#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DeployableADS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_DeployableADS.ABP_DeployableADS_C
// 0x0630 (0x08F0 - 0x02C0)
class UABP_DeployableADS_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02C8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0310(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0340(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0368(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x03E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0418(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0498(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04C8(0x00B0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0578(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0680(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x06A0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x06C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x07C8(0x0108)()
	bool                                          bIsDeployed;                                       // 0x08D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsPropellerDetached;                              // 0x08D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsLookingAtInterception;                          // 0x08D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D3[0x1];                                      // 0x08D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Interception_Wheel_Rotation;                       // 0x08D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Interception_Weapon_Rotation;                      // 0x08E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_DeployableADS(int32 EntryPoint);
	void AnimNotify_DeployableADS_PropellerDetach();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_DeployableADS_C">();
	}
	static class UABP_DeployableADS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_DeployableADS_C>();
	}
};
static_assert(alignof(UABP_DeployableADS_C) == 0x000010, "Wrong alignment on UABP_DeployableADS_C");
static_assert(sizeof(UABP_DeployableADS_C) == 0x0008F0, "Wrong size on UABP_DeployableADS_C");
static_assert(offsetof(UABP_DeployableADS_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_DeployableADS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_Slot) == 0x0002C8, "Member 'UABP_DeployableADS_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_Root) == 0x000310, "Member 'UABP_DeployableADS_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_TransitionResult) == 0x000340, "Member 'UABP_DeployableADS_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_SequencePlayer_1) == 0x000368, "Member 'UABP_DeployableADS_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_StateResult_1) == 0x0003E8, "Member 'UABP_DeployableADS_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_SequencePlayer) == 0x000418, "Member 'UABP_DeployableADS_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_StateResult) == 0x000498, "Member 'UABP_DeployableADS_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_StateMachine) == 0x0004C8, "Member 'UABP_DeployableADS_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_ModifyBone_2) == 0x000578, "Member 'UABP_DeployableADS_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_ComponentToLocalSpace) == 0x000680, "Member 'UABP_DeployableADS_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_LocalToComponentSpace) == 0x0006A0, "Member 'UABP_DeployableADS_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_ModifyBone_1) == 0x0006C0, "Member 'UABP_DeployableADS_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, AnimGraphNode_ModifyBone) == 0x0007C8, "Member 'UABP_DeployableADS_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, bIsDeployed) == 0x0008D0, "Member 'UABP_DeployableADS_C::bIsDeployed' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, bIsPropellerDetached) == 0x0008D1, "Member 'UABP_DeployableADS_C::bIsPropellerDetached' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, bIsLookingAtInterception) == 0x0008D2, "Member 'UABP_DeployableADS_C::bIsLookingAtInterception' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, Interception_Wheel_Rotation) == 0x0008D4, "Member 'UABP_DeployableADS_C::Interception_Wheel_Rotation' has a wrong offset!");
static_assert(offsetof(UABP_DeployableADS_C, Interception_Weapon_Rotation) == 0x0008E0, "Member 'UABP_DeployableADS_C::Interception_Weapon_Rotation' has a wrong offset!");

}

