#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APBAutoMissileLauncher_Direct_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function APBAutoMissileLauncher_Direct_BP.APBAutoMissileLauncher_Direct_BP_C.ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP
// 0x00E0 (0x00E0 - 0x0000)
struct APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMach_Arm_RigL_Skeleton_ABP_C*          K2Node_DynamicCast_AsMach_Arm_Rig_L_Skeleton_ABP;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMach_Arm_RigR_Skeleton_ABP_C*          K2Node_DynamicCast_AsMach_Arm_Rig_R_Skeleton_ABP;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue_1;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue_2;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue_3;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_3;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_4;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_5;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_6;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_7;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_8;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_9;        // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_10;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_11;       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP) == 0x000008, "Wrong alignment on APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP");
static_assert(sizeof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP) == 0x0000E0, "Wrong size on APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, EntryPoint) == 0x000000, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000010, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_2) == 0x000018, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, K2Node_DynamicCast_AsMach_Arm_Rig_L_Skeleton_ABP) == 0x000030, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::K2Node_DynamicCast_AsMach_Arm_Rig_L_Skeleton_ABP' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000040, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_GetOwnerPawn_ReturnValue) == 0x000048, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_GetOwnerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, K2Node_DynamicCast_AsMach_Arm_Rig_R_Skeleton_ABP) == 0x000050, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::K2Node_DynamicCast_AsMach_Arm_Rig_R_Skeleton_ABP' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_IsLocallyControlled_ReturnValue) == 0x00005A, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, Temp_bool_Has_Been_Initd_Variable) == 0x00005B, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, K2Node_SwitchEnum_CmpSuccess_1) == 0x00005C, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_GetOwnerPawn_ReturnValue_1) == 0x000060, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_GetOwnerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, K2Node_SwitchEnum_CmpSuccess_2) == 0x000069, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x00006A, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_GetOwnerPawn_ReturnValue_2) == 0x000070, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_GetOwnerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_IsValid_ReturnValue_2) == 0x000078, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x000079, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_GetOwnerPawn_ReturnValue_3) == 0x000080, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_GetOwnerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, K2Node_SwitchEnum_CmpSuccess_3) == 0x000088, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_IsValid_ReturnValue_3) == 0x000089, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_IsLocallyControlled_ReturnValue_3) == 0x00008A, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_IsLocallyControlled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, Temp_bool_IsClosed_Variable) == 0x00008B, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, K2Node_SwitchEnum_CmpSuccess_4) == 0x00008C, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_3) == 0x000090, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_4) == 0x000098, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_5) == 0x0000A0, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0000A8, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_6) == 0x0000B0, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_7) == 0x0000B8, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_8) == 0x0000C0, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_9) == 0x0000C8, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_10) == 0x0000D0, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP, CallFunc_K2_GetRootComponent_ReturnValue_11) == 0x0000D8, "Member 'APBAutoMissileLauncher_Direct_BP_C_ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP::CallFunc_K2_GetRootComponent_ReturnValue_11' has a wrong offset!");

// Function APBAutoMissileLauncher_Direct_BP.APBAutoMissileLauncher_Direct_BP_C.AttachMissile3P
// 0x00B0 (0x00B0 - 0x0000)
struct APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P) == 0x000010, "Wrong alignment on APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P");
static_assert(sizeof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P) == 0x0000B0, "Wrong size on APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, Temp_struct_Variable) == 0x000000, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, Temp_bool_Variable) == 0x000030, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_SetStaticMesh_ReturnValue) == 0x000040, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, Temp_int_Variable) == 0x000044, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_Conv_TextToString_ReturnValue) == 0x000070, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_Conv_StringToName_ReturnValue) == 0x000094, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000A4, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile3P::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function APBAutoMissileLauncher_Direct_BP.APBAutoMissileLauncher_Direct_BP_C.HiddenMissle3P
// 0x0018 (0x0018 - 0x0000)
struct APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P) == 0x000008, "Wrong alignment on APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P");
static_assert(sizeof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P) == 0x000018, "Wrong size on APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P, Temp_int_Variable) == 0x000000, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P, CallFunc_Array_Get_Item) == 0x000008, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000015, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000016, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle3P::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function APBAutoMissileLauncher_Direct_BP.APBAutoMissileLauncher_Direct_BP_C.AttachMissile1P
// 0x00B0 (0x00B0 - 0x0000)
struct APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P) == 0x000010, "Wrong alignment on APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P");
static_assert(sizeof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P) == 0x0000B0, "Wrong size on APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, Temp_struct_Variable) == 0x000000, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, Temp_bool_Variable) == 0x000030, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_SetStaticMesh_ReturnValue) == 0x000040, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, Temp_int_Variable) == 0x000044, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_Conv_TextToString_ReturnValue) == 0x000070, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_Conv_StringToName_ReturnValue) == 0x000094, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000A4, "Member 'APBAutoMissileLauncher_Direct_BP_C_AttachMissile1P::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function APBAutoMissileLauncher_Direct_BP.APBAutoMissileLauncher_Direct_BP_C.HiddenMissle1P
// 0x0018 (0x0018 - 0x0000)
struct APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P) == 0x000008, "Wrong alignment on APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P");
static_assert(sizeof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P) == 0x000018, "Wrong size on APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P, Temp_int_Variable) == 0x000000, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P, CallFunc_Array_Get_Item) == 0x000008, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000015, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000016, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'APBAutoMissileLauncher_Direct_BP_C_HiddenMissle1P::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function APBAutoMissileLauncher_Direct_BP.APBAutoMissileLauncher_Direct_BP_C.Fired
// 0x0050 (0x0050 - 0x0000)
struct APBAutoMissileLauncher_Direct_BP_C_Fired final
{
public:
	class FName                                   LoaclEventGroup;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      OwningCharacter;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(APBAutoMissileLauncher_Direct_BP_C_Fired) == 0x000008, "Wrong alignment on APBAutoMissileLauncher_Direct_BP_C_Fired");
static_assert(sizeof(APBAutoMissileLauncher_Direct_BP_C_Fired) == 0x000050, "Wrong size on APBAutoMissileLauncher_Direct_BP_C_Fired");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_Fired, LoaclEventGroup) == 0x000000, "Member 'APBAutoMissileLauncher_Direct_BP_C_Fired::LoaclEventGroup' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_Fired, OwningCharacter) == 0x000008, "Member 'APBAutoMissileLauncher_Direct_BP_C_Fired::OwningCharacter' has a wrong offset!");
static_assert(offsetof(APBAutoMissileLauncher_Direct_BP_C_Fired, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'APBAutoMissileLauncher_Direct_BP_C_Fired::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
