#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APBAutoMissileLauncher_Direct_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass APBAutoMissileLauncher_Direct_BP.APBAutoMissileLauncher_Direct_BP_C
// 0x0028 (0x0698 - 0x0670)
class AAPBAutoMissileLauncher_Direct_BP_C final : public APBAutoMissileLauncher
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UStaticMeshComponent*>           MessileArray3P;                                    // 0x0678(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           MessileArray1P;                                    // 0x0688(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_APBAutoMissileLauncher_Direct_BP(int32 EntryPoint);
	void K2_Standby();
	void K2_Ready();
	void K2_SimuilateFire();
	void K2_OnEquip();
	void K2_Undeploying();
	void K2_Deploying();
	void K2_UpdateMagazine();
	void ReceiveBeginPlay();
	void AttachMissile3P();
	void HiddenMissle3P();
	void AttachMissile1P();
	void HiddenMissle1P();
	void Fired();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"APBAutoMissileLauncher_Direct_BP_C">();
	}
	static class AAPBAutoMissileLauncher_Direct_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAPBAutoMissileLauncher_Direct_BP_C>();
	}
};
static_assert(alignof(AAPBAutoMissileLauncher_Direct_BP_C) == 0x000008, "Wrong alignment on AAPBAutoMissileLauncher_Direct_BP_C");
static_assert(sizeof(AAPBAutoMissileLauncher_Direct_BP_C) == 0x000698, "Wrong size on AAPBAutoMissileLauncher_Direct_BP_C");
static_assert(offsetof(AAPBAutoMissileLauncher_Direct_BP_C, UberGraphFrame) == 0x000670, "Member 'AAPBAutoMissileLauncher_Direct_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAPBAutoMissileLauncher_Direct_BP_C, MessileArray3P) == 0x000678, "Member 'AAPBAutoMissileLauncher_Direct_BP_C::MessileArray3P' has a wrong offset!");
static_assert(offsetof(AAPBAutoMissileLauncher_Direct_BP_C, MessileArray1P) == 0x000688, "Member 'AAPBAutoMissileLauncher_Direct_BP_C::MessileArray1P' has a wrong offset!");

}

