#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APBHomingMissileLauncher_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass APBHomingMissileLauncher_BP.APBHomingMissileLauncher_BP_C
// 0x0048 (0x06C8 - 0x0680)
class AAPBHomingMissileLauncher_BP_C final : public APBHomingMissileLauncher
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Mesh_St_Equm_SpaceSparrows_missile;                // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_St_Equm_SpaceSparrows_missile3;               // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_St_Equm_SpaceSparrows_missile4;               // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_St_Equm_SpaceSparrows_missile5;               // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_St_Equm_SpaceSparrows_missile2;               // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_St_Equm_SpaceSparrows_missile1;               // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoMissileTargetWaring_C*               NoMissileTargetWarning;                            // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FireMuzzle_VFX;                                    // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_APBHomingMissileLauncher_BP(int32 EntryPoint);
	void K2_Ready();
	void K2_Standby();
	void K2_OnEquip();
	void K2_Undeploying();
	void K2_Deploying();
	void K2_SimuilateFire();
	void NotifyNoMissileTarget_1();
	void K2_AdjustedAim(struct FVector* Origin, struct FVector* ShootDir);
	void Fired();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"APBHomingMissileLauncher_BP_C">();
	}
	static class AAPBHomingMissileLauncher_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAPBHomingMissileLauncher_BP_C>();
	}
};
static_assert(alignof(AAPBHomingMissileLauncher_BP_C) == 0x000008, "Wrong alignment on AAPBHomingMissileLauncher_BP_C");
static_assert(sizeof(AAPBHomingMissileLauncher_BP_C) == 0x0006C8, "Wrong size on AAPBHomingMissileLauncher_BP_C");
static_assert(offsetof(AAPBHomingMissileLauncher_BP_C, UberGraphFrame) == 0x000680, "Member 'AAPBHomingMissileLauncher_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAPBHomingMissileLauncher_BP_C, Mesh_St_Equm_SpaceSparrows_missile) == 0x000688, "Member 'AAPBHomingMissileLauncher_BP_C::Mesh_St_Equm_SpaceSparrows_missile' has a wrong offset!");
static_assert(offsetof(AAPBHomingMissileLauncher_BP_C, Mesh_St_Equm_SpaceSparrows_missile3) == 0x000690, "Member 'AAPBHomingMissileLauncher_BP_C::Mesh_St_Equm_SpaceSparrows_missile3' has a wrong offset!");
static_assert(offsetof(AAPBHomingMissileLauncher_BP_C, Mesh_St_Equm_SpaceSparrows_missile4) == 0x000698, "Member 'AAPBHomingMissileLauncher_BP_C::Mesh_St_Equm_SpaceSparrows_missile4' has a wrong offset!");
static_assert(offsetof(AAPBHomingMissileLauncher_BP_C, Mesh_St_Equm_SpaceSparrows_missile5) == 0x0006A0, "Member 'AAPBHomingMissileLauncher_BP_C::Mesh_St_Equm_SpaceSparrows_missile5' has a wrong offset!");
static_assert(offsetof(AAPBHomingMissileLauncher_BP_C, Mesh_St_Equm_SpaceSparrows_missile2) == 0x0006A8, "Member 'AAPBHomingMissileLauncher_BP_C::Mesh_St_Equm_SpaceSparrows_missile2' has a wrong offset!");
static_assert(offsetof(AAPBHomingMissileLauncher_BP_C, Mesh_St_Equm_SpaceSparrows_missile1) == 0x0006B0, "Member 'AAPBHomingMissileLauncher_BP_C::Mesh_St_Equm_SpaceSparrows_missile1' has a wrong offset!");
static_assert(offsetof(AAPBHomingMissileLauncher_BP_C, NoMissileTargetWarning) == 0x0006B8, "Member 'AAPBHomingMissileLauncher_BP_C::NoMissileTargetWarning' has a wrong offset!");
static_assert(offsetof(AAPBHomingMissileLauncher_BP_C, FireMuzzle_VFX) == 0x0006C0, "Member 'AAPBHomingMissileLauncher_BP_C::FireMuzzle_VFX' has a wrong offset!");

}

