#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APBMiniGunLauncher_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBLauncher_Deploy_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass APBMiniGunLauncher_BP.APBMiniGunLauncher_BP_C
// 0x0068 (0x0700 - 0x0698)
class AAPBMiniGunLauncher_BP_C : public APBLauncher_Deploy_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_APBMiniGunLauncher_BP_C;            // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBFireComponent_RayProjectile*         PBFireComponent_RayProjectile;                     // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Barrel_1P;                                         // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Barrel_3P;                                         // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_BerralRoll_6210E3F14EFA805E7D10469AE3642F68; // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_6210E3F14EFA805E7D10469AE3642F68; // 0x06BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BD[0x3];                                      // 0x06BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FireMuzzle_VFX;                                    // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Fire;                                              // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MotorVFX;                                          // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RollScaler;                                        // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        FireSound_AC;                                      // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Left_AC;                                           // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Right_AC;                                          // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_APBMiniGunLauncher_BP(int32 EntryPoint);
	void K2_Undeploying();
	void K2_Deploying();
	void K2_SimulateStopFire();
	void K2_SimulateStartFire();
	void K2_SimuilateFire();
	void ReceiveDestroyed();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void K2_AdjustedAim(struct FVector* Origin, struct FVector* ShootDir);
	void StartFire();
	void StopFire();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"APBMiniGunLauncher_BP_C">();
	}
	static class AAPBMiniGunLauncher_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAPBMiniGunLauncher_BP_C>();
	}
};
static_assert(alignof(AAPBMiniGunLauncher_BP_C) == 0x000008, "Wrong alignment on AAPBMiniGunLauncher_BP_C");
static_assert(sizeof(AAPBMiniGunLauncher_BP_C) == 0x000700, "Wrong size on AAPBMiniGunLauncher_BP_C");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, UberGraphFrame_APBMiniGunLauncher_BP_C) == 0x000698, "Member 'AAPBMiniGunLauncher_BP_C::UberGraphFrame_APBMiniGunLauncher_BP_C' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, PBFireComponent_RayProjectile) == 0x0006A0, "Member 'AAPBMiniGunLauncher_BP_C::PBFireComponent_RayProjectile' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, Barrel_1P) == 0x0006A8, "Member 'AAPBMiniGunLauncher_BP_C::Barrel_1P' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, Barrel_3P) == 0x0006B0, "Member 'AAPBMiniGunLauncher_BP_C::Barrel_3P' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, Timeline_2_BerralRoll_6210E3F14EFA805E7D10469AE3642F68) == 0x0006B8, "Member 'AAPBMiniGunLauncher_BP_C::Timeline_2_BerralRoll_6210E3F14EFA805E7D10469AE3642F68' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, Timeline_2__Direction_6210E3F14EFA805E7D10469AE3642F68) == 0x0006BC, "Member 'AAPBMiniGunLauncher_BP_C::Timeline_2__Direction_6210E3F14EFA805E7D10469AE3642F68' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, Timeline_2) == 0x0006C0, "Member 'AAPBMiniGunLauncher_BP_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, FireMuzzle_VFX) == 0x0006C8, "Member 'AAPBMiniGunLauncher_BP_C::FireMuzzle_VFX' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, Fire) == 0x0006D0, "Member 'AAPBMiniGunLauncher_BP_C::Fire' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, MotorVFX) == 0x0006D8, "Member 'AAPBMiniGunLauncher_BP_C::MotorVFX' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, RollScaler) == 0x0006E0, "Member 'AAPBMiniGunLauncher_BP_C::RollScaler' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, FireSound_AC) == 0x0006E8, "Member 'AAPBMiniGunLauncher_BP_C::FireSound_AC' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, Left_AC) == 0x0006F0, "Member 'AAPBMiniGunLauncher_BP_C::Left_AC' has a wrong offset!");
static_assert(offsetof(AAPBMiniGunLauncher_BP_C, Right_AC) == 0x0006F8, "Member 'AAPBMiniGunLauncher_BP_C::Right_AC' has a wrong offset!");

}

