#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APBSmokeGrenadeLauncher_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBLauncher_Delay_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass APBSmokeGrenadeLauncher_BP.APBSmokeGrenadeLauncher_BP_C
// 0x0058 (0x06D0 - 0x0678)
class AAPBSmokeGrenadeLauncher_BP_C final : public APBLauncher_Delay_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_APBSmokeGrenadeLauncher_BP_C;       // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBFireComponent_Projectile*            PBFireComponent_Projectile;                        // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ThreePgagetmesh;                                   // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FPAttachMesh;                                      // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ThreeP_SKmesh;                                     // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_St_Weap_SGL03;                                // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_St_Weap_SGL02;                                // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_St_Weap_SGL01;                                // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           LeftTriggerSmokeMontage;                           // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RightTriggerSmokeMontage;                          // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FireMuzzle_VFX;                                    // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_APBSmokeGrenadeLauncher_BP(int32 EntryPoint);
	void K2_Undeploying();
	void K2_Deploying();
	void NotifySmokeTriggedByPlayer_1();
	void OnCompleted_1FD7BB1E49E7F34F91E856834DDE14FA(class FName NotifyName);
	void OnBlendOut_1FD7BB1E49E7F34F91E856834DDE14FA(class FName NotifyName);
	void OnInterrupted_1FD7BB1E49E7F34F91E856834DDE14FA(class FName NotifyName);
	void OnNotifyBegin_1FD7BB1E49E7F34F91E856834DDE14FA(class FName NotifyName);
	void OnNotifyEnd_1FD7BB1E49E7F34F91E856834DDE14FA(class FName NotifyName);
	void OnCompleted_3FDC6E784E7003F8C82041BC6FFBB978(class FName NotifyName);
	void OnBlendOut_3FDC6E784E7003F8C82041BC6FFBB978(class FName NotifyName);
	void OnInterrupted_3FDC6E784E7003F8C82041BC6FFBB978(class FName NotifyName);
	void OnNotifyBegin_3FDC6E784E7003F8C82041BC6FFBB978(class FName NotifyName);
	void OnNotifyEnd_3FDC6E784E7003F8C82041BC6FFBB978(class FName NotifyName);
	void K2_SimuilateFire();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"APBSmokeGrenadeLauncher_BP_C">();
	}
	static class AAPBSmokeGrenadeLauncher_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAPBSmokeGrenadeLauncher_BP_C>();
	}
};
static_assert(alignof(AAPBSmokeGrenadeLauncher_BP_C) == 0x000008, "Wrong alignment on AAPBSmokeGrenadeLauncher_BP_C");
static_assert(sizeof(AAPBSmokeGrenadeLauncher_BP_C) == 0x0006D0, "Wrong size on AAPBSmokeGrenadeLauncher_BP_C");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, UberGraphFrame_APBSmokeGrenadeLauncher_BP_C) == 0x000678, "Member 'AAPBSmokeGrenadeLauncher_BP_C::UberGraphFrame_APBSmokeGrenadeLauncher_BP_C' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, PBFireComponent_Projectile) == 0x000680, "Member 'AAPBSmokeGrenadeLauncher_BP_C::PBFireComponent_Projectile' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, ThreePgagetmesh) == 0x000688, "Member 'AAPBSmokeGrenadeLauncher_BP_C::ThreePgagetmesh' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, FPAttachMesh) == 0x000690, "Member 'AAPBSmokeGrenadeLauncher_BP_C::FPAttachMesh' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, ThreeP_SKmesh) == 0x000698, "Member 'AAPBSmokeGrenadeLauncher_BP_C::ThreeP_SKmesh' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, Mesh_St_Weap_SGL03) == 0x0006A0, "Member 'AAPBSmokeGrenadeLauncher_BP_C::Mesh_St_Weap_SGL03' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, Mesh_St_Weap_SGL02) == 0x0006A8, "Member 'AAPBSmokeGrenadeLauncher_BP_C::Mesh_St_Weap_SGL02' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, Mesh_St_Weap_SGL01) == 0x0006B0, "Member 'AAPBSmokeGrenadeLauncher_BP_C::Mesh_St_Weap_SGL01' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, LeftTriggerSmokeMontage) == 0x0006B8, "Member 'AAPBSmokeGrenadeLauncher_BP_C::LeftTriggerSmokeMontage' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, RightTriggerSmokeMontage) == 0x0006C0, "Member 'AAPBSmokeGrenadeLauncher_BP_C::RightTriggerSmokeMontage' has a wrong offset!");
static_assert(offsetof(AAPBSmokeGrenadeLauncher_BP_C, FireMuzzle_VFX) == 0x0006C8, "Member 'AAPBSmokeGrenadeLauncher_BP_C::FireMuzzle_VFX' has a wrong offset!");

}

