#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APBSmokeGrenadeLauncher_BP_Squid

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid
// 0x01D0 (0x01D0 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetFireSocketName_ReturnValue;            // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0xC];                                      // 0x0164(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid) == 0x000010, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid) == 0x0001D0, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, EntryPoint) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::EntryPoint' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName_9) == 0x000004, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName_8) == 0x00000C, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName_7) == 0x000024, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName_6) == 0x00003C, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName_5) == 0x000054, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, Temp_name_Variable) == 0x00006C, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName_4) == 0x000084, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName_3) == 0x00008C, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate_5) == 0x000094, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName_2) == 0x0000A4, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000AC, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName_1) == 0x0000BC, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C4, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CustomEvent_NotifyName) == 0x0000D4, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000DC, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, Temp_name_Variable_1) == 0x0000EC, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_GetOwner_ReturnValue) == 0x0000F8, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_GetPlayerController_ReturnValue) == 0x000100, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_GetInstigatorController_ReturnValue) == 0x000108, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000110, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_CreateDelegate_OutputDelegate_9) == 0x000114, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_GetOwnerPawn_ReturnValue) == 0x000128, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_GetOwnerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000130, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000139, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000140, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000150, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_IsValid_ReturnValue_1) == 0x000158, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_GetFireSocketName_ReturnValue) == 0x00015C, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_GetFireSocketName_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_GetSocketTransform_ReturnValue) == 0x000170, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_BreakTransform_Location) == 0x0001A0, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_BreakTransform_Rotation) == 0x0001AC, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_BreakTransform_Scale) == 0x0001B8, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001C8, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_ExecuteUbergraph_APBSmokeGrenadeLauncher_BP_Squid::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnCompleted_8A661CF54E35C6A71FA57C9549DCCCD2
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_8A661CF54E35C6A71FA57C9549DCCCD2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_8A661CF54E35C6A71FA57C9549DCCCD2, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_8A661CF54E35C6A71FA57C9549DCCCD2::NotifyName' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnBlendOut_8A661CF54E35C6A71FA57C9549DCCCD2
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_8A661CF54E35C6A71FA57C9549DCCCD2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_8A661CF54E35C6A71FA57C9549DCCCD2, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_8A661CF54E35C6A71FA57C9549DCCCD2::NotifyName' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnInterrupted_8A661CF54E35C6A71FA57C9549DCCCD2
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_8A661CF54E35C6A71FA57C9549DCCCD2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_8A661CF54E35C6A71FA57C9549DCCCD2, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_8A661CF54E35C6A71FA57C9549DCCCD2::NotifyName' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnNotifyBegin_8A661CF54E35C6A71FA57C9549DCCCD2
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_8A661CF54E35C6A71FA57C9549DCCCD2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_8A661CF54E35C6A71FA57C9549DCCCD2, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_8A661CF54E35C6A71FA57C9549DCCCD2::NotifyName' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnNotifyEnd_8A661CF54E35C6A71FA57C9549DCCCD2
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_8A661CF54E35C6A71FA57C9549DCCCD2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_8A661CF54E35C6A71FA57C9549DCCCD2) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_8A661CF54E35C6A71FA57C9549DCCCD2");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_8A661CF54E35C6A71FA57C9549DCCCD2, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_8A661CF54E35C6A71FA57C9549DCCCD2::NotifyName' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnCompleted_D30D7A4244000F7E4C9961BC049B8902
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_D30D7A4244000F7E4C9961BC049B8902 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_D30D7A4244000F7E4C9961BC049B8902) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_D30D7A4244000F7E4C9961BC049B8902");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_D30D7A4244000F7E4C9961BC049B8902) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_D30D7A4244000F7E4C9961BC049B8902");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_D30D7A4244000F7E4C9961BC049B8902, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnCompleted_D30D7A4244000F7E4C9961BC049B8902::NotifyName' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnBlendOut_D30D7A4244000F7E4C9961BC049B8902
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_D30D7A4244000F7E4C9961BC049B8902 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_D30D7A4244000F7E4C9961BC049B8902) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_D30D7A4244000F7E4C9961BC049B8902");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_D30D7A4244000F7E4C9961BC049B8902) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_D30D7A4244000F7E4C9961BC049B8902");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_D30D7A4244000F7E4C9961BC049B8902, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnBlendOut_D30D7A4244000F7E4C9961BC049B8902::NotifyName' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnInterrupted_D30D7A4244000F7E4C9961BC049B8902
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_D30D7A4244000F7E4C9961BC049B8902 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_D30D7A4244000F7E4C9961BC049B8902) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_D30D7A4244000F7E4C9961BC049B8902");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_D30D7A4244000F7E4C9961BC049B8902) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_D30D7A4244000F7E4C9961BC049B8902");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_D30D7A4244000F7E4C9961BC049B8902, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnInterrupted_D30D7A4244000F7E4C9961BC049B8902::NotifyName' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnNotifyBegin_D30D7A4244000F7E4C9961BC049B8902
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_D30D7A4244000F7E4C9961BC049B8902 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_D30D7A4244000F7E4C9961BC049B8902) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_D30D7A4244000F7E4C9961BC049B8902");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_D30D7A4244000F7E4C9961BC049B8902) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_D30D7A4244000F7E4C9961BC049B8902");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_D30D7A4244000F7E4C9961BC049B8902, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyBegin_D30D7A4244000F7E4C9961BC049B8902::NotifyName' has a wrong offset!");

// Function APBSmokeGrenadeLauncher_BP_Squid.APBSmokeGrenadeLauncher_BP_Squid_C.OnNotifyEnd_D30D7A4244000F7E4C9961BC049B8902
// 0x0008 (0x0008 - 0x0000)
struct APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_D30D7A4244000F7E4C9961BC049B8902 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_D30D7A4244000F7E4C9961BC049B8902) == 0x000004, "Wrong alignment on APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_D30D7A4244000F7E4C9961BC049B8902");
static_assert(sizeof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_D30D7A4244000F7E4C9961BC049B8902) == 0x000008, "Wrong size on APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_D30D7A4244000F7E4C9961BC049B8902");
static_assert(offsetof(APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_D30D7A4244000F7E4C9961BC049B8902, NotifyName) == 0x000000, "Member 'APBSmokeGrenadeLauncher_BP_Squid_C_OnNotifyEnd_D30D7A4244000F7E4C9961BC049B8902::NotifyName' has a wrong offset!");

}

