#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicPackBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BasicPackBP.BasicPackBP_C.ExecuteUbergraph_BasicPackBP
// 0x0028 (0x0028 - 0x0000)
struct BasicPackBP_C_ExecuteUbergraph_BasicPackBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_DamageTaken;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageEvent                           K2Node_ComponentBoundEvent_DamageEvent;            // 0x0008(0x0010)(ConstParm)
	class APawn*                                  K2Node_ComponentBoundEvent_PawnInstigator;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicPackBP_C_ExecuteUbergraph_BasicPackBP) == 0x000008, "Wrong alignment on BasicPackBP_C_ExecuteUbergraph_BasicPackBP");
static_assert(sizeof(BasicPackBP_C_ExecuteUbergraph_BasicPackBP) == 0x000028, "Wrong size on BasicPackBP_C_ExecuteUbergraph_BasicPackBP");
static_assert(offsetof(BasicPackBP_C_ExecuteUbergraph_BasicPackBP, EntryPoint) == 0x000000, "Member 'BasicPackBP_C_ExecuteUbergraph_BasicPackBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_ExecuteUbergraph_BasicPackBP, K2Node_ComponentBoundEvent_DamageTaken) == 0x000004, "Member 'BasicPackBP_C_ExecuteUbergraph_BasicPackBP::K2Node_ComponentBoundEvent_DamageTaken' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_ExecuteUbergraph_BasicPackBP, K2Node_ComponentBoundEvent_DamageEvent) == 0x000008, "Member 'BasicPackBP_C_ExecuteUbergraph_BasicPackBP::K2Node_ComponentBoundEvent_DamageEvent' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_ExecuteUbergraph_BasicPackBP, K2Node_ComponentBoundEvent_PawnInstigator) == 0x000018, "Member 'BasicPackBP_C_ExecuteUbergraph_BasicPackBP::K2Node_ComponentBoundEvent_PawnInstigator' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_ExecuteUbergraph_BasicPackBP, K2Node_ComponentBoundEvent_DamageCauser) == 0x000020, "Member 'BasicPackBP_C_ExecuteUbergraph_BasicPackBP::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");

// Function BasicPackBP.BasicPackBP_C.BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature final
{
public:
	float                                         DamageTaken;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEvent                           DamageEvent;                                       // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class APawn*                                  PawnInstigator;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature");
static_assert(sizeof(BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature) == 0x000028, "Wrong size on BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature");
static_assert(offsetof(BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature, DamageTaken) == 0x000000, "Member 'BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature::DamageTaken' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature, DamageEvent) == 0x000008, "Member 'BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature::DamageEvent' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature, PawnInstigator) == 0x000018, "Member 'BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature::PawnInstigator' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature, DamageCauser) == 0x000020, "Member 'BasicPackBP_C_BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature::DamageCauser' has a wrong offset!");

// Function BasicPackBP.BasicPackBP_C.CallToCharacterBackPackBeHit
// 0x0020 (0x0020 - 0x0000)
struct BasicPackBP_C_CallToCharacterBackPackBeHit final
{
public:
	class APawn*                                  DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageTaken;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasicPackBP_C_CallToCharacterBackPackBeHit) == 0x000008, "Wrong alignment on BasicPackBP_C_CallToCharacterBackPackBeHit");
static_assert(sizeof(BasicPackBP_C_CallToCharacterBackPackBeHit) == 0x000020, "Wrong size on BasicPackBP_C_CallToCharacterBackPackBeHit");
static_assert(offsetof(BasicPackBP_C_CallToCharacterBackPackBeHit, DamageCauser) == 0x000000, "Member 'BasicPackBP_C_CallToCharacterBackPackBeHit::DamageCauser' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_CallToCharacterBackPackBeHit, DamageTaken) == 0x000008, "Member 'BasicPackBP_C_CallToCharacterBackPackBeHit::DamageTaken' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_CallToCharacterBackPackBeHit, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BasicPackBP_C_CallToCharacterBackPackBeHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_CallToCharacterBackPackBeHit, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000010, "Member 'BasicPackBP_C_CallToCharacterBackPackBeHit::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_CallToCharacterBackPackBeHit, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BasicPackBP_C_CallToCharacterBackPackBeHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_CallToCharacterBackPackBeHit, CallFunc_IsLocallyControlled_ReturnValue) == 0x000019, "Member 'BasicPackBP_C_CallToCharacterBackPackBeHit::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function BasicPackBP.BasicPackBP_C.TurnOnLight
// 0x0018 (0x0018 - 0x0000)
struct BasicPackBP_C_TurnOnLight final
{
public:
	class UPBTeamManager*                         CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBTeamDisplayAsset*                    CallFunc_GetTeamDisplayAsset_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicPackBP_C_TurnOnLight) == 0x000008, "Wrong alignment on BasicPackBP_C_TurnOnLight");
static_assert(sizeof(BasicPackBP_C_TurnOnLight) == 0x000018, "Wrong size on BasicPackBP_C_TurnOnLight");
static_assert(offsetof(BasicPackBP_C_TurnOnLight, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BasicPackBP_C_TurnOnLight::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_TurnOnLight, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'BasicPackBP_C_TurnOnLight::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_TurnOnLight, CallFunc_GetTeamDisplayAsset_ReturnValue) == 0x000010, "Member 'BasicPackBP_C_TurnOnLight::CallFunc_GetTeamDisplayAsset_ReturnValue' has a wrong offset!");

// Function BasicPackBP.BasicPackBP_C.TurnOffLight
// 0x0010 (0x0010 - 0x0000)
struct BasicPackBP_C_TurnOffLight final
{
public:
	class UPBTeamManager*                         CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBTeamDisplayAsset*                    CallFunc_GetTeamDisplayAsset_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicPackBP_C_TurnOffLight) == 0x000008, "Wrong alignment on BasicPackBP_C_TurnOffLight");
static_assert(sizeof(BasicPackBP_C_TurnOffLight) == 0x000010, "Wrong size on BasicPackBP_C_TurnOffLight");
static_assert(offsetof(BasicPackBP_C_TurnOffLight, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BasicPackBP_C_TurnOffLight::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_TurnOffLight, CallFunc_GetTeamDisplayAsset_ReturnValue) == 0x000008, "Member 'BasicPackBP_C_TurnOffLight::CallFunc_GetTeamDisplayAsset_ReturnValue' has a wrong offset!");

// Function BasicPackBP.BasicPackBP_C.DistroyJets
// 0x0004 (0x0004 - 0x0000)
struct BasicPackBP_C_DistroyJets final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasicPackBP_C_DistroyJets) == 0x000001, "Wrong alignment on BasicPackBP_C_DistroyJets");
static_assert(sizeof(BasicPackBP_C_DistroyJets) == 0x000004, "Wrong size on BasicPackBP_C_DistroyJets");
static_assert(offsetof(BasicPackBP_C_DistroyJets, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BasicPackBP_C_DistroyJets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_DistroyJets, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BasicPackBP_C_DistroyJets::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_DistroyJets, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'BasicPackBP_C_DistroyJets::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BasicPackBP_C_DistroyJets, CallFunc_IsValid_ReturnValue_3) == 0x000003, "Member 'BasicPackBP_C_DistroyJets::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BasicPackBP.BasicPackBP_C.UpdateOverBoostStatus
// 0x0001 (0x0001 - 0x0000)
struct BasicPackBP_C_UpdateOverBoostStatus final
{
public:
	bool                                          bOverBoostOn;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasicPackBP_C_UpdateOverBoostStatus) == 0x000001, "Wrong alignment on BasicPackBP_C_UpdateOverBoostStatus");
static_assert(sizeof(BasicPackBP_C_UpdateOverBoostStatus) == 0x000001, "Wrong size on BasicPackBP_C_UpdateOverBoostStatus");
static_assert(offsetof(BasicPackBP_C_UpdateOverBoostStatus, bOverBoostOn) == 0x000000, "Member 'BasicPackBP_C_UpdateOverBoostStatus::bOverBoostOn' has a wrong offset!");

// Function BasicPackBP.BasicPackBP_C.UpdateTeamColor
// 0x0010 (0x0010 - 0x0000)
struct BasicPackBP_C_UpdateTeamColor final
{
public:
	struct FLinearColor                           IFF_TeamColor;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicPackBP_C_UpdateTeamColor) == 0x000004, "Wrong alignment on BasicPackBP_C_UpdateTeamColor");
static_assert(sizeof(BasicPackBP_C_UpdateTeamColor) == 0x000010, "Wrong size on BasicPackBP_C_UpdateTeamColor");
static_assert(offsetof(BasicPackBP_C_UpdateTeamColor, IFF_TeamColor) == 0x000000, "Member 'BasicPackBP_C_UpdateTeamColor::IFF_TeamColor' has a wrong offset!");

}

