#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicPackBP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BasicPackBP.BasicPackBP_C
// 0x0058 (0x0360 - 0x0308)
class ABasicPackBP_C : public APBVehicle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara4;                                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara3;                                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara2;                                          // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPBMobilityHeatComponent*               PBMobilityHeat;                                    // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPBEnergySupplyComponent*               PBEnergySupply;                                    // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPBArmorComponent*                      RearArmor;                                         // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPBArmorManagerComponent*               PBArmorManager;                                    // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bVehicleOn;                                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NewVar_0;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BasicPackBP(int32 EntryPoint);
	void ShowNiagara();
	void HideNiagara();
	void K2_UpdateTeamNum();
	void K2_TurnOnVehicle();
	void K2_TurnOffVehicle();
	void K2_SimulateVehicleRestart();
	void K2_SimulateVehicleDown();
	void BndEvt__PBArmorManager_K2Node_ComponentBoundEvent_0_ArmorComponentBeHitSignature__DelegateSignature(float DamageTaken, const struct FDamageEvent& DamageEvent, class APawn* PawnInstigator, class AActor* DamageCauser);
	void CallToCharacterBackPackBeHit(class APawn* DamageCauser, float DamageTaken);
	void TurnOnLight();
	void TurnOffLight();
	void DistroyJets();
	void UpdateOverBoostStatus(bool bOverBoostOn);
	void UpdateTeamColor(const struct FLinearColor& IFF_TeamColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BasicPackBP_C">();
	}
	static class ABasicPackBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABasicPackBP_C>();
	}
};
static_assert(alignof(ABasicPackBP_C) == 0x000008, "Wrong alignment on ABasicPackBP_C");
static_assert(sizeof(ABasicPackBP_C) == 0x000360, "Wrong size on ABasicPackBP_C");
static_assert(offsetof(ABasicPackBP_C, UberGraphFrame) == 0x000308, "Member 'ABasicPackBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, Niagara4) == 0x000310, "Member 'ABasicPackBP_C::Niagara4' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, Niagara3) == 0x000318, "Member 'ABasicPackBP_C::Niagara3' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, Niagara2) == 0x000320, "Member 'ABasicPackBP_C::Niagara2' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, Niagara) == 0x000328, "Member 'ABasicPackBP_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, PBMobilityHeat) == 0x000330, "Member 'ABasicPackBP_C::PBMobilityHeat' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, PBEnergySupply) == 0x000338, "Member 'ABasicPackBP_C::PBEnergySupply' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, RearArmor) == 0x000340, "Member 'ABasicPackBP_C::RearArmor' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, PBArmorManager) == 0x000348, "Member 'ABasicPackBP_C::PBArmorManager' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, bVehicleOn) == 0x000350, "Member 'ABasicPackBP_C::bVehicleOn' has a wrong offset!");
static_assert(offsetof(ABasicPackBP_C, NewVar_0) == 0x000358, "Member 'ABasicPackBP_C::NewVar_0' has a wrong offset!");

}

