#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BB_BenchMarkHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BoundaryBenchmark_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BB_BenchMarkHelper.BB_BenchMarkHelper_C
// 0x0138 (0x01B0 - 0x0078)
class UBB_BenchMarkHelper_C final : public UBBM_Subsystem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerController*                      PlayerController_Ptr;                              // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CurrentMenu;                                       // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_InGameHUD_C*                       InGameHUD_Ptr;                                     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USG_SaveFPSdata_C*                      SaveGamePtr;                                       // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BM_Level;                                          // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BenchMarkLevelTime;                                // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckFPSHUDTimer;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           EndBenchMarkTimer;                                 // 0x00B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Pause_;                                            // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              NormalMenuResolution;                              // 0x00C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstLaunch;                                       // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxFPSTemp;                                        // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinFPSTemp;                                        // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      LinePointArray;                                    // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         LineCenterLocation;                                // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FPSLineSeeds;                                      // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxFPSIndexTemp;                                   // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinFPSIndexTemp;                                   // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalFPSSum;                                       // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AverageFPS;                                        // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      AverageLineArray;                                  // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         LineLeftBound;                                     // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LineRightBound;                                    // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LineUPBound;                                       // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LineDownBound;                                     // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_GerCurrentFPS;                               // 0x0120(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentFPS;                                        // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FPSArray_0;                                        // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FIntPoint                              MaxResolution;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 FrameTimeArray;                                    // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          StartGetGPUFrameTime;                              // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 GPUDataArray;                                      // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         CsvArray;                                          // 0x0170(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         GrappleShotArray;                                  // 0x0180(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ALevelSequenceActor*                    GrappleShotSeq;                                    // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         JetShotArray;                                      // 0x0198(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ALevelSequenceActor*                    JetShotSeq;                                        // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BB_BenchMarkHelper(int32 EntryPoint);
	void Event_SaveGameData();
	void Completed_A14B304849457937707F79AE23F81981(class USaveGame* SaveGame, bool bSuccess);
	void OnGameStart(class UClass* Class_0);
	void SetInputMode(EMouseLockMode InMouseLockMode);
	void SetShowPlayerMouseCursor(bool bShowMouseCursor);
	void SetEndBenchMarkTimer(float Time);
	void End_Bench_Mark(bool EndByPlayer);
	void ToMainMenuLevel();
	void ToFinalPageLevel();
	void CreateSaveGamePtr();
	void OnStartBenchMark();
	void Save_Game_Settings();
	void SetMaxFPS(float MaxFPS_F);
	void SetRTXConsoles();
	void OnEscPressed(bool Pause);
	void PauseGame(bool Pause);
	void CalMaxFPS();
	void CalMinFPS();
	void SetPointArrays();
	void RefreshFPSTempData();
	void CalAverageFPS();
	void SetAverageLineSeedArray();
	void CreateAndSaveBMData();
	void GetCurrentFPS();
	void Start_Get_FPSData();
	void Debug_PrintSettings();
	void GetMaxResolution();
	void SetResolutionBaseOnSetting();
	void PauseSequence();
	void StartUpSequence();
	void StopFPSDataCollection();
	void CreatCSVArrayData();
	void SetResolution();
	void SetResolutionTimer();
	void HideLevel(TArray<class AActor*>& GrappleShotArray_0);
	void ShowLevel(TArray<class AActor*>& Array);
	void Set_Bloom_by_Settings(class APostProcessVolume* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BB_BenchMarkHelper_C">();
	}
	static class UBB_BenchMarkHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBB_BenchMarkHelper_C>();
	}
};
static_assert(alignof(UBB_BenchMarkHelper_C) == 0x000008, "Wrong alignment on UBB_BenchMarkHelper_C");
static_assert(sizeof(UBB_BenchMarkHelper_C) == 0x0001B0, "Wrong size on UBB_BenchMarkHelper_C");
static_assert(offsetof(UBB_BenchMarkHelper_C, UberGraphFrame) == 0x000078, "Member 'UBB_BenchMarkHelper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, PlayerController_Ptr) == 0x000080, "Member 'UBB_BenchMarkHelper_C::PlayerController_Ptr' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, CurrentMenu) == 0x000088, "Member 'UBB_BenchMarkHelper_C::CurrentMenu' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, InGameHUD_Ptr) == 0x000090, "Member 'UBB_BenchMarkHelper_C::InGameHUD_Ptr' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, SaveGamePtr) == 0x000098, "Member 'UBB_BenchMarkHelper_C::SaveGamePtr' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, BM_Level) == 0x0000A0, "Member 'UBB_BenchMarkHelper_C::BM_Level' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, BenchMarkLevelTime) == 0x0000A8, "Member 'UBB_BenchMarkHelper_C::BenchMarkLevelTime' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, CheckFPSHUDTimer) == 0x0000B0, "Member 'UBB_BenchMarkHelper_C::CheckFPSHUDTimer' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, EndBenchMarkTimer) == 0x0000B8, "Member 'UBB_BenchMarkHelper_C::EndBenchMarkTimer' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, Pause_) == 0x0000C0, "Member 'UBB_BenchMarkHelper_C::Pause_' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, NormalMenuResolution) == 0x0000C4, "Member 'UBB_BenchMarkHelper_C::NormalMenuResolution' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, FirstLaunch) == 0x0000CC, "Member 'UBB_BenchMarkHelper_C::FirstLaunch' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, MaxFPSTemp) == 0x0000D0, "Member 'UBB_BenchMarkHelper_C::MaxFPSTemp' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, MinFPSTemp) == 0x0000D4, "Member 'UBB_BenchMarkHelper_C::MinFPSTemp' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, LinePointArray) == 0x0000D8, "Member 'UBB_BenchMarkHelper_C::LinePointArray' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, LineCenterLocation) == 0x0000E8, "Member 'UBB_BenchMarkHelper_C::LineCenterLocation' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, FPSLineSeeds) == 0x0000EC, "Member 'UBB_BenchMarkHelper_C::FPSLineSeeds' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, MaxFPSIndexTemp) == 0x0000F0, "Member 'UBB_BenchMarkHelper_C::MaxFPSIndexTemp' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, MinFPSIndexTemp) == 0x0000F4, "Member 'UBB_BenchMarkHelper_C::MinFPSIndexTemp' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, TotalFPSSum) == 0x0000F8, "Member 'UBB_BenchMarkHelper_C::TotalFPSSum' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, AverageFPS) == 0x0000FC, "Member 'UBB_BenchMarkHelper_C::AverageFPS' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, AverageLineArray) == 0x000100, "Member 'UBB_BenchMarkHelper_C::AverageLineArray' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, LineLeftBound) == 0x000110, "Member 'UBB_BenchMarkHelper_C::LineLeftBound' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, LineRightBound) == 0x000114, "Member 'UBB_BenchMarkHelper_C::LineRightBound' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, LineUPBound) == 0x000118, "Member 'UBB_BenchMarkHelper_C::LineUPBound' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, LineDownBound) == 0x00011C, "Member 'UBB_BenchMarkHelper_C::LineDownBound' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, Timer_GerCurrentFPS) == 0x000120, "Member 'UBB_BenchMarkHelper_C::Timer_GerCurrentFPS' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, CurrentFPS) == 0x000128, "Member 'UBB_BenchMarkHelper_C::CurrentFPS' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, FPSArray_0) == 0x000130, "Member 'UBB_BenchMarkHelper_C::FPSArray_0' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, MaxResolution) == 0x000140, "Member 'UBB_BenchMarkHelper_C::MaxResolution' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, FrameTimeArray) == 0x000148, "Member 'UBB_BenchMarkHelper_C::FrameTimeArray' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, StartGetGPUFrameTime) == 0x000158, "Member 'UBB_BenchMarkHelper_C::StartGetGPUFrameTime' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, GPUDataArray) == 0x000160, "Member 'UBB_BenchMarkHelper_C::GPUDataArray' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, CsvArray) == 0x000170, "Member 'UBB_BenchMarkHelper_C::CsvArray' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, GrappleShotArray) == 0x000180, "Member 'UBB_BenchMarkHelper_C::GrappleShotArray' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, GrappleShotSeq) == 0x000190, "Member 'UBB_BenchMarkHelper_C::GrappleShotSeq' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, JetShotArray) == 0x000198, "Member 'UBB_BenchMarkHelper_C::JetShotArray' has a wrong offset!");
static_assert(offsetof(UBB_BenchMarkHelper_C, JetShotSeq) == 0x0001A8, "Member 'UBB_BenchMarkHelper_C::JetShotSeq' has a wrong offset!");

}

