#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BB_BenchMarkHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.ExecuteUbergraph_BB_BenchMarkHelper
// 0x0048 (0x0048 - 0x0000)
struct BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              K2Node_CustomEvent_SaveGame;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USaveGame* SaveGame, bool bSuccess)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncActionHandleSaveGame*             CallFunc_AsyncSaveGameToSlot_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper");
static_assert(sizeof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper) == 0x000048, "Wrong size on BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper");
static_assert(offsetof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper, EntryPoint) == 0x000000, "Member 'BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper::EntryPoint' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper, CallFunc_GetCurrentWorld_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper::CallFunc_GetCurrentWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper, K2Node_CustomEvent_SaveGame) == 0x000010, "Member 'BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper::K2Node_CustomEvent_SaveGame' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper, K2Node_CustomEvent_bSuccess) == 0x000018, "Member 'BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper, Temp_bool_Variable) == 0x00002C, "Member 'BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper, Temp_object_Variable) == 0x000030, "Member 'BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper, CallFunc_AsyncSaveGameToSlot_ReturnValue) == 0x000038, "Member 'BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper::CallFunc_AsyncSaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BB_BenchMarkHelper_C_ExecuteUbergraph_BB_BenchMarkHelper::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.Completed_A14B304849457937707F79AE23F81981
// 0x0010 (0x0010 - 0x0000)
struct BB_BenchMarkHelper_C_Completed_A14B304849457937707F79AE23F81981 final
{
public:
	class USaveGame*                              SaveGame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_Completed_A14B304849457937707F79AE23F81981) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_Completed_A14B304849457937707F79AE23F81981");
static_assert(sizeof(BB_BenchMarkHelper_C_Completed_A14B304849457937707F79AE23F81981) == 0x000010, "Wrong size on BB_BenchMarkHelper_C_Completed_A14B304849457937707F79AE23F81981");
static_assert(offsetof(BB_BenchMarkHelper_C_Completed_A14B304849457937707F79AE23F81981, SaveGame) == 0x000000, "Member 'BB_BenchMarkHelper_C_Completed_A14B304849457937707F79AE23F81981::SaveGame' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_Completed_A14B304849457937707F79AE23F81981, bSuccess) == 0x000008, "Member 'BB_BenchMarkHelper_C_Completed_A14B304849457937707F79AE23F81981::bSuccess' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.OnGameStart
// 0x0020 (0x0020 - 0x0000)
struct BB_BenchMarkHelper_C_OnGameStart final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_OnGameStart) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_OnGameStart");
static_assert(sizeof(BB_BenchMarkHelper_C_OnGameStart) == 0x000020, "Wrong size on BB_BenchMarkHelper_C_OnGameStart");
static_assert(offsetof(BB_BenchMarkHelper_C_OnGameStart, Class_0) == 0x000000, "Member 'BB_BenchMarkHelper_C_OnGameStart::Class_0' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_OnGameStart, CallFunc_GetCurrentWorld_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_OnGameStart::CallFunc_GetCurrentWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_OnGameStart, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BB_BenchMarkHelper_C_OnGameStart::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_OnGameStart, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'BB_BenchMarkHelper_C_OnGameStart::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.SetInputMode
// 0x0003 (0x0003 - 0x0000)
struct BB_BenchMarkHelper_C_SetInputMode final
{
public:
	EMouseLockMode                                InMouseLockMode;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_SetInputMode) == 0x000001, "Wrong alignment on BB_BenchMarkHelper_C_SetInputMode");
static_assert(sizeof(BB_BenchMarkHelper_C_SetInputMode) == 0x000003, "Wrong size on BB_BenchMarkHelper_C_SetInputMode");
static_assert(offsetof(BB_BenchMarkHelper_C_SetInputMode, InMouseLockMode) == 0x000000, "Member 'BB_BenchMarkHelper_C_SetInputMode::InMouseLockMode' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetInputMode, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BB_BenchMarkHelper_C_SetInputMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetInputMode, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'BB_BenchMarkHelper_C_SetInputMode::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.SetShowPlayerMouseCursor
// 0x0002 (0x0002 - 0x0000)
struct BB_BenchMarkHelper_C_SetShowPlayerMouseCursor final
{
public:
	bool                                          bShowMouseCursor;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_SetShowPlayerMouseCursor) == 0x000001, "Wrong alignment on BB_BenchMarkHelper_C_SetShowPlayerMouseCursor");
static_assert(sizeof(BB_BenchMarkHelper_C_SetShowPlayerMouseCursor) == 0x000002, "Wrong size on BB_BenchMarkHelper_C_SetShowPlayerMouseCursor");
static_assert(offsetof(BB_BenchMarkHelper_C_SetShowPlayerMouseCursor, bShowMouseCursor) == 0x000000, "Member 'BB_BenchMarkHelper_C_SetShowPlayerMouseCursor::bShowMouseCursor' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetShowPlayerMouseCursor, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BB_BenchMarkHelper_C_SetShowPlayerMouseCursor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.SetEndBenchMarkTimer
// 0x0010 (0x0010 - 0x0000)
struct BB_BenchMarkHelper_C_SetEndBenchMarkTimer final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_SetEndBenchMarkTimer) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_SetEndBenchMarkTimer");
static_assert(sizeof(BB_BenchMarkHelper_C_SetEndBenchMarkTimer) == 0x000010, "Wrong size on BB_BenchMarkHelper_C_SetEndBenchMarkTimer");
static_assert(offsetof(BB_BenchMarkHelper_C_SetEndBenchMarkTimer, Time) == 0x000000, "Member 'BB_BenchMarkHelper_C_SetEndBenchMarkTimer::Time' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetEndBenchMarkTimer, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_SetEndBenchMarkTimer::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.End Bench Mark
// 0x0020 (0x0020 - 0x0000)
struct BB_BenchMarkHelper_C_End_Bench_Mark final
{
public:
	bool                                          EndByPlayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_End_Bench_Mark) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_End_Bench_Mark");
static_assert(sizeof(BB_BenchMarkHelper_C_End_Bench_Mark) == 0x000020, "Wrong size on BB_BenchMarkHelper_C_End_Bench_Mark");
static_assert(offsetof(BB_BenchMarkHelper_C_End_Bench_Mark, EndByPlayer) == 0x000000, "Member 'BB_BenchMarkHelper_C_End_Bench_Mark::EndByPlayer' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_End_Bench_Mark, CallFunc_GetCurrentWorld_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_End_Bench_Mark::CallFunc_GetCurrentWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_End_Bench_Mark, CallFunc_GetCurrentWorld_ReturnValue_1) == 0x000010, "Member 'BB_BenchMarkHelper_C_End_Bench_Mark::CallFunc_GetCurrentWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_End_Bench_Mark, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BB_BenchMarkHelper_C_End_Bench_Mark::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.ToMainMenuLevel
// 0x0008 (0x0008 - 0x0000)
struct BB_BenchMarkHelper_C_ToMainMenuLevel final
{
public:
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_ToMainMenuLevel) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_ToMainMenuLevel");
static_assert(sizeof(BB_BenchMarkHelper_C_ToMainMenuLevel) == 0x000008, "Wrong size on BB_BenchMarkHelper_C_ToMainMenuLevel");
static_assert(offsetof(BB_BenchMarkHelper_C_ToMainMenuLevel, CallFunc_GetCurrentWorld_ReturnValue) == 0x000000, "Member 'BB_BenchMarkHelper_C_ToMainMenuLevel::CallFunc_GetCurrentWorld_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.ToFinalPageLevel
// 0x0008 (0x0008 - 0x0000)
struct BB_BenchMarkHelper_C_ToFinalPageLevel final
{
public:
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_ToFinalPageLevel) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_ToFinalPageLevel");
static_assert(sizeof(BB_BenchMarkHelper_C_ToFinalPageLevel) == 0x000008, "Wrong size on BB_BenchMarkHelper_C_ToFinalPageLevel");
static_assert(offsetof(BB_BenchMarkHelper_C_ToFinalPageLevel, CallFunc_GetCurrentWorld_ReturnValue) == 0x000000, "Member 'BB_BenchMarkHelper_C_ToFinalPageLevel::CallFunc_GetCurrentWorld_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.CreateSaveGamePtr
// 0x0008 (0x0008 - 0x0000)
struct BB_BenchMarkHelper_C_CreateSaveGamePtr final
{
public:
	class USG_SaveFPSdata_C*                      CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_CreateSaveGamePtr) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_CreateSaveGamePtr");
static_assert(sizeof(BB_BenchMarkHelper_C_CreateSaveGamePtr) == 0x000008, "Wrong size on BB_BenchMarkHelper_C_CreateSaveGamePtr");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateSaveGamePtr, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000000, "Member 'BB_BenchMarkHelper_C_CreateSaveGamePtr::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.OnStartBenchMark
// 0x0010 (0x0010 - 0x0000)
struct BB_BenchMarkHelper_C_OnStartBenchMark final
{
public:
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_OnStartBenchMark) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_OnStartBenchMark");
static_assert(sizeof(BB_BenchMarkHelper_C_OnStartBenchMark) == 0x000010, "Wrong size on BB_BenchMarkHelper_C_OnStartBenchMark");
static_assert(offsetof(BB_BenchMarkHelper_C_OnStartBenchMark, CallFunc_GetCurrentWorld_ReturnValue) == 0x000000, "Member 'BB_BenchMarkHelper_C_OnStartBenchMark::CallFunc_GetCurrentWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_OnStartBenchMark, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_OnStartBenchMark::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.SetMaxFPS
// 0x0010 (0x0010 - 0x0000)
struct BB_BenchMarkHelper_C_SetMaxFPS final
{
public:
	float                                         MaxFPS_F;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_SetMaxFPS) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_SetMaxFPS");
static_assert(sizeof(BB_BenchMarkHelper_C_SetMaxFPS) == 0x000010, "Wrong size on BB_BenchMarkHelper_C_SetMaxFPS");
static_assert(offsetof(BB_BenchMarkHelper_C_SetMaxFPS, MaxFPS_F) == 0x000000, "Member 'BB_BenchMarkHelper_C_SetMaxFPS::MaxFPS_F' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetMaxFPS, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_SetMaxFPS::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.SetRTXConsoles
// 0x0008 (0x0008 - 0x0000)
struct BB_BenchMarkHelper_C_SetRTXConsoles final
{
public:
	class UObject*                                LocalSaveGame;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_SetRTXConsoles) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_SetRTXConsoles");
static_assert(sizeof(BB_BenchMarkHelper_C_SetRTXConsoles) == 0x000008, "Wrong size on BB_BenchMarkHelper_C_SetRTXConsoles");
static_assert(offsetof(BB_BenchMarkHelper_C_SetRTXConsoles, LocalSaveGame) == 0x000000, "Member 'BB_BenchMarkHelper_C_SetRTXConsoles::LocalSaveGame' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.OnEscPressed
// 0x0001 (0x0001 - 0x0000)
struct BB_BenchMarkHelper_C_OnEscPressed final
{
public:
	bool                                          Pause;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_OnEscPressed) == 0x000001, "Wrong alignment on BB_BenchMarkHelper_C_OnEscPressed");
static_assert(sizeof(BB_BenchMarkHelper_C_OnEscPressed) == 0x000001, "Wrong size on BB_BenchMarkHelper_C_OnEscPressed");
static_assert(offsetof(BB_BenchMarkHelper_C_OnEscPressed, Pause) == 0x000000, "Member 'BB_BenchMarkHelper_C_OnEscPressed::Pause' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.PauseGame
// 0x0018 (0x0018 - 0x0000)
struct BB_BenchMarkHelper_C_PauseGame final
{
public:
	bool                                          Pause;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_PauseGame) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_PauseGame");
static_assert(sizeof(BB_BenchMarkHelper_C_PauseGame) == 0x000018, "Wrong size on BB_BenchMarkHelper_C_PauseGame");
static_assert(offsetof(BB_BenchMarkHelper_C_PauseGame, Pause) == 0x000000, "Member 'BB_BenchMarkHelper_C_PauseGame::Pause' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_PauseGame, CallFunc_GetCurrentWorld_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_PauseGame::CallFunc_GetCurrentWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_PauseGame, CallFunc_SetGamePaused_ReturnValue) == 0x000010, "Member 'BB_BenchMarkHelper_C_PauseGame::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.CalMaxFPS
// 0x0018 (0x0018 - 0x0000)
struct BB_BenchMarkHelper_C_CalMaxFPS final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_CalMaxFPS) == 0x000004, "Wrong alignment on BB_BenchMarkHelper_C_CalMaxFPS");
static_assert(sizeof(BB_BenchMarkHelper_C_CalMaxFPS) == 0x000018, "Wrong size on BB_BenchMarkHelper_C_CalMaxFPS");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMaxFPS, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BB_BenchMarkHelper_C_CalMaxFPS::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMaxFPS, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BB_BenchMarkHelper_C_CalMaxFPS::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMaxFPS, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_CalMaxFPS::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMaxFPS, CallFunc_Array_Get_Item) == 0x00000C, "Member 'BB_BenchMarkHelper_C_CalMaxFPS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMaxFPS, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BB_BenchMarkHelper_C_CalMaxFPS::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMaxFPS, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'BB_BenchMarkHelper_C_CalMaxFPS::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMaxFPS, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000015, "Member 'BB_BenchMarkHelper_C_CalMaxFPS::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.CalMinFPS
// 0x0018 (0x0018 - 0x0000)
struct BB_BenchMarkHelper_C_CalMinFPS final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_CalMinFPS) == 0x000004, "Wrong alignment on BB_BenchMarkHelper_C_CalMinFPS");
static_assert(sizeof(BB_BenchMarkHelper_C_CalMinFPS) == 0x000018, "Wrong size on BB_BenchMarkHelper_C_CalMinFPS");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMinFPS, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BB_BenchMarkHelper_C_CalMinFPS::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMinFPS, CallFunc_Array_Get_Item) == 0x000004, "Member 'BB_BenchMarkHelper_C_CalMinFPS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMinFPS, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_CalMinFPS::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMinFPS, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BB_BenchMarkHelper_C_CalMinFPS::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMinFPS, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'BB_BenchMarkHelper_C_CalMinFPS::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMinFPS, CallFunc_Less_IntInt_ReturnValue) == 0x000011, "Member 'BB_BenchMarkHelper_C_CalMinFPS::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalMinFPS, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BB_BenchMarkHelper_C_CalMinFPS::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.SetPointArrays
// 0x0004 (0x0004 - 0x0000)
struct BB_BenchMarkHelper_C_SetPointArrays final
{
public:
	int32                                         FPSArrayLength;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_SetPointArrays) == 0x000004, "Wrong alignment on BB_BenchMarkHelper_C_SetPointArrays");
static_assert(sizeof(BB_BenchMarkHelper_C_SetPointArrays) == 0x000004, "Wrong size on BB_BenchMarkHelper_C_SetPointArrays");
static_assert(offsetof(BB_BenchMarkHelper_C_SetPointArrays, FPSArrayLength) == 0x000000, "Member 'BB_BenchMarkHelper_C_SetPointArrays::FPSArrayLength' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.CalAverageFPS
// 0x0028 (0x0028 - 0x0000)
struct BB_BenchMarkHelper_C_CalAverageFPS final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_CalAverageFPS) == 0x000004, "Wrong alignment on BB_BenchMarkHelper_C_CalAverageFPS");
static_assert(sizeof(BB_BenchMarkHelper_C_CalAverageFPS) == 0x000028, "Wrong size on BB_BenchMarkHelper_C_CalAverageFPS");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, CallFunc_Array_Get_Item) == 0x000004, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, CallFunc_Array_Length_ReturnValue_1) == 0x00000C, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CalAverageFPS, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BB_BenchMarkHelper_C_CalAverageFPS::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.SetAverageLineSeedArray
// 0x0028 (0x0028 - 0x0000)
struct BB_BenchMarkHelper_C_SetAverageLineSeedArray final
{
public:
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(BB_BenchMarkHelper_C_SetAverageLineSeedArray) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_SetAverageLineSeedArray");
static_assert(sizeof(BB_BenchMarkHelper_C_SetAverageLineSeedArray) == 0x000028, "Wrong size on BB_BenchMarkHelper_C_SetAverageLineSeedArray");
static_assert(offsetof(BB_BenchMarkHelper_C_SetAverageLineSeedArray, CallFunc_MapRangeClamped_ReturnValue) == 0x000000, "Member 'BB_BenchMarkHelper_C_SetAverageLineSeedArray::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetAverageLineSeedArray, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000004, "Member 'BB_BenchMarkHelper_C_SetAverageLineSeedArray::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetAverageLineSeedArray, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_SetAverageLineSeedArray::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetAverageLineSeedArray, CallFunc_MakeVector2D_ReturnValue_1) == 0x000010, "Member 'BB_BenchMarkHelper_C_SetAverageLineSeedArray::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetAverageLineSeedArray, K2Node_MakeArray_Array) == 0x000018, "Member 'BB_BenchMarkHelper_C_SetAverageLineSeedArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.CreateAndSaveBMData
// 0x0170 (0x0170 - 0x0000)
struct BB_BenchMarkHelper_C_CreateAndSaveBMData final
{
public:
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetPlatformUserName_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinute_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDay_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHour_ReturnValue;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMonth_ReturnValue;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYear_ReturnValue;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetProjectDirectory_ReturnValue;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateCSV_ReturnValue;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BB_BenchMarkHelper_C_CreateAndSaveBMData) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_CreateAndSaveBMData");
static_assert(sizeof(BB_BenchMarkHelper_C_CreateAndSaveBMData) == 0x000170, "Wrong size on BB_BenchMarkHelper_C_CreateAndSaveBMData");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, K2Node_MakeArray_Array) == 0x000000, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_GetPlatformUserName_ReturnValue) == 0x000010, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_GetPlatformUserName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Now_ReturnValue) == 0x000020, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_GetMinute_ReturnValue) == 0x000038, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_GetMinute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_GetDay_ReturnValue) == 0x00003C, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_GetDay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000050, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_GetHour_ReturnValue) == 0x000060, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_GetHour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000078, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_GetMonth_ReturnValue) == 0x000088, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_GetMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000090, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0000A0, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B0, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000C0, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_GetYear_ReturnValue) == 0x0000D0, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_GetYear_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Conv_IntToString_ReturnValue_4) == 0x0000D8, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_GetProjectDirectory_ReturnValue) == 0x0000E8, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_GetProjectDirectory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F8, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000108, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000118, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000128, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000138, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000148, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000158, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_CreateAndSaveBMData, CallFunc_CreateCSV_ReturnValue) == 0x000168, "Member 'BB_BenchMarkHelper_C_CreateAndSaveBMData::CallFunc_CreateCSV_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.GetCurrentFPS
// 0x000C (0x000C - 0x0000)
struct BB_BenchMarkHelper_C_GetCurrentFPS final
{
public:
	float                                         CallFunc_GetCurrentFakeFPS_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_GetCurrentFPS) == 0x000004, "Wrong alignment on BB_BenchMarkHelper_C_GetCurrentFPS");
static_assert(sizeof(BB_BenchMarkHelper_C_GetCurrentFPS) == 0x00000C, "Wrong size on BB_BenchMarkHelper_C_GetCurrentFPS");
static_assert(offsetof(BB_BenchMarkHelper_C_GetCurrentFPS, CallFunc_GetCurrentFakeFPS_ReturnValue) == 0x000000, "Member 'BB_BenchMarkHelper_C_GetCurrentFPS::CallFunc_GetCurrentFakeFPS_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_GetCurrentFPS, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'BB_BenchMarkHelper_C_GetCurrentFPS::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_GetCurrentFPS, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_GetCurrentFPS::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.Start Get FPSData
// 0x0010 (0x0010 - 0x0000)
struct BB_BenchMarkHelper_C_Start_Get_FPSData final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_Start_Get_FPSData) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_Start_Get_FPSData");
static_assert(sizeof(BB_BenchMarkHelper_C_Start_Get_FPSData) == 0x000010, "Wrong size on BB_BenchMarkHelper_C_Start_Get_FPSData");
static_assert(offsetof(BB_BenchMarkHelper_C_Start_Get_FPSData, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BB_BenchMarkHelper_C_Start_Get_FPSData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_Start_Get_FPSData, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_Start_Get_FPSData::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.GetMaxResolution
// 0x0010 (0x0010 - 0x0000)
struct BB_BenchMarkHelper_C_GetMaxResolution final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetDesktopResolution_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_GetMaxResolution) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_GetMaxResolution");
static_assert(sizeof(BB_BenchMarkHelper_C_GetMaxResolution) == 0x000010, "Wrong size on BB_BenchMarkHelper_C_GetMaxResolution");
static_assert(offsetof(BB_BenchMarkHelper_C_GetMaxResolution, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'BB_BenchMarkHelper_C_GetMaxResolution::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_GetMaxResolution, CallFunc_GetDesktopResolution_ReturnValue) == 0x000008, "Member 'BB_BenchMarkHelper_C_GetMaxResolution::CallFunc_GetDesktopResolution_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.SetResolutionBaseOnSetting
// 0x0070 (0x0070 - 0x0000)
struct BB_BenchMarkHelper_C_SetResolutionBaseOnSetting final
{
public:
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenMode_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntPointToString_ReturnValue;        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting) == 0x000008, "Wrong alignment on BB_BenchMarkHelper_C_SetResolutionBaseOnSetting");
static_assert(sizeof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting) == 0x000070, "Wrong size on BB_BenchMarkHelper_C_SetResolutionBaseOnSetting");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_MakeLiteralString_ReturnValue) == 0x000000, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, Temp_int_Variable) == 0x000010, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000014, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_K2_SetTimer_ReturnValue) == 0x000018, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_GetGameUserSettings_ReturnValue) == 0x000028, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_GetFullscreenMode_ReturnValue) == 0x000030, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_GetFullscreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000038, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_GetScreenResolution_ReturnValue) == 0x000048, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_Conv_IntPointToString_ReturnValue) == 0x000050, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_Conv_IntPointToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BB_BenchMarkHelper_C_SetResolutionBaseOnSetting, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'BB_BenchMarkHelper_C_SetResolutionBaseOnSetting::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BB_BenchMarkHelper.BB_BenchMarkHelper_C.PauseSequence
// 0x0060 (0x0060 - 0x0000)
struct BB_BenchMarkHelper_C_PauseSequence final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_GetCurrentWorld_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ALevelSequenceActor*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
