#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlackFader

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlackFader.BlackFader_C
// 0x0030 (0x0290 - 0x0260)
class UBlackFader_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_BG;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              FadeOutShowDispatcher;                             // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BlackFader(int32 EntryPoint);
	void CustomEvent_0();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Fade(float PlaybackSpeed);
	void Fade_Out_Show_Func();
	void Fade_In();
	void Fade_Out();
	void SequenceEvent__ENTRYPOINTBlackFader_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlackFader_C">();
	}
	static class UBlackFader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlackFader_C>();
	}
};
static_assert(alignof(UBlackFader_C) == 0x000008, "Wrong alignment on UBlackFader_C");
static_assert(sizeof(UBlackFader_C) == 0x000290, "Wrong size on UBlackFader_C");
static_assert(offsetof(UBlackFader_C, UberGraphFrame) == 0x000260, "Member 'UBlackFader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlackFader_C, FadeIn) == 0x000268, "Member 'UBlackFader_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UBlackFader_C, FadeOut) == 0x000270, "Member 'UBlackFader_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UBlackFader_C, Border_BG) == 0x000278, "Member 'UBlackFader_C::Border_BG' has a wrong offset!");
static_assert(offsetof(UBlackFader_C, FadeOutShowDispatcher) == 0x000280, "Member 'UBlackFader_C::FadeOutShowDispatcher' has a wrong offset!");

}

