#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BottomTips

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BottomTips.BottomTips_C.ExecuteUbergraph_BottomTips
// 0x0158 (0x0158 - 0x0000)
struct BottomTips_C_ExecuteUbergraph_BottomTips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0040(0x0070)(ConstParm)
	bool                                          CallFunc_SetInputName_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00B8(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00E0(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BottomTips_C_ExecuteUbergraph_BottomTips) == 0x000008, "Wrong alignment on BottomTips_C_ExecuteUbergraph_BottomTips");
static_assert(sizeof(BottomTips_C_ExecuteUbergraph_BottomTips) == 0x000158, "Wrong size on BottomTips_C_ExecuteUbergraph_BottomTips");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, EntryPoint) == 0x000000, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::EntryPoint' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, K2Node_Event_MyGeometry) == 0x000004, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, K2Node_Event_MouseEvent) == 0x000040, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, CallFunc_SetInputName_ReturnValue) == 0x0000B0, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::CallFunc_SetInputName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, K2Node_Event_IsDesignTime) == 0x0000B1, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, CallFunc_TextToUpper_ReturnValue) == 0x0000B8, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, CallFunc_PlayAnimation_ReturnValue) == 0x0000D0, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, CallFunc_GetEndTime_ReturnValue) == 0x0000D8, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, K2Node_Event_MouseEvent_1) == 0x0000E0, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ExecuteUbergraph_BottomTips, CallFunc_PlayAnimation_ReturnValue_1) == 0x000150, "Member 'BottomTips_C_ExecuteUbergraph_BottomTips::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BottomTips.BottomTips_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct BottomTips_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BottomTips_C_OnMouseEnter) == 0x000008, "Wrong alignment on BottomTips_C_OnMouseEnter");
static_assert(sizeof(BottomTips_C_OnMouseEnter) == 0x0000A8, "Wrong size on BottomTips_C_OnMouseEnter");
static_assert(offsetof(BottomTips_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'BottomTips_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(BottomTips_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'BottomTips_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function BottomTips.BottomTips_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct BottomTips_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BottomTips_C_OnMouseLeave) == 0x000008, "Wrong alignment on BottomTips_C_OnMouseLeave");
static_assert(sizeof(BottomTips_C_OnMouseLeave) == 0x000070, "Wrong size on BottomTips_C_OnMouseLeave");
static_assert(offsetof(BottomTips_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'BottomTips_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function BottomTips.BottomTips_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BottomTips_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BottomTips_C_PreConstruct) == 0x000001, "Wrong alignment on BottomTips_C_PreConstruct");
static_assert(sizeof(BottomTips_C_PreConstruct) == 0x000001, "Wrong size on BottomTips_C_PreConstruct");
static_assert(offsetof(BottomTips_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BottomTips_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BottomTips.BottomTips_C.ModifyText
// 0x0030 (0x0030 - 0x0000)
struct BottomTips_C_ModifyText final
{
public:
	class FText                                   ModifyText_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(BottomTips_C_ModifyText) == 0x000008, "Wrong alignment on BottomTips_C_ModifyText");
static_assert(sizeof(BottomTips_C_ModifyText) == 0x000030, "Wrong size on BottomTips_C_ModifyText");
static_assert(offsetof(BottomTips_C_ModifyText, ModifyText_0) == 0x000000, "Member 'BottomTips_C_ModifyText::ModifyText_0' has a wrong offset!");
static_assert(offsetof(BottomTips_C_ModifyText, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'BottomTips_C_ModifyText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function BottomTips.BottomTips_C.On Main Border Mouse Button Up
// 0x0250 (0x0250 - 0x0000)
struct BottomTips_C_On_Main_Border_Mouse_Button_Up final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetKeysOfInput_ReturnValue;               // 0x0220(0x0010)(ReferenceParm)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x0230(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_SimulatePressKey_ReturnValue;             // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SimulateReleaseKey_ReturnValue;           // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BottomTips_C_On_Main_Border_Mouse_Button_Up) == 0x000008, "Wrong alignment on BottomTips_C_On_Main_Border_Mouse_Button_Up");
static_assert(sizeof(BottomTips_C_On_Main_Border_Mouse_Button_Up) == 0x000250, "Wrong size on BottomTips_C_On_Main_Border_Mouse_Button_Up");
static_assert(offsetof(BottomTips_C_On_Main_Border_Mouse_Button_Up, MyGeometry) == 0x000000, "Member 'BottomTips_C_On_Main_Border_Mouse_Button_Up::MyGeometry' has a wrong offset!");
static_assert(offsetof(BottomTips_C_On_Main_Border_Mouse_Button_Up, MouseEvent) == 0x000038, "Member 'BottomTips_C_On_Main_Border_Mouse_Button_Up::MouseEvent' has a wrong offset!");
static_assert(offsetof(BottomTips_C_On_Main_Border_Mouse_Button_Up, ReturnValue) == 0x0000A8, "Member 'BottomTips_C_On_Main_Border_Mouse_Button_Up::ReturnValue' has a wrong offset!");
static_assert(offsetof(BottomTips_C_On_Main_Border_Mouse_Button_Up, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'BottomTips_C_On_Main_Border_Mouse_Button_Up::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(BottomTips_C_On_Main_Border_Mouse_Button_Up, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000218, "Member 'BottomTips_C_On_Main_Border_Mouse_Button_Up::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BottomTips_C_On_Main_Border_Mouse_Button_Up, CallFunc_GetKeysOfInput_ReturnValue) == 0x000220, "Member 'BottomTips_C_On_Main_Border_Mouse_Button_Up::CallFunc_GetKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BottomTips_C_On_Main_Border_Mouse_Button_Up, CallFunc_Array_Get_Item) == 0x000230, "Member 'BottomTips_C_On_Main_Border_Mouse_Button_Up::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BottomTips_C_On_Main_Border_Mouse_Button_Up, CallFunc_SimulatePressKey_ReturnValue) == 0x000248, "Member 'BottomTips_C_On_Main_Border_Mouse_Button_Up::CallFunc_SimulatePressKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BottomTips_C_On_Main_Border_Mouse_Button_Up, CallFunc_SimulateReleaseKey_ReturnValue) == 0x000249, "Member 'BottomTips_C_On_Main_Border_Mouse_Button_Up::CallFunc_SimulateReleaseKey_ReturnValue' has a wrong offset!");

}

