#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BottomTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MainMenuWidget_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BottomTips.BottomTips_C
// 0x0070 (0x0360 - 0x02F0)
class UBottomTips_C final : public UMainMenuWidget_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BottomTips_C;                       // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SmartButton;                                       // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomBar;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      ButtonImage;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      ButtonImage_1;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonName_2;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_955;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MainBorder;                                        // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SecImage;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Tip_Select;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0340(0x0018)(Edit, BlueprintVisible)
	class FName                                   Input;                                             // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BottomTips(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void ModifyText(const class FText& ModifyText_0);
	struct FEventReply On_Main_Border_Mouse_Button_Up(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BottomTips_C">();
	}
	static class UBottomTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBottomTips_C>();
	}
};
static_assert(alignof(UBottomTips_C) == 0x000008, "Wrong alignment on UBottomTips_C");
static_assert(sizeof(UBottomTips_C) == 0x000360, "Wrong size on UBottomTips_C");
static_assert(offsetof(UBottomTips_C, UberGraphFrame_BottomTips_C) == 0x0002F0, "Member 'UBottomTips_C::UberGraphFrame_BottomTips_C' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, SmartButton) == 0x0002F8, "Member 'UBottomTips_C::SmartButton' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, BottomBar) == 0x000300, "Member 'UBottomTips_C::BottomBar' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, ButtonImage) == 0x000308, "Member 'UBottomTips_C::ButtonImage' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, ButtonImage_1) == 0x000310, "Member 'UBottomTips_C::ButtonImage_1' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, ButtonName_2) == 0x000318, "Member 'UBottomTips_C::ButtonName_2' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, Image_955) == 0x000320, "Member 'UBottomTips_C::Image_955' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, MainBorder) == 0x000328, "Member 'UBottomTips_C::MainBorder' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, SecImage) == 0x000330, "Member 'UBottomTips_C::SecImage' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, Tip_Select) == 0x000338, "Member 'UBottomTips_C::Tip_Select' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, ButtonText) == 0x000340, "Member 'UBottomTips_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UBottomTips_C, Input) == 0x000358, "Member 'UBottomTips_C::Input' has a wrong offset!");

}

