#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoundaryBenchmark

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class BoundaryBenchmark.BBM_Subsystem
// 0x0048 (0x0078 - 0x0030)
class UBBM_Subsystem : public UGameInstanceSubsystem
{
public:
	TArray<int32>                                 FPSArray;                                          // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 CPUFPSArray;                                       // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 GPUFPSArray;                                       // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         RecordingTime;                                     // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnBenchmarkEndDelegate;                            // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class FString GetCPUBrandName();
	static int32 GetCPUCores();
	static class FString GetCPUVendorName();
	static class FString GetGPUBrandName();

	void BenchmarkTick(int32 FPS, int32 CPUFPS, int32 GPUFPS, float DeltaTime);
	bool CreateCSV(const class FString& SaveDirectory, const class FString& Filename, const TArray<class FString>& SaveText, bool AllowOverWriting);
	void EndBenchmark();
	float GetCurrentFakeFPS();
	class UWorld* GetCurrentWorld();
	float GetGameThreadTime();
	float GetGPUTime();
	class FString GetOSVersion();
	float GetRenderThreadTime();
	struct FVideoMemoryInfo GetVideoMemory();
	void StartBenchmark();

	class FString GetRHIInfo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BBM_Subsystem">();
	}
	static class UBBM_Subsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBBM_Subsystem>();
	}
};
static_assert(alignof(UBBM_Subsystem) == 0x000008, "Wrong alignment on UBBM_Subsystem");
static_assert(sizeof(UBBM_Subsystem) == 0x000078, "Wrong size on UBBM_Subsystem");
static_assert(offsetof(UBBM_Subsystem, FPSArray) == 0x000030, "Member 'UBBM_Subsystem::FPSArray' has a wrong offset!");
static_assert(offsetof(UBBM_Subsystem, CPUFPSArray) == 0x000040, "Member 'UBBM_Subsystem::CPUFPSArray' has a wrong offset!");
static_assert(offsetof(UBBM_Subsystem, GPUFPSArray) == 0x000050, "Member 'UBBM_Subsystem::GPUFPSArray' has a wrong offset!");
static_assert(offsetof(UBBM_Subsystem, RecordingTime) == 0x000060, "Member 'UBBM_Subsystem::RecordingTime' has a wrong offset!");
static_assert(offsetof(UBBM_Subsystem, OnBenchmarkEndDelegate) == 0x000068, "Member 'UBBM_Subsystem::OnBenchmarkEndDelegate' has a wrong offset!");

// Class BoundaryBenchmark.BoundaryBenchmarkCharacter
// 0x0090 (0x0550 - 0x04C0)
class ABoundaryBenchmarkCharacter : public ACharacter
{
public:
	class USkeletalMeshComponent*                 Mesh1P;                                            // 0x04B8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 FP_Gun;                                            // 0x04C0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        FP_MuzzleLocation;                                 // 0x04C8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 VR_Gun;                                            // 0x04D0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        VR_MuzzleLocation;                                 // 0x04D8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraComponent*                       FirstPersonCameraComponent;                        // 0x04E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMotionControllerComponent*             R_MotionController;                                // 0x04E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMotionControllerComponent*             L_MotionController;                                // 0x04F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BaseTurnRate;                                      // 0x04F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseLookUpRate;                                    // 0x04FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GunOffset;                                         // 0x0500(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ABoundaryBenchmarkProjectile> ProjectileClass;                                   // 0x0510(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             FireSound;                                         // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           FireAnimation;                                     // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUsingMotionControllers : 1;                       // 0x0528(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_529[0x27];                                     // 0x0529(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoundaryBenchmarkCharacter">();
	}
	static class ABoundaryBenchmarkCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoundaryBenchmarkCharacter>();
	}
};
static_assert(alignof(ABoundaryBenchmarkCharacter) == 0x000010, "Wrong alignment on ABoundaryBenchmarkCharacter");
static_assert(sizeof(ABoundaryBenchmarkCharacter) == 0x000550, "Wrong size on ABoundaryBenchmarkCharacter");
static_assert(offsetof(ABoundaryBenchmarkCharacter, Mesh1P) == 0x0004B8, "Member 'ABoundaryBenchmarkCharacter::Mesh1P' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, FP_Gun) == 0x0004C0, "Member 'ABoundaryBenchmarkCharacter::FP_Gun' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, FP_MuzzleLocation) == 0x0004C8, "Member 'ABoundaryBenchmarkCharacter::FP_MuzzleLocation' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, VR_Gun) == 0x0004D0, "Member 'ABoundaryBenchmarkCharacter::VR_Gun' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, VR_MuzzleLocation) == 0x0004D8, "Member 'ABoundaryBenchmarkCharacter::VR_MuzzleLocation' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, FirstPersonCameraComponent) == 0x0004E0, "Member 'ABoundaryBenchmarkCharacter::FirstPersonCameraComponent' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, R_MotionController) == 0x0004E8, "Member 'ABoundaryBenchmarkCharacter::R_MotionController' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, L_MotionController) == 0x0004F0, "Member 'ABoundaryBenchmarkCharacter::L_MotionController' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, BaseTurnRate) == 0x0004F8, "Member 'ABoundaryBenchmarkCharacter::BaseTurnRate' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, BaseLookUpRate) == 0x0004FC, "Member 'ABoundaryBenchmarkCharacter::BaseLookUpRate' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, GunOffset) == 0x000500, "Member 'ABoundaryBenchmarkCharacter::GunOffset' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, ProjectileClass) == 0x000510, "Member 'ABoundaryBenchmarkCharacter::ProjectileClass' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, FireSound) == 0x000518, "Member 'ABoundaryBenchmarkCharacter::FireSound' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkCharacter, FireAnimation) == 0x000520, "Member 'ABoundaryBenchmarkCharacter::FireAnimation' has a wrong offset!");

// Class BoundaryBenchmark.BoundaryBenchmarkGameMode
// 0x0000 (0x02C0 - 0x02C0)
class ABoundaryBenchmarkGameMode final : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoundaryBenchmarkGameMode">();
	}
	static class ABoundaryBenchmarkGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoundaryBenchmarkGameMode>();
	}
};
static_assert(alignof(ABoundaryBenchmarkGameMode) == 0x000008, "Wrong alignment on ABoundaryBenchmarkGameMode");
static_assert(sizeof(ABoundaryBenchmarkGameMode) == 0x0002C0, "Wrong size on ABoundaryBenchmarkGameMode");

// Class BoundaryBenchmark.BoundaryBenchmarkHUD
// 0x0008 (0x0318 - 0x0310)
class ABoundaryBenchmarkHUD final : public AHUD
{
public:
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoundaryBenchmarkHUD">();
	}
	static class ABoundaryBenchmarkHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoundaryBenchmarkHUD>();
	}
};
static_assert(alignof(ABoundaryBenchmarkHUD) == 0x000008, "Wrong alignment on ABoundaryBenchmarkHUD");
static_assert(sizeof(ABoundaryBenchmarkHUD) == 0x000318, "Wrong size on ABoundaryBenchmarkHUD");

// Class BoundaryBenchmark.BoundaryBenchmarkProjectile
// 0x0010 (0x0230 - 0x0220)
class ABoundaryBenchmarkProjectile : public AActor
{
public:
	class USphereComponent*                       CollisionComp;                                     // 0x0220(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnHit(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoundaryBenchmarkProjectile">();
	}
	static class ABoundaryBenchmarkProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoundaryBenchmarkProjectile>();
	}
};
static_assert(alignof(ABoundaryBenchmarkProjectile) == 0x000008, "Wrong alignment on ABoundaryBenchmarkProjectile");
static_assert(sizeof(ABoundaryBenchmarkProjectile) == 0x000230, "Wrong size on ABoundaryBenchmarkProjectile");
static_assert(offsetof(ABoundaryBenchmarkProjectile, CollisionComp) == 0x000220, "Member 'ABoundaryBenchmarkProjectile::CollisionComp' has a wrong offset!");
static_assert(offsetof(ABoundaryBenchmarkProjectile, ProjectileMovement) == 0x000228, "Member 'ABoundaryBenchmarkProjectile::ProjectileMovement' has a wrong offset!");

}

