#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoundaryBenchmark

#include "Basic.hpp"

#include "BoundaryBenchmark_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BoundaryBenchmark.BBM_Subsystem.GetCPUBrandName
// 0x0010 (0x0010 - 0x0000)
struct BBM_Subsystem_GetCPUBrandName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetCPUBrandName) == 0x000008, "Wrong alignment on BBM_Subsystem_GetCPUBrandName");
static_assert(sizeof(BBM_Subsystem_GetCPUBrandName) == 0x000010, "Wrong size on BBM_Subsystem_GetCPUBrandName");
static_assert(offsetof(BBM_Subsystem_GetCPUBrandName, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetCPUBrandName::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetCPUCores
// 0x0004 (0x0004 - 0x0000)
struct BBM_Subsystem_GetCPUCores final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetCPUCores) == 0x000004, "Wrong alignment on BBM_Subsystem_GetCPUCores");
static_assert(sizeof(BBM_Subsystem_GetCPUCores) == 0x000004, "Wrong size on BBM_Subsystem_GetCPUCores");
static_assert(offsetof(BBM_Subsystem_GetCPUCores, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetCPUCores::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetCPUVendorName
// 0x0010 (0x0010 - 0x0000)
struct BBM_Subsystem_GetCPUVendorName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetCPUVendorName) == 0x000008, "Wrong alignment on BBM_Subsystem_GetCPUVendorName");
static_assert(sizeof(BBM_Subsystem_GetCPUVendorName) == 0x000010, "Wrong size on BBM_Subsystem_GetCPUVendorName");
static_assert(offsetof(BBM_Subsystem_GetCPUVendorName, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetCPUVendorName::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetGPUBrandName
// 0x0010 (0x0010 - 0x0000)
struct BBM_Subsystem_GetGPUBrandName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetGPUBrandName) == 0x000008, "Wrong alignment on BBM_Subsystem_GetGPUBrandName");
static_assert(sizeof(BBM_Subsystem_GetGPUBrandName) == 0x000010, "Wrong size on BBM_Subsystem_GetGPUBrandName");
static_assert(offsetof(BBM_Subsystem_GetGPUBrandName, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetGPUBrandName::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.BenchmarkTick
// 0x0010 (0x0010 - 0x0000)
struct BBM_Subsystem_BenchmarkTick final
{
public:
	int32                                         FPS;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CPUFPS;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GPUFPS;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_BenchmarkTick) == 0x000004, "Wrong alignment on BBM_Subsystem_BenchmarkTick");
static_assert(sizeof(BBM_Subsystem_BenchmarkTick) == 0x000010, "Wrong size on BBM_Subsystem_BenchmarkTick");
static_assert(offsetof(BBM_Subsystem_BenchmarkTick, FPS) == 0x000000, "Member 'BBM_Subsystem_BenchmarkTick::FPS' has a wrong offset!");
static_assert(offsetof(BBM_Subsystem_BenchmarkTick, CPUFPS) == 0x000004, "Member 'BBM_Subsystem_BenchmarkTick::CPUFPS' has a wrong offset!");
static_assert(offsetof(BBM_Subsystem_BenchmarkTick, GPUFPS) == 0x000008, "Member 'BBM_Subsystem_BenchmarkTick::GPUFPS' has a wrong offset!");
static_assert(offsetof(BBM_Subsystem_BenchmarkTick, DeltaTime) == 0x00000C, "Member 'BBM_Subsystem_BenchmarkTick::DeltaTime' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.CreateCSV
// 0x0038 (0x0038 - 0x0000)
struct BBM_Subsystem_CreateCSV final
{
public:
	class FString                                 SaveDirectory;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SaveText;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          AllowOverWriting;                                  // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BBM_Subsystem_CreateCSV) == 0x000008, "Wrong alignment on BBM_Subsystem_CreateCSV");
static_assert(sizeof(BBM_Subsystem_CreateCSV) == 0x000038, "Wrong size on BBM_Subsystem_CreateCSV");
static_assert(offsetof(BBM_Subsystem_CreateCSV, SaveDirectory) == 0x000000, "Member 'BBM_Subsystem_CreateCSV::SaveDirectory' has a wrong offset!");
static_assert(offsetof(BBM_Subsystem_CreateCSV, Filename) == 0x000010, "Member 'BBM_Subsystem_CreateCSV::Filename' has a wrong offset!");
static_assert(offsetof(BBM_Subsystem_CreateCSV, SaveText) == 0x000020, "Member 'BBM_Subsystem_CreateCSV::SaveText' has a wrong offset!");
static_assert(offsetof(BBM_Subsystem_CreateCSV, AllowOverWriting) == 0x000030, "Member 'BBM_Subsystem_CreateCSV::AllowOverWriting' has a wrong offset!");
static_assert(offsetof(BBM_Subsystem_CreateCSV, ReturnValue) == 0x000031, "Member 'BBM_Subsystem_CreateCSV::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetCurrentFakeFPS
// 0x0004 (0x0004 - 0x0000)
struct BBM_Subsystem_GetCurrentFakeFPS final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetCurrentFakeFPS) == 0x000004, "Wrong alignment on BBM_Subsystem_GetCurrentFakeFPS");
static_assert(sizeof(BBM_Subsystem_GetCurrentFakeFPS) == 0x000004, "Wrong size on BBM_Subsystem_GetCurrentFakeFPS");
static_assert(offsetof(BBM_Subsystem_GetCurrentFakeFPS, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetCurrentFakeFPS::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetCurrentWorld
// 0x0008 (0x0008 - 0x0000)
struct BBM_Subsystem_GetCurrentWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetCurrentWorld) == 0x000008, "Wrong alignment on BBM_Subsystem_GetCurrentWorld");
static_assert(sizeof(BBM_Subsystem_GetCurrentWorld) == 0x000008, "Wrong size on BBM_Subsystem_GetCurrentWorld");
static_assert(offsetof(BBM_Subsystem_GetCurrentWorld, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetCurrentWorld::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetGameThreadTime
// 0x0004 (0x0004 - 0x0000)
struct BBM_Subsystem_GetGameThreadTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetGameThreadTime) == 0x000004, "Wrong alignment on BBM_Subsystem_GetGameThreadTime");
static_assert(sizeof(BBM_Subsystem_GetGameThreadTime) == 0x000004, "Wrong size on BBM_Subsystem_GetGameThreadTime");
static_assert(offsetof(BBM_Subsystem_GetGameThreadTime, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetGameThreadTime::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetGPUTime
// 0x0004 (0x0004 - 0x0000)
struct BBM_Subsystem_GetGPUTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetGPUTime) == 0x000004, "Wrong alignment on BBM_Subsystem_GetGPUTime");
static_assert(sizeof(BBM_Subsystem_GetGPUTime) == 0x000004, "Wrong size on BBM_Subsystem_GetGPUTime");
static_assert(offsetof(BBM_Subsystem_GetGPUTime, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetGPUTime::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetOSVersion
// 0x0010 (0x0010 - 0x0000)
struct BBM_Subsystem_GetOSVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetOSVersion) == 0x000008, "Wrong alignment on BBM_Subsystem_GetOSVersion");
static_assert(sizeof(BBM_Subsystem_GetOSVersion) == 0x000010, "Wrong size on BBM_Subsystem_GetOSVersion");
static_assert(offsetof(BBM_Subsystem_GetOSVersion, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetOSVersion::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetRenderThreadTime
// 0x0004 (0x0004 - 0x0000)
struct BBM_Subsystem_GetRenderThreadTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetRenderThreadTime) == 0x000004, "Wrong alignment on BBM_Subsystem_GetRenderThreadTime");
static_assert(sizeof(BBM_Subsystem_GetRenderThreadTime) == 0x000004, "Wrong size on BBM_Subsystem_GetRenderThreadTime");
static_assert(offsetof(BBM_Subsystem_GetRenderThreadTime, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetRenderThreadTime::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetVideoMemory
// 0x0008 (0x0008 - 0x0000)
struct BBM_Subsystem_GetVideoMemory final
{
public:
	struct FVideoMemoryInfo                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetVideoMemory) == 0x000004, "Wrong alignment on BBM_Subsystem_GetVideoMemory");
static_assert(sizeof(BBM_Subsystem_GetVideoMemory) == 0x000008, "Wrong size on BBM_Subsystem_GetVideoMemory");
static_assert(offsetof(BBM_Subsystem_GetVideoMemory, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetVideoMemory::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BBM_Subsystem.GetRHIInfo
// 0x0010 (0x0010 - 0x0000)
struct BBM_Subsystem_GetRHIInfo final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBM_Subsystem_GetRHIInfo) == 0x000008, "Wrong alignment on BBM_Subsystem_GetRHIInfo");
static_assert(sizeof(BBM_Subsystem_GetRHIInfo) == 0x000010, "Wrong size on BBM_Subsystem_GetRHIInfo");
static_assert(offsetof(BBM_Subsystem_GetRHIInfo, ReturnValue) == 0x000000, "Member 'BBM_Subsystem_GetRHIInfo::ReturnValue' has a wrong offset!");

// Function BoundaryBenchmark.BoundaryBenchmarkProjectile.OnHit
// 0x00B0 (0x00B0 - 0x0000)
struct BoundaryBenchmarkProjectile_OnHit final
{
public:
	class UPrimitiveComponent*                    HitComp;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BoundaryBenchmarkProjectile_OnHit) == 0x000008, "Wrong alignment on BoundaryBenchmarkProjectile_OnHit");
static_assert(sizeof(BoundaryBenchmarkProjectile_OnHit) == 0x0000B0, "Wrong size on BoundaryBenchmarkProjectile_OnHit");
static_assert(offsetof(BoundaryBenchmarkProjectile_OnHit, HitComp) == 0x000000, "Member 'BoundaryBenchmarkProjectile_OnHit::HitComp' has a wrong offset!");
static_assert(offsetof(BoundaryBenchmarkProjectile_OnHit, OtherActor) == 0x000008, "Member 'BoundaryBenchmarkProjectile_OnHit::OtherActor' has a wrong offset!");
static_assert(offsetof(BoundaryBenchmarkProjectile_OnHit, OtherComp) == 0x000010, "Member 'BoundaryBenchmarkProjectile_OnHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BoundaryBenchmarkProjectile_OnHit, NormalImpulse) == 0x000018, "Member 'BoundaryBenchmarkProjectile_OnHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BoundaryBenchmarkProjectile_OnHit, Hit) == 0x000024, "Member 'BoundaryBenchmarkProjectile_OnHit::Hit' has a wrong offset!");

}

