#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CamereaModify_LowAirPerrsure

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CamereaModify_LowAirPerrsure.BP_CamereaModify_LowAirPerrsure_C.BlueprintModifyPostProcess
// 0x0B50 (0x0B50 - 0x0000)
struct BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0560)(Parm, OutParm)
	class APBCharacter_BP_C*                      CastedPBCharacter;                                 // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0xC];                                      // 0x0584(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0590(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Cos_ReturnValue;                          // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x05D0(0x0560)()
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0B30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0B38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0B39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3A[0x2];                                      // 0x0B3A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxAirPressure_ReturnValue;            // 0x0B3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAirPressure_ReturnValue;               // 0x0B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess");
static_assert(sizeof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess) == 0x000B50, "Wrong size on BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, PostProcessBlendWeight) == 0x000004, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::PostProcessBlendWeight' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, PostProcessSettings) == 0x000010, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::PostProcessSettings' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CastedPBCharacter) == 0x000570, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CastedPBCharacter' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_MapRangeClamped_ReturnValue) == 0x000578, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_FClamp_ReturnValue) == 0x00057C, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000580, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, K2Node_MakeStruct_Vector4) == 0x000590, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::K2Node_MakeStruct_Vector4' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x0005A0, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0005A4, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0005A8, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_Cos_ReturnValue) == 0x0005AC, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0005B0, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_GetOwningPlayerController_ReturnValue) == 0x0005B8, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_Add_FloatFloat_ReturnValue) == 0x0005C0, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_GetViewTarget_ReturnValue) == 0x0005C8, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, K2Node_MakeStruct_PostProcessSettings) == 0x0005D0, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000B30, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, K2Node_DynamicCast_bSuccess) == 0x000B38, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_IsValid_ReturnValue) == 0x000B39, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_GetMaxAirPressure_ReturnValue) == 0x000B3C, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_GetMaxAirPressure_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_GetAirPressure_ReturnValue) == 0x000B40, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_GetAirPressure_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000B44, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess, CallFunc_IsLocallyControlled_ReturnValue) == 0x000B48, "Member 'BP_CamereaModify_LowAirPerrsure_C_BlueprintModifyPostProcess::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

}

