#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraModifier_OverAirPressure

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraModifier_OverAirPressure.BP_CameraModifier_OverAirPressure_C
// 0x0018 (0x0060 - 0x0048)
class UBP_CameraModifier_OverAirPressure_C final : public UCameraModifier
{
public:
	struct FWeightedBlendables                    PostProcessMaterials;                              // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PrevFXDisplayStrength;                             // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultInterpSpeed;                                // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintModifyPostProcess(float DeltaTime, float* PostProcessBlendWeight, struct FPostProcessSettings* PostProcessSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CameraModifier_OverAirPressure_C">();
	}
	static class UBP_CameraModifier_OverAirPressure_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CameraModifier_OverAirPressure_C>();
	}
};
static_assert(alignof(UBP_CameraModifier_OverAirPressure_C) == 0x000008, "Wrong alignment on UBP_CameraModifier_OverAirPressure_C");
static_assert(sizeof(UBP_CameraModifier_OverAirPressure_C) == 0x000060, "Wrong size on UBP_CameraModifier_OverAirPressure_C");
static_assert(offsetof(UBP_CameraModifier_OverAirPressure_C, PostProcessMaterials) == 0x000048, "Member 'UBP_CameraModifier_OverAirPressure_C::PostProcessMaterials' has a wrong offset!");
static_assert(offsetof(UBP_CameraModifier_OverAirPressure_C, PrevFXDisplayStrength) == 0x000058, "Member 'UBP_CameraModifier_OverAirPressure_C::PrevFXDisplayStrength' has a wrong offset!");
static_assert(offsetof(UBP_CameraModifier_OverAirPressure_C, DefaultInterpSpeed) == 0x00005C, "Member 'UBP_CameraModifier_OverAirPressure_C::DefaultInterpSpeed' has a wrong offset!");

}

