#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CamereaModify_LowAirPerrsure

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CamereaModify_LowAirPerrsure.BP_CamereaModify_LowAirPerrsure_C
// 0x0578 (0x05C0 - 0x0048)
class UBP_CamereaModify_LowAirPerrsure_C final : public UCameraModifier
{
public:
	float                                         NewVar_0;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   NoVFXPost;                                         // 0x0050(0x0560)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         AirPresurepercent;                                 // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintModifyPostProcess(float DeltaTime, float* PostProcessBlendWeight, struct FPostProcessSettings* PostProcessSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CamereaModify_LowAirPerrsure_C">();
	}
	static class UBP_CamereaModify_LowAirPerrsure_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CamereaModify_LowAirPerrsure_C>();
	}
};
static_assert(alignof(UBP_CamereaModify_LowAirPerrsure_C) == 0x000010, "Wrong alignment on UBP_CamereaModify_LowAirPerrsure_C");
static_assert(sizeof(UBP_CamereaModify_LowAirPerrsure_C) == 0x0005C0, "Wrong size on UBP_CamereaModify_LowAirPerrsure_C");
static_assert(offsetof(UBP_CamereaModify_LowAirPerrsure_C, NewVar_0) == 0x000048, "Member 'UBP_CamereaModify_LowAirPerrsure_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UBP_CamereaModify_LowAirPerrsure_C, NoVFXPost) == 0x000050, "Member 'UBP_CamereaModify_LowAirPerrsure_C::NoVFXPost' has a wrong offset!");
static_assert(offsetof(UBP_CamereaModify_LowAirPerrsure_C, AirPresurepercent) == 0x0005B0, "Member 'UBP_CamereaModify_LowAirPerrsure_C::AirPresurepercent' has a wrong offset!");

}

