#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraActorDeath

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CameraActorDeath.BP_CameraActorDeath_C.ExecuteUbergraph_BP_CameraActorDeath
// 0x0008 (0x0008 - 0x0000)
struct BP_CameraActorDeath_C_ExecuteUbergraph_BP_CameraActorDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraActorDeath_C_ExecuteUbergraph_BP_CameraActorDeath) == 0x000004, "Wrong alignment on BP_CameraActorDeath_C_ExecuteUbergraph_BP_CameraActorDeath");
static_assert(sizeof(BP_CameraActorDeath_C_ExecuteUbergraph_BP_CameraActorDeath) == 0x000008, "Wrong size on BP_CameraActorDeath_C_ExecuteUbergraph_BP_CameraActorDeath");
static_assert(offsetof(BP_CameraActorDeath_C_ExecuteUbergraph_BP_CameraActorDeath, EntryPoint) == 0x000000, "Member 'BP_CameraActorDeath_C_ExecuteUbergraph_BP_CameraActorDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CameraActorDeath_C_ExecuteUbergraph_BP_CameraActorDeath, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_CameraActorDeath_C_ExecuteUbergraph_BP_CameraActorDeath::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_CameraActorDeath.BP_CameraActorDeath_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CameraActorDeath_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraActorDeath_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CameraActorDeath_C_ReceiveTick");
static_assert(sizeof(BP_CameraActorDeath_C_ReceiveTick) == 0x000004, "Wrong size on BP_CameraActorDeath_C_ReceiveTick");
static_assert(offsetof(BP_CameraActorDeath_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CameraActorDeath_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CameraActorDeath.BP_CameraActorDeath_C.FocusActor
// 0x0008 (0x0008 - 0x0000)
struct BP_CameraActorDeath_C_FocusActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraActorDeath_C_FocusActor) == 0x000008, "Wrong alignment on BP_CameraActorDeath_C_FocusActor");
static_assert(sizeof(BP_CameraActorDeath_C_FocusActor) == 0x000008, "Wrong size on BP_CameraActorDeath_C_FocusActor");
static_assert(offsetof(BP_CameraActorDeath_C_FocusActor, Actor) == 0x000000, "Member 'BP_CameraActorDeath_C_FocusActor::Actor' has a wrong offset!");

}

