#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraModifier_ScreenArmorBreak

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CameraModifier_ScreenArmorBreak.BP_CameraModifier_ScreenArmorBreak_C.BlueprintModifyPostProcess
// 0x0AE0 (0x0AE0 - 0x0000)
struct BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight_0;                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0560)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0580(0x0560)()
};
static_assert(alignof(BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess");
static_assert(sizeof(BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess) == 0x000AE0, "Wrong size on BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess");
static_assert(offsetof(BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess, PostProcessBlendWeight_0) == 0x000004, "Member 'BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess::PostProcessBlendWeight_0' has a wrong offset!");
static_assert(offsetof(BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess, PostProcessSettings) == 0x000010, "Member 'BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess::PostProcessSettings' has a wrong offset!");
static_assert(offsetof(BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess, Temp_bool_Variable) == 0x000570, "Member 'BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000574, "Member 'BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess, K2Node_Select_Default) == 0x000578, "Member 'BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess, K2Node_MakeStruct_PostProcessSettings) == 0x000580, "Member 'BP_CameraModifier_ScreenArmorBreak_C_BlueprintModifyPostProcess::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");

}

