#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GE_MS_Base

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GE_MS_Base.BP_GE_MS_Base_C
// 0x0028 (0x0248 - 0x0220)
class ABP_GE_MS_Base_C : public APBGameplayEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                ParticleEffects;                                   // 0x0230(0x0010)(Edit, BlueprintVisible)
	float                                         EffectScale;                                       // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GE_MS_Base(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GE_MS_Base_C">();
	}
	static class ABP_GE_MS_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GE_MS_Base_C>();
	}
};
static_assert(alignof(ABP_GE_MS_Base_C) == 0x000008, "Wrong alignment on ABP_GE_MS_Base_C");
static_assert(sizeof(ABP_GE_MS_Base_C) == 0x000248, "Wrong size on ABP_GE_MS_Base_C");
static_assert(offsetof(ABP_GE_MS_Base_C, UberGraphFrame) == 0x000220, "Member 'ABP_GE_MS_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GE_MS_Base_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_GE_MS_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GE_MS_Base_C, ParticleEffects) == 0x000230, "Member 'ABP_GE_MS_Base_C::ParticleEffects' has a wrong offset!");
static_assert(offsetof(ABP_GE_MS_Base_C, EffectScale) == 0x000240, "Member 'ABP_GE_MS_Base_C::EffectScale' has a wrong offset!");

}

