#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MicroMeteor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MicroMeteor.BP_MicroMeteor_C.ExecuteUbergraph_BP_MicroMeteor
// 0x0028 (0x0028 - 0x0000)
struct BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor) == 0x000008, "Wrong alignment on BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor");
static_assert(sizeof(BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor) == 0x000028, "Wrong size on BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor");
static_assert(offsetof(BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor, EntryPoint) == 0x000000, "Member 'BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor, K2Node_Event_EndPlayReason) == 0x000024, "Member 'BP_MicroMeteor_C_ExecuteUbergraph_BP_MicroMeteor::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_MicroMeteor.BP_MicroMeteor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_MicroMeteor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MicroMeteor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_MicroMeteor_C_ReceiveEndPlay");
static_assert(sizeof(BP_MicroMeteor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_MicroMeteor_C_ReceiveEndPlay");
static_assert(offsetof(BP_MicroMeteor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_MicroMeteor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_MicroMeteor.BP_MicroMeteor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MicroMeteor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MicroMeteor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_MicroMeteor_C_ReceiveTick");
static_assert(sizeof(BP_MicroMeteor_C_ReceiveTick) == 0x000004, "Wrong size on BP_MicroMeteor_C_ReceiveTick");
static_assert(offsetof(BP_MicroMeteor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_MicroMeteor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_MicroMeteor.BP_MicroMeteor_C.UpdateMicroMeteor
// 0x0050 (0x0050 - 0x0000)
struct BP_MicroMeteor_C_UpdateMicroMeteor final
{
public:
	class UPBWorldManagerV2*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOutboundPawn_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MicroMeteor_C_UpdateMicroMeteor) == 0x000008, "Wrong alignment on BP_MicroMeteor_C_UpdateMicroMeteor");
static_assert(sizeof(BP_MicroMeteor_C_UpdateMicroMeteor) == 0x000050, "Wrong size on BP_MicroMeteor_C_UpdateMicroMeteor");
static_assert(offsetof(BP_MicroMeteor_C_UpdateMicroMeteor, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BP_MicroMeteor_C_UpdateMicroMeteor::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_UpdateMicroMeteor, CallFunc_GetOutboundPawn_ReturnValue) == 0x000008, "Member 'BP_MicroMeteor_C_UpdateMicroMeteor::CallFunc_GetOutboundPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_UpdateMicroMeteor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_MicroMeteor_C_UpdateMicroMeteor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_UpdateMicroMeteor, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_MicroMeteor_C_UpdateMicroMeteor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_UpdateMicroMeteor, CallFunc_Cross_VectorVector_ReturnValue) == 0x000020, "Member 'BP_MicroMeteor_C_UpdateMicroMeteor::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_UpdateMicroMeteor, CallFunc_Normal_ReturnValue) == 0x00002C, "Member 'BP_MicroMeteor_C_UpdateMicroMeteor::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_UpdateMicroMeteor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'BP_MicroMeteor_C_UpdateMicroMeteor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_UpdateMicroMeteor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000044, "Member 'BP_MicroMeteor_C_UpdateMicroMeteor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_MicroMeteor.BP_MicroMeteor_C.PlayCameraShake
// 0x0060 (0x0060 - 0x0000)
struct BP_MicroMeteor_C_PlayCameraShake final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBWorldManagerV2*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOutboundPawn_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloat_ReturnValue_1;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInPlayerLifeStatus_ReturnValue;         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MicroMeteor_C_PlayCameraShake) == 0x000008, "Wrong alignment on BP_MicroMeteor_C_PlayCameraShake");
static_assert(sizeof(BP_MicroMeteor_C_PlayCameraShake) == 0x000060, "Wrong size on BP_MicroMeteor_C_PlayCameraShake");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, Temp_float_Variable) == 0x000000, "Member 'BP_MicroMeteor_C_PlayCameraShake::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_GetOutboundPawn_ReturnValue) == 0x000010, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_GetOutboundPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_RandomFloat_ReturnValue) == 0x000018, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_GetController_ReturnValue) == 0x000028, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000030, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, K2Node_DynamicCast_AsPlayer_Controller) == 0x000038, "Member 'BP_MicroMeteor_C_PlayCameraShake::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_MicroMeteor_C_PlayCameraShake::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_RandomFloat_ReturnValue_1) == 0x000044, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, K2Node_DynamicCast_AsPBPlayer_State) == 0x000050, "Member 'BP_MicroMeteor_C_PlayCameraShake::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_MicroMeteor_C_PlayCameraShake::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, CallFunc_IsInPlayerLifeStatus_ReturnValue) == 0x000059, "Member 'BP_MicroMeteor_C_PlayCameraShake::CallFunc_IsInPlayerLifeStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, Temp_bool_Variable) == 0x00005A, "Member 'BP_MicroMeteor_C_PlayCameraShake::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayCameraShake, K2Node_Select_Default) == 0x00005C, "Member 'BP_MicroMeteor_C_PlayCameraShake::K2Node_Select_Default' has a wrong offset!");

// Function BP_MicroMeteor.BP_MicroMeteor_C.PlayImpactSound
// 0x0018 (0x0018 - 0x0000)
struct BP_MicroMeteor_C_PlayImpactSound final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MicroMeteor_C_PlayImpactSound) == 0x000008, "Wrong alignment on BP_MicroMeteor_C_PlayImpactSound");
static_assert(sizeof(BP_MicroMeteor_C_PlayImpactSound) == 0x000018, "Wrong size on BP_MicroMeteor_C_PlayImpactSound");
static_assert(offsetof(BP_MicroMeteor_C_PlayImpactSound, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'BP_MicroMeteor_C_PlayImpactSound::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayImpactSound, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000008, "Member 'BP_MicroMeteor_C_PlayImpactSound::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayImpactSound, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_MicroMeteor_C_PlayImpactSound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MicroMeteor_C_PlayImpactSound, CallFunc_IsLocallyControlled_ReturnValue) == 0x000011, "Member 'BP_MicroMeteor_C_PlayImpactSound::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

}

