#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MicroMeteor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MicroMeteor.BP_MicroMeteor_C
// 0x0020 (0x0240 - 0x0220)
class ABP_MicroMeteor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           CameraShake;                                       // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   EventGroup;                                        // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MicroMeteor(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Camera_Shake_Event();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UpdateMicroMeteor();
	void PlayCameraShake();
	void PlayImpactSound();
	void StopImpactSound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MicroMeteor_C">();
	}
	static class ABP_MicroMeteor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MicroMeteor_C>();
	}
};
static_assert(alignof(ABP_MicroMeteor_C) == 0x000008, "Wrong alignment on ABP_MicroMeteor_C");
static_assert(sizeof(ABP_MicroMeteor_C) == 0x000240, "Wrong size on ABP_MicroMeteor_C");
static_assert(offsetof(ABP_MicroMeteor_C, UberGraphFrame) == 0x000220, "Member 'ABP_MicroMeteor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MicroMeteor_C, NiagaraSystem) == 0x000228, "Member 'ABP_MicroMeteor_C::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(ABP_MicroMeteor_C, CameraShake) == 0x000230, "Member 'ABP_MicroMeteor_C::CameraShake' has a wrong offset!");
static_assert(offsetof(ABP_MicroMeteor_C, EventGroup) == 0x000238, "Member 'ABP_MicroMeteor_C::EventGroup' has a wrong offset!");

}

