#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Option_AimMethodKeyboard

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Option_AimMethodKeyboard.BP_Option_AimMethodKeyboard_C.ExecuteUbergraph_BP_Option_AimMethodKeyboard
// 0x0008 (0x0008 - 0x0000)
struct BP_Option_AimMethodKeyboard_C_ExecuteUbergraph_BP_Option_AimMethodKeyboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Option_AimMethodKeyboard_C_ExecuteUbergraph_BP_Option_AimMethodKeyboard) == 0x000004, "Wrong alignment on BP_Option_AimMethodKeyboard_C_ExecuteUbergraph_BP_Option_AimMethodKeyboard");
static_assert(sizeof(BP_Option_AimMethodKeyboard_C_ExecuteUbergraph_BP_Option_AimMethodKeyboard) == 0x000008, "Wrong size on BP_Option_AimMethodKeyboard_C_ExecuteUbergraph_BP_Option_AimMethodKeyboard");
static_assert(offsetof(BP_Option_AimMethodKeyboard_C_ExecuteUbergraph_BP_Option_AimMethodKeyboard, EntryPoint) == 0x000000, "Member 'BP_Option_AimMethodKeyboard_C_ExecuteUbergraph_BP_Option_AimMethodKeyboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Option_AimMethodKeyboard_C_ExecuteUbergraph_BP_Option_AimMethodKeyboard, K2Node_Event_bIsDependencyChanged) == 0x000004, "Member 'BP_Option_AimMethodKeyboard_C_ExecuteUbergraph_BP_Option_AimMethodKeyboard::K2Node_Event_bIsDependencyChanged' has a wrong offset!");

// Function BP_Option_AimMethodKeyboard.BP_Option_AimMethodKeyboard_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct BP_Option_AimMethodKeyboard_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Option_AimMethodKeyboard_C_K2_Modify) == 0x000001, "Wrong alignment on BP_Option_AimMethodKeyboard_C_K2_Modify");
static_assert(sizeof(BP_Option_AimMethodKeyboard_C_K2_Modify) == 0x000001, "Wrong size on BP_Option_AimMethodKeyboard_C_K2_Modify");
static_assert(offsetof(BP_Option_AimMethodKeyboard_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'BP_Option_AimMethodKeyboard_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

}

