#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Option_FloatConfigurableOption

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Option_FloatConfigurableOption.BP_Option_FloatConfigurableOption_C.ModifyConfigurability
// 0x0001 (0x0001 - 0x0000)
struct BP_Option_FloatConfigurableOption_C_ModifyConfigurability final
{
public:
	bool                                          CallFunc_ShouldBeConfigurable_IsConfigurable;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Option_FloatConfigurableOption_C_ModifyConfigurability) == 0x000001, "Wrong alignment on BP_Option_FloatConfigurableOption_C_ModifyConfigurability");
static_assert(sizeof(BP_Option_FloatConfigurableOption_C_ModifyConfigurability) == 0x000001, "Wrong size on BP_Option_FloatConfigurableOption_C_ModifyConfigurability");
static_assert(offsetof(BP_Option_FloatConfigurableOption_C_ModifyConfigurability, CallFunc_ShouldBeConfigurable_IsConfigurable) == 0x000000, "Member 'BP_Option_FloatConfigurableOption_C_ModifyConfigurability::CallFunc_ShouldBeConfigurable_IsConfigurable' has a wrong offset!");

// Function BP_Option_FloatConfigurableOption.BP_Option_FloatConfigurableOption_C.ShouldBeConfigurable
// 0x0001 (0x0001 - 0x0000)
struct BP_Option_FloatConfigurableOption_C_ShouldBeConfigurable final
{
public:
	bool                                          IsConfigurable;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Option_FloatConfigurableOption_C_ShouldBeConfigurable) == 0x000001, "Wrong alignment on BP_Option_FloatConfigurableOption_C_ShouldBeConfigurable");
static_assert(sizeof(BP_Option_FloatConfigurableOption_C_ShouldBeConfigurable) == 0x000001, "Wrong size on BP_Option_FloatConfigurableOption_C_ShouldBeConfigurable");
static_assert(offsetof(BP_Option_FloatConfigurableOption_C_ShouldBeConfigurable, IsConfigurable) == 0x000000, "Member 'BP_Option_FloatConfigurableOption_C_ShouldBeConfigurable::IsConfigurable' has a wrong offset!");

}

