#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Option_PostProcessing

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Option_PostProcessing.BP_Option_PostProcessing_C.ExecuteUbergraph_BP_Option_PostProcessing
// 0x0028 (0x0028 - 0x0000)
struct BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSettingOption*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing) == 0x000008, "Wrong alignment on BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing");
static_assert(sizeof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing) == 0x000028, "Wrong size on BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing");
static_assert(offsetof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing, EntryPoint) == 0x000000, "Member 'BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing, K2Node_Event_bIsDependencyChanged) == 0x000020, "Member 'BP_Option_PostProcessing_C_ExecuteUbergraph_BP_Option_PostProcessing::K2Node_Event_bIsDependencyChanged' has a wrong offset!");

// Function BP_Option_PostProcessing.BP_Option_PostProcessing_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct BP_Option_PostProcessing_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Option_PostProcessing_C_K2_Modify) == 0x000001, "Wrong alignment on BP_Option_PostProcessing_C_K2_Modify");
static_assert(sizeof(BP_Option_PostProcessing_C_K2_Modify) == 0x000001, "Wrong size on BP_Option_PostProcessing_C_K2_Modify");
static_assert(offsetof(BP_Option_PostProcessing_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'BP_Option_PostProcessing_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

}

