#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Option_EnumSettingBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Option_EnumSettingBase.BP_Option_EnumSettingBase_C.ModifyViaDependencies
// 0x0048 (0x0048 - 0x0000)
struct BP_Option_EnumSettingBase_C_ModifyViaDependencies final
{
public:
	bool                                          IsDependencyChanged;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSettingOption*                       TempParent;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSettingOption*                       CallFunc_GetRootParent_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSettingOption*                       CallFunc_GetRootParent_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetGraphicsOptionConfigValue_Value;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSettingOption*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Option_EnumSettingBase_C_ModifyViaDependencies) == 0x000008, "Wrong alignment on BP_Option_EnumSettingBase_C_ModifyViaDependencies");
static_assert(sizeof(BP_Option_EnumSettingBase_C_ModifyViaDependencies) == 0x000048, "Wrong size on BP_Option_EnumSettingBase_C_ModifyViaDependencies");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, IsDependencyChanged) == 0x000000, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::IsDependencyChanged' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, TempParent) == 0x000008, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::TempParent' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, CallFunc_GetRootParent_ReturnValue) == 0x000018, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::CallFunc_GetRootParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, CallFunc_GetRootParent_ReturnValue_1) == 0x000020, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::CallFunc_GetRootParent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, CallFunc_GetGraphicsOptionConfigValue_Value) == 0x000028, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::CallFunc_GetGraphicsOptionConfigValue_Value' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_ModifyViaDependencies, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_Option_EnumSettingBase_C_ModifyViaDependencies::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Option_EnumSettingBase.BP_Option_EnumSettingBase_C.GetGraphicsOptionConfigValue
// 0x0020 (0x0020 - 0x0000)
struct BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue final
{
public:
	class FName                                   OptionName_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Value_0;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectBoundaryUserSettings*           CallFunc_GetProjectBoundaryUserSettings_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumUserSetting_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumGraphicsOptionConfigValue_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue) == 0x000008, "Wrong alignment on BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue");
static_assert(sizeof(BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue) == 0x000020, "Wrong size on BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue");
static_assert(offsetof(BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue, OptionName_0) == 0x000000, "Member 'BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue::OptionName_0' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue, Value_0) == 0x000008, "Member 'BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue::Value_0' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue, CallFunc_GetProjectBoundaryUserSettings_ReturnValue) == 0x000010, "Member 'BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue::CallFunc_GetProjectBoundaryUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue, CallFunc_GetEnumUserSetting_ReturnValue) == 0x000018, "Member 'BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue::CallFunc_GetEnumUserSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue, CallFunc_GetEnumGraphicsOptionConfigValue_ReturnValue) == 0x000019, "Member 'BP_Option_EnumSettingBase_C_GetGraphicsOptionConfigValue::CallFunc_GetEnumGraphicsOptionConfigValue_ReturnValue' has a wrong offset!");

}

