#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBGrenadeLauncher_MADNESS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBLauncher_Deploy_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PBGrenadeLauncher_MADNESS.BP_PBGrenadeLauncher_MADNESS_C
// 0x0020 (0x06B8 - 0x0698)
class ABP_PBGrenadeLauncher_MADNESS_C final : public APBLauncher_Deploy_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PBGrenadeLauncher_MADNESS_C;     // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBFireComponent_Projectile*            PBFireComponent_Projectile;                        // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FireMuzzle_VFX;                                    // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Fire;                                              // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PBGrenadeLauncher_MADNESS(int32 EntryPoint);
	void K2_SimuilateFire();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PBGrenadeLauncher_MADNESS_C">();
	}
	static class ABP_PBGrenadeLauncher_MADNESS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PBGrenadeLauncher_MADNESS_C>();
	}
};
static_assert(alignof(ABP_PBGrenadeLauncher_MADNESS_C) == 0x000008, "Wrong alignment on ABP_PBGrenadeLauncher_MADNESS_C");
static_assert(sizeof(ABP_PBGrenadeLauncher_MADNESS_C) == 0x0006B8, "Wrong size on ABP_PBGrenadeLauncher_MADNESS_C");
static_assert(offsetof(ABP_PBGrenadeLauncher_MADNESS_C, UberGraphFrame_BP_PBGrenadeLauncher_MADNESS_C) == 0x000698, "Member 'ABP_PBGrenadeLauncher_MADNESS_C::UberGraphFrame_BP_PBGrenadeLauncher_MADNESS_C' has a wrong offset!");
static_assert(offsetof(ABP_PBGrenadeLauncher_MADNESS_C, PBFireComponent_Projectile) == 0x0006A0, "Member 'ABP_PBGrenadeLauncher_MADNESS_C::PBFireComponent_Projectile' has a wrong offset!");
static_assert(offsetof(ABP_PBGrenadeLauncher_MADNESS_C, FireMuzzle_VFX) == 0x0006A8, "Member 'ABP_PBGrenadeLauncher_MADNESS_C::FireMuzzle_VFX' has a wrong offset!");
static_assert(offsetof(ABP_PBGrenadeLauncher_MADNESS_C, Fire) == 0x0006B0, "Member 'ABP_PBGrenadeLauncher_MADNESS_C::Fire' has a wrong offset!");

}

