#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBSmokeGrenadeVolume

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PBSmokeGrenadeVolume.BP_PBSmokeGrenadeVolume_C
// 0x0068 (0x02E8 - 0x0280)
class ABP_PBSmokeGrenadeVolume_C final : public APBSmokeObscuringVolume
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Particle_Ribbon;                                   // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       SphereCollison;                                    // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTimeline_Density_3C60275A42CEB9F40BA55A9E79C7B6EE; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeTimeline__Direction_3C60275A42CEB9F40BA55A9E79C7B6EE; // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeTimeline;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShowTimeline_Density_E690066E42EB46CD716856B4B9E7609A; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ShowTimeline__Direction_E690066E42EB46CD716856B4B9E7609A; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ShowTimeline;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotateTimeline_NewTrack_0_63405C3E48F468E7933E349C070BE4F7; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RotateTimeline__Direction_63405C3E48F468E7933E349C070BE4F7; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RotateTimeline;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotateSpeed;                                       // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDensity;                                        // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Smoke;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayDuration;                                      // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PBSmokeGrenadeVolume(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ShowTimeline__UpdateFunc();
	void ShowTimeline__FinishedFunc();
	void FadeTimeline__UpdateFunc();
	void FadeTimeline__FinishedFunc();
	void RotateTimeline__UpdateFunc();
	void RotateTimeline__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PBSmokeGrenadeVolume_C">();
	}
	static class ABP_PBSmokeGrenadeVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PBSmokeGrenadeVolume_C>();
	}
};
static_assert(alignof(ABP_PBSmokeGrenadeVolume_C) == 0x000008, "Wrong alignment on ABP_PBSmokeGrenadeVolume_C");
static_assert(sizeof(ABP_PBSmokeGrenadeVolume_C) == 0x0002E8, "Wrong size on ABP_PBSmokeGrenadeVolume_C");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, UberGraphFrame) == 0x000280, "Member 'ABP_PBSmokeGrenadeVolume_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, Particle_Ribbon) == 0x000288, "Member 'ABP_PBSmokeGrenadeVolume_C::Particle_Ribbon' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, SphereCollison) == 0x000290, "Member 'ABP_PBSmokeGrenadeVolume_C::SphereCollison' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, Sphere) == 0x000298, "Member 'ABP_PBSmokeGrenadeVolume_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, FadeTimeline_Density_3C60275A42CEB9F40BA55A9E79C7B6EE) == 0x0002A0, "Member 'ABP_PBSmokeGrenadeVolume_C::FadeTimeline_Density_3C60275A42CEB9F40BA55A9E79C7B6EE' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, FadeTimeline__Direction_3C60275A42CEB9F40BA55A9E79C7B6EE) == 0x0002A4, "Member 'ABP_PBSmokeGrenadeVolume_C::FadeTimeline__Direction_3C60275A42CEB9F40BA55A9E79C7B6EE' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, FadeTimeline) == 0x0002A8, "Member 'ABP_PBSmokeGrenadeVolume_C::FadeTimeline' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, ShowTimeline_Density_E690066E42EB46CD716856B4B9E7609A) == 0x0002B0, "Member 'ABP_PBSmokeGrenadeVolume_C::ShowTimeline_Density_E690066E42EB46CD716856B4B9E7609A' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, ShowTimeline__Direction_E690066E42EB46CD716856B4B9E7609A) == 0x0002B4, "Member 'ABP_PBSmokeGrenadeVolume_C::ShowTimeline__Direction_E690066E42EB46CD716856B4B9E7609A' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, ShowTimeline) == 0x0002B8, "Member 'ABP_PBSmokeGrenadeVolume_C::ShowTimeline' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, RotateTimeline_NewTrack_0_63405C3E48F468E7933E349C070BE4F7) == 0x0002C0, "Member 'ABP_PBSmokeGrenadeVolume_C::RotateTimeline_NewTrack_0_63405C3E48F468E7933E349C070BE4F7' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, RotateTimeline__Direction_63405C3E48F468E7933E349C070BE4F7) == 0x0002C4, "Member 'ABP_PBSmokeGrenadeVolume_C::RotateTimeline__Direction_63405C3E48F468E7933E349C070BE4F7' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, RotateTimeline) == 0x0002C8, "Member 'ABP_PBSmokeGrenadeVolume_C::RotateTimeline' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, RotateSpeed) == 0x0002D0, "Member 'ABP_PBSmokeGrenadeVolume_C::RotateSpeed' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, MaxDensity) == 0x0002D4, "Member 'ABP_PBSmokeGrenadeVolume_C::MaxDensity' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, MID_Smoke) == 0x0002D8, "Member 'ABP_PBSmokeGrenadeVolume_C::MID_Smoke' has a wrong offset!");
static_assert(offsetof(ABP_PBSmokeGrenadeVolume_C, PlayDuration) == 0x0002E0, "Member 'ABP_PBSmokeGrenadeVolume_C::PlayDuration' has a wrong offset!");

}

