#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBDisplayCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PBDisplayCharacter.BP_PBDisplayCharacter_C.ExecuteUbergraph_BP_PBDisplayCharacter
// 0x0074 (0x0074 - 0x0000)
struct BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_5;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_6;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_7;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_8;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter) == 0x000004, "Wrong alignment on BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter");
static_assert(sizeof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter) == 0x000074, "Wrong size on BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, EntryPoint) == 0x000000, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000004, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000005, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x000006, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_GetSocketLocation_ReturnValue) == 0x000008, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000014, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000020, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_GetSocketLocation_ReturnValue_3) == 0x00002C, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_GetSocketLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_GetSocketLocation_ReturnValue_4) == 0x000038, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_GetSocketLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_GetSocketLocation_ReturnValue_5) == 0x000044, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_GetSocketLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_GetSocketLocation_ReturnValue_6) == 0x000050, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_GetSocketLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_GetSocketLocation_ReturnValue_7) == 0x00005C, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_GetSocketLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter, CallFunc_GetSocketLocation_ReturnValue_8) == 0x000068, "Member 'BP_PBDisplayCharacter_C_ExecuteUbergraph_BP_PBDisplayCharacter::CallFunc_GetSocketLocation_ReturnValue_8' has a wrong offset!");

}

