#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBDisplayWeapon

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PBDisplayWeapon.BP_PBDisplayWeapon_C
// 0x0060 (0x0470 - 0x0410)
class ABP_PBDisplayWeapon_C final : public APBDisplayWeapon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   RT;                                                // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   RL;                                                // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   RR;                                                // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   RU;                                                // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        R;                                                 // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   FT;                                                // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   FU;                                                // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   FL;                                                // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   FR;                                                // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        F;                                                 // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        LightBase;                                         // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PBDisplayWeapon(int32 EntryPoint);
	void K2_OnUnFocus();
	void K2_OnFocus();
	void ReceiveBeginPlay();
	void AttachWeaponPart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PBDisplayWeapon_C">();
	}
	static class ABP_PBDisplayWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PBDisplayWeapon_C>();
	}
};
static_assert(alignof(ABP_PBDisplayWeapon_C) == 0x000008, "Wrong alignment on ABP_PBDisplayWeapon_C");
static_assert(sizeof(ABP_PBDisplayWeapon_C) == 0x000470, "Wrong size on ABP_PBDisplayWeapon_C");
static_assert(offsetof(ABP_PBDisplayWeapon_C, UberGraphFrame) == 0x000410, "Member 'ABP_PBDisplayWeapon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, RT) == 0x000418, "Member 'ABP_PBDisplayWeapon_C::RT' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, RL) == 0x000420, "Member 'ABP_PBDisplayWeapon_C::RL' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, RR) == 0x000428, "Member 'ABP_PBDisplayWeapon_C::RR' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, RU) == 0x000430, "Member 'ABP_PBDisplayWeapon_C::RU' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, R) == 0x000438, "Member 'ABP_PBDisplayWeapon_C::R' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, FT) == 0x000440, "Member 'ABP_PBDisplayWeapon_C::FT' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, FU) == 0x000448, "Member 'ABP_PBDisplayWeapon_C::FU' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, FL) == 0x000450, "Member 'ABP_PBDisplayWeapon_C::FL' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, FR) == 0x000458, "Member 'ABP_PBDisplayWeapon_C::FR' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, F) == 0x000460, "Member 'ABP_PBDisplayWeapon_C::F' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayWeapon_C, LightBase) == 0x000468, "Member 'ABP_PBDisplayWeapon_C::LightBase' has a wrong offset!");

}

