#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBDisplayPod

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PBDisplayPod.BP_PBDisplayPod_C
// 0x0060 (0x03C0 - 0x0360)
class ABP_PBDisplayPod_C final : public APBDisplayPod
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   RT;                                                // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   RL;                                                // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   RR;                                                // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   RU;                                                // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        R;                                                 // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   FT;                                                // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   FL;                                                // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   FR;                                                // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   FU;                                                // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        F;                                                 // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        LightBase;                                         // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PBDisplayPod(int32 EntryPoint);
	void K2_OnUnFocus();
	void K2_OnFocus();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PBDisplayPod_C">();
	}
	static class ABP_PBDisplayPod_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PBDisplayPod_C>();
	}
};
static_assert(alignof(ABP_PBDisplayPod_C) == 0x000008, "Wrong alignment on ABP_PBDisplayPod_C");
static_assert(sizeof(ABP_PBDisplayPod_C) == 0x0003C0, "Wrong size on ABP_PBDisplayPod_C");
static_assert(offsetof(ABP_PBDisplayPod_C, UberGraphFrame) == 0x000360, "Member 'ABP_PBDisplayPod_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, RT) == 0x000368, "Member 'ABP_PBDisplayPod_C::RT' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, RL) == 0x000370, "Member 'ABP_PBDisplayPod_C::RL' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, RR) == 0x000378, "Member 'ABP_PBDisplayPod_C::RR' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, RU) == 0x000380, "Member 'ABP_PBDisplayPod_C::RU' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, R) == 0x000388, "Member 'ABP_PBDisplayPod_C::R' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, FT) == 0x000390, "Member 'ABP_PBDisplayPod_C::FT' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, FL) == 0x000398, "Member 'ABP_PBDisplayPod_C::FL' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, FR) == 0x0003A0, "Member 'ABP_PBDisplayPod_C::FR' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, FU) == 0x0003A8, "Member 'ABP_PBDisplayPod_C::FU' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, F) == 0x0003B0, "Member 'ABP_PBDisplayPod_C::F' has a wrong offset!");
static_assert(offsetof(ABP_PBDisplayPod_C, LightBase) == 0x0003B8, "Member 'ABP_PBDisplayPod_C::LightBase' has a wrong offset!");

}

