#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBSmokeGrenadeVolume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PBSmokeGrenadeVolume.BP_PBSmokeGrenadeVolume_C.ExecuteUbergraph_BP_PBSmokeGrenadeVolume
// 0x0148 (0x0148 - 0x0000)
struct BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ADirectionalLight*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x00B0(0x0010)(ReferenceParm)
	class ADirectionalLight*                      CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume) == 0x000008, "Wrong alignment on BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume");
static_assert(sizeof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume) == 0x000148, "Wrong size on BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, EntryPoint) == 0x000000, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_GetMaterial_ReturnValue) == 0x000018, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000020, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000A8, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000B0, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_GetForwardVector_ReturnValue) == 0x0000CC, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D8, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000DC, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000E8, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000EC, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_BooleanOR_ReturnValue) == 0x0000FC, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Add_FloatFloat_ReturnValue) == 0x000100, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000104, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000108, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_MakeVector_ReturnValue) == 0x00010C, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000118, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_MakeVector_ReturnValue_1) == 0x00011C, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000128, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00012C, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, Temp_int_Loop_Counter_Variable) == 0x000130, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Less_IntInt_ReturnValue) == 0x000134, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00013C, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000140, "Member 'BP_PBSmokeGrenadeVolume_C_ExecuteUbergraph_BP_PBSmokeGrenadeVolume::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");

}

