#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBMiniGunWithShieldLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PBMiniGunWithShieldLauncher.BP_PBMiniGunWithShieldLauncher_C.ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher
// 0x0038 (0x0038 - 0x0000)
struct BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UPBNormalDamageType*              K2Node_DynamicCast_AsPBNormal_Damage_Type;         // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher) == 0x000008, "Wrong alignment on BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher");
static_assert(sizeof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher) == 0x000038, "Wrong size on BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher, EntryPoint) == 0x000000, "Member 'BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher, K2Node_Event_Damage) == 0x000004, "Member 'BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher, K2Node_Event_DamageType) == 0x000008, "Member 'BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher, K2Node_Event_InstigatedBy) == 0x000010, "Member 'BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher, K2Node_Event_DamageCauser) == 0x000018, "Member 'BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher, K2Node_DynamicCast_AsPBNormal_Damage_Type) == 0x000020, "Member 'BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher::K2Node_DynamicCast_AsPBNormal_Damage_Type' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'BP_PBMiniGunWithShieldLauncher_C_ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function BP_PBMiniGunWithShieldLauncher.BP_PBMiniGunWithShieldLauncher_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage");
static_assert(sizeof(BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage) == 0x000020, "Wrong size on BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'BP_PBMiniGunWithShieldLauncher_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function BP_PBMiniGunWithShieldLauncher.BP_PBMiniGunWithShieldLauncher_C.DeployShield
// 0x0018 (0x0018 - 0x0000)
struct BP_PBMiniGunWithShieldLauncher_C_DeployShield final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShieldModel_Skeleton_AnimBlueprint_C*  K2Node_DynamicCast_AsShield_Model_Skeleton_Anim_Blueprint; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PBMiniGunWithShieldLauncher_C_DeployShield) == 0x000008, "Wrong alignment on BP_PBMiniGunWithShieldLauncher_C_DeployShield");
static_assert(sizeof(BP_PBMiniGunWithShieldLauncher_C_DeployShield) == 0x000018, "Wrong size on BP_PBMiniGunWithShieldLauncher_C_DeployShield");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_DeployShield, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'BP_PBMiniGunWithShieldLauncher_C_DeployShield::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_DeployShield, K2Node_DynamicCast_AsShield_Model_Skeleton_Anim_Blueprint) == 0x000008, "Member 'BP_PBMiniGunWithShieldLauncher_C_DeployShield::K2Node_DynamicCast_AsShield_Model_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_DeployShield, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_PBMiniGunWithShieldLauncher_C_DeployShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_PBMiniGunWithShieldLauncher.BP_PBMiniGunWithShieldLauncher_C.UndeployShield
// 0x0018 (0x0018 - 0x0000)
struct BP_PBMiniGunWithShieldLauncher_C_UndeployShield final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShieldModel_Skeleton_AnimBlueprint_C*  K2Node_DynamicCast_AsShield_Model_Skeleton_Anim_Blueprint; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PBMiniGunWithShieldLauncher_C_UndeployShield) == 0x000008, "Wrong alignment on BP_PBMiniGunWithShieldLauncher_C_UndeployShield");
static_assert(sizeof(BP_PBMiniGunWithShieldLauncher_C_UndeployShield) == 0x000018, "Wrong size on BP_PBMiniGunWithShieldLauncher_C_UndeployShield");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_UndeployShield, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'BP_PBMiniGunWithShieldLauncher_C_UndeployShield::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_UndeployShield, K2Node_DynamicCast_AsShield_Model_Skeleton_Anim_Blueprint) == 0x000008, "Member 'BP_PBMiniGunWithShieldLauncher_C_UndeployShield::K2Node_DynamicCast_AsShield_Model_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_UndeployShield, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_PBMiniGunWithShieldLauncher_C_UndeployShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_PBMiniGunWithShieldLauncher.BP_PBMiniGunWithShieldLauncher_C.InstallShield
// 0x00A8 (0x00A8 - 0x0000)
struct BP_PBMiniGunWithShieldLauncher_C_InstallShield final
{
public:
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x001C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PBMiniGunWithShieldLauncher_C_InstallShield) == 0x000008, "Wrong alignment on BP_PBMiniGunWithShieldLauncher_C_InstallShield");
static_assert(sizeof(BP_PBMiniGunWithShieldLauncher_C_InstallShield) == 0x0000A8, "Wrong size on BP_PBMiniGunWithShieldLauncher_C_InstallShield");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_InstallShield, CallFunc_GetOwnerPawn_ReturnValue) == 0x000000, "Member 'BP_PBMiniGunWithShieldLauncher_C_InstallShield::CallFunc_GetOwnerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_InstallShield, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_PBMiniGunWithShieldLauncher_C_InstallShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_InstallShield, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'BP_PBMiniGunWithShieldLauncher_C_InstallShield::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_InstallShield, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PBMiniGunWithShieldLauncher_C_InstallShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_InstallShield, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x00001C, "Member 'BP_PBMiniGunWithShieldLauncher_C_InstallShield::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_InstallShield, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000A4, "Member 'BP_PBMiniGunWithShieldLauncher_C_InstallShield::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_PBMiniGunWithShieldLauncher.BP_PBMiniGunWithShieldLauncher_C.OnRep_ShieldHealth
// 0x0003 (0x0003 - 0x0000)
struct BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReady_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth) == 0x000001, "Wrong alignment on BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth");
static_assert(sizeof(BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth) == 0x000003, "Wrong size on BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth, CallFunc_IsReady_ReturnValue) == 0x000001, "Member 'BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth::CallFunc_IsReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000002, "Member 'BP_PBMiniGunWithShieldLauncher_C_OnRep_ShieldHealth::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

