#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBCamModifyMedicine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PBCamModifyMedicine.BP_PBCamModifyMedicine_C
// 0x0020 (0x0068 - 0x0048)
class UBP_PBCamModifyMedicine_C final : public UCameraModifier
{
public:
	struct FWeightedBlendables                    PostProcessMaterials;                              // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Cache;                                             // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target;                                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintModifyPostProcess(float DeltaTime, float* PostProcessBlendWeight, struct FPostProcessSettings* PostProcessSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PBCamModifyMedicine_C">();
	}
	static class UBP_PBCamModifyMedicine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PBCamModifyMedicine_C>();
	}
};
static_assert(alignof(UBP_PBCamModifyMedicine_C) == 0x000008, "Wrong alignment on UBP_PBCamModifyMedicine_C");
static_assert(sizeof(UBP_PBCamModifyMedicine_C) == 0x000068, "Wrong size on UBP_PBCamModifyMedicine_C");
static_assert(offsetof(UBP_PBCamModifyMedicine_C, PostProcessMaterials) == 0x000048, "Member 'UBP_PBCamModifyMedicine_C::PostProcessMaterials' has a wrong offset!");
static_assert(offsetof(UBP_PBCamModifyMedicine_C, Cache) == 0x000058, "Member 'UBP_PBCamModifyMedicine_C::Cache' has a wrong offset!");
static_assert(offsetof(UBP_PBCamModifyMedicine_C, Duration) == 0x00005C, "Member 'UBP_PBCamModifyMedicine_C::Duration' has a wrong offset!");
static_assert(offsetof(UBP_PBCamModifyMedicine_C, Target) == 0x000060, "Member 'UBP_PBCamModifyMedicine_C::Target' has a wrong offset!");

}

