#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBSpectatorCameraComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PBSpectatorCameraComponent.BP_PBSpectatorCameraComponent_C.ExecuteUbergraph_BP_PBSpectatorCameraComponent
// 0x0048 (0x0048 - 0x0000)
struct BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUD_Observe_C*                         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent) == 0x000008, "Wrong alignment on BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent");
static_assert(sizeof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent) == 0x000048, "Wrong size on BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, EntryPoint) == 0x000000, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, CallFunc_IsValid_ReturnValue_2) == 0x000012, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, CallFunc_IsValid_ReturnValue_3) == 0x000013, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, K2Node_DynamicCast_AsPBCharacter) == 0x000020, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::K2Node_DynamicCast_AsPBCharacter' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000029, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, K2Node_Event_EndPlayReason) == 0x00002A, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000030, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000038, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_PBSpectatorCameraComponent_C_ExecuteUbergraph_BP_PBSpectatorCameraComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_PBSpectatorCameraComponent.BP_PBSpectatorCameraComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PBSpectatorCameraComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PBSpectatorCameraComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PBSpectatorCameraComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PBSpectatorCameraComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PBSpectatorCameraComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PBSpectatorCameraComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PBSpectatorCameraComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

