#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBMiniGunWithShieldLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "APBMiniGunLauncher_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PBMiniGunWithShieldLauncher.BP_PBMiniGunWithShieldLauncher_C
// 0x0018 (0x0718 - 0x0700)
class ABP_PBMiniGunWithShieldLauncher_C final : public AAPBMiniGunLauncher_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PBMiniGunWithShieldLauncher_C;   // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Shield;                                            // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ShieldHealth;                                      // 0x0710(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PBMiniGunWithShieldLauncher(int32 EntryPoint);
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void K2_Standby();
	void K2_OnEquip();
	void K2_Undeploying();
	void K2_Deploying();
	void DeployShield();
	void UndeployShield();
	void InstallShield();
	void OnRep_ShieldHealth();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PBMiniGunWithShieldLauncher_C">();
	}
	static class ABP_PBMiniGunWithShieldLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PBMiniGunWithShieldLauncher_C>();
	}
};
static_assert(alignof(ABP_PBMiniGunWithShieldLauncher_C) == 0x000008, "Wrong alignment on ABP_PBMiniGunWithShieldLauncher_C");
static_assert(sizeof(ABP_PBMiniGunWithShieldLauncher_C) == 0x000718, "Wrong size on ABP_PBMiniGunWithShieldLauncher_C");
static_assert(offsetof(ABP_PBMiniGunWithShieldLauncher_C, UberGraphFrame_BP_PBMiniGunWithShieldLauncher_C) == 0x000700, "Member 'ABP_PBMiniGunWithShieldLauncher_C::UberGraphFrame_BP_PBMiniGunWithShieldLauncher_C' has a wrong offset!");
static_assert(offsetof(ABP_PBMiniGunWithShieldLauncher_C, Shield) == 0x000708, "Member 'ABP_PBMiniGunWithShieldLauncher_C::Shield' has a wrong offset!");
static_assert(offsetof(ABP_PBMiniGunWithShieldLauncher_C, ShieldHealth) == 0x000710, "Member 'ABP_PBMiniGunWithShieldLauncher_C::ShieldHealth' has a wrong offset!");

}

