#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBDisplayWeaponPart

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PBDisplayWeaponPart.BP_PBDisplayWeaponPart_C.ExecuteUbergraph_BP_PBDisplayWeaponPart
// 0x0020 (0x0020 - 0x0000)
struct BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_DisplayActor_C*                    K2Node_DynamicCast_AsUMG_Display_Actor;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart) == 0x000008, "Wrong alignment on BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart");
static_assert(sizeof(BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart) == 0x000020, "Wrong size on BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart");
static_assert(offsetof(BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart, EntryPoint) == 0x000000, "Member 'BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart, K2Node_DynamicCast_AsUMG_Display_Actor) == 0x000010, "Member 'BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart::K2Node_DynamicCast_AsUMG_Display_Actor' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'BP_PBDisplayWeaponPart_C_ExecuteUbergraph_BP_PBDisplayWeaponPart::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

