#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBSMShowRoomInstance

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass BP_PBSMShowRoomInstance.BP_PBSMShowRoomInstance_C
// 0x6088 (0x6720 - 0x0698)
class UBP_PBSMShowRoomInstance_C final : public UPBSMShowRoomInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_BD1DEA064D9D161F1ECF4582B9D3206D_C997958B411A5198A5C8C0BED857B33C; // 0x06A0(0x01F8)()
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_6FC4C283418D59F51DF811A86FC6A7F9_13EA16974D49A7AA7C2F24B3DC473BBB; // 0x0898(0x01F8)()
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_236411D64C9451EC961906A3A414280F_D7BCBF264F0D7684EFF698B268D8BF11; // 0x0A90(0x01F8)()
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_6269C57C411649AF376351BA254286FE_BCF8B92A489F42AE2F44408939D6C239; // 0x0C88(0x01F8)()
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_AC61DAD241841F010DB86FA082D30B3D_AEDCE082446C9051DA128FAC9ACE53EA; // 0x0E80(0x01F8)()
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_9E7E14374C3DBF754DE35AB4EE61D0E9_FE0338A84F483DE685BE38AE767C64E7; // 0x1078(0x01F8)()
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_2163AE08490D561847C9CB96CDAB0157_4BDE033F41EC1FFF58963F8E4DA01D0A; // 0x1270(0x01F8)()
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_DB5E3E984D4A4BD0ADB6A79150BCF102_85CFF7D94369272CB57668AFC3327996; // 0x1468(0x01F8)()
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_F488803143166F0D456A9DAF314507D5_496564304FCE4BC35CDF848A113E6AD6; // 0x1660(0x01F8)()
	struct FSMTransition                          AnyState_SMGraphK2Node_TransitionResultNode_0_1425B09A419414B43246049E1543F93A_80858D444FCF2CAAB5AD2EBFCE552F78; // 0x1858(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_18_FC74DAC54644B6988AF11E9F5648855E; // 0x1A50(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_17_CDE397D84E7088042ADB9490D1210E78; // 0x1C48(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_16_7AB309D9431D66E4F062B38E288B964F; // 0x1E40(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_15_D5B79ADC46E0AC06E9C26A8F609762DC; // 0x2038(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_14_C333AB7B44AA4E91F3E386BCAD3888FF; // 0x2230(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_13_8648C94B469EAD3FC187368680CD1B83; // 0x2428(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_12_814B8B774817D1CB15F65A8DA7B96043; // 0x2620(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_11_E5404FDD49485C7683D7F09F804B0B3D; // 0x2818(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_10_843459CE46B35B08C9639282BEC930CF; // 0x2A10(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_9_94A5DA7541E4F235E0A516BD6BC912A4; // 0x2C08(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_8_0B083AB84FCB0D29D945239763591847; // 0x2E00(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_10_09FE40604AF767AE3D1BE0A8BD567FBA; // 0x2FF8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_9_B16E917F41306C3699E76ABFC72F64F3; // 0x31D8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_8_CFB3A06141588772D9BCA48D00829F8B; // 0x33B8(0x01E0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_7_54833A084A6049C146E9AFB3B31EACB5; // 0x3598(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_6_0F12A87A47E829D35A2A029E7F4F2A6D; // 0x3790(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_5_4580C20142A6E3F226FF049F5ABB46CC; // 0x3988(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_4_3E6BC124479B6C7ED78EF681A61971C4; // 0x3B80(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_7_A682339A4CF2AF49364EF990BFDE4866; // 0x3D78(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_6_20EA2E214A049112DE04F7B12BBE060C; // 0x3F58(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_5_A3EE00574F7DDC5FBEAC1E90BB0F87DA; // 0x4138(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_4_0647D3B74143B8307C8056890F57CE47; // 0x4318(0x01E0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_3_B138BCC74F39AACD781D318327AB6E89; // 0x44F8(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_2_E73B7CAB4F370CC63D634BB56B66B3CB; // 0x46F0(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_25B1D87546CBF1A128AB459FECA12022; // 0x48E8(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_F7D21EF542F85906D3F631B6DE644091; // 0x4AE0(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_3_A7BB3B69455E38906CC2B2AFE889C84D; // 0x4CD8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_2_6DBB85044B34C104C735FB9282C4B4E4; // 0x4EB8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_1_414FE9E2468FD1F6AC4471B4DE90D81A; // 0x5098(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_5399D4494B750CE83BD2058756C960AB; // 0x5278(0x01E0)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_5_1C127E6C4FE2A848181C56BEEBF03FD1; // 0x5458(0x0320)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_4_1EEDC24A459F928FCE28F5BBA2468B54; // 0x5778(0x0320)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_3_4AFB88394A8AE249BFB62DA5F697D78D; // 0x5A98(0x0320)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_2_171BC4134574384A380877B37A5F80AB; // 0x5DB8(0x0320)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_1_C7E1890248CA58E596D29CADD2969A09; // 0x60D8(0x0320)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_A34CB7034E2037A36D7A6FA966F3019E; // 0x63F8(0x0320)()
	EPBSkinClass                                  LastPreviewCharacterAppearance;                    // 0x6718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBSkinClass                                  LastEditingCharacterAppearance;                    // 0x6719(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PBSMShowRoomInstance(int32 EntryPoint);
	void OnStateMachineStop();
	void OnStateMachineStart();
	void SMGraphK2Node_StateUpdateNode_2_AppearanceSlot_752480904F3BC7812761728F5B99780D_4E23E14F497644D71E1F378E380AB909(float DeltaSeconds);
	void AnyState_SMGraphK2Node_TransitionResultNode_0_BD1DEA064D9D161F1ECF4582B9D3206D_EmptyState_to_WeaponPart_0B9653BF4D20E1F8BCF2C0BCAB861A50_5390C07740696E17326EE4B6F9BC48DD();
	void AnyState_SMGraphK2Node_TransitionResultNode_0_6FC4C283418D59F51DF811A86FC6A7F9_CharacterList_to_WeaponPart_0B9653BF4D20E1F8BCF2C0BCAB861A50_185A2AD549E09FEAB74B97A05F641FDE();
	void AnyState_SMGraphK2Node_TransitionResultNode_0_236411D64C9451EC961906A3A414280F_EmptyState_to_WeaponPartList_2057A29A4A02C2C9D5448EA4B34E009E_7C3C3873440D71808A57D3AA9952253B();
	void AnyState_SMGraphK2Node_TransitionResultNode_0_6269C57C411649AF376351BA254286FE_CharacterList_to_WeaponPartList_2057A29A4A02C2C9D5448EA4B34E009E_BF65B88346B45E9775AEE8B08B9DA25E();
	void AnyState_SMGraphK2Node_TransitionResultNode_0_AC61DAD241841F010DB86FA082D30B3D_EmptyState_to_Inventory_6FFDD17D4BF154F466405BA432515B8A_C4D87A22422D6027B725C39AFB300570();
	void AnyState_SMGraphK2Node_TransitionResultNode_0_9E7E14374C3DBF754DE35AB4EE61D0E9_CharacterList_to_Inventory_6FFDD17D4BF154F466405BA432515B8A_5286F65E4FDC13817DA5FFA98B76CC47();
	void AnyState_SMGraphK2Node_TransitionResultNode_0_2163AE08490D561847C9CB96CDAB0157_EmptyState_to_InventoryList_ED7BE797462DFC9A6AE09A85AD2CB008_FDAFF3944CE0DA480D954395BBD420C3();
	void AnyState_SMGraphK2Node_TransitionResultNode_0_DB5E3E984D4A4BD0ADB6A79150BCF102_CharacterList_to_InventoryList_ED7BE797462DFC9A6AE09A85AD2CB008_3B3B04B1426795A0F85EB787C8F818B0();
	void AnyState_SMGraphK2Node_TransitionResultNode_0_F488803143166F0D456A9DAF314507D5_EmptyState_to_Character_C8843B6F4E624AFEDE52DC84CAD3E981_F8026A16498758803E1D4AA9D740A7A1();
	void AnyState_SMGraphK2Node_TransitionResultNode_0_1425B09A419414B43246049E1543F93A_CharacterList_to_Character_C8843B6F4E624AFEDE52DC84CAD3E981_3A445DDF4C4A4C374AAD0F9ACF603A94();
	void SMGraphK2Node_TransitionResultNode_18_Character_to_InventoryList_9988C7EA4AB24DF0D20C9B8D2B0CDD9C_AA73C70B4976ED9E982689BE9ABFF844();
	void SMGraphK2Node_TransitionResultNode_17_InventoryList_to_Character_E00BD7CC43E51803A95EDF99945B98DA_ED8A628643799737DC934E9D5AE0FF3B();
	void SMGraphK2Node_TransitionResultNode_16_WeaponPart_to_WeaponPartList_8B68BC4F4D63018E3D46808DF33F8F14_9C0CA03B4372BB41866748AF84B7BCEE();
	void SMGraphK2Node_TransitionResultNode_15_WeaponPartList_to_WeaponPart_97BB970F453A30BBDA4937BD78806110_E44140E64F17C459B57C48843705AFD9();
	void SMGraphK2Node_TransitionResultNode_14_WeaponPartList_to_Inventory_CE5CA1F54A6DD45AC7C23A8DDB9B7518_4D6FBCDD44F51D47D69616ADABE0E63F();
	void SMGraphK2Node_TransitionResultNode_13_Inventory_to_InventoryList_F58908534362803A57CD24B722EB71C7_F99F36924A242001E557F78785BF8B3D();
	void SMGraphK2Node_TransitionResultNode_12_Character_to_CharacterList_7837E9C84F8D2D066C44369D10E60A01_73D910BF488C9CC38CE55D9C4E93CF49();
	void SMGraphK2Node_TransitionResultNode_11_EmptyState_to_CharacterList_B1FA6008455411244C8B6E9731BD4166_D7801B8D4335CC6E04ACBE817801F002();
	void SMGraphK2Node_TransitionResultNode_10_Inventory_to_WeaponPartList_75EE57304107783D036763A4A8C90435_2823C5F04CA793BDABBB3BBFB9B2AA55();
	void SMGraphK2Node_TransitionResultNode_9_InventoryList_to_Inventory_772E0E194B5E96D0355E7C93F7E7BDEE_9DDA63664739CDA48AF456BDC5CBFB6F();
	void SMGraphK2Node_TransitionResultNode_8_CharacterList_to_Character_46880EE9471939EE20E0CE9707E82AB7_10C98EE045064AC889FE6BA04EAFE450();
	void SMGraphK2Node_StateEntryNode_10_EmptyState_0F71DD6F4400BA0073984D921FED446F_1D67623147E4314E49E185AB5C416B16();
	void SMGraphK2Node_StateEntryNode_9_State_1_B1C5774847E7E70B897381BE123B743C_91A6B0474CC6F5139BA3709752552D87();
	void SMGraphK2Node_StateEntryNode_8_State_78C16B9D4D316922D544B2933FB94FAA_2EA4C1B84E98E7319C964E92396D5669();
	void SMGraphK2Node_TransitionResultNode_7_WeaponSlot_to_WeaponSuite_A39C2A824B4DDC7BE24D0B898D6D46E4_EE18F95C4F867F5D0B5B96956EB89D08();
	void SMGraphK2Node_TransitionResultNode_6_WeaponSuite_to_WeaponSlot_12E6DF1B42870D246F473BB0B636F8F9_0D5F49F44BF8C292C7425A99B701532B();
	void SMGraphK2Node_TransitionResultNode_5_State_to_WeaponSuite_3F3BEAE74E61FD2970CB5FB3C28481E5_AA0F753F419B21E5761C20B24E40FAE6();
	void SMGraphK2Node_TransitionResultNode_4_State_to_WeaponSlot_3C4F3FAA487074D08C91B195F1F6D750_E20D837B4207163157B7A184E2617183();
	void SMGraphK2Node_StateEntryNode_7_State_5A3C8DDB4592773422640BB235940B1B_46C1C4A345A517F0055061B7E175A80F();
	void SMGraphK2Node_StateEntryNode_6_WeaponSuite_490253334118677CA3E010BA9F2F800B_6C2B5B96468F497CB316A0B3E382B18A();
	void SMGraphK2Node_StateEntryNode_5_WeaponSlot_2FE59E934C9D96E045338DA971389015_3DED333F45DCA1630E4EBD97DC649A85();
	void SMGraphK2Node_StateEntryNode_4_State_0383100645B338A9658925975AE75C36_B448564E458810A9CBCF4CAB523835D5();
	void SMGraphK2Node_TransitionResultNode_3_State_to_AppearanceSlot_7F4CE943444DAB6040BC62BDB98EE1F4_7587A3FD43BE31F0FB502C941E459222();
	void SMGraphK2Node_TransitionResultNode_2_AppearanceSlot_to_Slot_CD30E00341C6B8C2E97396A6E049931F_FF26C5CF4F58CC7FE21C3F93E0537C33();
	void SMGraphK2Node_TransitionResultNode_1_Slot_to_AppearanceSlot_7CC0AB2D4FCC66CBF2C95BB73D2B4204_92D1FF944772C08B39DBF78291B73B8F();
	void SMGraphK2Node_TransitionResultNode_0_State_to_Slot_2EB4E90C416EAF558D8654B44E21A522_9E9D4C6647FB69EA02C8D4A00577D792();
	void SMGraphK2Node_StateEntryNode_3_AppearanceSlot_752480904F3BC7812761728F5B99780D_9DF023E140C1F09CB695DFA72DAFA6FC();
	void SMGraphK2Node_StateEntryNode_2_Slot_3E31BCA441BBF5BE22973DA3C9CF276B_D4188C524F20CAE8654E17802FA117F0();
	void SMGraphK2Node_StateEntryNode_1_State_646274DF47445BA8123569816D48E147_5E6EA52847A69F4B850304A64EA6FCDD();
	void SMGraphK2Node_StateEntryNode_0_State_1EF310BD44405218ED6C3F896BEEB802_BB03C2B344853B8690AD59ADECE0E5D7();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PBSMShowRoomInstance_C">();
	}
	static class UBP_PBSMShowRoomInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PBSMShowRoomInstance_C>();
	}
};
static_assert(alignof(UBP_PBSMShowRoomInstance_C) == 0x000008, "Wrong alignment on UBP_PBSMShowRoomInstance_C");
static_assert(sizeof(UBP_PBSMShowRoomInstance_C) == 0x006720, "Wrong size on UBP_PBSMShowRoomInstance_C");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, UberGraphFrame) == 0x000698, "Member 'UBP_PBSMShowRoomInstance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_BD1DEA064D9D161F1ECF4582B9D3206D_C997958B411A5198A5C8C0BED857B33C) == 0x0006A0, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_BD1DEA064D9D161F1ECF4582B9D3206D_C997958B411A5198A5C8C0BED857B33C' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_6FC4C283418D59F51DF811A86FC6A7F9_13EA16974D49A7AA7C2F24B3DC473BBB) == 0x000898, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_6FC4C283418D59F51DF811A86FC6A7F9_13EA16974D49A7AA7C2F24B3DC473BBB' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_236411D64C9451EC961906A3A414280F_D7BCBF264F0D7684EFF698B268D8BF11) == 0x000A90, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_236411D64C9451EC961906A3A414280F_D7BCBF264F0D7684EFF698B268D8BF11' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_6269C57C411649AF376351BA254286FE_BCF8B92A489F42AE2F44408939D6C239) == 0x000C88, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_6269C57C411649AF376351BA254286FE_BCF8B92A489F42AE2F44408939D6C239' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_AC61DAD241841F010DB86FA082D30B3D_AEDCE082446C9051DA128FAC9ACE53EA) == 0x000E80, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_AC61DAD241841F010DB86FA082D30B3D_AEDCE082446C9051DA128FAC9ACE53EA' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_9E7E14374C3DBF754DE35AB4EE61D0E9_FE0338A84F483DE685BE38AE767C64E7) == 0x001078, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_9E7E14374C3DBF754DE35AB4EE61D0E9_FE0338A84F483DE685BE38AE767C64E7' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_2163AE08490D561847C9CB96CDAB0157_4BDE033F41EC1FFF58963F8E4DA01D0A) == 0x001270, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_2163AE08490D561847C9CB96CDAB0157_4BDE033F41EC1FFF58963F8E4DA01D0A' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_DB5E3E984D4A4BD0ADB6A79150BCF102_85CFF7D94369272CB57668AFC3327996) == 0x001468, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_DB5E3E984D4A4BD0ADB6A79150BCF102_85CFF7D94369272CB57668AFC3327996' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_F488803143166F0D456A9DAF314507D5_496564304FCE4BC35CDF848A113E6AD6) == 0x001660, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_F488803143166F0D456A9DAF314507D5_496564304FCE4BC35CDF848A113E6AD6' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, AnyState_SMGraphK2Node_TransitionResultNode_0_1425B09A419414B43246049E1543F93A_80858D444FCF2CAAB5AD2EBFCE552F78) == 0x001858, "Member 'UBP_PBSMShowRoomInstance_C::AnyState_SMGraphK2Node_TransitionResultNode_0_1425B09A419414B43246049E1543F93A_80858D444FCF2CAAB5AD2EBFCE552F78' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_18_FC74DAC54644B6988AF11E9F5648855E) == 0x001A50, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_18_FC74DAC54644B6988AF11E9F5648855E' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_17_CDE397D84E7088042ADB9490D1210E78) == 0x001C48, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_17_CDE397D84E7088042ADB9490D1210E78' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_16_7AB309D9431D66E4F062B38E288B964F) == 0x001E40, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_16_7AB309D9431D66E4F062B38E288B964F' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_15_D5B79ADC46E0AC06E9C26A8F609762DC) == 0x002038, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_15_D5B79ADC46E0AC06E9C26A8F609762DC' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_14_C333AB7B44AA4E91F3E386BCAD3888FF) == 0x002230, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_14_C333AB7B44AA4E91F3E386BCAD3888FF' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_13_8648C94B469EAD3FC187368680CD1B83) == 0x002428, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_13_8648C94B469EAD3FC187368680CD1B83' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_12_814B8B774817D1CB15F65A8DA7B96043) == 0x002620, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_12_814B8B774817D1CB15F65A8DA7B96043' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_11_E5404FDD49485C7683D7F09F804B0B3D) == 0x002818, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_11_E5404FDD49485C7683D7F09F804B0B3D' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_10_843459CE46B35B08C9639282BEC930CF) == 0x002A10, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_10_843459CE46B35B08C9639282BEC930CF' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_9_94A5DA7541E4F235E0A516BD6BC912A4) == 0x002C08, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_9_94A5DA7541E4F235E0A516BD6BC912A4' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_8_0B083AB84FCB0D29D945239763591847) == 0x002E00, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_8_0B083AB84FCB0D29D945239763591847' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_10_09FE40604AF767AE3D1BE0A8BD567FBA) == 0x002FF8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_10_09FE40604AF767AE3D1BE0A8BD567FBA' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_9_B16E917F41306C3699E76ABFC72F64F3) == 0x0031D8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_9_B16E917F41306C3699E76ABFC72F64F3' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_8_CFB3A06141588772D9BCA48D00829F8B) == 0x0033B8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_8_CFB3A06141588772D9BCA48D00829F8B' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_7_54833A084A6049C146E9AFB3B31EACB5) == 0x003598, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_7_54833A084A6049C146E9AFB3B31EACB5' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_6_0F12A87A47E829D35A2A029E7F4F2A6D) == 0x003790, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_6_0F12A87A47E829D35A2A029E7F4F2A6D' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_5_4580C20142A6E3F226FF049F5ABB46CC) == 0x003988, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_5_4580C20142A6E3F226FF049F5ABB46CC' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_4_3E6BC124479B6C7ED78EF681A61971C4) == 0x003B80, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_4_3E6BC124479B6C7ED78EF681A61971C4' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_7_A682339A4CF2AF49364EF990BFDE4866) == 0x003D78, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_7_A682339A4CF2AF49364EF990BFDE4866' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_6_20EA2E214A049112DE04F7B12BBE060C) == 0x003F58, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_6_20EA2E214A049112DE04F7B12BBE060C' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_5_A3EE00574F7DDC5FBEAC1E90BB0F87DA) == 0x004138, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_5_A3EE00574F7DDC5FBEAC1E90BB0F87DA' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_4_0647D3B74143B8307C8056890F57CE47) == 0x004318, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_4_0647D3B74143B8307C8056890F57CE47' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_3_B138BCC74F39AACD781D318327AB6E89) == 0x0044F8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_3_B138BCC74F39AACD781D318327AB6E89' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_2_E73B7CAB4F370CC63D634BB56B66B3CB) == 0x0046F0, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_2_E73B7CAB4F370CC63D634BB56B66B3CB' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_1_25B1D87546CBF1A128AB459FECA12022) == 0x0048E8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_1_25B1D87546CBF1A128AB459FECA12022' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_TransitionResultNode_F7D21EF542F85906D3F631B6DE644091) == 0x004AE0, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_TransitionResultNode_F7D21EF542F85906D3F631B6DE644091' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_3_A7BB3B69455E38906CC2B2AFE889C84D) == 0x004CD8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_3_A7BB3B69455E38906CC2B2AFE889C84D' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_2_6DBB85044B34C104C735FB9282C4B4E4) == 0x004EB8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_2_6DBB85044B34C104C735FB9282C4B4E4' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_1_414FE9E2468FD1F6AC4471B4DE90D81A) == 0x005098, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_1_414FE9E2468FD1F6AC4471B4DE90D81A' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateEntryNode_5399D4494B750CE83BD2058756C960AB) == 0x005278, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateEntryNode_5399D4494B750CE83BD2058756C960AB' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateMachineEntryNode_5_1C127E6C4FE2A848181C56BEEBF03FD1) == 0x005458, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateMachineEntryNode_5_1C127E6C4FE2A848181C56BEEBF03FD1' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateMachineEntryNode_4_1EEDC24A459F928FCE28F5BBA2468B54) == 0x005778, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateMachineEntryNode_4_1EEDC24A459F928FCE28F5BBA2468B54' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateMachineEntryNode_3_4AFB88394A8AE249BFB62DA5F697D78D) == 0x005A98, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateMachineEntryNode_3_4AFB88394A8AE249BFB62DA5F697D78D' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateMachineEntryNode_2_171BC4134574384A380877B37A5F80AB) == 0x005DB8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateMachineEntryNode_2_171BC4134574384A380877B37A5F80AB' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateMachineEntryNode_1_C7E1890248CA58E596D29CADD2969A09) == 0x0060D8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateMachineEntryNode_1_C7E1890248CA58E596D29CADD2969A09' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, SMGraphK2Node_StateMachineEntryNode_A34CB7034E2037A36D7A6FA966F3019E) == 0x0063F8, "Member 'UBP_PBSMShowRoomInstance_C::SMGraphK2Node_StateMachineEntryNode_A34CB7034E2037A36D7A6FA966F3019E' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, LastPreviewCharacterAppearance) == 0x006718, "Member 'UBP_PBSMShowRoomInstance_C::LastPreviewCharacterAppearance' has a wrong offset!");
static_assert(offsetof(UBP_PBSMShowRoomInstance_C, LastEditingCharacterAppearance) == 0x006719, "Member 'UBP_PBSMShowRoomInstance_C::LastEditingCharacterAppearance' has a wrong offset!");

}

