#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBSMShowRoomInstance

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function BP_PBSMShowRoomInstance.BP_PBSMShowRoomInstance_C.ExecuteUbergraph_BP_PBSMShowRoomInstance
// 0x00C0 (0x00C0 - 0x0000)
struct BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBState_FocusInventory*                K2Node_DynamicCast_AsPBState_Focus_Inventory;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_16;       // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_17;       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_18;       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_19;       // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_20;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_21;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_22;       // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_23;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_24;       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_25;       // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_26;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_27;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_28;       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_29;       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_30;       // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBState_FocusWeaponPart*               K2Node_DynamicCast_AsPBState_Focus_Weapon_Part;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_31;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_32;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_33;       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_34;       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_35;       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBState_FocusWeaponPart*               K2Node_DynamicCast_AsPBState_Focus_Weapon_Part_1;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBSkinClass                                  CallFunc_GetPreviewCharacterAppearanceType_ReturnValue; // 0x0051(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBSkinClass                                  CallFunc_GetEditingCharacterAppearanceType_ReturnValue; // 0x0053(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_36;       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_37;       // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBState_FocusWeaponSlot*               K2Node_DynamicCast_AsPBState_Focus_Weapon_Slot;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBState_FocusCharacter*                K2Node_DynamicCast_AsPBState_Focus_Character;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBState_FocusCharacterSlot*            K2Node_DynamicCast_AsPBState_Focus_Character_Slot; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBState_FocusInventory*                K2Node_DynamicCast_AsPBState_Focus_Inventory_1;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBState_FocusCharacterAppearanceType*  K2Node_DynamicCast_AsPBState_Focus_Character_Appearance_Type; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_38;       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_39;       // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBState_FocusCharacterAppearanceType*  K2Node_DynamicCast_AsPBState_Focus_Character_Appearance_Type_1; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance) == 0x000008, "Wrong alignment on BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance");
static_assert(sizeof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance) == 0x0000C0, "Wrong size on BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, EntryPoint) == 0x000000, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000007, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000008, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000009, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_1) == 0x00000A, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00000B, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x00000C, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x00000D, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x00000E, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x00000F, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x000010, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_2) == 0x000011, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x000012, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_12) == 0x000013, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_13) == 0x000014, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_3) == 0x000015, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_AsPBState_Focus_Inventory) == 0x000018, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_AsPBState_Focus_Inventory' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_14) == 0x000021, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_15) == 0x000022, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_16) == 0x000023, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_4) == 0x000024, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_17) == 0x000025, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_18) == 0x000026, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_19) == 0x000027, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_20) == 0x000028, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_21) == 0x000029, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_5) == 0x00002A, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_22) == 0x00002B, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_23) == 0x00002C, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_24) == 0x00002D, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_25) == 0x00002E, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_6) == 0x00002F, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_26) == 0x000030, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_27) == 0x000031, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_28) == 0x000032, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_7) == 0x000033, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_29) == 0x000034, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_30) == 0x000035, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_8) == 0x000036, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_AsPBState_Focus_Weapon_Part) == 0x000038, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_AsPBState_Focus_Weapon_Part' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_31) == 0x000041, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_32) == 0x000042, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_33) == 0x000043, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_34) == 0x000044, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_34' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_35) == 0x000045, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_35' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_AsPBState_Focus_Weapon_Part_1) == 0x000048, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_AsPBState_Focus_Weapon_Part_1' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_GetPreviewCharacterAppearanceType_ReturnValue) == 0x000051, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_GetPreviewCharacterAppearanceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_SwitchEnum_CmpSuccess) == 0x000052, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_GetEditingCharacterAppearanceType_ReturnValue) == 0x000053, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_GetEditingCharacterAppearanceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_36) == 0x000054, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_36' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_37) == 0x000055, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_37' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_SwitchEnum_CmpSuccess_1) == 0x000056, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_9) == 0x000057, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000058, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000059, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_CustomEvent_DeltaSeconds) == 0x00005C, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_AsPBState_Focus_Weapon_Slot) == 0x000060, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_AsPBState_Focus_Weapon_Slot' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_AsPBState_Focus_Character) == 0x000070, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_AsPBState_Focus_Character' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_bSuccess_4) == 0x000078, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_AsPBState_Focus_Character_Slot) == 0x000080, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_AsPBState_Focus_Character_Slot' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_bSuccess_5) == 0x000088, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_AsPBState_Focus_Inventory_1) == 0x000090, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_AsPBState_Focus_Inventory_1' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_bSuccess_6) == 0x000098, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_AsPBState_Focus_Character_Appearance_Type) == 0x0000A0, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_AsPBState_Focus_Character_Appearance_Type' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_bSuccess_7) == 0x0000A8, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_38) == 0x0000A9, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_38' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_EqualEqual_ByteByte_ReturnValue_39) == 0x0000AA, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_EqualEqual_ByteByte_ReturnValue_39' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, CallFunc_BooleanOR_ReturnValue_10) == 0x0000AB, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_AsPBState_Focus_Character_Appearance_Type_1) == 0x0000B0, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_AsPBState_Focus_Character_Appearance_Type_1' has a wrong offset!");
static_assert(offsetof(BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance, K2Node_DynamicCast_bSuccess_8) == 0x0000B8, "Member 'BP_PBSMShowRoomInstance_C_ExecuteUbergraph_BP_PBSMShowRoomInstance::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");

// Function BP_PBSMShowRoomInstance.BP_PBSMShowRoomInstance_C.SMGraphK2Node_StateUpdateNode_2_AppearanceSlot_752480904F3BC7812761728F5B99780D_4E23E14F497644D71E1F378E380AB909
// 0x0004 (0x0004 - 0x0000)
struct BP_PBSMShowRoomInstance_C_SMGraphK2Node_StateUpdateNode_2_AppearanceSlot_752480904F3BC7812761728F5B99780D_4E23E14F497644D71E1F378E380AB909 final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PBSMShowRoomInstance_C_SMGraphK2Node_StateUpdateNode_2_AppearanceSlot_752480904F3BC7812761728F5B99780D_4E23E14F497644D71E1F378E380AB909) == 0x000004, "Wrong alignment on BP_PBSMShowRoomInstance_C_SMGraphK2Node_StateUpdateNode_2_AppearanceSlot_752480904F3BC7812761728F5B99780D_4E23E14F497644D71E1F378E380AB909");
static_assert(sizeof(BP_PBSMShowRoomInstance_C_SMGraphK2Node_StateUpdateNode_2_AppearanceSlot_752480904F3BC7812761728F5B99780D_4E23E14F497644D71E1F378E380AB909) == 0x000004, "Wrong size on BP_PBSMShowRoomInstance_C_SMGraphK2Node_StateUpdateNode_2_AppearanceSlot_752480904F3BC7812761728F5B99780D_4E23E14F497644D71E1F378E380AB909");
