#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PBDamageIndicatorComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UStruct_DamageIndicatorOverallDamage_structs.hpp"


namespace SDK::Params
{

// Function BP_PBDamageIndicatorComponent.BP_PBDamageIndicatorComponent_C.ExecuteUbergraph_BP_PBDamageIndicatorComponent
// 0x00B8 (0x00B8 - 0x0000)
struct BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUStruct_DamageIndicatorOverallDamage> CallFunc_Map_Values_Values;                        // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FUStruct_DamageIndicatorOverallDamage> CallFunc_Map_Values_Values_1;                      // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUStruct_DamageIndicatorOverallDamage  CallFunc_Array_Get_Item;                           // 0x0060(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUStruct_DamageIndicatorOverallDamage  CallFunc_Array_Get_Item_1;                         // 0x0090(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent) == 0x000008, "Wrong alignment on BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent");
static_assert(sizeof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent) == 0x0000B8, "Wrong size on BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, EntryPoint) == 0x000000, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_IsLocallyControlled_ReturnValue) == 0x000008, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000028, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Map_Values_Values) == 0x000038, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Map_Values_Values_1) == 0x000048, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Map_Values_Values_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_IsValid_ReturnValue) == 0x000084, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, K2Node_Event_EndPlayReason) == 0x00008C, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Less_IntInt_ReturnValue) == 0x00008D, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B4, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_IsValid_ReturnValue_1) == 0x0000B5, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0000B6, "Member 'BP_PBDamageIndicatorComponent_C_ExecuteUbergraph_BP_PBDamageIndicatorComponent::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");

// Function BP_PBDamageIndicatorComponent.BP_PBDamageIndicatorComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PBDamageIndicatorComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PBDamageIndicatorComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PBDamageIndicatorComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PBDamageIndicatorComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PBDamageIndicatorComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PBDamageIndicatorComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PBDamageIndicatorComponent.BP_PBDamageIndicatorComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PBDamageIndicatorComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PBDamageIndicatorComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PBDamageIndicatorComponent_C_ReceiveTick");
static_assert(sizeof(BP_PBDamageIndicatorComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_PBDamageIndicatorComponent_C_ReceiveTick");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PBDamageIndicatorComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PBDamageIndicatorComponent.BP_PBDamageIndicatorComponent_C.BeHit
// 0x0308 (0x0308 - 0x0000)
struct BP_PBDamageIndicatorComponent_C_BeHit final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBackPack;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsRadialDamage;                                    // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RadialDamageSourceLocation;                        // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalAccDamageRef;                                 // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalBackPackDamageAcc;                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalDamageAcc;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           InPlayerState;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInArray;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AccumlateDamage;                                   // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxAirTightness_ReturnValue;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAirTightness_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP_1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsADS_ReturnValue;                        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsADS_ReturnValue_1;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsADS_ReturnValue_2;                      // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerController*                    K2Node_DynamicCast_AsPBPlayer_Controller;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_4;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsADS_ReturnValue_3;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default_5;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP_2;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default_6;                           // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_7;                           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUStruct_DamageIndicatorOverallDamage  K2Node_MakeStruct_UStruct_DamageIndicatorOverallDamage; // 0x0170(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FUStruct_DamageIndicatorOverallDamage  K2Node_MakeStruct_UStruct_DamageIndicatorOverallDamage_1; // 0x0190(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP_3;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_8;                           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_2;         // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_9;                           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_2;                       // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_3;         // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUStruct_DamageIndicatorOverallDamage  K2Node_Select_Default_10;                          // 0x0210(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FUStruct_DamageIndicatorOverallDamage  CallFunc_Map_Find_Value;                           // 0x0230(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_11;                             // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_11;                          // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUStruct_DamageIndicatorOverallDamage  K2Node_SetFieldsInStruct_StructOut;                // 0x0268(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUStruct_DamageIndicatorOverallDamage  K2Node_SetFieldsInStruct_StructOut_1;              // 0x0290(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUStruct_DamageIndicatorOverallDamage  K2Node_SetFieldsInStruct_StructOut_2;              // 0x02C8(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FUStruct_DamageIndicatorOverallDamage  K2Node_SetFieldsInStruct_StructOut_3;              // 0x02E8(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_PBDamageIndicatorComponent_C_BeHit) == 0x000008, "Wrong alignment on BP_PBDamageIndicatorComponent_C_BeHit");
static_assert(sizeof(BP_PBDamageIndicatorComponent_C_BeHit) == 0x000308, "Wrong size on BP_PBDamageIndicatorComponent_C_BeHit");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Pawn) == 0x000000, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Pawn' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Damage) == 0x000008, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Damage' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, IsBackPack) == 0x00000C, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::IsBackPack' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, IsRadialDamage) == 0x00000D, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::IsRadialDamage' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, RadialDamageSourceLocation) == 0x000010, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::RadialDamageSourceLocation' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, LocalAccDamageRef) == 0x00001C, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::LocalAccDamageRef' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, LocalBackPackDamageAcc) == 0x000020, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::LocalBackPackDamageAcc' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, LocalDamageAcc) == 0x000024, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::LocalDamageAcc' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, InPlayerState) == 0x000028, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::InPlayerState' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, IsInArray) == 0x000030, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::IsInArray' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, AccumlateDamage) == 0x000034, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::AccumlateDamage' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable) == 0x000038, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_1) == 0x000039, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_GetMaxAirTightness_ReturnValue) == 0x00003C, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_GetMaxAirTightness_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_GetAirTightness_ReturnValue) == 0x000040, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_GetAirTightness_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_2) == 0x000044, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000045, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_BooleanAND_ReturnValue) == 0x000046, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000048, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_AsPBCharacter_BP_1) == 0x000058, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_AsPBCharacter_BP_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue_1) == 0x000062, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default) == 0x00007C, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_1) == 0x000088, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue_2) == 0x000094, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000098, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsADS_ReturnValue) == 0x0000A4, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsADS_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_SelectFloat_ReturnValue) == 0x0000A8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsADS_ReturnValue_1) == 0x0000AC, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsADS_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsADS_ReturnValue_2) == 0x0000AD, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsADS_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_SelectFloat_ReturnValue_1) == 0x0000B0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue_3) == 0x0000B4, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_GetController_ReturnValue) == 0x0000B8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_AsPBPlayer_Controller) == 0x0000C0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_AsPBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000C9, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_BooleanAND_ReturnValue_1) == 0x0000CA, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_SelectFloat_ReturnValue_2) == 0x0000CC, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_3) == 0x0000D0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_float_Variable) == 0x0000D4, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_4) == 0x0000D8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_float_Variable_1) == 0x0000DC, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_5) == 0x0000E0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_2) == 0x0000E4, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_3) == 0x0000E8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_4) == 0x0000F0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsADS_ReturnValue_3) == 0x0000F8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsADS_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_6) == 0x0000F9, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_SelectFloat_ReturnValue_3) == 0x0000FC, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_5) == 0x000100, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000108, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_AsPBCharacter_BP_2) == 0x000110, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_AsPBCharacter_BP_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Conv_FloatToVector_ReturnValue) == 0x00011C, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000128, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue_4) == 0x000134, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_6) == 0x000138, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_7) == 0x000144, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000148, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_7) == 0x000150, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000154, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_FMin_ReturnValue) == 0x000158, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x00015C, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue_5) == 0x000168, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_MakeStruct_UStruct_DamageIndicatorOverallDamage) == 0x000170, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_MakeStruct_UStruct_DamageIndicatorOverallDamage' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_MakeStruct_UStruct_DamageIndicatorOverallDamage_1) == 0x000190, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_MakeStruct_UStruct_DamageIndicatorOverallDamage_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_8) == 0x0001B0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_AsPBCharacter_BP_3) == 0x0001B8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_AsPBCharacter_BP_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_DynamicCast_bSuccess_4) == 0x0001C0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_8) == 0x0001C4, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0001C8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0001D4, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue_6) == 0x0001D8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_FMin_ReturnValue_1) == 0x0001DC, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Conv_FloatToVector_ReturnValue_2) == 0x0001E0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Conv_FloatToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_9) == 0x0001EC, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_9) == 0x0001F0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0001F4, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_FMin_ReturnValue_2) == 0x0001F8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_FMin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_10) == 0x0001FC, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Conv_FloatToVector_ReturnValue_3) == 0x000200, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Conv_FloatToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_10) == 0x000210, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Map_Find_Value) == 0x000230, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Map_Find_ReturnValue) == 0x000250, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, Temp_bool_Variable_11) == 0x000251, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Add_FloatFloat_ReturnValue) == 0x000254, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_Select_Default_11) == 0x000258, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_Select_Default_11' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_SetFieldsInStruct_StructOut) == 0x000268, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000288, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_SetFieldsInStruct_StructOut_1) == 0x000290, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_SetFieldsInStruct_StructOut_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue_7) == 0x0002B0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue_8) == 0x0002B1, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x0002B8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, CallFunc_IsValid_ReturnValue_9) == 0x0002C0, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PBDamageIndicatorComponent_C_BeHit, K2Node_SetFieldsInStruct_StructOut_2) == 0x0002C8, "Member 'BP_PBDamageIndicatorComponent_C_BeHit::K2Node_SetFieldsInStruct_StructOut_2' has a wrong offset!");
