#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StateMachine_CharacterList

#include "Basic.hpp"

#include "SMSystem_structs.hpp"


namespace SDK::Params
{

// Function BP_StateMachine_CharacterList.BP_StateMachine_CharacterList_C.ExecuteUbergraph_BP_StateMachine_CharacterList
// 0x0004 (0x0004 - 0x0000)
struct BP_StateMachine_CharacterList_C_ExecuteUbergraph_BP_StateMachine_CharacterList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StateMachine_CharacterList_C_ExecuteUbergraph_BP_StateMachine_CharacterList) == 0x000004, "Wrong alignment on BP_StateMachine_CharacterList_C_ExecuteUbergraph_BP_StateMachine_CharacterList");
static_assert(sizeof(BP_StateMachine_CharacterList_C_ExecuteUbergraph_BP_StateMachine_CharacterList) == 0x000004, "Wrong size on BP_StateMachine_CharacterList_C_ExecuteUbergraph_BP_StateMachine_CharacterList");
static_assert(offsetof(BP_StateMachine_CharacterList_C_ExecuteUbergraph_BP_StateMachine_CharacterList, EntryPoint) == 0x000000, "Member 'BP_StateMachine_CharacterList_C_ExecuteUbergraph_BP_StateMachine_CharacterList::EntryPoint' has a wrong offset!");

// Function BP_StateMachine_CharacterList.BP_StateMachine_CharacterList_C.ConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_StateMachine_CharacterList_C_ConstructionScript final
{
public:
	ESMExecutionEnvironment                       CallFunc_WithExecutionEnvironment_ExecutionEnvironment; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StateMachine_CharacterList_C_ConstructionScript) == 0x000001, "Wrong alignment on BP_StateMachine_CharacterList_C_ConstructionScript");
static_assert(sizeof(BP_StateMachine_CharacterList_C_ConstructionScript) == 0x000002, "Wrong size on BP_StateMachine_CharacterList_C_ConstructionScript");
static_assert(offsetof(BP_StateMachine_CharacterList_C_ConstructionScript, CallFunc_WithExecutionEnvironment_ExecutionEnvironment) == 0x000000, "Member 'BP_StateMachine_CharacterList_C_ConstructionScript::CallFunc_WithExecutionEnvironment_ExecutionEnvironment' has a wrong offset!");
static_assert(offsetof(BP_StateMachine_CharacterList_C_ConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_StateMachine_CharacterList_C_ConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

