#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SuperFastVehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicPackBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SuperFastVehicle.BP_SuperFastVehicle_C
// 0x0020 (0x0380 - 0x0360)
class ABP_SuperFastVehicle_C final : public ABasicPackBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SuperFastVehicle_C;              // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   SimulatePhysicsBoneName;                           // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SimulatePhysicsBoneName1;                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SimulatePhysicsBoneName2;                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SuperFastVehicle(int32 EntryPoint);
	void ChangeMeshPhysics();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SuperFastVehicle_C">();
	}
	static class ABP_SuperFastVehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SuperFastVehicle_C>();
	}
};
static_assert(alignof(ABP_SuperFastVehicle_C) == 0x000008, "Wrong alignment on ABP_SuperFastVehicle_C");
static_assert(sizeof(ABP_SuperFastVehicle_C) == 0x000380, "Wrong size on ABP_SuperFastVehicle_C");
static_assert(offsetof(ABP_SuperFastVehicle_C, UberGraphFrame_BP_SuperFastVehicle_C) == 0x000360, "Member 'ABP_SuperFastVehicle_C::UberGraphFrame_BP_SuperFastVehicle_C' has a wrong offset!");
static_assert(offsetof(ABP_SuperFastVehicle_C, SimulatePhysicsBoneName) == 0x000368, "Member 'ABP_SuperFastVehicle_C::SimulatePhysicsBoneName' has a wrong offset!");
static_assert(offsetof(ABP_SuperFastVehicle_C, SimulatePhysicsBoneName1) == 0x000370, "Member 'ABP_SuperFastVehicle_C::SimulatePhysicsBoneName1' has a wrong offset!");
static_assert(offsetof(ABP_SuperFastVehicle_C, SimulatePhysicsBoneName2) == 0x000378, "Member 'ABP_SuperFastVehicle_C::SimulatePhysicsBoneName2' has a wrong offset!");

}

