#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrakingModule_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function BrakingModule_BP.BrakingModule_BP_C.ExecuteUbergraph_BrakingModule_BP
// 0x0018 (0x0018 - 0x0000)
struct BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP) == 0x000008, "Wrong alignment on BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP");
static_assert(sizeof(BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP) == 0x000018, "Wrong size on BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP");
static_assert(offsetof(BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP, EntryPoint) == 0x000000, "Member 'BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP, CallFunc_IsLocallyControlled_ReturnValue) == 0x000006, "Member 'BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000007, "Member 'BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000010, "Member 'BrakingModule_BP_C_ExecuteUbergraph_BrakingModule_BP::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");

}

