#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bubble_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Bubble_BP.Bubble_BP_C.Recover
// 0x0010 (0x0010 - 0x0000)
struct Bubble_BP_C_Recover final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bubble_BP_C_Recover) == 0x000008, "Wrong alignment on Bubble_BP_C_Recover");
static_assert(sizeof(Bubble_BP_C_Recover) == 0x000010, "Wrong size on Bubble_BP_C_Recover");
static_assert(offsetof(Bubble_BP_C_Recover, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'Bubble_BP_C_Recover::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bubble_BP_C_Recover, CallFunc_Montage_Play_ReturnValue) == 0x000008, "Member 'Bubble_BP_C_Recover::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function Bubble_BP.Bubble_BP_C.StopBubble
// 0x0010 (0x0010 - 0x0000)
struct Bubble_BP_C_StopBubble final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bubble_BP_C_StopBubble) == 0x000008, "Wrong alignment on Bubble_BP_C_StopBubble");
static_assert(sizeof(Bubble_BP_C_StopBubble) == 0x000010, "Wrong size on Bubble_BP_C_StopBubble");
static_assert(offsetof(Bubble_BP_C_StopBubble, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'Bubble_BP_C_StopBubble::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bubble_BP_C_StopBubble, CallFunc_Montage_Play_ReturnValue) == 0x000008, "Member 'Bubble_BP_C_StopBubble::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function Bubble_BP.Bubble_BP_C.Activate
// 0x0018 (0x0018 - 0x0000)
struct Bubble_BP_C_Activate final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bubble_BP_C_Activate) == 0x000008, "Wrong alignment on Bubble_BP_C_Activate");
static_assert(sizeof(Bubble_BP_C_Activate) == 0x000018, "Wrong size on Bubble_BP_C_Activate");
static_assert(offsetof(Bubble_BP_C_Activate, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'Bubble_BP_C_Activate::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bubble_BP_C_Activate, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Bubble_BP_C_Activate::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bubble_BP_C_Activate, CallFunc_Montage_Play_ReturnValue) == 0x000010, "Member 'Bubble_BP_C_Activate::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function Bubble_BP.Bubble_BP_C.Deactivate
// 0x0018 (0x0018 - 0x0000)
struct Bubble_BP_C_Deactivate final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bubble_BP_C_Deactivate) == 0x000008, "Wrong alignment on Bubble_BP_C_Deactivate");
static_assert(sizeof(Bubble_BP_C_Deactivate) == 0x000018, "Wrong size on Bubble_BP_C_Deactivate");
static_assert(offsetof(Bubble_BP_C_Deactivate, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'Bubble_BP_C_Deactivate::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bubble_BP_C_Deactivate, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Bubble_BP_C_Deactivate::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bubble_BP_C_Deactivate, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Bubble_BP_C_Deactivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bubble_BP_C_Deactivate, CallFunc_Montage_Play_ReturnValue) == 0x000014, "Member 'Bubble_BP_C_Deactivate::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

}

