#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraShakeRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CameraShakeRuntime.CameraShakeLibrary.PlayCameraShake
// 0x0028 (0x0028 - 0x0000)
struct CameraShakeLibrary_PlayCameraShake final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraShakeBase*                       Shake;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraShakePlaySpace                         PlaySpace;                                         // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               UserPlaySpaceRot;                                  // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CameraShakeLibrary_PlayCameraShake) == 0x000008, "Wrong alignment on CameraShakeLibrary_PlayCameraShake");
static_assert(sizeof(CameraShakeLibrary_PlayCameraShake) == 0x000028, "Wrong size on CameraShakeLibrary_PlayCameraShake");
static_assert(offsetof(CameraShakeLibrary_PlayCameraShake, PlayerController) == 0x000000, "Member 'CameraShakeLibrary_PlayCameraShake::PlayerController' has a wrong offset!");
static_assert(offsetof(CameraShakeLibrary_PlayCameraShake, Shake) == 0x000008, "Member 'CameraShakeLibrary_PlayCameraShake::Shake' has a wrong offset!");
static_assert(offsetof(CameraShakeLibrary_PlayCameraShake, Scale) == 0x000010, "Member 'CameraShakeLibrary_PlayCameraShake::Scale' has a wrong offset!");
static_assert(offsetof(CameraShakeLibrary_PlayCameraShake, PlaySpace) == 0x000014, "Member 'CameraShakeLibrary_PlayCameraShake::PlaySpace' has a wrong offset!");
static_assert(offsetof(CameraShakeLibrary_PlayCameraShake, UserPlaySpaceRot) == 0x000018, "Member 'CameraShakeLibrary_PlayCameraShake::UserPlaySpaceRot' has a wrong offset!");
static_assert(offsetof(CameraShakeLibrary_PlayCameraShake, ReturnValue) == 0x000024, "Member 'CameraShakeLibrary_PlayCameraShake::ReturnValue' has a wrong offset!");

}

