#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Card_MainOption

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Card_MainOption.Card_MainOption_C.ExecuteUbergraph_Card_MainOption
// 0x0100 (0x0100 - 0x0000)
struct Card_MainOption_C_ExecuteUbergraph_Card_MainOption final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0010(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0028(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0068(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_4;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x00DC(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00E4(0x0008)(NoDestructor)
	struct FBPFocusEvent                          CallFunc_ConvertToBPFocusEvent_ReturnValue;        // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsEntry;                        // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption) == 0x000008, "Wrong alignment on Card_MainOption_C_ExecuteUbergraph_Card_MainOption");
static_assert(sizeof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption) == 0x000100, "Wrong size on Card_MainOption_C_ExecuteUbergraph_Card_MainOption");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, EntryPoint) == 0x000000, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::EntryPoint' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, Temp_bool_Variable) == 0x000004, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, Temp_float_Variable) == 0x000008, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, Temp_float_Variable_1) == 0x00000C, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, K2Node_CustomEvent_InText) == 0x000010, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_TextToUpper_ReturnValue) == 0x000028, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000048, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000050, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000058, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000060, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, K2Node_Event_MyGeometry) == 0x000068, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, K2Node_Event_InDeltaTime) == 0x0000A0, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_BooleanOR_ReturnValue) == 0x0000A4, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, K2Node_Select_Default) == 0x0000A8, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x0000B0, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_FInterpTo_ReturnValue) == 0x0000B8, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x0000C0, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_PlayAnimationReverse_ReturnValue_3) == 0x0000C8, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_PlayAnimationReverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_PlayAnimationReverse_ReturnValue_4) == 0x0000D0, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_PlayAnimationReverse_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, K2Node_Event_IsDesignTime) == 0x0000D8, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, K2Node_Event_InFocusEvent_1) == 0x0000DC, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, K2Node_Event_InFocusEvent) == 0x0000E4, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_ConvertToBPFocusEvent_ReturnValue) == 0x0000EC, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_ConvertToBPFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, K2Node_SwitchEnum_CmpSuccess) == 0x0000F4, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, K2Node_CustomEvent_IsEntry) == 0x0000F5, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::K2Node_CustomEvent_IsEntry' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_ExecuteUbergraph_Card_MainOption, CallFunc_GetPlayerController_ReturnValue) == 0x0000F8, "Member 'Card_MainOption_C_ExecuteUbergraph_Card_MainOption::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function Card_MainOption.Card_MainOption_C.GetIntoNextLevel
// 0x0001 (0x0001 - 0x0000)
struct Card_MainOption_C_GetIntoNextLevel final
{
public:
	bool                                          IsEntry;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Card_MainOption_C_GetIntoNextLevel) == 0x000001, "Wrong alignment on Card_MainOption_C_GetIntoNextLevel");
static_assert(sizeof(Card_MainOption_C_GetIntoNextLevel) == 0x000001, "Wrong size on Card_MainOption_C_GetIntoNextLevel");
static_assert(offsetof(Card_MainOption_C_GetIntoNextLevel, IsEntry) == 0x000000, "Member 'Card_MainOption_C_GetIntoNextLevel::IsEntry' has a wrong offset!");

// Function Card_MainOption.Card_MainOption_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct Card_MainOption_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(Card_MainOption_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on Card_MainOption_C_OnRemovedFromFocusPath");
static_assert(sizeof(Card_MainOption_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on Card_MainOption_C_OnRemovedFromFocusPath");
static_assert(offsetof(Card_MainOption_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'Card_MainOption_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function Card_MainOption.Card_MainOption_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct Card_MainOption_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(Card_MainOption_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on Card_MainOption_C_OnAddedToFocusPath");
static_assert(sizeof(Card_MainOption_C_OnAddedToFocusPath) == 0x000008, "Wrong size on Card_MainOption_C_OnAddedToFocusPath");
static_assert(offsetof(Card_MainOption_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'Card_MainOption_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function Card_MainOption.Card_MainOption_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Card_MainOption_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Card_MainOption_C_PreConstruct) == 0x000001, "Wrong alignment on Card_MainOption_C_PreConstruct");
static_assert(sizeof(Card_MainOption_C_PreConstruct) == 0x000001, "Wrong size on Card_MainOption_C_PreConstruct");
static_assert(offsetof(Card_MainOption_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Card_MainOption_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Card_MainOption.Card_MainOption_C.Tick
// 0x003C (0x003C - 0x0000)
struct Card_MainOption_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Card_MainOption_C_Tick) == 0x000004, "Wrong alignment on Card_MainOption_C_Tick");
static_assert(sizeof(Card_MainOption_C_Tick) == 0x00003C, "Wrong size on Card_MainOption_C_Tick");
static_assert(offsetof(Card_MainOption_C_Tick, MyGeometry) == 0x000000, "Member 'Card_MainOption_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_Tick, InDeltaTime) == 0x000038, "Member 'Card_MainOption_C_Tick::InDeltaTime' has a wrong offset!");

// Function Card_MainOption.Card_MainOption_C.Designer_SetTitle
// 0x0018 (0x0018 - 0x0000)
struct Card_MainOption_C_Designer_SetTitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Card_MainOption_C_Designer_SetTitle) == 0x000008, "Wrong alignment on Card_MainOption_C_Designer_SetTitle");
static_assert(sizeof(Card_MainOption_C_Designer_SetTitle) == 0x000018, "Wrong size on Card_MainOption_C_Designer_SetTitle");
static_assert(offsetof(Card_MainOption_C_Designer_SetTitle, InText) == 0x000000, "Member 'Card_MainOption_C_Designer_SetTitle::InText' has a wrong offset!");

// Function Card_MainOption.Card_MainOption_C.Unselected
// 0x0008 (0x0008 - 0x0000)
struct Card_MainOption_C_Unselected final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Card_MainOption_C_Unselected) == 0x000008, "Wrong alignment on Card_MainOption_C_Unselected");
static_assert(sizeof(Card_MainOption_C_Unselected) == 0x000008, "Wrong size on Card_MainOption_C_Unselected");
static_assert(offsetof(Card_MainOption_C_Unselected, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'Card_MainOption_C_Unselected::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function Card_MainOption.Card_MainOption_C.Selected
// 0x0010 (0x0010 - 0x0000)
struct Card_MainOption_C_Selected final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Card_MainOption_C_Selected) == 0x000008, "Wrong alignment on Card_MainOption_C_Selected");
static_assert(sizeof(Card_MainOption_C_Selected) == 0x000010, "Wrong size on Card_MainOption_C_Selected");
static_assert(offsetof(Card_MainOption_C_Selected, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'Card_MainOption_C_Selected::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Card_MainOption_C_Selected, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000008, "Member 'Card_MainOption_C_Selected::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");

}

