#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Card_MainOption

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MainMenuWidget_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Card_MainOption.Card_MainOption_C
// 0x0110 (0x0400 - 0x02F0)
class UCard_MainOption_C final : public UMainMenuWidget_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Card_MainOption_C;                  // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OtherSelect;                                       // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectedOn;                                        // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FocusOn;                                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 blackBG;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusMask;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_678;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Main_button;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OptionIconImage;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedMask;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title_1;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_Title;                                        // 0x0358(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          EnterDetails;                                      // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 Index)>   Clicked;                                           // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Index_0;                                           // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            NormalTextColor;                                   // 0x0390(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            UnLevelTextColor;                                  // 0x03B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class UCard_MainOption_C* Caller)> OnMainOptionFocus;                                 // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             OptionIcon;                                        // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsFocus;                                          // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsSelected;                                       // 0x03F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA[0x2];                                      // 0x03FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FocusMaskOpcacity;                                 // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Card_MainOption(int32 EntryPoint);
	void SetCustomFocus();
	void GetBack();
	void GetIntoNextLevel(bool IsEntry);
	void BndEvt__Main_button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__Main_button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__Main_button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Designer_OtherLeaveNextLevel();
	void Designer_OtherGotoNextLevel();
	void Designer_LeaveAsEntry();
	void Designer_EnterAsEntry();
	void Designer_Unfocus();
	void Designer_OnFocus();
	void Designer_SetTitle(const class FText& InText);
	void Unselected();
	void Selected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Card_MainOption_C">();
	}
	static class UCard_MainOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCard_MainOption_C>();
	}
};
static_assert(alignof(UCard_MainOption_C) == 0x000008, "Wrong alignment on UCard_MainOption_C");
static_assert(sizeof(UCard_MainOption_C) == 0x000400, "Wrong size on UCard_MainOption_C");
static_assert(offsetof(UCard_MainOption_C, UberGraphFrame_Card_MainOption_C) == 0x0002F0, "Member 'UCard_MainOption_C::UberGraphFrame_Card_MainOption_C' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, OtherSelect) == 0x0002F8, "Member 'UCard_MainOption_C::OtherSelect' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, SelectedOn) == 0x000300, "Member 'UCard_MainOption_C::SelectedOn' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, FocusOn) == 0x000308, "Member 'UCard_MainOption_C::FocusOn' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, blackBG) == 0x000310, "Member 'UCard_MainOption_C::blackBG' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, FocusMask) == 0x000318, "Member 'UCard_MainOption_C::FocusMask' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, Image_113) == 0x000320, "Member 'UCard_MainOption_C::Image_113' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, Image_678) == 0x000328, "Member 'UCard_MainOption_C::Image_678' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, Main_button) == 0x000330, "Member 'UCard_MainOption_C::Main_button' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, OptionIconImage) == 0x000338, "Member 'UCard_MainOption_C::OptionIconImage' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, SelectedMask) == 0x000340, "Member 'UCard_MainOption_C::SelectedMask' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, Title) == 0x000348, "Member 'UCard_MainOption_C::Title' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, Title_1) == 0x000350, "Member 'UCard_MainOption_C::Title_1' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, Text_Title) == 0x000358, "Member 'UCard_MainOption_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, EnterDetails) == 0x000370, "Member 'UCard_MainOption_C::EnterDetails' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, Clicked) == 0x000378, "Member 'UCard_MainOption_C::Clicked' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, Index_0) == 0x000388, "Member 'UCard_MainOption_C::Index_0' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, NormalTextColor) == 0x000390, "Member 'UCard_MainOption_C::NormalTextColor' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, UnLevelTextColor) == 0x0003B8, "Member 'UCard_MainOption_C::UnLevelTextColor' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, OnMainOptionFocus) == 0x0003E0, "Member 'UCard_MainOption_C::OnMainOptionFocus' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, OptionIcon) == 0x0003F0, "Member 'UCard_MainOption_C::OptionIcon' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, bIsFocus) == 0x0003F8, "Member 'UCard_MainOption_C::bIsFocus' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, bIsSelected) == 0x0003F9, "Member 'UCard_MainOption_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UCard_MainOption_C, FocusMaskOpcacity) == 0x0003FC, "Member 'UCard_MainOption_C::FocusMaskOpcacity' has a wrong offset!");

}

