#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CatchingModule_BP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CatchingModule_BP.CatchingModule_BP_C
// 0x0088 (0x0528 - 0x04A0)
class ACatchingModule_BP_C : public APBCatchingModule
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_1_HookLaunchingTimeline_E025F2C74309CFCA9F31998F543173CF; // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_E025F2C74309CFCA9F31998F543173CF; // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_HookLaunchingTimeline_6885444748156552F1D28A97EE1FDA08; // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_6885444748156552F1D28A97EE1FDA08; // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SubAninmationClass;                                // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBAnimLinkSlot                               AnimLinkSlot;                                      // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBStateInHookUsing                           HookState;                                         // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HookSnapping_;                                     // 0x04D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHookUsing_;                                      // 0x04D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RaiseHand_;                                        // 0x04D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HookCaughtLocation;                                // 0x04D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UseGraple_AfterInterp;                             // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CurrentHookRope;                                // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_UpdateRopeEndLoc;                            // 0x04F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationToSet;                                     // 0x04F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxBeamCircleRadius;                               // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CurrentHookRope_TP;                             // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_UpdateRopeEndLoc_TP;                         // 0x0510(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bGrappleLaunched;                                  // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GrappleLocation;                                   // 0x051C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CatchingModule_BP(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Event_OnHookRecycleFinished_Multicast_();
	void Event_OnHookRecycleFinished_SERVER_();
	void Event_OnTPHookLaunching_Multicast_();
	void Event_OnTPHookLaunching_SERVER_();
	void K2_HookReset();
	void K2_HookRecycling();
	void K2_HookLocked();
	void K2_HookLaunching();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void LinkAnimationGraph();
	void UnLinkAnimationGraph();
	void InitHookRopeVFX();
	void SetHookLaunchingVFXParameters(float InAlpha);
	void SetHookTightVFXParameters(float InAlpha);
	void InitHookRopeVFXTP();
	void UpdateHookRopeEndLocation();
	void UpdateHookRopeEndLocation_TP();
	void DisableHookRopeVFX();
	void LaunchingGrapple();
	void RestoreGrapple();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CatchingModule_BP_C">();
	}
	static class ACatchingModule_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACatchingModule_BP_C>();
	}
};
static_assert(alignof(ACatchingModule_BP_C) == 0x000008, "Wrong alignment on ACatchingModule_BP_C");
static_assert(sizeof(ACatchingModule_BP_C) == 0x000528, "Wrong size on ACatchingModule_BP_C");
static_assert(offsetof(ACatchingModule_BP_C, UberGraphFrame) == 0x0004A0, "Member 'ACatchingModule_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, Timeline_1_HookLaunchingTimeline_E025F2C74309CFCA9F31998F543173CF) == 0x0004A8, "Member 'ACatchingModule_BP_C::Timeline_1_HookLaunchingTimeline_E025F2C74309CFCA9F31998F543173CF' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, Timeline_1__Direction_E025F2C74309CFCA9F31998F543173CF) == 0x0004AC, "Member 'ACatchingModule_BP_C::Timeline_1__Direction_E025F2C74309CFCA9F31998F543173CF' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, Timeline_1) == 0x0004B0, "Member 'ACatchingModule_BP_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, Timeline_0_HookLaunchingTimeline_6885444748156552F1D28A97EE1FDA08) == 0x0004B8, "Member 'ACatchingModule_BP_C::Timeline_0_HookLaunchingTimeline_6885444748156552F1D28A97EE1FDA08' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, Timeline_0__Direction_6885444748156552F1D28A97EE1FDA08) == 0x0004BC, "Member 'ACatchingModule_BP_C::Timeline_0__Direction_6885444748156552F1D28A97EE1FDA08' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, Timeline_0) == 0x0004C0, "Member 'ACatchingModule_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, SubAninmationClass) == 0x0004C8, "Member 'ACatchingModule_BP_C::SubAninmationClass' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, AnimLinkSlot) == 0x0004D0, "Member 'ACatchingModule_BP_C::AnimLinkSlot' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, HookState) == 0x0004D1, "Member 'ACatchingModule_BP_C::HookState' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, HookSnapping_) == 0x0004D2, "Member 'ACatchingModule_BP_C::HookSnapping_' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, IsHookUsing_) == 0x0004D3, "Member 'ACatchingModule_BP_C::IsHookUsing_' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, RaiseHand_) == 0x0004D4, "Member 'ACatchingModule_BP_C::RaiseHand_' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, HookCaughtLocation) == 0x0004D8, "Member 'ACatchingModule_BP_C::HookCaughtLocation' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, UseGraple_AfterInterp) == 0x0004E4, "Member 'ACatchingModule_BP_C::UseGraple_AfterInterp' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, NS_CurrentHookRope) == 0x0004E8, "Member 'ACatchingModule_BP_C::NS_CurrentHookRope' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, Timer_UpdateRopeEndLoc) == 0x0004F0, "Member 'ACatchingModule_BP_C::Timer_UpdateRopeEndLoc' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, LocationToSet) == 0x0004F8, "Member 'ACatchingModule_BP_C::LocationToSet' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, MaxBeamCircleRadius) == 0x000504, "Member 'ACatchingModule_BP_C::MaxBeamCircleRadius' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, NS_CurrentHookRope_TP) == 0x000508, "Member 'ACatchingModule_BP_C::NS_CurrentHookRope_TP' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, Timer_UpdateRopeEndLoc_TP) == 0x000510, "Member 'ACatchingModule_BP_C::Timer_UpdateRopeEndLoc_TP' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, bGrappleLaunched) == 0x000518, "Member 'ACatchingModule_BP_C::bGrappleLaunched' has a wrong offset!");
static_assert(offsetof(ACatchingModule_BP_C, GrappleLocation) == 0x00051C, "Member 'ACatchingModule_BP_C::GrappleLocation' has a wrong offset!");

}

