#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CatchingModule_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CatchingModule_BP.CatchingModule_BP_C.ExecuteUbergraph_CatchingModule_BP
// 0x003C (0x003C - 0x0000)
struct CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_4;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP) == 0x000004, "Wrong alignment on CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP");
static_assert(sizeof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP) == 0x00003C, "Wrong size on CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, EntryPoint) == 0x000000, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsLocallyControlled_ReturnValue) == 0x000005, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsValid_ReturnValue_2) == 0x000007, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000008, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x000009, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsValid_ReturnValue_3) == 0x00000A, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsLocallyControlled_ReturnValue_3) == 0x00000B, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsLocallyControlled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsValid_ReturnValue_4) == 0x00000C, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_GetActorForwardVector_ReturnValue) == 0x000010, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00001C, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_IsLocallyControlled_ReturnValue_4) == 0x000028, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_IsLocallyControlled_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP, CallFunc_Add_VectorVector_ReturnValue) == 0x000030, "Member 'CatchingModule_BP_C_ExecuteUbergraph_CatchingModule_BP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CatchingModule_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CatchingModule_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on CatchingModule_BP_C_ReceiveTick");
static_assert(sizeof(CatchingModule_BP_C_ReceiveTick) == 0x000004, "Wrong size on CatchingModule_BP_C_ReceiveTick");
static_assert(offsetof(CatchingModule_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CatchingModule_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.LinkAnimationGraph
// 0x0008 (0x0008 - 0x0000)
struct CatchingModule_BP_C_LinkAnimationGraph final
{
public:
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CatchingModule_BP_C_LinkAnimationGraph) == 0x000004, "Wrong alignment on CatchingModule_BP_C_LinkAnimationGraph");
static_assert(sizeof(CatchingModule_BP_C_LinkAnimationGraph) == 0x000008, "Wrong size on CatchingModule_BP_C_LinkAnimationGraph");
static_assert(offsetof(CatchingModule_BP_C_LinkAnimationGraph, CallFunc_MakeLiteralName_ReturnValue) == 0x000000, "Member 'CatchingModule_BP_C_LinkAnimationGraph::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.UnLinkAnimationGraph
// 0x0018 (0x0018 - 0x0000)
struct CatchingModule_BP_C_UnLinkAnimationGraph final
{
public:
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CatchingModule_BP_C_UnLinkAnimationGraph) == 0x000004, "Wrong alignment on CatchingModule_BP_C_UnLinkAnimationGraph");
static_assert(sizeof(CatchingModule_BP_C_UnLinkAnimationGraph) == 0x000018, "Wrong size on CatchingModule_BP_C_UnLinkAnimationGraph");
static_assert(offsetof(CatchingModule_BP_C_UnLinkAnimationGraph, CallFunc_GetEnumeratorName_ReturnValue) == 0x000000, "Member 'CatchingModule_BP_C_UnLinkAnimationGraph::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_UnLinkAnimationGraph, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x000008, "Member 'CatchingModule_BP_C_UnLinkAnimationGraph::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_UnLinkAnimationGraph, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'CatchingModule_BP_C_UnLinkAnimationGraph::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_UnLinkAnimationGraph, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000011, "Member 'CatchingModule_BP_C_UnLinkAnimationGraph::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_UnLinkAnimationGraph, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000012, "Member 'CatchingModule_BP_C_UnLinkAnimationGraph::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_UnLinkAnimationGraph, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'CatchingModule_BP_C_UnLinkAnimationGraph::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_UnLinkAnimationGraph, CallFunc_BooleanOR_ReturnValue_1) == 0x000014, "Member 'CatchingModule_BP_C_UnLinkAnimationGraph::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.InitHookRopeVFX
// 0x0020 (0x0020 - 0x0000)
struct CatchingModule_BP_C_InitHookRopeVFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CatchingModule_BP_C_InitHookRopeVFX) == 0x000008, "Wrong alignment on CatchingModule_BP_C_InitHookRopeVFX");
static_assert(sizeof(CatchingModule_BP_C_InitHookRopeVFX) == 0x000020, "Wrong size on CatchingModule_BP_C_InitHookRopeVFX");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CatchingModule_BP_C_InitHookRopeVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFX, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'CatchingModule_BP_C_InitHookRopeVFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFX, CallFunc_GetActorForwardVector_ReturnValue) == 0x000004, "Member 'CatchingModule_BP_C_InitHookRopeVFX::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFX, CallFunc_IsValid_ReturnValue_2) == 0x000010, "Member 'CatchingModule_BP_C_InitHookRopeVFX::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000018, "Member 'CatchingModule_BP_C_InitHookRopeVFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.SetHookLaunchingVFXParameters
// 0x0018 (0x0018 - 0x0000)
struct CatchingModule_BP_C_SetHookLaunchingVFXParameters final
{
public:
	float                                         InAlpha;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalAlpha;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CatchingModule_BP_C_SetHookLaunchingVFXParameters) == 0x000004, "Wrong alignment on CatchingModule_BP_C_SetHookLaunchingVFXParameters");
static_assert(sizeof(CatchingModule_BP_C_SetHookLaunchingVFXParameters) == 0x000018, "Wrong size on CatchingModule_BP_C_SetHookLaunchingVFXParameters");
static_assert(offsetof(CatchingModule_BP_C_SetHookLaunchingVFXParameters, InAlpha) == 0x000000, "Member 'CatchingModule_BP_C_SetHookLaunchingVFXParameters::InAlpha' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookLaunchingVFXParameters, LocalAlpha) == 0x000004, "Member 'CatchingModule_BP_C_SetHookLaunchingVFXParameters::LocalAlpha' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookLaunchingVFXParameters, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'CatchingModule_BP_C_SetHookLaunchingVFXParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookLaunchingVFXParameters, CallFunc_Lerp_ReturnValue) == 0x00000C, "Member 'CatchingModule_BP_C_SetHookLaunchingVFXParameters::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookLaunchingVFXParameters, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'CatchingModule_BP_C_SetHookLaunchingVFXParameters::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookLaunchingVFXParameters, CallFunc_Lerp_ReturnValue_2) == 0x000014, "Member 'CatchingModule_BP_C_SetHookLaunchingVFXParameters::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.SetHookTightVFXParameters
// 0x001C (0x001C - 0x0000)
struct CatchingModule_BP_C_SetHookTightVFXParameters final
{
public:
	float                                         InAlpha;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalAlpha;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CatchingModule_BP_C_SetHookTightVFXParameters) == 0x000004, "Wrong alignment on CatchingModule_BP_C_SetHookTightVFXParameters");
static_assert(sizeof(CatchingModule_BP_C_SetHookTightVFXParameters) == 0x00001C, "Wrong size on CatchingModule_BP_C_SetHookTightVFXParameters");
static_assert(offsetof(CatchingModule_BP_C_SetHookTightVFXParameters, InAlpha) == 0x000000, "Member 'CatchingModule_BP_C_SetHookTightVFXParameters::InAlpha' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookTightVFXParameters, LocalAlpha) == 0x000004, "Member 'CatchingModule_BP_C_SetHookTightVFXParameters::LocalAlpha' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookTightVFXParameters, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000008, "Member 'CatchingModule_BP_C_SetHookTightVFXParameters::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookTightVFXParameters, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'CatchingModule_BP_C_SetHookTightVFXParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookTightVFXParameters, CallFunc_Lerp_ReturnValue) == 0x00000C, "Member 'CatchingModule_BP_C_SetHookTightVFXParameters::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookTightVFXParameters, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'CatchingModule_BP_C_SetHookTightVFXParameters::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookTightVFXParameters, CallFunc_Lerp_ReturnValue_2) == 0x000014, "Member 'CatchingModule_BP_C_SetHookTightVFXParameters::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_SetHookTightVFXParameters, CallFunc_Lerp_ReturnValue_3) == 0x000018, "Member 'CatchingModule_BP_C_SetHookTightVFXParameters::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.InitHookRopeVFXTP
// 0x0020 (0x0020 - 0x0000)
struct CatchingModule_BP_C_InitHookRopeVFXTP final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CatchingModule_BP_C_InitHookRopeVFXTP) == 0x000008, "Wrong alignment on CatchingModule_BP_C_InitHookRopeVFXTP");
static_assert(sizeof(CatchingModule_BP_C_InitHookRopeVFXTP) == 0x000020, "Wrong size on CatchingModule_BP_C_InitHookRopeVFXTP");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFXTP, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CatchingModule_BP_C_InitHookRopeVFXTP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFXTP, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'CatchingModule_BP_C_InitHookRopeVFXTP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFXTP, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'CatchingModule_BP_C_InitHookRopeVFXTP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFXTP, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000008, "Member 'CatchingModule_BP_C_InitHookRopeVFXTP::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_InitHookRopeVFXTP, CallFunc_GetActorForwardVector_ReturnValue) == 0x000010, "Member 'CatchingModule_BP_C_InitHookRopeVFXTP::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.UpdateHookRopeEndLocation
// 0x0001 (0x0001 - 0x0000)
struct CatchingModule_BP_C_UpdateHookRopeEndLocation final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CatchingModule_BP_C_UpdateHookRopeEndLocation) == 0x000001, "Wrong alignment on CatchingModule_BP_C_UpdateHookRopeEndLocation");
static_assert(sizeof(CatchingModule_BP_C_UpdateHookRopeEndLocation) == 0x000001, "Wrong size on CatchingModule_BP_C_UpdateHookRopeEndLocation");
static_assert(offsetof(CatchingModule_BP_C_UpdateHookRopeEndLocation, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CatchingModule_BP_C_UpdateHookRopeEndLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.UpdateHookRopeEndLocation_TP
// 0x0001 (0x0001 - 0x0000)
struct CatchingModule_BP_C_UpdateHookRopeEndLocation_TP final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CatchingModule_BP_C_UpdateHookRopeEndLocation_TP) == 0x000001, "Wrong alignment on CatchingModule_BP_C_UpdateHookRopeEndLocation_TP");
static_assert(sizeof(CatchingModule_BP_C_UpdateHookRopeEndLocation_TP) == 0x000001, "Wrong size on CatchingModule_BP_C_UpdateHookRopeEndLocation_TP");
static_assert(offsetof(CatchingModule_BP_C_UpdateHookRopeEndLocation_TP, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CatchingModule_BP_C_UpdateHookRopeEndLocation_TP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.DisableHookRopeVFX
// 0x0004 (0x0004 - 0x0000)
struct CatchingModule_BP_C_DisableHookRopeVFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CatchingModule_BP_C_DisableHookRopeVFX) == 0x000001, "Wrong alignment on CatchingModule_BP_C_DisableHookRopeVFX");
static_assert(sizeof(CatchingModule_BP_C_DisableHookRopeVFX) == 0x000004, "Wrong size on CatchingModule_BP_C_DisableHookRopeVFX");
static_assert(offsetof(CatchingModule_BP_C_DisableHookRopeVFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CatchingModule_BP_C_DisableHookRopeVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_DisableHookRopeVFX, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'CatchingModule_BP_C_DisableHookRopeVFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_DisableHookRopeVFX, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000002, "Member 'CatchingModule_BP_C_DisableHookRopeVFX::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_DisableHookRopeVFX, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x000003, "Member 'CatchingModule_BP_C_DisableHookRopeVFX::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.LaunchingGrapple
// 0x0002 (0x0002 - 0x0000)
struct CatchingModule_BP_C_LaunchingGrapple final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CatchingModule_BP_C_LaunchingGrapple) == 0x000001, "Wrong alignment on CatchingModule_BP_C_LaunchingGrapple");
static_assert(sizeof(CatchingModule_BP_C_LaunchingGrapple) == 0x000002, "Wrong size on CatchingModule_BP_C_LaunchingGrapple");
static_assert(offsetof(CatchingModule_BP_C_LaunchingGrapple, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CatchingModule_BP_C_LaunchingGrapple::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_LaunchingGrapple, CallFunc_IsLocallyControlled_ReturnValue) == 0x000001, "Member 'CatchingModule_BP_C_LaunchingGrapple::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function CatchingModule_BP.CatchingModule_BP_C.RestoreGrapple
// 0x0002 (0x0002 - 0x0000)
struct CatchingModule_BP_C_RestoreGrapple final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CatchingModule_BP_C_RestoreGrapple) == 0x000001, "Wrong alignment on CatchingModule_BP_C_RestoreGrapple");
static_assert(sizeof(CatchingModule_BP_C_RestoreGrapple) == 0x000002, "Wrong size on CatchingModule_BP_C_RestoreGrapple");
static_assert(offsetof(CatchingModule_BP_C_RestoreGrapple, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CatchingModule_BP_C_RestoreGrapple::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CatchingModule_BP_C_RestoreGrapple, CallFunc_IsLocallyControlled_ReturnValue) == 0x000001, "Member 'CatchingModule_BP_C_RestoreGrapple::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

}

