#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ChatComponent.ChatComponent_C.ExecuteUbergraph_ChatComponent
// 0x0008 (0x0008 - 0x0000)
struct ChatComponent_C_ExecuteUbergraph_ChatComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatComponent_C_ExecuteUbergraph_ChatComponent) == 0x000004, "Wrong alignment on ChatComponent_C_ExecuteUbergraph_ChatComponent");
static_assert(sizeof(ChatComponent_C_ExecuteUbergraph_ChatComponent) == 0x000008, "Wrong size on ChatComponent_C_ExecuteUbergraph_ChatComponent");
static_assert(offsetof(ChatComponent_C_ExecuteUbergraph_ChatComponent, EntryPoint) == 0x000000, "Member 'ChatComponent_C_ExecuteUbergraph_ChatComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_ExecuteUbergraph_ChatComponent, K2Node_Event_EndPlayReason) == 0x000004, "Member 'ChatComponent_C_ExecuteUbergraph_ChatComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_ExecuteUbergraph_ChatComponent, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'ChatComponent_C_ExecuteUbergraph_ChatComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_ExecuteUbergraph_ChatComponent, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'ChatComponent_C_ExecuteUbergraph_ChatComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function ChatComponent.ChatComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct ChatComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on ChatComponent_C_ReceiveEndPlay");
static_assert(sizeof(ChatComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on ChatComponent_C_ReceiveEndPlay");
static_assert(offsetof(ChatComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'ChatComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function ChatComponent.ChatComponent_C.CreateChatInterFace
// 0x0030 (0x0030 - 0x0000)
struct ChatComponent_C_CreateChatInterFace final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ChatInterface_C*                   CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatComponent_C_CreateChatInterFace) == 0x000008, "Wrong alignment on ChatComponent_C_CreateChatInterFace");
static_assert(sizeof(ChatComponent_C_CreateChatInterFace) == 0x000030, "Wrong size on ChatComponent_C_CreateChatInterFace");
static_assert(offsetof(ChatComponent_C_CreateChatInterFace, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'ChatComponent_C_CreateChatInterFace::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_CreateChatInterFace, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ChatComponent_C_CreateChatInterFace::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_CreateChatInterFace, K2Node_DynamicCast_AsPlayer_Controller) == 0x000010, "Member 'ChatComponent_C_CreateChatInterFace::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_CreateChatInterFace, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ChatComponent_C_CreateChatInterFace::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_CreateChatInterFace, CallFunc_Create_ReturnValue) == 0x000020, "Member 'ChatComponent_C_CreateChatInterFace::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_CreateChatInterFace, CallFunc_IsLocalController_ReturnValue) == 0x000028, "Member 'ChatComponent_C_CreateChatInterFace::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");

// Function ChatComponent.ChatComponent_C.TestFunction
// 0x0038 (0x0038 - 0x0000)
struct ChatComponent_C_TestFunction final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ChatChild_C*                       CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatComponent_C_TestFunction) == 0x000008, "Wrong alignment on ChatComponent_C_TestFunction");
static_assert(sizeof(ChatComponent_C_TestFunction) == 0x000038, "Wrong size on ChatComponent_C_TestFunction");
static_assert(offsetof(ChatComponent_C_TestFunction, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'ChatComponent_C_TestFunction::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_TestFunction, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000008, "Member 'ChatComponent_C_TestFunction::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_TestFunction, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ChatComponent_C_TestFunction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_TestFunction, CallFunc_GetController_ReturnValue) == 0x000018, "Member 'ChatComponent_C_TestFunction::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_TestFunction, K2Node_DynamicCast_AsPlayer_Controller) == 0x000020, "Member 'ChatComponent_C_TestFunction::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_TestFunction, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'ChatComponent_C_TestFunction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ChatComponent_C_TestFunction, CallFunc_Create_ReturnValue) == 0x000030, "Member 'ChatComponent_C_TestFunction::CallFunc_Create_ReturnValue' has a wrong offset!");

}

