#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CountDown

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CountDown.CountDown_C.ExecuteUbergraph_CountDown
// 0x01E0 (0x01E0 - 0x0000)
struct CountDown_C_ExecuteUbergraph_CountDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBGameState*                           K2Node_DynamicCast_AsPBGame_State;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	int32                                         CallFunc_GetRemainingTime_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTimerPaused_ReturnValue;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBGameState*                           K2Node_DynamicCast_AsPBGame_State_1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APBCharacter*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamNum_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_3;            // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_4;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBGameState*                           K2Node_DynamicCast_AsPBGame_State_2;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0100(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0138(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0160(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           CallFunc_Array_Get_Item;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State_1;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInPlayerLifeStatus_ReturnValue;         // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamNum_ReturnValue_1;                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x019C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CountDown_C_ExecuteUbergraph_CountDown) == 0x000008, "Wrong alignment on CountDown_C_ExecuteUbergraph_CountDown");
static_assert(sizeof(CountDown_C_ExecuteUbergraph_CountDown) == 0x0001E0, "Wrong size on CountDown_C_ExecuteUbergraph_CountDown");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, EntryPoint) == 0x000000, "Member 'CountDown_C_ExecuteUbergraph_CountDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CountDown_C_ExecuteUbergraph_CountDown::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, Temp_int_Variable) == 0x000014, "Member 'CountDown_C_ExecuteUbergraph_CountDown::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Contains_ReturnValue) == 0x000030, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Contains_ReturnValue_1) == 0x000031, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_AsPBGame_State) == 0x000038, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_AsPBGame_State' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000041, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000042, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000043, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000044, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_GetRemainingTime_ReturnValue) == 0x000060, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_GetRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_IsTimerPaused_ReturnValue) == 0x000064, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_IsTimerPaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_GetGameState_ReturnValue_1) == 0x000068, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_AsPBGame_State_1) == 0x000070, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_AsPBGame_State_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_GetAllActorsOfClass_OutActors) == 0x000080, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Conv_IntToString_ReturnValue) == 0x000098, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B8, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_AsPBPlayer_State) == 0x0000C0, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_GetTeamNum_ReturnValue) == 0x0000CC, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000D4, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0000D8, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x0000D9, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_BooleanOR_ReturnValue) == 0x0000DA, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_NotEqual_IntInt_ReturnValue_3) == 0x0000DB, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_NotEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_NotEqual_IntInt_ReturnValue_4) == 0x0000DC, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_NotEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_GetGameState_ReturnValue_2) == 0x0000E0, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_BooleanAND_ReturnValue) == 0x0000E8, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_AsPBGame_State_2) == 0x0000F0, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_AsPBGame_State_2' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x0000F9, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_MakeLiteralText_ReturnValue) == 0x000100, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Conv_TextToString_ReturnValue) == 0x000118, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Concat_StrStr_ReturnValue) == 0x000128, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000138, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000150, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Conv_StringToText_ReturnValue) == 0x000160, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, Temp_int_Array_Index_Variable) == 0x000178, "Member 'CountDown_C_ExecuteUbergraph_CountDown::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, Temp_int_Variable_1) == 0x00017C, "Member 'CountDown_C_ExecuteUbergraph_CountDown::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Array_Get_Item) == 0x000180, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_AsPBPlayer_State_1) == 0x000188, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_AsPBPlayer_State_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_DynamicCast_bSuccess_4) == 0x000190, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_IsInPlayerLifeStatus_ReturnValue) == 0x000191, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_IsInPlayerLifeStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_GetTeamNum_ReturnValue_1) == 0x000194, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_GetTeamNum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000198, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_Event_MyGeometry) == 0x00019C, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, K2Node_Event_InDeltaTime) == 0x0001D4, "Member 'CountDown_C_ExecuteUbergraph_CountDown::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(CountDown_C_ExecuteUbergraph_CountDown, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001D8, "Member 'CountDown_C_ExecuteUbergraph_CountDown::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function CountDown.CountDown_C.Tick
// 0x003C (0x003C - 0x0000)
struct CountDown_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CountDown_C_Tick) == 0x000004, "Wrong alignment on CountDown_C_Tick");
static_assert(sizeof(CountDown_C_Tick) == 0x00003C, "Wrong size on CountDown_C_Tick");
static_assert(offsetof(CountDown_C_Tick, MyGeometry) == 0x000000, "Member 'CountDown_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CountDown_C_Tick, InDeltaTime) == 0x000038, "Member 'CountDown_C_Tick::InDeltaTime' has a wrong offset!");

// Function CountDown.CountDown_C.ShowVS
// 0x0108 (0x0108 - 0x0000)
struct CountDown_C_ShowVS final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0058(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
};
static_assert(alignof(CountDown_C_ShowVS) == 0x000008, "Wrong alignment on CountDown_C_ShowVS");
static_assert(sizeof(CountDown_C_ShowVS) == 0x000108, "Wrong size on CountDown_C_ShowVS");
static_assert(offsetof(CountDown_C_ShowVS, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'CountDown_C_ShowVS::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ShowVS, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'CountDown_C_ShowVS::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CountDown_C_ShowVS, K2Node_MakeStruct_FormatArgumentData_1) == 0x000058, "Member 'CountDown_C_ShowVS::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CountDown_C_ShowVS, K2Node_MakeStruct_FormatArgumentData_2) == 0x000098, "Member 'CountDown_C_ShowVS::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CountDown_C_ShowVS, K2Node_MakeArray_Array) == 0x0000D8, "Member 'CountDown_C_ShowVS::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CountDown_C_ShowVS, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'CountDown_C_ShowVS::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_ShowVS, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'CountDown_C_ShowVS::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function CountDown.CountDown_C.CommanderSoundEvent
// 0x0080 (0x0080 - 0x0000)
struct CountDown_C_CommanderSoundEvent final
{
public:
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInPlayerLifeStatus_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP_1;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State_1;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInPlayerLifeStatus_ReturnValue_1;       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CountDown_C_CommanderSoundEvent) == 0x000008, "Wrong alignment on CountDown_C_CommanderSoundEvent");
static_assert(sizeof(CountDown_C_CommanderSoundEvent) == 0x000080, "Wrong size on CountDown_C_CommanderSoundEvent");
static_assert(offsetof(CountDown_C_CommanderSoundEvent, CallFunc_Greater_IntInt_ReturnValue) == 0x000000, "Member 'CountDown_C_CommanderSoundEvent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_CommanderSoundEvent, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'CountDown_C_CommanderSoundEvent::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountDown_C_CommanderSoundEvent, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'CountDown_C_CommanderSoundEvent::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
