#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CountDown

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CountDown.CountDown_C
// 0x0078 (0x02D8 - 0x0260)
class UCountDown_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_VS;                                           // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TextOpacity;                                       // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_CountDown;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RoundNum;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_VS;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         WaitTime;                                          // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline;                                          // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxFontSize;                                       // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScaleRate;                                         // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinFontSize;                                       // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFont*                                  Font;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MyTeamNum;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherTeamNum;                                      // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempMyTeamNum;                                     // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempOtherTeamNum;                                  // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxMyTeamAlive;                                    // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CommanderYouAreLastOneDoOnce;                      // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxOtherTeamAlive;                                 // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CommanderOtherTeamLastOneDoOnce;                   // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CommanderOtherTeamMoreThanOurTeamDoOnce;           // 0x02D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CountDown(int32 EntryPoint);
	void EventVSUpdate();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ShowVS();
	void CommanderSoundEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CountDown_C">();
	}
	static class UCountDown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCountDown_C>();
	}
};
static_assert(alignof(UCountDown_C) == 0x000008, "Wrong alignment on UCountDown_C");
static_assert(sizeof(UCountDown_C) == 0x0002D8, "Wrong size on UCountDown_C");
static_assert(offsetof(UCountDown_C, UberGraphFrame) == 0x000260, "Member 'UCountDown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCountDown_C, NewAnimation) == 0x000268, "Member 'UCountDown_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UCountDown_C, Anim_VS) == 0x000270, "Member 'UCountDown_C::Anim_VS' has a wrong offset!");
static_assert(offsetof(UCountDown_C, TextOpacity) == 0x000278, "Member 'UCountDown_C::TextOpacity' has a wrong offset!");
static_assert(offsetof(UCountDown_C, Text_CountDown) == 0x000280, "Member 'UCountDown_C::Text_CountDown' has a wrong offset!");
static_assert(offsetof(UCountDown_C, TextBlock_RoundNum) == 0x000288, "Member 'UCountDown_C::TextBlock_RoundNum' has a wrong offset!");
static_assert(offsetof(UCountDown_C, TextBlock_VS) == 0x000290, "Member 'UCountDown_C::TextBlock_VS' has a wrong offset!");
static_assert(offsetof(UCountDown_C, WaitTime) == 0x000298, "Member 'UCountDown_C::WaitTime' has a wrong offset!");
static_assert(offsetof(UCountDown_C, Timeline) == 0x00029C, "Member 'UCountDown_C::Timeline' has a wrong offset!");
static_assert(offsetof(UCountDown_C, MaxFontSize) == 0x0002A0, "Member 'UCountDown_C::MaxFontSize' has a wrong offset!");
static_assert(offsetof(UCountDown_C, ScaleRate) == 0x0002A4, "Member 'UCountDown_C::ScaleRate' has a wrong offset!");
static_assert(offsetof(UCountDown_C, MinFontSize) == 0x0002A8, "Member 'UCountDown_C::MinFontSize' has a wrong offset!");
static_assert(offsetof(UCountDown_C, Font) == 0x0002B0, "Member 'UCountDown_C::Font' has a wrong offset!");
static_assert(offsetof(UCountDown_C, MyTeamNum) == 0x0002B8, "Member 'UCountDown_C::MyTeamNum' has a wrong offset!");
static_assert(offsetof(UCountDown_C, OtherTeamNum) == 0x0002BC, "Member 'UCountDown_C::OtherTeamNum' has a wrong offset!");
static_assert(offsetof(UCountDown_C, TempMyTeamNum) == 0x0002C0, "Member 'UCountDown_C::TempMyTeamNum' has a wrong offset!");
static_assert(offsetof(UCountDown_C, TempOtherTeamNum) == 0x0002C4, "Member 'UCountDown_C::TempOtherTeamNum' has a wrong offset!");
static_assert(offsetof(UCountDown_C, MaxMyTeamAlive) == 0x0002C8, "Member 'UCountDown_C::MaxMyTeamAlive' has a wrong offset!");
static_assert(offsetof(UCountDown_C, CommanderYouAreLastOneDoOnce) == 0x0002CC, "Member 'UCountDown_C::CommanderYouAreLastOneDoOnce' has a wrong offset!");
static_assert(offsetof(UCountDown_C, MaxOtherTeamAlive) == 0x0002D0, "Member 'UCountDown_C::MaxOtherTeamAlive' has a wrong offset!");
static_assert(offsetof(UCountDown_C, CommanderOtherTeamLastOneDoOnce) == 0x0002D4, "Member 'UCountDown_C::CommanderOtherTeamLastOneDoOnce' has a wrong offset!");
static_assert(offsetof(UCountDown_C, CommanderOtherTeamMoreThanOurTeamDoOnce) == 0x0002D5, "Member 'UCountDown_C::CommanderOtherTeamMoreThanOurTeamDoOnce' has a wrong offset!");

}

