#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CSTM_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function CSTM_Base.CSTM_Base_C.ExecuteUbergraph_CSTM_Base
// 0x0228 (0x0228 - 0x0000)
struct CSTM_Base_C_ExecuteUbergraph_CSTM_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           CallFunc_GetPawnOwner_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNetMass_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InCurrentAmmo;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCurrentAmmoInClip;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_5;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           CallFunc_GetPawnOwner_ReturnValue_1;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APBWeapon*>                      CallFunc_GetWeaponArray_ReturnValue;               // 0x0078(0x0010)(ReferenceParm)
	class APBWeapon*                              CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon*                              CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           CallFunc_GetPawnOwner_ReturnValue_2;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APBWeapon*>                      CallFunc_GetWeaponArray_ReturnValue_1;             // 0x00B0(0x0010)(ReferenceParm)
	class APBWeapon*                              CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon*                              CallFunc_GetCurrentWeapon_ReturnValue_1;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           CallFunc_GetPawnOwner_ReturnValue_3;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APBWeapon*>                      CallFunc_GetWeaponArray_ReturnValue_2;             // 0x00E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBWeapon*                              CallFunc_Array_Get_Item_2;                         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_6;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_7;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           CallFunc_GetPawnOwner_ReturnValue_4;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children_1;         // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_3;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           CallFunc_GetPawnOwner_ReturnValue_5;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_4;        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_4;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component_1;    // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        K2Node_Event_DirArray;                             // 0x01E0(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                K2Node_Event_Origin;                               // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentFatigue_ReturnValue;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeployed_ReturnValue;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base) == 0x000008, "Wrong alignment on CSTM_Base_C_ExecuteUbergraph_CSTM_Base");
static_assert(sizeof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base) == 0x000228, "Wrong size on CSTM_Base_C_ExecuteUbergraph_CSTM_Base");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, EntryPoint) == 0x000000, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetPawnOwner_ReturnValue) == 0x000008, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetNetMass_ReturnValue) == 0x000014, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetNetMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000024, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_SpawnSound2D_ReturnValue) == 0x000028, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Clamp_ReturnValue) == 0x000030, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsLocalController_ReturnValue) == 0x000040, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, K2Node_Event_InCurrentAmmo) == 0x000044, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::K2Node_Event_InCurrentAmmo' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, K2Node_Event_InCurrentAmmoInClip) == 0x000048, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::K2Node_Event_InCurrentAmmoInClip' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00004C, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000050, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000054, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000058, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Conv_IntToFloat_ReturnValue_4) == 0x00005C, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Conv_IntToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Conv_IntToFloat_ReturnValue_5) == 0x000060, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Conv_IntToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetPawnOwner_ReturnValue_1) == 0x000068, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetWeaponArray_ReturnValue) == 0x000078, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetWeaponArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Array_Get_Item) == 0x000088, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000090, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsLocallyControlled_ReturnValue) == 0x000098, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000099, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00009A, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetPawnOwner_ReturnValue_2) == 0x0000A0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetPawnOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_3) == 0x0000A8, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetWeaponArray_ReturnValue_1) == 0x0000B0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetWeaponArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetCurrentWeapon_ReturnValue_1) == 0x0000C8, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetCurrentWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0000D0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0000D1, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x0000D2, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetPawnOwner_ReturnValue_3) == 0x0000D8, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetPawnOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetWeaponArray_ReturnValue_2) == 0x0000E0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetWeaponArray_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x0000F0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Array_Get_Item_2) == 0x0000F8, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x000100, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Conv_IntToFloat_ReturnValue_6) == 0x000104, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Conv_IntToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Conv_IntToFloat_ReturnValue_7) == 0x000108, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Conv_IntToFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetPawnOwner_ReturnValue_4) == 0x000110, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetPawnOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsLocallyControlled_ReturnValue_3) == 0x000118, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsLocallyControlled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000120, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, K2Node_Event_EndPlayReason) == 0x000128, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, Temp_int_Array_Index_Variable) == 0x00012C, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_4) == 0x000130, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetChildrenComponents_Children) == 0x000138, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetChildrenComponents_Children_1) == 0x000148, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetChildrenComponents_Children_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Array_Get_Item_3) == 0x000158, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000168, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Array_Length_ReturnValue_1) == 0x000174, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetAnimInstance_ReturnValue) == 0x000178, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_5) == 0x000181, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000188, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000190, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_6) == 0x000198, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_7) == 0x000199, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetPawnOwner_ReturnValue_5) == 0x0001A0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetPawnOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsLocallyControlled_ReturnValue_4) == 0x0001A8, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsLocallyControlled_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_8) == 0x0001A9, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, Temp_int_Array_Index_Variable_1) == 0x0001AC, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_HasAuthority_ReturnValue) == 0x0001B0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Array_Get_Item_4) == 0x0001B8, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, K2Node_DynamicCast_AsSkeletal_Mesh_Component_1) == 0x0001C0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::K2Node_DynamicCast_AsSkeletal_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetAnimInstance_ReturnValue_3) == 0x0001D0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_9) == 0x0001D8, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, K2Node_Event_DirArray) == 0x0001E0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::K2Node_Event_DirArray' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, K2Node_Event_Origin) == 0x0001F0, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::K2Node_Event_Origin' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsValid_ReturnValue_10) == 0x0001FC, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetCurrentFatigue_ReturnValue) == 0x000200, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetCurrentFatigue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_GetVectorValue_ReturnValue) == 0x000204, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_IsDeployed_ReturnValue) == 0x000210, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_IsDeployed_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, Temp_int_Loop_Counter_Variable_1) == 0x000214, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Less_IntInt_ReturnValue_1) == 0x000218, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_Add_IntInt_ReturnValue_1) == 0x00021C, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000220, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ExecuteUbergraph_CSTM_Base, CallFunc_BooleanAND_ReturnValue) == 0x000221, "Member 'CSTM_Base_C_ExecuteUbergraph_CSTM_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CSTM_Base.CSTM_Base_C.K2_PlayerFireProjectile
// 0x0020 (0x0020 - 0x0000)
struct CSTM_Base_C_K2_PlayerFireProjectile final
{
public:
	TArray<struct FVector>                        DirArray;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Origin;                                            // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CSTM_Base_C_K2_PlayerFireProjectile) == 0x000008, "Wrong alignment on CSTM_Base_C_K2_PlayerFireProjectile");
static_assert(sizeof(CSTM_Base_C_K2_PlayerFireProjectile) == 0x000020, "Wrong size on CSTM_Base_C_K2_PlayerFireProjectile");
static_assert(offsetof(CSTM_Base_C_K2_PlayerFireProjectile, DirArray) == 0x000000, "Member 'CSTM_Base_C_K2_PlayerFireProjectile::DirArray' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_K2_PlayerFireProjectile, Origin) == 0x000010, "Member 'CSTM_Base_C_K2_PlayerFireProjectile::Origin' has a wrong offset!");

// Function CSTM_Base.CSTM_Base_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct CSTM_Base_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CSTM_Base_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on CSTM_Base_C_ReceiveEndPlay");
static_assert(sizeof(CSTM_Base_C_ReceiveEndPlay) == 0x000001, "Wrong size on CSTM_Base_C_ReceiveEndPlay");
static_assert(offsetof(CSTM_Base_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'CSTM_Base_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function CSTM_Base.CSTM_Base_C.K2_UpdateCurrentAmmoInClip
// 0x0004 (0x0004 - 0x0000)
struct CSTM_Base_C_K2_UpdateCurrentAmmoInClip final
{
public:
	int32                                         InCurrentAmmoInClip;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CSTM_Base_C_K2_UpdateCurrentAmmoInClip) == 0x000004, "Wrong alignment on CSTM_Base_C_K2_UpdateCurrentAmmoInClip");
static_assert(sizeof(CSTM_Base_C_K2_UpdateCurrentAmmoInClip) == 0x000004, "Wrong size on CSTM_Base_C_K2_UpdateCurrentAmmoInClip");
static_assert(offsetof(CSTM_Base_C_K2_UpdateCurrentAmmoInClip, InCurrentAmmoInClip) == 0x000000, "Member 'CSTM_Base_C_K2_UpdateCurrentAmmoInClip::InCurrentAmmoInClip' has a wrong offset!");

// Function CSTM_Base.CSTM_Base_C.K2_UpdateCurrentAmmo
// 0x0004 (0x0004 - 0x0000)
struct CSTM_Base_C_K2_UpdateCurrentAmmo final
{
public:
	int32                                         InCurrentAmmo;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CSTM_Base_C_K2_UpdateCurrentAmmo) == 0x000004, "Wrong alignment on CSTM_Base_C_K2_UpdateCurrentAmmo");
static_assert(sizeof(CSTM_Base_C_K2_UpdateCurrentAmmo) == 0x000004, "Wrong size on CSTM_Base_C_K2_UpdateCurrentAmmo");
static_assert(offsetof(CSTM_Base_C_K2_UpdateCurrentAmmo, InCurrentAmmo) == 0x000000, "Member 'CSTM_Base_C_K2_UpdateCurrentAmmo::InCurrentAmmo' has a wrong offset!");

// Function CSTM_Base.CSTM_Base_C.ConvertToLocalLocationOffset
// 0x0100 (0x0100 - 0x0000)
struct CSTM_Base_C_ConvertToLocalLocationOffset final
{
public:
	struct FVector                                FromWorldLocation;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ToWorldLocation;                                   // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ReferanceObject;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebugInfo;                                     // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugMSG;                                          // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           DebugMSG_Color;                                    // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalLocationOffset;                               // 0x0048(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CSTM_Base_C_ConvertToLocalLocationOffset) == 0x000008, "Wrong alignment on CSTM_Base_C_ConvertToLocalLocationOffset");
static_assert(sizeof(CSTM_Base_C_ConvertToLocalLocationOffset) == 0x000100, "Wrong size on CSTM_Base_C_ConvertToLocalLocationOffset");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, FromWorldLocation) == 0x000000, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::FromWorldLocation' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, ToWorldLocation) == 0x00000C, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::ToWorldLocation' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, ReferanceObject) == 0x000018, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::ReferanceObject' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, DrawDebugInfo) == 0x000020, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::DrawDebugInfo' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, DebugMSG) == 0x000028, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::DebugMSG' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, DebugMSG_Color) == 0x000038, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::DebugMSG_Color' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, LocalLocationOffset) == 0x000048, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::LocalLocationOffset' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000054, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_GetUpVector_ReturnValue) == 0x000070, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_GetForwardVector_ReturnValue) == 0x00007C, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Dot_VectorVector_ReturnValue) == 0x000088, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x00008C, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000090, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_GetRightVector_ReturnValue) == 0x00009C, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A8, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Dot_VectorVector_ReturnValue_2) == 0x0000B4, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Dot_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B8, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000BC, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_MakeVector_ReturnValue) == 0x0000C8, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000D4, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Conv_VectorToString_ReturnValue) == 0x0000E0, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSTM_Base_C_ConvertToLocalLocationOffset, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F0, "Member 'CSTM_Base_C_ConvertToLocalLocationOffset::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function CSTM_Base.CSTM_Base_C.DecidePartInstallOffsetAndPartSettings
// 0x0410 (0x0410 - 0x0000)
struct CSTM_Base_C_DecidePartInstallOffsetAndPartSettings final
{
public:
	class UMeshComponent*                         SGTO_3P;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         SGTO_1P;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         SGTI_3P;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         SGTI_1P;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         LocalUpper_3P;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         LocalUpper_1P;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Local_BRL_ForeEnd_3P;                              // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Local_URCVR_ForeEnd_3P;                            // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalHaveURCVR;                                    // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalHaveBRL;                                      // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         LocalMuzzle_3P;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         LocalBarrel_3P;                                    // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Local_BRL_ForEnd_1P;                               // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Local_URCVR_ForEnd_1P;                             // 0x006C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         LocalMuzzle_1P;                                    // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         LocalBarrel_1P;                                    // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue_1;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBPartSlotType                               Temp_byte_Variable;                                // 0x00A9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBPartSlotType                               Temp_byte_Variable_1;                              // 0x0137(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBWeaponPartManager*                   CallFunc_GetWeaponPartMgr_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBPartSlotType, class UPartDataHolderComponent*> CallFunc_GetWeaponSlotPartMap_ReturnValue;         // 0x0150(0x0050)(ContainsInstancedReference)
	class UPartDataHolderComponent*               CallFunc_Map_Find_Value;                           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
