#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CstmFunctionLibrary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CstmFunctionLibrary.CstmFunctionLibrary_C.3ChannelRandomize
// 0x0058 (0x0058 - 0x0000)
struct CstmFunctionLibrary_C_ThreeChannelRandomize final
{
public:
	float                                         F0;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         F1;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         F2;                                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomRange;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Channel0;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Channel1;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Channel2;                                          // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CstmFunctionLibrary_C_ThreeChannelRandomize) == 0x000008, "Wrong alignment on CstmFunctionLibrary_C_ThreeChannelRandomize");
static_assert(sizeof(CstmFunctionLibrary_C_ThreeChannelRandomize) == 0x000058, "Wrong size on CstmFunctionLibrary_C_ThreeChannelRandomize");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, F0) == 0x000000, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::F0' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, F1) == 0x000004, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::F1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, F2) == 0x000008, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::F2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, RandomRange) == 0x00000C, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::RandomRange' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, __WorldContext) == 0x000010, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::__WorldContext' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, Channel0) == 0x000018, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::Channel0' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, Channel1) == 0x00001C, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::Channel1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, Channel2) == 0x000020, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::Channel2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000030, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000038, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00003C, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000040, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_RandomFloatInRange_ReturnValue) == 0x000044, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000048, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x00004C, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_ThreeChannelRandomize, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000050, "Member 'CstmFunctionLibrary_C_ThreeChannelRandomize::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");

// Function CstmFunctionLibrary.CstmFunctionLibrary_C.FreeCameraInput
// 0x0048 (0x0048 - 0x0000)
struct CstmFunctionLibrary_C_FreeCameraInput final
{
public:
	float                                         Input;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InputScale;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ResultToAddSelf;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LimitThreshold;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NagitiveInput;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoLimit;                                           // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CstmFunctionLibrary_C_FreeCameraInput) == 0x000008, "Wrong alignment on CstmFunctionLibrary_C_FreeCameraInput");
static_assert(sizeof(CstmFunctionLibrary_C_FreeCameraInput) == 0x000048, "Wrong size on CstmFunctionLibrary_C_FreeCameraInput");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, Input) == 0x000000, "Member 'CstmFunctionLibrary_C_FreeCameraInput::Input' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, InputScale) == 0x000004, "Member 'CstmFunctionLibrary_C_FreeCameraInput::InputScale' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, ResultToAddSelf) == 0x000008, "Member 'CstmFunctionLibrary_C_FreeCameraInput::ResultToAddSelf' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, LimitThreshold) == 0x00000C, "Member 'CstmFunctionLibrary_C_FreeCameraInput::LimitThreshold' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, NagitiveInput) == 0x000010, "Member 'CstmFunctionLibrary_C_FreeCameraInput::NagitiveInput' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, NoLimit) == 0x000011, "Member 'CstmFunctionLibrary_C_FreeCameraInput::NoLimit' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, __WorldContext) == 0x000018, "Member 'CstmFunctionLibrary_C_FreeCameraInput::__WorldContext' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, ReturnValue) == 0x000020, "Member 'CstmFunctionLibrary_C_FreeCameraInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'CstmFunctionLibrary_C_FreeCameraInput::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000028, "Member 'CstmFunctionLibrary_C_FreeCameraInput::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'CstmFunctionLibrary_C_FreeCameraInput::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000030, "Member 'CstmFunctionLibrary_C_FreeCameraInput::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000034, "Member 'CstmFunctionLibrary_C_FreeCameraInput::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000038, "Member 'CstmFunctionLibrary_C_FreeCameraInput::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, CallFunc_FClamp_ReturnValue) == 0x00003C, "Member 'CstmFunctionLibrary_C_FreeCameraInput::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_FreeCameraInput, CallFunc_FClamp_ReturnValue_1) == 0x000040, "Member 'CstmFunctionLibrary_C_FreeCameraInput::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");

// Function CstmFunctionLibrary.CstmFunctionLibrary_C.SphereTraceAlongCone
// 0x01F8 (0x01F8 - 0x0000)
struct CstmFunctionLibrary_C_SphereTraceAlongCone final
{
public:
	int32                                         LoopTimes;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ForewardVec;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceStart;                                        // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FOV;                                               // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitialTraceStep;                                  // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebugInfo;                                     // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DrawSphere;                                        // 0x0025(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DebugRightVec;                                     // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugDrawTime;                                     // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DebugSphereRotation;                               // 0x0038(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalSide;                                         // 0x0050(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       Sphere;                                            // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Local_a;                                           // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalLoc;                                          // 0x006C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalFOV;                                          // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalStep;                                         // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalFront;                                        // 0x0080(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalLoopTimes;                                    // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegTan_ReturnValue;                       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0138(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0154(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CstmFunctionLibrary_C_SphereTraceAlongCone) == 0x000008, "Wrong alignment on CstmFunctionLibrary_C_SphereTraceAlongCone");
static_assert(sizeof(CstmFunctionLibrary_C_SphereTraceAlongCone) == 0x0001F8, "Wrong size on CstmFunctionLibrary_C_SphereTraceAlongCone");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, LoopTimes) == 0x000000, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::LoopTimes' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, ForewardVec) == 0x000004, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::ForewardVec' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, TraceStart) == 0x000010, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::TraceStart' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, FOV) == 0x00001C, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::FOV' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, InitialTraceStep) == 0x000020, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::InitialTraceStep' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, DrawDebugInfo) == 0x000024, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::DrawDebugInfo' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, DrawSphere) == 0x000025, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::DrawSphere' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, DebugRightVec) == 0x000028, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::DebugRightVec' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, DebugDrawTime) == 0x000034, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::DebugDrawTime' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, DebugSphereRotation) == 0x000038, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::DebugSphereRotation' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, __WorldContext) == 0x000048, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::__WorldContext' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, LocalSide) == 0x000050, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::LocalSide' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, Sphere) == 0x000060, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::Sphere' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, Local_a) == 0x000068, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::Local_a' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, LocalLoc) == 0x00006C, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::LocalLoc' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, LocalFOV) == 0x000078, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::LocalFOV' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, LocalStep) == 0x00007C, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::LocalStep' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, LocalFront) == 0x000080, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::LocalFront' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, LocalLoopTimes) == 0x00008C, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::LocalLoopTimes' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_SelectFloat_ReturnValue) == 0x000094, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000098, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Subtract_IntInt_ReturnValue) == 0x00009C, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A0, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Add_VectorVector_ReturnValue) == 0x0000AC, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B8, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000BC, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C0, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_SelectInt_ReturnValue) == 0x0000C4, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000C8, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000CC, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D8, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000DC, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000E0, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0000EC, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_DegTan_ReturnValue) == 0x0000F8, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_DegTan_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x0000FC, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_VSize_ReturnValue) == 0x000108, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00010C, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000118, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Add_VectorVector_ReturnValue_2) == 0x00011C, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000128, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, Temp_object_Variable) == 0x000138, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x000148, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_SphereTraceSingle_OutHit) == 0x000154, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_SphereTraceSingle_ReturnValue) == 0x0001DC, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0001E0, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, Temp_int_Variable) == 0x0001EC, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001F0, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001F1, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_SphereTraceAlongCone, CallFunc_Add_IntInt_ReturnValue) == 0x0001F4, "Member 'CstmFunctionLibrary_C_SphereTraceAlongCone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function CstmFunctionLibrary.CstmFunctionLibrary_C.GetRoleSlotTypeName
// 0x00F0 (0x00F0 - 0x0000)
struct CstmFunctionLibrary_C_GetRoleSlotTypeName final
{
public:
	EPBCharacterSlotType                          RoleSlotType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutText;                                           // 0x0010(0x0018)(Parm, OutParm)
	EPBCharacterSlotType                          Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00C0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0018)()
};
static_assert(alignof(CstmFunctionLibrary_C_GetRoleSlotTypeName) == 0x000008, "Wrong alignment on CstmFunctionLibrary_C_GetRoleSlotTypeName");
static_assert(sizeof(CstmFunctionLibrary_C_GetRoleSlotTypeName) == 0x0000F0, "Wrong size on CstmFunctionLibrary_C_GetRoleSlotTypeName");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, RoleSlotType) == 0x000000, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::RoleSlotType' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, __WorldContext) == 0x000008, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::__WorldContext' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, OutText) == 0x000010, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::OutText' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, Temp_byte_Variable) == 0x000028, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, Temp_text_Variable) == 0x000030, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, Temp_text_Variable_1) == 0x000048, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, Temp_text_Variable_2) == 0x000060, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, Temp_text_Variable_3) == 0x000078, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, Temp_text_Variable_4) == 0x000090, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, Temp_text_Variable_5) == 0x0000A8, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, Temp_text_Variable_6) == 0x0000C0, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetRoleSlotTypeName, K2Node_Select_Default) == 0x0000D8, "Member 'CstmFunctionLibrary_C_GetRoleSlotTypeName::K2Node_Select_Default' has a wrong offset!");

// Function CstmFunctionLibrary.CstmFunctionLibrary_C.GetWeaponAttachmentSlotTypeName
// 0x0198 (0x0198 - 0x0000)
struct CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName final
{
public:
	EPBPartSlotType                               WeaponAttachmentSlotTypeName;                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TypeName;                                          // 0x0010(0x0018)(Parm, OutParm)
	EPBPartSlotType                               Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00C0(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00F0(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0108(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0120(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0168(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0180(0x0018)()
};
static_assert(alignof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName) == 0x000008, "Wrong alignment on CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName");
static_assert(sizeof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName) == 0x000198, "Wrong size on CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, WeaponAttachmentSlotTypeName) == 0x000000, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::WeaponAttachmentSlotTypeName' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, __WorldContext) == 0x000008, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::__WorldContext' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, TypeName) == 0x000010, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::TypeName' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_byte_Variable) == 0x000028, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable) == 0x000030, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_1) == 0x000048, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_2) == 0x000060, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_3) == 0x000078, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_4) == 0x000090, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_5) == 0x0000A8, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_6) == 0x0000C0, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_7) == 0x0000D8, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_8) == 0x0000F0, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_9) == 0x000108, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_10) == 0x000120, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_11) == 0x000138, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_12) == 0x000150, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, Temp_text_Variable_13) == 0x000168, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName, K2Node_Select_Default) == 0x000180, "Member 'CstmFunctionLibrary_C_GetWeaponAttachmentSlotTypeName::K2Node_Select_Default' has a wrong offset!");

// Function CstmFunctionLibrary.CstmFunctionLibrary_C.GetTeamName
// 0x00A8 (0x00A8 - 0x0000)
struct CstmFunctionLibrary_C_GetTeamName final
{
public:
	EPBTeam                                       TeamName;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0010(0x0018)(Parm, OutParm)
	EPBTeam                                       Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0090(0x0018)()
};
static_assert(alignof(CstmFunctionLibrary_C_GetTeamName) == 0x000008, "Wrong alignment on CstmFunctionLibrary_C_GetTeamName");
static_assert(sizeof(CstmFunctionLibrary_C_GetTeamName) == 0x0000A8, "Wrong size on CstmFunctionLibrary_C_GetTeamName");
static_assert(offsetof(CstmFunctionLibrary_C_GetTeamName, TeamName) == 0x000000, "Member 'CstmFunctionLibrary_C_GetTeamName::TeamName' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetTeamName, __WorldContext) == 0x000008, "Member 'CstmFunctionLibrary_C_GetTeamName::__WorldContext' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetTeamName, Name_0) == 0x000010, "Member 'CstmFunctionLibrary_C_GetTeamName::Name_0' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetTeamName, Temp_byte_Variable) == 0x000028, "Member 'CstmFunctionLibrary_C_GetTeamName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetTeamName, Temp_text_Variable) == 0x000030, "Member 'CstmFunctionLibrary_C_GetTeamName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetTeamName, Temp_text_Variable_1) == 0x000048, "Member 'CstmFunctionLibrary_C_GetTeamName::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetTeamName, Temp_text_Variable_2) == 0x000060, "Member 'CstmFunctionLibrary_C_GetTeamName::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetTeamName, Temp_text_Variable_3) == 0x000078, "Member 'CstmFunctionLibrary_C_GetTeamName::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(CstmFunctionLibrary_C_GetTeamName, K2Node_Select_Default) == 0x000090, "Member 'CstmFunctionLibrary_C_GetTeamName::K2Node_Select_Default' has a wrong offset!");

// Function CstmFunctionLibrary.CstmFunctionLibrary_C.CompareKeyBinding
// 0x00C0 (0x00C0 - 0x0000)
struct CstmFunctionLibrary_C_CompareKeyBinding final
{
public:
	class FName                                   InputItemToFind;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   KeyToCompare;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetActionNames_ActionNames;               // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x0078(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item;                           // 0x0090(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CstmFunctionLibrary_C_CompareKeyBinding) == 0x000008, "Wrong alignment on CstmFunctionLibrary_C_CompareKeyBinding");
static_assert(sizeof(CstmFunctionLibrary_C_CompareKeyBinding) == 0x0000C0, "Wrong size on CstmFunctionLibrary_C_CompareKeyBinding");
static_assert(offsetof(CstmFunctionLibrary_C_CompareKeyBinding, InputItemToFind) == 0x000000, "Member 'CstmFunctionLibrary_C_CompareKeyBinding::InputItemToFind' has a wrong offset!");
