#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomPostProcess

#include "Basic.hpp"


namespace SDK::Params
{

// Function CustomPostProcess.PostProcessSightsDOFAsset.SetBlurStrengthCurve
// 0x0004 (0x0004 - 0x0000)
struct PostProcessSightsDOFAsset_SetBlurStrengthCurve final
{
public:
	float                                         InBlurStrengthCurve;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PostProcessSightsDOFAsset_SetBlurStrengthCurve) == 0x000004, "Wrong alignment on PostProcessSightsDOFAsset_SetBlurStrengthCurve");
static_assert(sizeof(PostProcessSightsDOFAsset_SetBlurStrengthCurve) == 0x000004, "Wrong size on PostProcessSightsDOFAsset_SetBlurStrengthCurve");
static_assert(offsetof(PostProcessSightsDOFAsset_SetBlurStrengthCurve, InBlurStrengthCurve) == 0x000000, "Member 'PostProcessSightsDOFAsset_SetBlurStrengthCurve::InBlurStrengthCurve' has a wrong offset!");

// Function CustomPostProcess.PostProcessSightsDOFAsset.SetBokehRadius
// 0x0004 (0x0004 - 0x0000)
struct PostProcessSightsDOFAsset_SetBokehRadius final
{
public:
	float                                         InBokehRadius;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PostProcessSightsDOFAsset_SetBokehRadius) == 0x000004, "Wrong alignment on PostProcessSightsDOFAsset_SetBokehRadius");
static_assert(sizeof(PostProcessSightsDOFAsset_SetBokehRadius) == 0x000004, "Wrong size on PostProcessSightsDOFAsset_SetBokehRadius");
static_assert(offsetof(PostProcessSightsDOFAsset_SetBokehRadius, InBokehRadius) == 0x000000, "Member 'PostProcessSightsDOFAsset_SetBokehRadius::InBokehRadius' has a wrong offset!");

// Function CustomPostProcess.PostProcessSightsDOFAsset.SetFocusRegion
// 0x0004 (0x0004 - 0x0000)
struct PostProcessSightsDOFAsset_SetFocusRegion final
{
public:
	float                                         InFocusRegion;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PostProcessSightsDOFAsset_SetFocusRegion) == 0x000004, "Wrong alignment on PostProcessSightsDOFAsset_SetFocusRegion");
static_assert(sizeof(PostProcessSightsDOFAsset_SetFocusRegion) == 0x000004, "Wrong size on PostProcessSightsDOFAsset_SetFocusRegion");
static_assert(offsetof(PostProcessSightsDOFAsset_SetFocusRegion, InFocusRegion) == 0x000000, "Member 'PostProcessSightsDOFAsset_SetFocusRegion::InFocusRegion' has a wrong offset!");

// Function CustomPostProcess.PostProcessSightsDOFAsset.SetFoucsDistance
// 0x0004 (0x0004 - 0x0000)
struct PostProcessSightsDOFAsset_SetFoucsDistance final
{
public:
	float                                         InFocusDistance;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PostProcessSightsDOFAsset_SetFoucsDistance) == 0x000004, "Wrong alignment on PostProcessSightsDOFAsset_SetFoucsDistance");
static_assert(sizeof(PostProcessSightsDOFAsset_SetFoucsDistance) == 0x000004, "Wrong size on PostProcessSightsDOFAsset_SetFoucsDistance");
static_assert(offsetof(PostProcessSightsDOFAsset_SetFoucsDistance, InFocusDistance) == 0x000000, "Member 'PostProcessSightsDOFAsset_SetFoucsDistance::InFocusDistance' has a wrong offset!");

// Function CustomPostProcess.PostProcessSightsDOFAsset.SetSoftEdge
// 0x0004 (0x0004 - 0x0000)
struct PostProcessSightsDOFAsset_SetSoftEdge final
{
public:
	float                                         InSoftEdge;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PostProcessSightsDOFAsset_SetSoftEdge) == 0x000004, "Wrong alignment on PostProcessSightsDOFAsset_SetSoftEdge");
static_assert(sizeof(PostProcessSightsDOFAsset_SetSoftEdge) == 0x000004, "Wrong size on PostProcessSightsDOFAsset_SetSoftEdge");
static_assert(offsetof(PostProcessSightsDOFAsset_SetSoftEdge, InSoftEdge) == 0x000000, "Member 'PostProcessSightsDOFAsset_SetSoftEdge::InSoftEdge' has a wrong offset!");

// Function CustomPostProcess.PostProcessSightsDOFAsset.SetSoftEdgeFading
// 0x0004 (0x0004 - 0x0000)
struct PostProcessSightsDOFAsset_SetSoftEdgeFading final
{
public:
	float                                         InSoftEdgeFading;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PostProcessSightsDOFAsset_SetSoftEdgeFading) == 0x000004, "Wrong alignment on PostProcessSightsDOFAsset_SetSoftEdgeFading");
static_assert(sizeof(PostProcessSightsDOFAsset_SetSoftEdgeFading) == 0x000004, "Wrong size on PostProcessSightsDOFAsset_SetSoftEdgeFading");
static_assert(offsetof(PostProcessSightsDOFAsset_SetSoftEdgeFading, InSoftEdgeFading) == 0x000000, "Member 'PostProcessSightsDOFAsset_SetSoftEdgeFading::InSoftEdgeFading' has a wrong offset!");

}

