#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DashCameraModify_Bp

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DashCameraModify_Bp.DashCameraModify_BP_C.BlueprintModifyPostProcess
// 0x0B10 (0x0B10 - 0x0000)
struct DashCameraModify_BP_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0560)(Parm, OutParm)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0580(0x0560)()
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0AE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraMgr_BP_C*                  K2Node_DynamicCast_AsPlayer_Camera_Mgr_BP;         // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF1[0x7];                                      // 0x0AF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0AF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0B00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0B08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBDashState                                  CallFunc_GetDashCurrentState_ReturnValue;          // 0x0B09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0B0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DashCameraModify_BP_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on DashCameraModify_BP_C_BlueprintModifyPostProcess");
static_assert(sizeof(DashCameraModify_BP_C_BlueprintModifyPostProcess) == 0x000B10, "Wrong size on DashCameraModify_BP_C_BlueprintModifyPostProcess");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, PostProcessBlendWeight) == 0x000004, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::PostProcessBlendWeight' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, PostProcessSettings) == 0x000010, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::PostProcessSettings' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000570, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000574, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, CallFunc_FMax_ReturnValue) == 0x000578, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, K2Node_MakeStruct_PostProcessSettings) == 0x000580, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000AE0, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, K2Node_DynamicCast_AsPlayer_Camera_Mgr_BP) == 0x000AE8, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::K2Node_DynamicCast_AsPlayer_Camera_Mgr_BP' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, K2Node_DynamicCast_bSuccess) == 0x000AF0, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, CallFunc_K2_GetPawn_ReturnValue) == 0x000AF8, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000B00, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, K2Node_DynamicCast_bSuccess_1) == 0x000B08, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, CallFunc_GetDashCurrentState_ReturnValue) == 0x000B09, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::CallFunc_GetDashCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(DashCameraModify_BP_C_BlueprintModifyPostProcess, K2Node_SwitchEnum_CmpSuccess) == 0x000B0A, "Member 'DashCameraModify_BP_C_BlueprintModifyPostProcess::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

