#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_WinBoard

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Effect_WinBoard.Effect_WinBoard_C
// 0x0110 (0x0370 - 0x0260)
class UEffect_WinBoard_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Draw;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lose;                                              // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Win;                                               // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Summary;                                           // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AllyBG;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AllyLittice;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AllyLogo;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AllyScore;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AllyTeamName;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Draw_BG;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DrawText;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EnemyBG;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EnemyLattice;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EnemyLogo;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EnemyScore;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EnemyTeamName;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_111;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_126;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LoseText;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WinText;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPBGameResult                                 IsSelfWin;                                         // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AllyScore_Value;                                   // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyScore_Value;                                  // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AllyTeamName_Text;                                 // 0x0320(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EnemyTeamName_Text;                                // 0x0338(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   GameResult_Text;                                   // 0x0350(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   ResultSoundName;                                   // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Effect_WinBoard(int32 EntryPoint);
	void PlayResultSound();
	void Construct();
	void WinOrLost();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Effect_WinBoard_C">();
	}
	static class UEffect_WinBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEffect_WinBoard_C>();
	}
};
static_assert(alignof(UEffect_WinBoard_C) == 0x000008, "Wrong alignment on UEffect_WinBoard_C");
static_assert(sizeof(UEffect_WinBoard_C) == 0x000370, "Wrong size on UEffect_WinBoard_C");
static_assert(offsetof(UEffect_WinBoard_C, UberGraphFrame) == 0x000260, "Member 'UEffect_WinBoard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, Draw) == 0x000268, "Member 'UEffect_WinBoard_C::Draw' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, Lose) == 0x000270, "Member 'UEffect_WinBoard_C::Lose' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, Win) == 0x000278, "Member 'UEffect_WinBoard_C::Win' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, Summary) == 0x000280, "Member 'UEffect_WinBoard_C::Summary' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, AllyBG) == 0x000288, "Member 'UEffect_WinBoard_C::AllyBG' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, AllyLittice) == 0x000290, "Member 'UEffect_WinBoard_C::AllyLittice' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, AllyLogo) == 0x000298, "Member 'UEffect_WinBoard_C::AllyLogo' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, AllyScore) == 0x0002A0, "Member 'UEffect_WinBoard_C::AllyScore' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, AllyTeamName) == 0x0002A8, "Member 'UEffect_WinBoard_C::AllyTeamName' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, Draw_BG) == 0x0002B0, "Member 'UEffect_WinBoard_C::Draw_BG' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, DrawText) == 0x0002B8, "Member 'UEffect_WinBoard_C::DrawText' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, EnemyBG) == 0x0002C0, "Member 'UEffect_WinBoard_C::EnemyBG' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, EnemyLattice) == 0x0002C8, "Member 'UEffect_WinBoard_C::EnemyLattice' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, EnemyLogo) == 0x0002D0, "Member 'UEffect_WinBoard_C::EnemyLogo' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, EnemyScore) == 0x0002D8, "Member 'UEffect_WinBoard_C::EnemyScore' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, EnemyTeamName) == 0x0002E0, "Member 'UEffect_WinBoard_C::EnemyTeamName' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, Image_111) == 0x0002E8, "Member 'UEffect_WinBoard_C::Image_111' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, Image_126) == 0x0002F0, "Member 'UEffect_WinBoard_C::Image_126' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, LoseText) == 0x0002F8, "Member 'UEffect_WinBoard_C::LoseText' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, SafeZone_0) == 0x000300, "Member 'UEffect_WinBoard_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, WinText) == 0x000308, "Member 'UEffect_WinBoard_C::WinText' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, IsSelfWin) == 0x000310, "Member 'UEffect_WinBoard_C::IsSelfWin' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, AllyScore_Value) == 0x000314, "Member 'UEffect_WinBoard_C::AllyScore_Value' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, EnemyScore_Value) == 0x000318, "Member 'UEffect_WinBoard_C::EnemyScore_Value' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, AllyTeamName_Text) == 0x000320, "Member 'UEffect_WinBoard_C::AllyTeamName_Text' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, EnemyTeamName_Text) == 0x000338, "Member 'UEffect_WinBoard_C::EnemyTeamName_Text' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, GameResult_Text) == 0x000350, "Member 'UEffect_WinBoard_C::GameResult_Text' has a wrong offset!");
static_assert(offsetof(UEffect_WinBoard_C, ResultSoundName) == 0x000368, "Member 'UEffect_WinBoard_C::ResultSoundName' has a wrong offset!");

}

