#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_SubWinBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function Effect_SubWinBoard.Effect_SubWinBoard_C.ExecuteUbergraph_Effect_SubWinBoard
// 0x03A0 (0x03A0 - 0x0000)
struct Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00C0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0110(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0138(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_2;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_FinishAnimationName;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_6;       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_7;       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0200(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0240(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0250(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0260(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0278(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0290(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x02D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x02E0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02F8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBGameResult                                 CallFunc_GetLastRoundResult_ReturnValue;           // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31B[0x5];                                      // 0x031B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBModeRuleSetting                     CallFunc_GetModeRuleSetting_ReturnValue;           // 0x0320(0x0068)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0390(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard) == 0x000008, "Wrong alignment on Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard");
static_assert(sizeof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard) == 0x0003A0, "Wrong size on Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, EntryPoint) == 0x000000, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeArray_Array) == 0x000058, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeArray_Array_1) == 0x0000C0, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D0, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_Format_ReturnValue_1) == 0x000110, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeArray_Array_2) == 0x000128, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_Format_ReturnValue_2) == 0x000138, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationForward_ReturnValue) == 0x000150, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000158, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000160, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000168, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x000170, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PauseAnimation_ReturnValue) == 0x000178, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PauseAnimation_ReturnValue_1) == 0x00017C, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PauseAnimation_ReturnValue_2) == 0x000180, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PauseAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationForward_ReturnValue_5) == 0x000188, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationForward_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_CustomEvent_FinishAnimationName) == 0x000190, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_CustomEvent_FinishAnimationName' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationForward_ReturnValue_6) == 0x000198, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationForward_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0001A0, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationForward_ReturnValue_7) == 0x0001A8, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationForward_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0001B0, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x0001B8, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_Add_IntInt_ReturnValue) == 0x0001BC, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001C0, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeStruct_FormatArgumentData_4) == 0x000200, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeArray_Array_3) == 0x000240, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeArray_Array_4) == 0x000250, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_Format_ReturnValue_3) == 0x000260, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_Format_ReturnValue_4) == 0x000278, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeStruct_FormatArgumentData_5) == 0x000290, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_MakeArray_Array_5) == 0x0002D0, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_Format_ReturnValue_5) == 0x0002E0, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002F8, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_GetPlayerController_ReturnValue) == 0x000308, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_DynamicCast_AsPBPlayer_State) == 0x000310, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_DynamicCast_bSuccess) == 0x000318, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_GetLastRoundResult_ReturnValue) == 0x000319, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_GetLastRoundResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_SwitchEnum_CmpSuccess) == 0x00031A, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_GetModeRuleSetting_ReturnValue) == 0x000320, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_GetModeRuleSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_Array_Length_ReturnValue) == 0x000388, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00038C, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard, K2Node_CreateDelegate_OutputDelegate_2) == 0x000390, "Member 'Effect_SubWinBoard_C_ExecuteUbergraph_Effect_SubWinBoard::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function Effect_SubWinBoard.Effect_SubWinBoard_C.Init
// 0x0008 (0x0008 - 0x0000)
struct Effect_SubWinBoard_C_Init final
{
public:
	class FName                                   FinishAnimationName;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_SubWinBoard_C_Init) == 0x000004, "Wrong alignment on Effect_SubWinBoard_C_Init");
static_assert(sizeof(Effect_SubWinBoard_C_Init) == 0x000008, "Wrong size on Effect_SubWinBoard_C_Init");
static_assert(offsetof(Effect_SubWinBoard_C_Init, FinishAnimationName) == 0x000000, "Member 'Effect_SubWinBoard_C_Init::FinishAnimationName' has a wrong offset!");

// Function Effect_SubWinBoard.Effect_SubWinBoard_C.StartShow
// 0x0178 (0x0178 - 0x0000)
struct Effect_SubWinBoard_C_StartShow final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBGameState*                           K2Node_DynamicCast_AsPBGame_State;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamID_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBRoundResult                         CallFunc_GetLastRoundResult_ReturnValue;           // 0x0030(0x0028)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBModeRuleSetting                     CallFunc_GetModeRuleSetting_ReturnValue;           // 0x0060(0x0068)(ConstParm)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBGameState*                           K2Node_DynamicCast_AsPBGame_State_1;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBGameState*                           K2Node_DynamicCast_AsPBGame_State_2;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBGameState*                           K2Node_DynamicCast_AsPBGame_State_3;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetCurrentTeamRoundScores_ReturnValue;    // 0x0118(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0128(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0140(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State_1;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamNum_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBTeam                                       CallFunc_GetTeamEnum_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Effect_SubWinBoard_C_StartShow) == 0x000008, "Wrong alignment on Effect_SubWinBoard_C_StartShow");
static_assert(sizeof(Effect_SubWinBoard_C_StartShow) == 0x000178, "Wrong size on Effect_SubWinBoard_C_StartShow");
static_assert(offsetof(Effect_SubWinBoard_C_StartShow, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'Effect_SubWinBoard_C_StartShow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_StartShow, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'Effect_SubWinBoard_C_StartShow::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_SubWinBoard_C_StartShow, K2Node_DynamicCast_AsPBPlayer_State) == 0x000010, "Member 'Effect_SubWinBoard_C_StartShow::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
