#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EMPPostProgress_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EMPPostProgress_BP.EMPPostProgress_BP_C
// 0x1AF8 (0x1B40 - 0x0048)
class UEMPPostProgress_BP_C final : public UCameraModifier
{
public:
	class APBCharacter_BP_C*                      PBCharacter;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   EMPModify;                                         // 0x0050(0x0560)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPostProcessSettings                   EMPPostProcess;                                    // 0x05B0(0x0560)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPostProcessSettings                   NoneEMPPost;                                       // 0x0B10(0x0560)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPostProcessSettings                   EMPPost;                                           // 0x1070(0x0560)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPostProcessSettings                   EMPPostv2;                                         // 0x15D0(0x0560)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BlendWeight;                                       // 0x1B30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendSpeed;                                        // 0x1B34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintModifyPostProcess(float DeltaTime, float* PostProcessBlendWeight, struct FPostProcessSettings* PostProcessSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EMPPostProgress_BP_C">();
	}
	static class UEMPPostProgress_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMPPostProgress_BP_C>();
	}
};
static_assert(alignof(UEMPPostProgress_BP_C) == 0x000010, "Wrong alignment on UEMPPostProgress_BP_C");
static_assert(sizeof(UEMPPostProgress_BP_C) == 0x001B40, "Wrong size on UEMPPostProgress_BP_C");
static_assert(offsetof(UEMPPostProgress_BP_C, PBCharacter) == 0x000048, "Member 'UEMPPostProgress_BP_C::PBCharacter' has a wrong offset!");
static_assert(offsetof(UEMPPostProgress_BP_C, EMPModify) == 0x000050, "Member 'UEMPPostProgress_BP_C::EMPModify' has a wrong offset!");
static_assert(offsetof(UEMPPostProgress_BP_C, EMPPostProcess) == 0x0005B0, "Member 'UEMPPostProgress_BP_C::EMPPostProcess' has a wrong offset!");
static_assert(offsetof(UEMPPostProgress_BP_C, NoneEMPPost) == 0x000B10, "Member 'UEMPPostProgress_BP_C::NoneEMPPost' has a wrong offset!");
static_assert(offsetof(UEMPPostProgress_BP_C, EMPPost) == 0x001070, "Member 'UEMPPostProgress_BP_C::EMPPost' has a wrong offset!");
static_assert(offsetof(UEMPPostProgress_BP_C, EMPPostv2) == 0x0015D0, "Member 'UEMPPostProgress_BP_C::EMPPostv2' has a wrong offset!");
static_assert(offsetof(UEMPPostProgress_BP_C, BlendWeight) == 0x001B30, "Member 'UEMPPostProgress_BP_C::BlendWeight' has a wrong offset!");
static_assert(offsetof(UEMPPostProgress_BP_C, BlendSpeed) == 0x001B34, "Member 'UEMPPostProgress_BP_C::BlendSpeed' has a wrong offset!");

}

