#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EMPPostProgress_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function EMPPostProgress_BP.EMPPostProgress_BP_C.BlueprintModifyPostProcess
// 0x0600 (0x0600 - 0x0000)
struct EMPPostProgress_BP_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0560)(Parm, OutParm)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x057C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D[0x3];                                      // 0x057D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInKilledStatus_ReturnValue;             // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraMgr_BP_C*                  K2Node_DynamicCast_AsPlayer_Camera_Mgr_BP;         // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A[0x6];                                      // 0x059A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x3];                                      // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentEMPTolerance_ReturnValue;       // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEMPToleranceConfig                    CallFunc_GetEMPToleranceConfig_ReturnValue;        // 0x05B0(0x0028)(ConstParm, NoDestructor)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9[0x3];                                      // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EMPPostProgress_BP_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on EMPPostProgress_BP_C_BlueprintModifyPostProcess");
static_assert(sizeof(EMPPostProgress_BP_C_BlueprintModifyPostProcess) == 0x000600, "Wrong size on EMPPostProgress_BP_C_BlueprintModifyPostProcess");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, PostProcessBlendWeight) == 0x000004, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::PostProcessBlendWeight' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, PostProcessSettings) == 0x000010, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::PostProcessSettings' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000570, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000574, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000578, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00057C, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000580, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_Add_FloatFloat_ReturnValue) == 0x000584, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_IsInKilledStatus_ReturnValue) == 0x000588, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_IsInKilledStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, K2Node_DynamicCast_AsPlayer_Camera_Mgr_BP) == 0x000590, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::K2Node_DynamicCast_AsPlayer_Camera_Mgr_BP' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, K2Node_DynamicCast_bSuccess) == 0x000598, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_Not_PreBool_ReturnValue) == 0x000599, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_GetOwningPlayerController_ReturnValue) == 0x0005A0, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_IsValid_ReturnValue) == 0x0005A8, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_GetCurrentEMPTolerance_ReturnValue) == 0x0005AC, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_GetCurrentEMPTolerance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_GetEMPToleranceConfig_ReturnValue) == 0x0005B0, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_GetEMPToleranceConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_K2_GetPawn_ReturnValue) == 0x0005D8, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, K2Node_DynamicCast_AsPBCharacter_BP) == 0x0005E0, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, K2Node_DynamicCast_bSuccess_1) == 0x0005E8, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0005EC, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0005F0, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPPostProgress_BP_C_BlueprintModifyPostProcess, CallFunc_BooleanAND_ReturnValue) == 0x0005F1, "Member 'EMPPostProgress_BP_C_BlueprintModifyPostProcess::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

