#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPB_MedalDetailsConfig_BP

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FPB_MedalDetailsConfig_BP.FPB_MedalDetailsConfig_BP
// 0x0040 (0x0040 - 0x0000)
struct FFPB_MedalDetailsConfig_BP final
{
public:
	class FText                                   MedalName_5_6D095B964922B617B545A89AFDC5ADC2;      // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_7_9ED75AC74574FD7D4EE634AF613BA2BB;    // 0x0018(0x0018)(Edit, BlueprintVisible)
	int32                                         Exp_13_9E061F0E454DEAF3FB36A8BE4A46C395;           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Image_14_0AC5D2AB46D11E37682867AFD6CE9AF6;         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFPB_MedalDetailsConfig_BP) == 0x000008, "Wrong alignment on FFPB_MedalDetailsConfig_BP");
static_assert(sizeof(FFPB_MedalDetailsConfig_BP) == 0x000040, "Wrong size on FFPB_MedalDetailsConfig_BP");
static_assert(offsetof(FFPB_MedalDetailsConfig_BP, MedalName_5_6D095B964922B617B545A89AFDC5ADC2) == 0x000000, "Member 'FFPB_MedalDetailsConfig_BP::MedalName_5_6D095B964922B617B545A89AFDC5ADC2' has a wrong offset!");
static_assert(offsetof(FFPB_MedalDetailsConfig_BP, Description_7_9ED75AC74574FD7D4EE634AF613BA2BB) == 0x000018, "Member 'FFPB_MedalDetailsConfig_BP::Description_7_9ED75AC74574FD7D4EE634AF613BA2BB' has a wrong offset!");
static_assert(offsetof(FFPB_MedalDetailsConfig_BP, Exp_13_9E061F0E454DEAF3FB36A8BE4A46C395) == 0x000030, "Member 'FFPB_MedalDetailsConfig_BP::Exp_13_9E061F0E454DEAF3FB36A8BE4A46C395' has a wrong offset!");
static_assert(offsetof(FFPB_MedalDetailsConfig_BP, Image_14_0AC5D2AB46D11E37682867AFD6CE9AF6) == 0x000038, "Member 'FFPB_MedalDetailsConfig_BP::Image_14_0AC5D2AB46D11E37682867AFD6CE9AF6' has a wrong offset!");

}

