#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FreeCamHUD

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FreeCamHUD.FreeCamHUD_C
// 0x00C8 (0x0328 - 0x0260)
class UFreeCamHUD_C final : public UPBUserWidget
{
public:
	class UImage*                                 Image;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_13;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_15;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_16;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_17;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_18;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_19;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_20;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_21;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_22;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_23;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FreeCamHUD_C">();
	}
	static class UFreeCamHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFreeCamHUD_C>();
	}
};
static_assert(alignof(UFreeCamHUD_C) == 0x000008, "Wrong alignment on UFreeCamHUD_C");
static_assert(sizeof(UFreeCamHUD_C) == 0x000328, "Wrong size on UFreeCamHUD_C");
static_assert(offsetof(UFreeCamHUD_C, Image) == 0x000260, "Member 'UFreeCamHUD_C::Image' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_0) == 0x000268, "Member 'UFreeCamHUD_C::Image_0' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_1) == 0x000270, "Member 'UFreeCamHUD_C::Image_1' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_2) == 0x000278, "Member 'UFreeCamHUD_C::Image_2' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_3) == 0x000280, "Member 'UFreeCamHUD_C::Image_3' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_4) == 0x000288, "Member 'UFreeCamHUD_C::Image_4' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_5) == 0x000290, "Member 'UFreeCamHUD_C::Image_5' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_6) == 0x000298, "Member 'UFreeCamHUD_C::Image_6' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_7) == 0x0002A0, "Member 'UFreeCamHUD_C::Image_7' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_8) == 0x0002A8, "Member 'UFreeCamHUD_C::Image_8' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_9) == 0x0002B0, "Member 'UFreeCamHUD_C::Image_9' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_10) == 0x0002B8, "Member 'UFreeCamHUD_C::Image_10' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_11) == 0x0002C0, "Member 'UFreeCamHUD_C::Image_11' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_12) == 0x0002C8, "Member 'UFreeCamHUD_C::Image_12' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_13) == 0x0002D0, "Member 'UFreeCamHUD_C::Image_13' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_14) == 0x0002D8, "Member 'UFreeCamHUD_C::Image_14' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_15) == 0x0002E0, "Member 'UFreeCamHUD_C::Image_15' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_16) == 0x0002E8, "Member 'UFreeCamHUD_C::Image_16' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_17) == 0x0002F0, "Member 'UFreeCamHUD_C::Image_17' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_18) == 0x0002F8, "Member 'UFreeCamHUD_C::Image_18' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_19) == 0x000300, "Member 'UFreeCamHUD_C::Image_19' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_20) == 0x000308, "Member 'UFreeCamHUD_C::Image_20' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_21) == 0x000310, "Member 'UFreeCamHUD_C::Image_21' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_22) == 0x000318, "Member 'UFreeCamHUD_C::Image_22' has a wrong offset!");
static_assert(offsetof(UFreeCamHUD_C, Image_23) == 0x000320, "Member 'UFreeCamHUD_C::Image_23' has a wrong offset!");

}

