#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FreeCamChar

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass FreeCamChar.FreeCamChar_C
// 0x0070 (0x21D0 - 0x2160)
class AFreeCamChar_C final : public APBCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2160(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBMarkableComponent*                   PBMarkable;                                        // 0x2168(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        FocusPoint;                                        // 0x2170(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x2178(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x2180(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FOV_Cache;                                         // 0x2188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTimeX;                                        // 0x218C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FocusCam;                                          // 0x2190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2191[0x3];                                     // 0x2191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RotationDelta;                                     // 0x2194(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                AnchorLocation;                                    // 0x21A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21AC[0x4];                                     // 0x21AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFreeCamHUD_C*                          FreeCamHUD;                                        // 0x21B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    FocusComp;                                         // 0x21B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Aperture_Cache;                                    // 0x21C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Focal_Length_Cache;                                // 0x21C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Manual_Focus;                                      // 0x21C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_FreeCamChar(int32 EntryPoint);
	void ReceiveUnpossessed(class AController* OldController);
	void ReceivePossessed(class AController* NewController);
	void EnteringFreeCam();
	void LeavingFreeCam();
	void InpAxisEvt_MoveAlongSpline_K2Node_InputAxisEvent_8(float AxisValue);
	void ReceiveBeginPlay();
	void InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_0(float AxisValue);
	void ReceiveTick(float DeltaSeconds);
	void InpAxisEvt_MoveUp_K2Node_InputAxisEvent_42(float AxisValue);
	void InpAxisEvt_MoveRight_K2Node_InputAxisEvent_37(float AxisValue);
	void InpAxisEvt_MoveForward_K2Node_InputAxisEvent_36(float AxisValue);
	void InpActEvt_Eight_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Seven_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_Six_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_Five_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_Four_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Three_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_One_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7(const struct FKey& Key);
	void InpActEvt_RightMouseButton_K2Node_InputKeyEvent_8(const struct FKey& Key);
	void InpActEvt_Two_K2Node_InputKeyEvent_9(const struct FKey& Key);
	void InpActEvt_Slash_K2Node_InputKeyEvent_10(const struct FKey& Key);
	void InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_11(const struct FKey& Key);
	void UserConstructionScript();
	bool ReachForward(struct FHitResult* OutHit);
	void GetCastedController(class APlayerController** AsPlayer_Controller);
	void HandleAhchor(bool LaunchAnchor);
	void UpdatePostProcess(const struct FHitResult& Hit);
	struct FRotator FindLookatDelta_NoRoll(float Roll);
	void ToggleCameraLag(bool Enable_Camera_Rotation_Lag, float Camera_Rotation_Lag_Speed);
	void UpdateMovementConfig();
	void CreateWidget();
	void PrepareAnchor();
	void UpdateAnchorPlaceLocation(const struct FHitResult& Hit, bool Condition);
	void UpdateFOV(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FreeCamChar_C">();
	}
	static class AFreeCamChar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFreeCamChar_C>();
	}
};
static_assert(alignof(AFreeCamChar_C) == 0x000010, "Wrong alignment on AFreeCamChar_C");
static_assert(sizeof(AFreeCamChar_C) == 0x0021D0, "Wrong size on AFreeCamChar_C");
static_assert(offsetof(AFreeCamChar_C, UberGraphFrame) == 0x002160, "Member 'AFreeCamChar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, PBMarkable) == 0x002168, "Member 'AFreeCamChar_C::PBMarkable' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, FocusPoint) == 0x002170, "Member 'AFreeCamChar_C::FocusPoint' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, Camera) == 0x002178, "Member 'AFreeCamChar_C::Camera' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, SpringArm) == 0x002180, "Member 'AFreeCamChar_C::SpringArm' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, FOV_Cache) == 0x002188, "Member 'AFreeCamChar_C::FOV_Cache' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, DeltaTimeX) == 0x00218C, "Member 'AFreeCamChar_C::DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, FocusCam) == 0x002190, "Member 'AFreeCamChar_C::FocusCam' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, RotationDelta) == 0x002194, "Member 'AFreeCamChar_C::RotationDelta' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, AnchorLocation) == 0x0021A0, "Member 'AFreeCamChar_C::AnchorLocation' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, FreeCamHUD) == 0x0021B0, "Member 'AFreeCamChar_C::FreeCamHUD' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, FocusComp) == 0x0021B8, "Member 'AFreeCamChar_C::FocusComp' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, Aperture_Cache) == 0x0021C0, "Member 'AFreeCamChar_C::Aperture_Cache' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, Focal_Length_Cache) == 0x0021C4, "Member 'AFreeCamChar_C::Focal_Length_Cache' has a wrong offset!");
static_assert(offsetof(AFreeCamChar_C, Manual_Focus) == 0x0021C8, "Member 'AFreeCamChar_C::Manual_Focus' has a wrong offset!");

}

