#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FVoxelEditHistory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FVoxelEditHistory.FVoxelEditHistory
// 0x0014 (0x0014 - 0x0000)
struct FFVoxelEditHistory final
{
public:
	struct FIntVector                             EditLocation_2_AA0D560B4C5210A2DBAE5CA1D56E5E78;   // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_9_0D6CEF704646F006BEE53AA816E0FE09;           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMode_6_E3FB872B45FDBBA64FF58A8565554129;          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFVoxelEditHistory) == 0x000004, "Wrong alignment on FFVoxelEditHistory");
static_assert(sizeof(FFVoxelEditHistory) == 0x000014, "Wrong size on FFVoxelEditHistory");
static_assert(offsetof(FFVoxelEditHistory, EditLocation_2_AA0D560B4C5210A2DBAE5CA1D56E5E78) == 0x000000, "Member 'FFVoxelEditHistory::EditLocation_2_AA0D560B4C5210A2DBAE5CA1D56E5E78' has a wrong offset!");
static_assert(offsetof(FFVoxelEditHistory, Size_9_0D6CEF704646F006BEE53AA816E0FE09) == 0x00000C, "Member 'FFVoxelEditHistory::Size_9_0D6CEF704646F006BEE53AA816E0FE09' has a wrong offset!");
static_assert(offsetof(FFVoxelEditHistory, bMode_6_E3FB872B45FDBBA64FF58A8565554129) == 0x000010, "Member 'FFVoxelEditHistory::bMode_6_E3FB872B45FDBBA64FF58A8565554129' has a wrong offset!");

}

