#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayEventSystem

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayEventSystem_structs.hpp"


namespace SDK::Params
{

// Function GameplayEventSystem.GESAsyncAction_ListenForGameplayEvent.ListenForGameplayEvent
// 0x0038 (0x0038 - 0x0000)
struct GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EventName;                                         // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bListenToLocal;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bListenToSimulated;                                // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bListenToServer;                                   // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListenContext;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LifeSpan;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumTrigger;                                        // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGESEventMatch                                EventMatchType;                                    // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGESAsyncAction_ListenForGameplayEvent* ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent) == 0x000008, "Wrong alignment on GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent");
static_assert(sizeof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent) == 0x000038, "Wrong size on GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, WorldContextObject) == 0x000000, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::WorldContextObject' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, EventName) == 0x000008, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::EventName' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, bListenToLocal) == 0x000010, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::bListenToLocal' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, bListenToSimulated) == 0x000011, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::bListenToSimulated' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, bListenToServer) == 0x000012, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::bListenToServer' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, ListenContext) == 0x000018, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::ListenContext' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, LifeSpan) == 0x000020, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::LifeSpan' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, NumTrigger) == 0x000024, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::NumTrigger' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, EventMatchType) == 0x000028, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::EventMatchType' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent, ReturnValue) == 0x000030, "Member 'GESAsyncAction_ListenForGameplayEvent_ListenForGameplayEvent::ReturnValue' has a wrong offset!");

// Function GameplayEventSystem.GESAsyncAction_ListenForGameplayEvent.GetPayload
// 0x0008 (0x0008 - 0x0000)
struct GESAsyncAction_ListenForGameplayEvent_GetPayload final
{
public:
	int32                                         OutPayload;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GESAsyncAction_ListenForGameplayEvent_GetPayload) == 0x000004, "Wrong alignment on GESAsyncAction_ListenForGameplayEvent_GetPayload");
static_assert(sizeof(GESAsyncAction_ListenForGameplayEvent_GetPayload) == 0x000008, "Wrong size on GESAsyncAction_ListenForGameplayEvent_GetPayload");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_GetPayload, OutPayload) == 0x000000, "Member 'GESAsyncAction_ListenForGameplayEvent_GetPayload::OutPayload' has a wrong offset!");
static_assert(offsetof(GESAsyncAction_ListenForGameplayEvent_GetPayload, ReturnValue) == 0x000004, "Member 'GESAsyncAction_ListenForGameplayEvent_GetPayload::ReturnValue' has a wrong offset!");

// Function GameplayEventSystem.GESEventManager.K2_BroadcastEvent
// 0x0018 (0x0018 - 0x0000)
struct GESEventManager_K2_BroadcastEvent final
{
public:
	class UObject*                                ContextObject;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EventName;                                         // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGESEventRole                                 EventRole;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EventParamter;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESEventManager_K2_BroadcastEvent) == 0x000008, "Wrong alignment on GESEventManager_K2_BroadcastEvent");
static_assert(sizeof(GESEventManager_K2_BroadcastEvent) == 0x000018, "Wrong size on GESEventManager_K2_BroadcastEvent");
static_assert(offsetof(GESEventManager_K2_BroadcastEvent, ContextObject) == 0x000000, "Member 'GESEventManager_K2_BroadcastEvent::ContextObject' has a wrong offset!");
static_assert(offsetof(GESEventManager_K2_BroadcastEvent, EventName) == 0x000008, "Member 'GESEventManager_K2_BroadcastEvent::EventName' has a wrong offset!");
static_assert(offsetof(GESEventManager_K2_BroadcastEvent, EventRole) == 0x000010, "Member 'GESEventManager_K2_BroadcastEvent::EventRole' has a wrong offset!");
static_assert(offsetof(GESEventManager_K2_BroadcastEvent, EventParamter) == 0x000014, "Member 'GESEventManager_K2_BroadcastEvent::EventParamter' has a wrong offset!");

}

