#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEffect_BP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function GameEffect_BP.GameEffect_BP_C.ExecuteUbergraph_GameEffect_BP
// 0x0004 (0x0004 - 0x0000)
struct GameEffect_BP_C_ExecuteUbergraph_GameEffect_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameEffect_BP_C_ExecuteUbergraph_GameEffect_BP) == 0x000004, "Wrong alignment on GameEffect_BP_C_ExecuteUbergraph_GameEffect_BP");
static_assert(sizeof(GameEffect_BP_C_ExecuteUbergraph_GameEffect_BP) == 0x000004, "Wrong size on GameEffect_BP_C_ExecuteUbergraph_GameEffect_BP");
static_assert(offsetof(GameEffect_BP_C_ExecuteUbergraph_GameEffect_BP, EntryPoint) == 0x000000, "Member 'GameEffect_BP_C_ExecuteUbergraph_GameEffect_BP::EntryPoint' has a wrong offset!");

// Function GameEffect_BP.GameEffect_BP_C.HandleShowMedal
// 0x00D0 (0x00D0 - 0x0000)
struct GameEffect_BP_C_HandleShowMedal final
{
public:
	TArray<class FName>                           InRealChallengeArray;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FAchievementInfo>               AchievementInfoArray;                              // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBMedalDetailsDataTableRowBase        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0038(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAchievementInfo                       K2Node_MakeStruct_AchievementInfo;                 // 0x0080(0x0040)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameEffect_BP_C_HandleShowMedal) == 0x000008, "Wrong alignment on GameEffect_BP_C_HandleShowMedal");
static_assert(sizeof(GameEffect_BP_C_HandleShowMedal) == 0x0000D0, "Wrong size on GameEffect_BP_C_HandleShowMedal");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, InRealChallengeArray) == 0x000000, "Member 'GameEffect_BP_C_HandleShowMedal::InRealChallengeArray' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, AchievementInfoArray) == 0x000010, "Member 'GameEffect_BP_C_HandleShowMedal::AchievementInfoArray' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, Temp_int_Array_Index_Variable) == 0x000024, "Member 'GameEffect_BP_C_HandleShowMedal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'GameEffect_BP_C_HandleShowMedal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_Array_Get_Item) == 0x00002C, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_GetDataTableRowFromName_OutRow) == 0x000038, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000078, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, K2Node_MakeStruct_AchievementInfo) == 0x000080, "Member 'GameEffect_BP_C_HandleShowMedal::K2Node_MakeStruct_AchievementInfo' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_Array_Add_ReturnValue) == 0x0000C0, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_Array_Length_ReturnValue_1) == 0x0000C4, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C8, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_HandleShowMedal, CallFunc_IsInViewport_ReturnValue) == 0x0000C9, "Member 'GameEffect_BP_C_HandleShowMedal::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function GameEffect_BP.GameEffect_BP_C.ShowKillInfo
// 0x0078 (0x0078 - 0x0000)
struct GameEffect_BP_C_ShowKillInfo final
{
public:
	struct FPBEventAttackDetailInfo               AttackInfo;                                        // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
};
static_assert(alignof(GameEffect_BP_C_ShowKillInfo) == 0x000008, "Wrong alignment on GameEffect_BP_C_ShowKillInfo");
static_assert(sizeof(GameEffect_BP_C_ShowKillInfo) == 0x000078, "Wrong size on GameEffect_BP_C_ShowKillInfo");
static_assert(offsetof(GameEffect_BP_C_ShowKillInfo, AttackInfo) == 0x000000, "Member 'GameEffect_BP_C_ShowKillInfo::AttackInfo' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_ShowKillInfo, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'GameEffect_BP_C_ShowKillInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_ShowKillInfo, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'GameEffect_BP_C_ShowKillInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_ShowKillInfo, CallFunc_GetPlayerName_ReturnValue) == 0x000050, "Member 'GameEffect_BP_C_ShowKillInfo::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_ShowKillInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'GameEffect_BP_C_ShowKillInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function GameEffect_BP.GameEffect_BP_C.InitShowMedalInfo
// 0x0038 (0x0038 - 0x0000)
struct GameEffect_BP_C_InitShowMedalInfo final
{
public:
	class UInGameAchiFeedBack_C*                  CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBEventManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AController* TriggerController, class FName& EventID, struct FPBEventBaseRow& EventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameEffect_BP_C_InitShowMedalInfo) == 0x000008, "Wrong alignment on GameEffect_BP_C_InitShowMedalInfo");
static_assert(sizeof(GameEffect_BP_C_InitShowMedalInfo) == 0x000038, "Wrong size on GameEffect_BP_C_InitShowMedalInfo");
static_assert(offsetof(GameEffect_BP_C_InitShowMedalInfo, CallFunc_Create_ReturnValue) == 0x000000, "Member 'GameEffect_BP_C_InitShowMedalInfo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_InitShowMedalInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'GameEffect_BP_C_InitShowMedalInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_InitShowMedalInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GameEffect_BP_C_InitShowMedalInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_InitShowMedalInfo, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'GameEffect_BP_C_InitShowMedalInfo::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_InitShowMedalInfo, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GameEffect_BP_C_InitShowMedalInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GameEffect_BP.GameEffect_BP_C.InitShowScoreInfo
// 0x0028 (0x0028 - 0x0000)
struct GameEffect_BP_C_InitShowScoreInfo final
{
public:
	class UUMG_InGameUI_ScoreIcon_C*              CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBEventManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AController* TriggerController, class FName& EventID, struct FPBEventBaseRow& EventData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameEffect_BP_C_InitShowScoreInfo) == 0x000008, "Wrong alignment on GameEffect_BP_C_InitShowScoreInfo");
static_assert(sizeof(GameEffect_BP_C_InitShowScoreInfo) == 0x000028, "Wrong size on GameEffect_BP_C_InitShowScoreInfo");
static_assert(offsetof(GameEffect_BP_C_InitShowScoreInfo, CallFunc_Create_ReturnValue) == 0x000000, "Member 'GameEffect_BP_C_InitShowScoreInfo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_InitShowScoreInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'GameEffect_BP_C_InitShowScoreInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_InitShowScoreInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GameEffect_BP_C_InitShowScoreInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_InitShowScoreInfo, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GameEffect_BP_C_InitShowScoreInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GameEffect_BP.GameEffect_BP_C.InitShowKillInfo
// 0x0018 (0x0018 - 0x0000)
struct GameEffect_BP_C_InitShowKillInfo final
{
public:
	TDelegate<void(const struct FPBEventAttackDetailInfo& EventAttackDetailInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UPBGameplayEventManager*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameEffect_BP_C_InitShowKillInfo) == 0x000008, "Wrong alignment on GameEffect_BP_C_InitShowKillInfo");
static_assert(sizeof(GameEffect_BP_C_InitShowKillInfo) == 0x000018, "Wrong size on GameEffect_BP_C_InitShowKillInfo");
static_assert(offsetof(GameEffect_BP_C_InitShowKillInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'GameEffect_BP_C_InitShowKillInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_InitShowKillInfo, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'GameEffect_BP_C_InitShowKillInfo::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");

// Function GameEffect_BP.GameEffect_BP_C.OnTriggerEvent
// 0x0078 (0x0078 - 0x0000)
struct GameEffect_BP_C_OnTriggerEvent final
{
public:
	class AController*                            TriggerController;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EventID;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBEventBaseRow                        EventData;                                         // 0x0010(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBEventTriggerRow                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameEffect_BP_C_OnTriggerEvent) == 0x000008, "Wrong alignment on GameEffect_BP_C_OnTriggerEvent");
static_assert(sizeof(GameEffect_BP_C_OnTriggerEvent) == 0x000078, "Wrong size on GameEffect_BP_C_OnTriggerEvent");
static_assert(offsetof(GameEffect_BP_C_OnTriggerEvent, TriggerController) == 0x000000, "Member 'GameEffect_BP_C_OnTriggerEvent::TriggerController' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_OnTriggerEvent, EventID) == 0x000008, "Member 'GameEffect_BP_C_OnTriggerEvent::EventID' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_OnTriggerEvent, EventData) == 0x000010, "Member 'GameEffect_BP_C_OnTriggerEvent::EventData' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_OnTriggerEvent, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'GameEffect_BP_C_OnTriggerEvent::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_OnTriggerEvent, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'GameEffect_BP_C_OnTriggerEvent::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function GameEffect_BP.GameEffect_BP_C.OnCompletedMedal
// 0x0068 (0x0068 - 0x0000)
struct GameEffect_BP_C_OnCompletedMedal final
{
public:
	class AController*                            TriggerController;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EventID;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBEventBaseRow                        EventData;                                         // 0x0010(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameEffect_BP_C_OnCompletedMedal) == 0x000008, "Wrong alignment on GameEffect_BP_C_OnCompletedMedal");
static_assert(sizeof(GameEffect_BP_C_OnCompletedMedal) == 0x000068, "Wrong size on GameEffect_BP_C_OnCompletedMedal");
static_assert(offsetof(GameEffect_BP_C_OnCompletedMedal, TriggerController) == 0x000000, "Member 'GameEffect_BP_C_OnCompletedMedal::TriggerController' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_OnCompletedMedal, EventID) == 0x000008, "Member 'GameEffect_BP_C_OnCompletedMedal::EventID' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_OnCompletedMedal, EventData) == 0x000010, "Member 'GameEffect_BP_C_OnCompletedMedal::EventData' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_OnCompletedMedal, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'GameEffect_BP_C_OnCompletedMedal::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_OnCompletedMedal, CallFunc_Conv_StringToName_ReturnValue) == 0x000058, "Member 'GameEffect_BP_C_OnCompletedMedal::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_BP_C_OnCompletedMedal, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'GameEffect_BP_C_OnCompletedMedal::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

