#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEffect_PlayerIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GameEffect_PlayerIcon.GameEffect_PlayerIcon_C
// 0x0078 (0x02F0 - 0x0278)
class UGameEffect_PlayerIcon_C final : public UPBTopPlayerinfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon_BG;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Icon_Box;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NormalIcon;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnableIcon;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsLeader;                                          // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTeamate;                                         // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFriend;                                          // 0x02A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsCountTimePause;                                  // 0x02A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Yellow_Linear;                                     // 0x02A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Grey_Linear;                                       // 0x02B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountTime;                                         // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountTimeAnim;                                     // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               NormalIconDynamic;                                 // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               UnableIconDynamic;                                 // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EPBAllyIconState                              AllyStatus;                                        // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBHostileIconState                           EnemyStatus;                                       // 0x02E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Icon_Texture;                                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GameEffect_PlayerIcon(int32 EntryPoint);
	void OnInitialized();
	void K2_SetFightingStateImage();
	void K2_SetNullPlayerInfo();
	void Get_Icon_Texture(class FName RoleId, class UTexture2D** Image);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameEffect_PlayerIcon_C">();
	}
	static class UGameEffect_PlayerIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameEffect_PlayerIcon_C>();
	}
};
static_assert(alignof(UGameEffect_PlayerIcon_C) == 0x000008, "Wrong alignment on UGameEffect_PlayerIcon_C");
static_assert(sizeof(UGameEffect_PlayerIcon_C) == 0x0002F0, "Wrong size on UGameEffect_PlayerIcon_C");
static_assert(offsetof(UGameEffect_PlayerIcon_C, UberGraphFrame) == 0x000278, "Member 'UGameEffect_PlayerIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, Icon_BG) == 0x000280, "Member 'UGameEffect_PlayerIcon_C::Icon_BG' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, Icon_Box) == 0x000288, "Member 'UGameEffect_PlayerIcon_C::Icon_Box' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, NormalIcon) == 0x000290, "Member 'UGameEffect_PlayerIcon_C::NormalIcon' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, UnableIcon) == 0x000298, "Member 'UGameEffect_PlayerIcon_C::UnableIcon' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, IsLeader) == 0x0002A0, "Member 'UGameEffect_PlayerIcon_C::IsLeader' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, IsTeamate) == 0x0002A1, "Member 'UGameEffect_PlayerIcon_C::IsTeamate' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, IsFriend) == 0x0002A2, "Member 'UGameEffect_PlayerIcon_C::IsFriend' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, IsCountTimePause) == 0x0002A3, "Member 'UGameEffect_PlayerIcon_C::IsCountTimePause' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, Yellow_Linear) == 0x0002A4, "Member 'UGameEffect_PlayerIcon_C::Yellow_Linear' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, Grey_Linear) == 0x0002B4, "Member 'UGameEffect_PlayerIcon_C::Grey_Linear' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, CountTime) == 0x0002C4, "Member 'UGameEffect_PlayerIcon_C::CountTime' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, CountTimeAnim) == 0x0002C8, "Member 'UGameEffect_PlayerIcon_C::CountTimeAnim' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, NormalIconDynamic) == 0x0002D0, "Member 'UGameEffect_PlayerIcon_C::NormalIconDynamic' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, UnableIconDynamic) == 0x0002D8, "Member 'UGameEffect_PlayerIcon_C::UnableIconDynamic' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, Index_0) == 0x0002E0, "Member 'UGameEffect_PlayerIcon_C::Index_0' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, AllyStatus) == 0x0002E4, "Member 'UGameEffect_PlayerIcon_C::AllyStatus' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, EnemyStatus) == 0x0002E5, "Member 'UGameEffect_PlayerIcon_C::EnemyStatus' has a wrong offset!");
static_assert(offsetof(UGameEffect_PlayerIcon_C, Icon_Texture) == 0x0002E8, "Member 'UGameEffect_PlayerIcon_C::Icon_Texture' has a wrong offset!");

}

