#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEffect_PlayerIcon

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GameEffect_PlayerIcon.GameEffect_PlayerIcon_C.ExecuteUbergraph_GameEffect_PlayerIcon
// 0x0068 (0x0068 - 0x0000)
struct GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_3;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Get_Icon_Texture_Image;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon) == 0x000008, "Wrong alignment on GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon");
static_assert(sizeof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon) == 0x000068, "Wrong size on GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, EntryPoint) == 0x000000, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_bool_Variable) == 0x000004, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_byte_Variable) == 0x000005, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_byte_Variable_1) == 0x000006, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_bool_Variable_1) == 0x000007, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_byte_Variable_2) == 0x000008, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_byte_Variable_3) == 0x000009, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_bool_Variable_2) == 0x00000A, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_byte_Variable_4) == 0x00000B, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_byte_Variable_5) == 0x00000C, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_bool_Variable_3) == 0x000018, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000020, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_byte_Variable_6) == 0x000028, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_byte_Variable_7) == 0x000029, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_bool_Variable_4) == 0x00002A, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, K2Node_SwitchEnum_CmpSuccess) == 0x00002B, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, K2Node_SwitchEnum_CmpSuccess_1) == 0x00002C, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002D, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00002E, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00002F, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_BooleanOR_ReturnValue) == 0x000030, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_BooleanOR_ReturnValue_1) == 0x000031, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000034, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_BooleanOR_ReturnValue_2) == 0x000038, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, K2Node_Select_Default) == 0x000039, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, K2Node_Select_Default_1) == 0x00003A, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x00003C, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000040, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000041, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000042, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_BooleanOR_ReturnValue_3) == 0x000043, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x000044, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_BooleanOR_ReturnValue_4) == 0x000048, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, K2Node_Select_Default_2) == 0x000049, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, K2Node_Select_Default_3) == 0x00004A, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_BooleanOR_ReturnValue_5) == 0x00004B, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_Conv_BoolToFloat_ReturnValue_3) == 0x00004C, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_Conv_BoolToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, CallFunc_Get_Icon_Texture_Image) == 0x000050, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::CallFunc_Get_Icon_Texture_Image' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_float_Variable) == 0x000058, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, Temp_float_Variable_1) == 0x00005C, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon, K2Node_Select_Default_4) == 0x000060, "Member 'GameEffect_PlayerIcon_C_ExecuteUbergraph_GameEffect_PlayerIcon::K2Node_Select_Default_4' has a wrong offset!");

// Function GameEffect_PlayerIcon.GameEffect_PlayerIcon_C.Get Icon Texture
// 0x0400 (0x0400 - 0x0000)
struct GameEffect_PlayerIcon_C_Get_Icon_Texture final
{
public:
	class FName                                   RoleId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Image;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBCharacterDefinitionRow              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x03D0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameEffect_PlayerIcon_C_Get_Icon_Texture) == 0x000008, "Wrong alignment on GameEffect_PlayerIcon_C_Get_Icon_Texture");
static_assert(sizeof(GameEffect_PlayerIcon_C_Get_Icon_Texture) == 0x000400, "Wrong size on GameEffect_PlayerIcon_C_Get_Icon_Texture");
static_assert(offsetof(GameEffect_PlayerIcon_C_Get_Icon_Texture, RoleId) == 0x000000, "Member 'GameEffect_PlayerIcon_C_Get_Icon_Texture::RoleId' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_Get_Icon_Texture, Image) == 0x000008, "Member 'GameEffect_PlayerIcon_C_Get_Icon_Texture::Image' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_Get_Icon_Texture, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'GameEffect_PlayerIcon_C_Get_Icon_Texture::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_Get_Icon_Texture, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003E0, "Member 'GameEffect_PlayerIcon_C_Get_Icon_Texture::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_Get_Icon_Texture, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0003E8, "Member 'GameEffect_PlayerIcon_C_Get_Icon_Texture::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_Get_Icon_Texture, K2Node_DynamicCast_AsTexture_2D) == 0x0003F0, "Member 'GameEffect_PlayerIcon_C_Get_Icon_Texture::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(GameEffect_PlayerIcon_C_Get_Icon_Texture, K2Node_DynamicCast_bSuccess) == 0x0003F8, "Member 'GameEffect_PlayerIcon_C_Get_Icon_Texture::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

