#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEffect_AreaPointTips

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GameEffect_AreaPointTips.GameEffect_AreaPointTips_C
// 0x0060 (0x0340 - 0x02E0)
class UGameEffect_AreaPointTips_C final : public UPBMainMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 AreaPoint;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AreaPointName_Text;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextZoneName;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ZoneIcon;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ProgressValue;                                     // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ZoneDynamic;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCapturableZoneV2*                    CapturableZone;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         IsAlly;                                            // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapturingAnimationTimeline;                        // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ZoneNameText;                                      // 0x0328(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GameEffect_AreaPointTips(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameEffect_AreaPointTips_C">();
	}
	static class UGameEffect_AreaPointTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameEffect_AreaPointTips_C>();
	}
};
static_assert(alignof(UGameEffect_AreaPointTips_C) == 0x000008, "Wrong alignment on UGameEffect_AreaPointTips_C");
static_assert(sizeof(UGameEffect_AreaPointTips_C) == 0x000340, "Wrong size on UGameEffect_AreaPointTips_C");
static_assert(offsetof(UGameEffect_AreaPointTips_C, UberGraphFrame) == 0x0002E0, "Member 'UGameEffect_AreaPointTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, AreaPoint) == 0x0002E8, "Member 'UGameEffect_AreaPointTips_C::AreaPoint' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, AreaPointName_Text) == 0x0002F0, "Member 'UGameEffect_AreaPointTips_C::AreaPointName_Text' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, TextZoneName) == 0x0002F8, "Member 'UGameEffect_AreaPointTips_C::TextZoneName' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, ZoneIcon) == 0x000300, "Member 'UGameEffect_AreaPointTips_C::ZoneIcon' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, ProgressValue) == 0x000308, "Member 'UGameEffect_AreaPointTips_C::ProgressValue' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, ZoneDynamic) == 0x000310, "Member 'UGameEffect_AreaPointTips_C::ZoneDynamic' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, CapturableZone) == 0x000318, "Member 'UGameEffect_AreaPointTips_C::CapturableZone' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, IsAlly) == 0x000320, "Member 'UGameEffect_AreaPointTips_C::IsAlly' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, CapturingAnimationTimeline) == 0x000324, "Member 'UGameEffect_AreaPointTips_C::CapturingAnimationTimeline' has a wrong offset!");
static_assert(offsetof(UGameEffect_AreaPointTips_C, ZoneNameText) == 0x000328, "Member 'UGameEffect_AreaPointTips_C::ZoneNameText' has a wrong offset!");

}

