#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayEventSystem

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UE5Engine_classes.hpp"
#include "GameplayEventSystem_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GameplayEventSystem.GESAsyncAction_ListenForGameplayEvent
// 0x0068 (0x0098 - 0x0030)
class UGESAsyncAction_ListenForGameplayEvent final : public UUE5CancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(class UGESAsyncAction_ListenForGameplayEvent* ProxyObject, const struct FGameplayTag& ActualEvent)> OnMessageReceived;                                 // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x58];                                      // 0x0040(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGESAsyncAction_ListenForGameplayEvent* ListenForGameplayEvent(class UObject* WorldContextObject, const struct FGameplayTag& EventName, bool bListenToLocal, bool bListenToSimulated, bool bListenToServer, class UObject* ListenContext, float LifeSpan, int32 NumTrigger, EGESEventMatch EventMatchType);

	bool GetPayload(int32& OutPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GESAsyncAction_ListenForGameplayEvent">();
	}
	static class UGESAsyncAction_ListenForGameplayEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESAsyncAction_ListenForGameplayEvent>();
	}
};
static_assert(alignof(UGESAsyncAction_ListenForGameplayEvent) == 0x000008, "Wrong alignment on UGESAsyncAction_ListenForGameplayEvent");
static_assert(sizeof(UGESAsyncAction_ListenForGameplayEvent) == 0x000098, "Wrong size on UGESAsyncAction_ListenForGameplayEvent");
static_assert(offsetof(UGESAsyncAction_ListenForGameplayEvent, OnMessageReceived) == 0x000030, "Member 'UGESAsyncAction_ListenForGameplayEvent::OnMessageReceived' has a wrong offset!");

// Class GameplayEventSystem.GESEventManager
// 0x0050 (0x0080 - 0x0030)
class UGESEventManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void K2_BroadcastEvent(class UObject* ContextObject, const struct FGameplayTag& EventName, EGESEventRole EventRole, int32 EventParamter);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GESEventManager">();
	}
	static class UGESEventManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESEventManager>();
	}
};
static_assert(alignof(UGESEventManager) == 0x000008, "Wrong alignment on UGESEventManager");
static_assert(sizeof(UGESEventManager) == 0x000080, "Wrong size on UGESEventManager");

// Class GameplayEventSystem.GESEventSettings
// 0x0030 (0x0058 - 0x0028)
class UGESEventSettings final : public UObject
{
public:
	TSoftObjectPtr<class UGESEventStructMapping>  EventStructMapping;                                // 0x0028(0x0028)(Edit, Config, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGESEventStructMapping*                 EventStructMappingObject;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GESEventSettings">();
	}
	static class UGESEventSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESEventSettings>();
	}
};
static_assert(alignof(UGESEventSettings) == 0x000008, "Wrong alignment on UGESEventSettings");
static_assert(sizeof(UGESEventSettings) == 0x000058, "Wrong size on UGESEventSettings");
static_assert(offsetof(UGESEventSettings, EventStructMapping) == 0x000028, "Member 'UGESEventSettings::EventStructMapping' has a wrong offset!");
static_assert(offsetof(UGESEventSettings, EventStructMappingObject) == 0x000050, "Member 'UGESEventSettings::EventStructMappingObject' has a wrong offset!");

// Class GameplayEventSystem.GESEventStructMapping
// 0x0050 (0x0080 - 0x0030)
class UGESEventStructMapping final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, class UScriptStruct*> EventStructMapping;                                // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GESEventStructMapping">();
	}
	static class UGESEventStructMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESEventStructMapping>();
	}
};
static_assert(alignof(UGESEventStructMapping) == 0x000008, "Wrong alignment on UGESEventStructMapping");
static_assert(sizeof(UGESEventStructMapping) == 0x000080, "Wrong size on UGESEventStructMapping");
static_assert(offsetof(UGESEventStructMapping, EventStructMapping) == 0x000030, "Member 'UGESEventStructMapping::EventStructMapping' has a wrong offset!");

}

