#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEffect_GoalBoard_AreaPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameEffect_GoalBoard_AreaPoint.GameEffect_GoalBoard_AreaPoint_C.ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint
// 0x0008 (0x0008 - 0x0000)
struct GameEffect_GoalBoard_AreaPoint_C_ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameEffect_GoalBoard_AreaPoint_C_ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint) == 0x000004, "Wrong alignment on GameEffect_GoalBoard_AreaPoint_C_ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint");
static_assert(sizeof(GameEffect_GoalBoard_AreaPoint_C_ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint) == 0x000008, "Wrong size on GameEffect_GoalBoard_AreaPoint_C_ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint, EntryPoint) == 0x000000, "Member 'GameEffect_GoalBoard_AreaPoint_C_ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint, K2Node_Event_IsDesignTime) == 0x000004, "Member 'GameEffect_GoalBoard_AreaPoint_C_ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function GameEffect_GoalBoard_AreaPoint.GameEffect_GoalBoard_AreaPoint_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct GameEffect_GoalBoard_AreaPoint_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameEffect_GoalBoard_AreaPoint_C_PreConstruct) == 0x000001, "Wrong alignment on GameEffect_GoalBoard_AreaPoint_C_PreConstruct");
static_assert(sizeof(GameEffect_GoalBoard_AreaPoint_C_PreConstruct) == 0x000001, "Wrong size on GameEffect_GoalBoard_AreaPoint_C_PreConstruct");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'GameEffect_GoalBoard_AreaPoint_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function GameEffect_GoalBoard_AreaPoint.GameEffect_GoalBoard_AreaPoint_C.AddChildAreaPointTips
// 0x0090 (0x0090 - 0x0000)
struct GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips final
{
public:
	class UGameEffect_AreaPointTips_C*            CaturableZoneWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArrayIndex;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIndex;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        PointBoardChild;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameEffect_AreaPointTips_C*            K2Node_DynamicCast_AsGame_Effect_Area_Point_Tips;  // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips) == 0x000008, "Wrong alignment on GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips");
static_assert(sizeof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips) == 0x000090, "Wrong size on GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CaturableZoneWidget) == 0x000000, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CaturableZoneWidget' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, ArrayIndex) == 0x000008, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::ArrayIndex' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, InIndex) == 0x00000C, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::InIndex' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, PointBoardChild) == 0x000010, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::PointBoardChild' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, K2Node_SwitchString_CmpSuccess) == 0x000028, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_Array_Get_Item) == 0x000038, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, Temp_int_Loop_Counter_Variable_1) == 0x000044, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_Less_IntInt_ReturnValue_1) == 0x000050, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_AddChild_ReturnValue_1) == 0x000058, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_GetAllChildren_ReturnValue) == 0x000060, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, K2Node_DynamicCast_AsGame_Effect_Area_Point_Tips) == 0x000080, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::K2Node_DynamicCast_AsGame_Effect_Area_Point_Tips' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, CallFunc_Less_IntInt_ReturnValue_2) == 0x000089, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips, K2Node_SwitchString_CmpSuccess_1) == 0x00008A, "Member 'GameEffect_GoalBoard_AreaPoint_C_AddChildAreaPointTips::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");

}

