#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEffect_GoalBoard_AreaPoint

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GameEffect_GoalBoard_AreaPoint.GameEffect_GoalBoard_AreaPoint_C
// 0x0058 (0x02B8 - 0x0260)
class UGameEffect_GoalBoard_AreaPoint_C final : public UPBAreaPointWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGameEffect_AreaPointTips_C*            GameEffect_AreaPointTips;                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameEffect_AreaPointTips_C*            GameEffect_AreaPointTips_1;                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameEffect_AreaPointTips_C*            GameEffect_AreaPointTips_2;                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Point_Board;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Preview;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PointImage;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PointDynamic;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             PointText;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameEffect_AreaPointTips_C*            AreaPointTipsWidget;                               // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GameEffect_GoalBoard_AreaPoint(int32 EntryPoint);
	void Construct();
	void Destruct();
	void PreConstruct(bool IsDesignTime);
	void AddChildAreaPointTips(class UGameEffect_AreaPointTips_C* CaturableZoneWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameEffect_GoalBoard_AreaPoint_C">();
	}
	static class UGameEffect_GoalBoard_AreaPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameEffect_GoalBoard_AreaPoint_C>();
	}
};
static_assert(alignof(UGameEffect_GoalBoard_AreaPoint_C) == 0x000008, "Wrong alignment on UGameEffect_GoalBoard_AreaPoint_C");
static_assert(sizeof(UGameEffect_GoalBoard_AreaPoint_C) == 0x0002B8, "Wrong size on UGameEffect_GoalBoard_AreaPoint_C");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, UberGraphFrame) == 0x000260, "Member 'UGameEffect_GoalBoard_AreaPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, GameEffect_AreaPointTips) == 0x000268, "Member 'UGameEffect_GoalBoard_AreaPoint_C::GameEffect_AreaPointTips' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, GameEffect_AreaPointTips_1) == 0x000270, "Member 'UGameEffect_GoalBoard_AreaPoint_C::GameEffect_AreaPointTips_1' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, GameEffect_AreaPointTips_2) == 0x000278, "Member 'UGameEffect_GoalBoard_AreaPoint_C::GameEffect_AreaPointTips_2' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, Image_68) == 0x000280, "Member 'UGameEffect_GoalBoard_AreaPoint_C::Image_68' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, Point_Board) == 0x000288, "Member 'UGameEffect_GoalBoard_AreaPoint_C::Point_Board' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, Preview) == 0x000290, "Member 'UGameEffect_GoalBoard_AreaPoint_C::Preview' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, PointImage) == 0x000298, "Member 'UGameEffect_GoalBoard_AreaPoint_C::PointImage' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, PointDynamic) == 0x0002A0, "Member 'UGameEffect_GoalBoard_AreaPoint_C::PointDynamic' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, PointText) == 0x0002A8, "Member 'UGameEffect_GoalBoard_AreaPoint_C::PointText' has a wrong offset!");
static_assert(offsetof(UGameEffect_GoalBoard_AreaPoint_C, AreaPointTipsWidget) == 0x0002B0, "Member 'UGameEffect_GoalBoard_AreaPoint_C::AreaPointTipsWidget' has a wrong offset!");

}

