#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSW_LP_SK_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass GSW_LP_SK_Skeleton_AnimBlueprint.GSW_LP_SK_Skeleton_AnimBlueprint_C
// 0x0110 (0x03D0 - 0x02C0)
class UGSW_LP_SK_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x02C8(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0348(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0378(0x0048)()
	float                                         Feedback;                                          // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GSW_LP_SK_Skeleton_AnimBlueprint(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GSW_LP_SK_Skeleton_AnimBlueprint_C">();
	}
	static class UGSW_LP_SK_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSW_LP_SK_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UGSW_LP_SK_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UGSW_LP_SK_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UGSW_LP_SK_Skeleton_AnimBlueprint_C) == 0x0003D0, "Wrong size on UGSW_LP_SK_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UGSW_LP_SK_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UGSW_LP_SK_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGSW_LP_SK_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x0002C8, "Member 'UGSW_LP_SK_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UGSW_LP_SK_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000348, "Member 'UGSW_LP_SK_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UGSW_LP_SK_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000378, "Member 'UGSW_LP_SK_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UGSW_LP_SK_Skeleton_AnimBlueprint_C, Feedback) == 0x0003C0, "Member 'UGSW_LP_SK_Skeleton_AnimBlueprint_C::Feedback' has a wrong offset!");

}

