#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSW_MG_MAG_DRUM

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C
// 0x0040 (0x1F38 - 0x1EF8)
class UGSW_MG_MAG_DRUM_C : public UPartDataHolderComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1EF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mesh1P;                                            // 0x1F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh3P;                                            // 0x1F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AnimClass;                                         // 0x1F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PartReloadMontage;                                 // 0x1F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReloadRate;                                        // 0x1F20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F24[0x4];                                     // 0x1F24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBWeapon_RayProjectile*                WeaponOwner;                                       // 0x1F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PartReady;                                         // 0x1F30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x1F31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GSW_MG_MAG_DRUM(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnCompleted_CBBA4EE54847A3D2392507AB6CA8AA14(class FName NotifyName);
	void OnBlendOut_CBBA4EE54847A3D2392507AB6CA8AA14(class FName NotifyName);
	void OnInterrupted_CBBA4EE54847A3D2392507AB6CA8AA14(class FName NotifyName);
	void OnNotifyBegin_CBBA4EE54847A3D2392507AB6CA8AA14(class FName NotifyName);
	void OnNotifyEnd_CBBA4EE54847A3D2392507AB6CA8AA14(class FName NotifyName);
	void OnCompleted_E0591143462BFE3C753B11BF535EF18C(class FName NotifyName);
	void OnBlendOut_E0591143462BFE3C753B11BF535EF18C(class FName NotifyName);
	void OnInterrupted_E0591143462BFE3C753B11BF535EF18C(class FName NotifyName);
	void OnNotifyBegin_E0591143462BFE3C753B11BF535EF18C(class FName NotifyName);
	void OnNotifyEnd_E0591143462BFE3C753B11BF535EF18C(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GSW_MG_MAG_DRUM_C">();
	}
	static class UGSW_MG_MAG_DRUM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSW_MG_MAG_DRUM_C>();
	}
};
static_assert(alignof(UGSW_MG_MAG_DRUM_C) == 0x000008, "Wrong alignment on UGSW_MG_MAG_DRUM_C");
static_assert(sizeof(UGSW_MG_MAG_DRUM_C) == 0x001F38, "Wrong size on UGSW_MG_MAG_DRUM_C");
static_assert(offsetof(UGSW_MG_MAG_DRUM_C, UberGraphFrame) == 0x001EF8, "Member 'UGSW_MG_MAG_DRUM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGSW_MG_MAG_DRUM_C, Mesh1P) == 0x001F00, "Member 'UGSW_MG_MAG_DRUM_C::Mesh1P' has a wrong offset!");
static_assert(offsetof(UGSW_MG_MAG_DRUM_C, Mesh3P) == 0x001F08, "Member 'UGSW_MG_MAG_DRUM_C::Mesh3P' has a wrong offset!");
static_assert(offsetof(UGSW_MG_MAG_DRUM_C, AnimClass) == 0x001F10, "Member 'UGSW_MG_MAG_DRUM_C::AnimClass' has a wrong offset!");
static_assert(offsetof(UGSW_MG_MAG_DRUM_C, PartReloadMontage) == 0x001F18, "Member 'UGSW_MG_MAG_DRUM_C::PartReloadMontage' has a wrong offset!");
static_assert(offsetof(UGSW_MG_MAG_DRUM_C, ReloadRate) == 0x001F20, "Member 'UGSW_MG_MAG_DRUM_C::ReloadRate' has a wrong offset!");
static_assert(offsetof(UGSW_MG_MAG_DRUM_C, WeaponOwner) == 0x001F28, "Member 'UGSW_MG_MAG_DRUM_C::WeaponOwner' has a wrong offset!");
static_assert(offsetof(UGSW_MG_MAG_DRUM_C, PartReady) == 0x001F30, "Member 'UGSW_MG_MAG_DRUM_C::PartReady' has a wrong offset!");
static_assert(offsetof(UGSW_MG_MAG_DRUM_C, Dummy) == 0x001F31, "Member 'UGSW_MG_MAG_DRUM_C::Dummy' has a wrong offset!");

}

