#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSW_AMLR_STOG_ACOG_2_5

#include "Basic.hpp"


namespace SDK::Params
{

// Function GSW_AMLR_STOG_ACOG_2_5.GSW_AMLR_STOG_ACOG_2_5_C.ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5
// 0x0040 (0x0040 - 0x0000)
struct GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAimingRatio_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargeting_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon*                              K2Node_DynamicCast_AsPBWeapon;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5) == 0x000008, "Wrong alignment on GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5");
static_assert(sizeof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5) == 0x000040, "Wrong size on GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, EntryPoint) == 0x000000, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::EntryPoint' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, Temp_bool_Has_Been_Initd_Variable_1) == 0x000018, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, Temp_bool_IsClosed_Variable_1) == 0x000019, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, CallFunc_GetAimingRatio_ReturnValue) == 0x00001C, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::CallFunc_GetAimingRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, CallFunc_IsTargeting_ReturnValue) == 0x000021, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::CallFunc_IsTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, K2Node_DynamicCast_AsPBWeapon) == 0x000030, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::K2Node_DynamicCast_AsPBWeapon' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_ExecuteUbergraph_GSW_AMLR_STOG_ACOG_2_5::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GSW_AMLR_STOG_ACOG_2_5.GSW_AMLR_STOG_ACOG_2_5_C.RefreshPawnOwner
// 0x0030 (0x0030 - 0x0000)
struct GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon*                              K2Node_DynamicCast_AsPBWeapon;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           CallFunc_GetPawnOwner_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner) == 0x000008, "Wrong alignment on GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner");
static_assert(sizeof(GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner) == 0x000030, "Wrong size on GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner, K2Node_DynamicCast_AsPBWeapon) == 0x000008, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner::K2Node_DynamicCast_AsPBWeapon' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner, CallFunc_GetPawnOwner_ReturnValue) == 0x000018, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner::CallFunc_GetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000020, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000029, "Member 'GSW_AMLR_STOG_ACOG_2_5_C_RefreshPawnOwner::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

