#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSW_MG_MAG_DRUM

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.ExecuteUbergraph_GSW_MG_MAG_DRUM
// 0x0240 (0x0240 - 0x0000)
struct GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBPartSlotType                               Temp_byte_Variable;                                // 0x00A4(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInReloadState_ReturnValue;              // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class UMeshComponent*                         CallFunc_GetPartMesh1P_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetPartMesh3P_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon_RayProjectile*                K2Node_DynamicCast_AsPBWeapon_Ray_Projectile;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBWeaponPartManager*                   CallFunc_GetWeaponPartMgr_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EPBPartSlotType, class UPartDataHolderComponent*> CallFunc_GetWeaponSlotPartMap_ReturnValue;         // 0x0140(0x0050)(ContainsInstancedReference)
	class UPartDataHolderComponent*               CallFunc_Map_Find_Value;                           // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGSW_MG_MAG_DRUM_C*                     K2Node_DynamicCast_AsGSW_MG_MAG_DRUM;              // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetPartMesh3P_ReturnValue_1;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetPartMesh1P_ReturnValue_1;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component_1;    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x020C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM) == 0x000008, "Wrong alignment on GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM) == 0x000240, "Wrong size on GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, EntryPoint) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::EntryPoint' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName_5) == 0x000004, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, Temp_name_Variable) == 0x00001C, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName_4) == 0x000034, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName_3) == 0x00003C, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName_2) == 0x000054, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName_1) == 0x00006C, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName) == 0x000084, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate_5) == 0x00008C, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, Temp_name_Variable_1) == 0x00009C, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, Temp_byte_Variable) == 0x0000A4, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName_7) == 0x0000A8, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000C0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x0000D0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, Temp_bool_Has_Been_Initd_Variable) == 0x0000D8, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsValid_ReturnValue_1) == 0x0000D9, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName_8) == 0x0000DC, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName_6) == 0x0000E4, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsValid_ReturnValue_2) == 0x0000EC, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsInReloadState_ReturnValue) == 0x0000ED, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsInReloadState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000F0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_GetPartMesh1P_ReturnValue) == 0x000100, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_GetPartMesh1P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsValid_ReturnValue_3) == 0x000108, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_GetPartMesh3P_ReturnValue) == 0x000110, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_GetPartMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsValid_ReturnValue_4) == 0x000118, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_BooleanAND_ReturnValue) == 0x000119, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_GetOwner_ReturnValue) == 0x000120, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_DynamicCast_AsPBWeapon_Ray_Projectile) == 0x000128, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_DynamicCast_AsPBWeapon_Ray_Projectile' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_GetWeaponPartMgr_ReturnValue) == 0x000138, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_GetWeaponPartMgr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_GetWeaponSlotPartMap_ReturnValue) == 0x000140, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_GetWeaponSlotPartMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_Map_Find_Value) == 0x000190, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_Map_Find_ReturnValue) == 0x000198, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_DynamicCast_AsGSW_MG_MAG_DRUM) == 0x0001A0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_DynamicCast_AsGSW_MG_MAG_DRUM' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_GetPartMesh3P_ReturnValue_1) == 0x0001B0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_GetPartMesh3P_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_GetPartMesh1P_ReturnValue_1) == 0x0001B8, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_GetPartMesh1P_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsValid_ReturnValue_5) == 0x0001C0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsValid_ReturnValue_6) == 0x0001C1, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x0001C8, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_DynamicCast_bSuccess_2) == 0x0001D0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_DynamicCast_AsSkeletal_Mesh_Component_1) == 0x0001D8, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_DynamicCast_AsSkeletal_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_DynamicCast_bSuccess_3) == 0x0001E0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001E4, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CustomEvent_NotifyName_9) == 0x0001E8, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_Event_DeltaSeconds) == 0x0001F0, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, Temp_bool_Has_Been_Initd_Variable_1) == 0x0001F4, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, Temp_bool_IsClosed_Variable) == 0x0001F5, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001F8, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, Temp_bool_IsClosed_Variable_1) == 0x000208, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, K2Node_CreateDelegate_OutputDelegate_9) == 0x00020C, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_GetAnimInstance_ReturnValue) == 0x000220, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsValid_ReturnValue_7) == 0x000228, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000230, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM, CallFunc_IsValid_ReturnValue_8) == 0x000238, "Member 'GSW_MG_MAG_DRUM_C_ExecuteUbergraph_GSW_MG_MAG_DRUM::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GSW_MG_MAG_DRUM_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_ReceiveTick) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_ReceiveTick");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_ReceiveTick) == 0x000004, "Wrong size on GSW_MG_MAG_DRUM_C_ReceiveTick");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnCompleted_CBBA4EE54847A3D2392507AB6CA8AA14
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnCompleted_CBBA4EE54847A3D2392507AB6CA8AA14 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnCompleted_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnCompleted_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnCompleted_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnCompleted_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnCompleted_CBBA4EE54847A3D2392507AB6CA8AA14, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnCompleted_CBBA4EE54847A3D2392507AB6CA8AA14::NotifyName' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnBlendOut_CBBA4EE54847A3D2392507AB6CA8AA14
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnBlendOut_CBBA4EE54847A3D2392507AB6CA8AA14 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnBlendOut_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnBlendOut_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnBlendOut_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnBlendOut_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnBlendOut_CBBA4EE54847A3D2392507AB6CA8AA14, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnBlendOut_CBBA4EE54847A3D2392507AB6CA8AA14::NotifyName' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnInterrupted_CBBA4EE54847A3D2392507AB6CA8AA14
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnInterrupted_CBBA4EE54847A3D2392507AB6CA8AA14 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnInterrupted_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnInterrupted_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnInterrupted_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnInterrupted_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnInterrupted_CBBA4EE54847A3D2392507AB6CA8AA14, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnInterrupted_CBBA4EE54847A3D2392507AB6CA8AA14::NotifyName' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnNotifyBegin_CBBA4EE54847A3D2392507AB6CA8AA14
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnNotifyBegin_CBBA4EE54847A3D2392507AB6CA8AA14 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnNotifyBegin_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnNotifyBegin_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnNotifyBegin_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnNotifyBegin_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnNotifyBegin_CBBA4EE54847A3D2392507AB6CA8AA14, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnNotifyBegin_CBBA4EE54847A3D2392507AB6CA8AA14::NotifyName' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnNotifyEnd_CBBA4EE54847A3D2392507AB6CA8AA14
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnNotifyEnd_CBBA4EE54847A3D2392507AB6CA8AA14 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnNotifyEnd_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnNotifyEnd_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnNotifyEnd_CBBA4EE54847A3D2392507AB6CA8AA14) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnNotifyEnd_CBBA4EE54847A3D2392507AB6CA8AA14");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnNotifyEnd_CBBA4EE54847A3D2392507AB6CA8AA14, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnNotifyEnd_CBBA4EE54847A3D2392507AB6CA8AA14::NotifyName' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnCompleted_E0591143462BFE3C753B11BF535EF18C
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnCompleted_E0591143462BFE3C753B11BF535EF18C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnCompleted_E0591143462BFE3C753B11BF535EF18C) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnCompleted_E0591143462BFE3C753B11BF535EF18C");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnCompleted_E0591143462BFE3C753B11BF535EF18C) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnCompleted_E0591143462BFE3C753B11BF535EF18C");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnCompleted_E0591143462BFE3C753B11BF535EF18C, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnCompleted_E0591143462BFE3C753B11BF535EF18C::NotifyName' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnBlendOut_E0591143462BFE3C753B11BF535EF18C
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnBlendOut_E0591143462BFE3C753B11BF535EF18C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnBlendOut_E0591143462BFE3C753B11BF535EF18C) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnBlendOut_E0591143462BFE3C753B11BF535EF18C");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnBlendOut_E0591143462BFE3C753B11BF535EF18C) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnBlendOut_E0591143462BFE3C753B11BF535EF18C");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnBlendOut_E0591143462BFE3C753B11BF535EF18C, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnBlendOut_E0591143462BFE3C753B11BF535EF18C::NotifyName' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnInterrupted_E0591143462BFE3C753B11BF535EF18C
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnInterrupted_E0591143462BFE3C753B11BF535EF18C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnInterrupted_E0591143462BFE3C753B11BF535EF18C) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnInterrupted_E0591143462BFE3C753B11BF535EF18C");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnInterrupted_E0591143462BFE3C753B11BF535EF18C) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnInterrupted_E0591143462BFE3C753B11BF535EF18C");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnInterrupted_E0591143462BFE3C753B11BF535EF18C, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnInterrupted_E0591143462BFE3C753B11BF535EF18C::NotifyName' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnNotifyBegin_E0591143462BFE3C753B11BF535EF18C
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnNotifyBegin_E0591143462BFE3C753B11BF535EF18C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnNotifyBegin_E0591143462BFE3C753B11BF535EF18C) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnNotifyBegin_E0591143462BFE3C753B11BF535EF18C");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnNotifyBegin_E0591143462BFE3C753B11BF535EF18C) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnNotifyBegin_E0591143462BFE3C753B11BF535EF18C");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnNotifyBegin_E0591143462BFE3C753B11BF535EF18C, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnNotifyBegin_E0591143462BFE3C753B11BF535EF18C::NotifyName' has a wrong offset!");

// Function GSW_MG_MAG_DRUM.GSW_MG_MAG_DRUM_C.OnNotifyEnd_E0591143462BFE3C753B11BF535EF18C
// 0x0008 (0x0008 - 0x0000)
struct GSW_MG_MAG_DRUM_C_OnNotifyEnd_E0591143462BFE3C753B11BF535EF18C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSW_MG_MAG_DRUM_C_OnNotifyEnd_E0591143462BFE3C753B11BF535EF18C) == 0x000004, "Wrong alignment on GSW_MG_MAG_DRUM_C_OnNotifyEnd_E0591143462BFE3C753B11BF535EF18C");
static_assert(sizeof(GSW_MG_MAG_DRUM_C_OnNotifyEnd_E0591143462BFE3C753B11BF535EF18C) == 0x000008, "Wrong size on GSW_MG_MAG_DRUM_C_OnNotifyEnd_E0591143462BFE3C753B11BF535EF18C");
static_assert(offsetof(GSW_MG_MAG_DRUM_C_OnNotifyEnd_E0591143462BFE3C753B11BF535EF18C, NotifyName) == 0x000000, "Member 'GSW_MG_MAG_DRUM_C_OnNotifyEnd_E0591143462BFE3C753B11BF535EF18C::NotifyName' has a wrong offset!");

}

