#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSW_AR_SGTO_ACOG_4X

#include "Basic.hpp"


namespace SDK::Params
{

// Function GSW_AR_SGTO_ACOG_4X.GSW_AR_SGTO_ACOG_4X_C.ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X
// 0x0070 (0x0070 - 0x0000)
struct GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon*                              K2Node_DynamicCast_AsPBWeapon;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           CallFunc_GetPawnOwner_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAimingRatio_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargeting_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon*                              K2Node_DynamicCast_AsPBWeapon_1;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X) == 0x000008, "Wrong alignment on GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X");
static_assert(sizeof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X) == 0x000070, "Wrong size on GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, EntryPoint) == 0x000000, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::EntryPoint' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, Temp_bool_Has_Been_Initd_Variable_1) == 0x000019, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, K2Node_DynamicCast_AsPBWeapon) == 0x000028, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::K2Node_DynamicCast_AsPBWeapon' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, CallFunc_GetPawnOwner_ReturnValue) == 0x000038, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::CallFunc_GetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000040, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, CallFunc_GetAimingRatio_ReturnValue) == 0x00004C, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::CallFunc_GetAimingRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, CallFunc_IsTargeting_ReturnValue) == 0x000051, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::CallFunc_IsTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, Temp_bool_IsClosed_Variable_1) == 0x000052, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, CallFunc_GetOwner_ReturnValue_1) == 0x000058, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, K2Node_DynamicCast_AsPBWeapon_1) == 0x000060, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::K2Node_DynamicCast_AsPBWeapon_1' has a wrong offset!");
static_assert(offsetof(GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'GSW_AR_SGTO_ACOG_4X_C_ExecuteUbergraph_GSW_AR_SGTO_ACOG_4X::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

