#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HammerWithPylon_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HammerWithPylon_ABP.HammerWithPylon_ABP_C
// 0x0100 (0x03C0 - 0x02C0)
class UHammerWithPylon_ABP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0340(0x0080)()

public:
	void ExecuteUbergraph_HammerWithPylon_ABP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HammerWithPylon_ABP_C">();
	}
	static class UHammerWithPylon_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHammerWithPylon_ABP_C>();
	}
};
static_assert(alignof(UHammerWithPylon_ABP_C) == 0x000010, "Wrong alignment on UHammerWithPylon_ABP_C");
static_assert(sizeof(UHammerWithPylon_ABP_C) == 0x0003C0, "Wrong size on UHammerWithPylon_ABP_C");
static_assert(offsetof(UHammerWithPylon_ABP_C, UberGraphFrame) == 0x0002C0, "Member 'UHammerWithPylon_ABP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHammerWithPylon_ABP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UHammerWithPylon_ABP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHammerWithPylon_ABP_C, AnimGraphNode_Slot) == 0x0002F8, "Member 'UHammerWithPylon_ABP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UHammerWithPylon_ABP_C, AnimGraphNode_SequencePlayer) == 0x000340, "Member 'UHammerWithPylon_ABP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

