#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HammerWithPylon_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HammerWithPylon_ABP.HammerWithPylon_ABP_C.ExecuteUbergraph_HammerWithPylon_ABP
// 0x0004 (0x0004 - 0x0000)
struct HammerWithPylon_ABP_C_ExecuteUbergraph_HammerWithPylon_ABP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HammerWithPylon_ABP_C_ExecuteUbergraph_HammerWithPylon_ABP) == 0x000004, "Wrong alignment on HammerWithPylon_ABP_C_ExecuteUbergraph_HammerWithPylon_ABP");
static_assert(sizeof(HammerWithPylon_ABP_C_ExecuteUbergraph_HammerWithPylon_ABP) == 0x000004, "Wrong size on HammerWithPylon_ABP_C_ExecuteUbergraph_HammerWithPylon_ABP");
static_assert(offsetof(HammerWithPylon_ABP_C_ExecuteUbergraph_HammerWithPylon_ABP, EntryPoint) == 0x000000, "Member 'HammerWithPylon_ABP_C_ExecuteUbergraph_HammerWithPylon_ABP::EntryPoint' has a wrong offset!");

// Function HammerWithPylon_ABP.HammerWithPylon_ABP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct HammerWithPylon_ABP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(HammerWithPylon_ABP_C_AnimGraph) == 0x000008, "Wrong alignment on HammerWithPylon_ABP_C_AnimGraph");
static_assert(sizeof(HammerWithPylon_ABP_C_AnimGraph) == 0x000010, "Wrong size on HammerWithPylon_ABP_C_AnimGraph");
static_assert(offsetof(HammerWithPylon_ABP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'HammerWithPylon_ABP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

