#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HDR_filllight_PB

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HDR_filllight_PB.HDR_filllight_PB_C.ConstructAndCapture
// 0x00B0 (0x00B0 - 0x0000)
struct HDR_filllight_PB_C_ConstructAndCapture final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HDR_filllight_PB_C_ConstructAndCapture) == 0x000008, "Wrong alignment on HDR_filllight_PB_C_ConstructAndCapture");
static_assert(sizeof(HDR_filllight_PB_C_ConstructAndCapture) == 0x0000B0, "Wrong size on HDR_filllight_PB_C_ConstructAndCapture");
static_assert(offsetof(HDR_filllight_PB_C_ConstructAndCapture, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'HDR_filllight_PB_C_ConstructAndCapture::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HDR_filllight_PB_C_ConstructAndCapture, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'HDR_filllight_PB_C_ConstructAndCapture::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HDR_filllight_PB_C_ConstructAndCapture, CallFunc_BreakRotator_Roll) == 0x000014, "Member 'HDR_filllight_PB_C_ConstructAndCapture::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(HDR_filllight_PB_C_ConstructAndCapture, CallFunc_BreakRotator_Pitch) == 0x000018, "Member 'HDR_filllight_PB_C_ConstructAndCapture::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(HDR_filllight_PB_C_ConstructAndCapture, CallFunc_BreakRotator_Yaw) == 0x00001C, "Member 'HDR_filllight_PB_C_ConstructAndCapture::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(HDR_filllight_PB_C_ConstructAndCapture, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000020, "Member 'HDR_filllight_PB_C_ConstructAndCapture::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HDR_filllight_PB_C_ConstructAndCapture, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A8, "Member 'HDR_filllight_PB_C_ConstructAndCapture::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HDR_filllight_PB_C_ConstructAndCapture, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000AC, "Member 'HDR_filllight_PB_C_ConstructAndCapture::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

}

