#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HDR_filllight_PB

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HDR_filllight_PB.HDR_filllight_PB_C
// 0x0058 (0x0278 - 0x0220)
class AHDR_filllight_PB_C final : public AActor
{
public:
	class USkyLightComponent*                     HDRI_LightSource;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HDRI_dome;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HDRI;                                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HDRI_Inst_Runtime;                                 // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureCube*                           HDRI_Cubemap;                                      // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HDRI_Brightness;                                   // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HDRI_Desaturation;                                 // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HDRI_Tint;                                         // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HDRI_Contrast;                                     // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HDRI_pitch;                                        // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HDRI_roll;                                         // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HDRI_Yaw;                                          // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      HDRI_Inst_Master;                                  // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ConstructAndCapture();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HDR_filllight_PB_C">();
	}
	static class AHDR_filllight_PB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHDR_filllight_PB_C>();
	}
};
static_assert(alignof(AHDR_filllight_PB_C) == 0x000008, "Wrong alignment on AHDR_filllight_PB_C");
static_assert(sizeof(AHDR_filllight_PB_C) == 0x000278, "Wrong size on AHDR_filllight_PB_C");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_LightSource) == 0x000220, "Member 'AHDR_filllight_PB_C::HDRI_LightSource' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_dome) == 0x000228, "Member 'AHDR_filllight_PB_C::HDRI_dome' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI) == 0x000230, "Member 'AHDR_filllight_PB_C::HDRI' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_Inst_Runtime) == 0x000238, "Member 'AHDR_filllight_PB_C::HDRI_Inst_Runtime' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_Cubemap) == 0x000240, "Member 'AHDR_filllight_PB_C::HDRI_Cubemap' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_Brightness) == 0x000248, "Member 'AHDR_filllight_PB_C::HDRI_Brightness' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_Desaturation) == 0x00024C, "Member 'AHDR_filllight_PB_C::HDRI_Desaturation' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_Tint) == 0x000250, "Member 'AHDR_filllight_PB_C::HDRI_Tint' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_Contrast) == 0x000260, "Member 'AHDR_filllight_PB_C::HDRI_Contrast' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_pitch) == 0x000264, "Member 'AHDR_filllight_PB_C::HDRI_pitch' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_roll) == 0x000268, "Member 'AHDR_filllight_PB_C::HDRI_roll' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_Yaw) == 0x00026C, "Member 'AHDR_filllight_PB_C::HDRI_Yaw' has a wrong offset!");
static_assert(offsetof(AHDR_filllight_PB_C, HDRI_Inst_Master) == 0x000270, "Member 'AHDR_filllight_PB_C::HDRI_Inst_Master' has a wrong offset!");

}

