#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HostHasLeftTheGame

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HostHasLeftTheGame.HostHasLeftTheGame_C
// 0x0050 (0x0300 - 0x02B0)
class UHostHasLeftTheGame_C final : public UPBConfirmationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_LeavePage;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_373;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_436;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MessageText;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      PBInputTipsImage_0;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HostHasLeftTheGame(int32 EntryPoint);
	void InitFocus();
	void BndEvt__Button_LeavePage_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HostHasLeftTheGame_C">();
	}
	static class UHostHasLeftTheGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHostHasLeftTheGame_C>();
	}
};
static_assert(alignof(UHostHasLeftTheGame_C) == 0x000008, "Wrong alignment on UHostHasLeftTheGame_C");
static_assert(sizeof(UHostHasLeftTheGame_C) == 0x000300, "Wrong size on UHostHasLeftTheGame_C");
static_assert(offsetof(UHostHasLeftTheGame_C, UberGraphFrame) == 0x0002B0, "Member 'UHostHasLeftTheGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHostHasLeftTheGame_C, Button_LeavePage) == 0x0002B8, "Member 'UHostHasLeftTheGame_C::Button_LeavePage' has a wrong offset!");
static_assert(offsetof(UHostHasLeftTheGame_C, Image) == 0x0002C0, "Member 'UHostHasLeftTheGame_C::Image' has a wrong offset!");
static_assert(offsetof(UHostHasLeftTheGame_C, Image_0) == 0x0002C8, "Member 'UHostHasLeftTheGame_C::Image_0' has a wrong offset!");
static_assert(offsetof(UHostHasLeftTheGame_C, Image_1) == 0x0002D0, "Member 'UHostHasLeftTheGame_C::Image_1' has a wrong offset!");
static_assert(offsetof(UHostHasLeftTheGame_C, Image_2) == 0x0002D8, "Member 'UHostHasLeftTheGame_C::Image_2' has a wrong offset!");
static_assert(offsetof(UHostHasLeftTheGame_C, Image_373) == 0x0002E0, "Member 'UHostHasLeftTheGame_C::Image_373' has a wrong offset!");
static_assert(offsetof(UHostHasLeftTheGame_C, Image_436) == 0x0002E8, "Member 'UHostHasLeftTheGame_C::Image_436' has a wrong offset!");
static_assert(offsetof(UHostHasLeftTheGame_C, MessageText) == 0x0002F0, "Member 'UHostHasLeftTheGame_C::MessageText' has a wrong offset!");
static_assert(offsetof(UHostHasLeftTheGame_C, PBInputTipsImage_0) == 0x0002F8, "Member 'UHostHasLeftTheGame_C::PBInputTipsImage_0' has a wrong offset!");

}

