#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_Observe

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function HUD_Observe.HUD_Observe_C.ExecuteUbergraph_HUD_Observe
// 0x0448 (0x0448 - 0x0000)
struct HUD_Observe_C_ExecuteUbergraph_HUD_Observe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBCharacterDefinitionRow              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x03D0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State_1;             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInPlayerLifeStatus_ReturnValue;         // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInPlayerLifeStatus_ReturnValue_1;       // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FB[0x5];                                      // 0x03FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0400(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0430(0x0018)()
};
static_assert(alignof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe) == 0x000008, "Wrong alignment on HUD_Observe_C_ExecuteUbergraph_HUD_Observe");
static_assert(sizeof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe) == 0x000448, "Wrong size on HUD_Observe_C_ExecuteUbergraph_HUD_Observe");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, EntryPoint) == 0x000000, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003D8, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, K2Node_DynamicCast_AsPBPlayer_State) == 0x0003E0, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, K2Node_DynamicCast_bSuccess) == 0x0003E8, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, K2Node_DynamicCast_AsPBPlayer_State_1) == 0x0003F0, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::K2Node_DynamicCast_AsPBPlayer_State_1' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, K2Node_DynamicCast_bSuccess_1) == 0x0003F8, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, CallFunc_IsInPlayerLifeStatus_ReturnValue) == 0x0003F9, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::CallFunc_IsInPlayerLifeStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, CallFunc_IsInPlayerLifeStatus_ReturnValue_1) == 0x0003FA, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::CallFunc_IsInPlayerLifeStatus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, CallFunc_Conv_IntToText_ReturnValue) == 0x000400, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, CallFunc_BooleanOR_ReturnValue) == 0x000418, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, CallFunc_GetPlayerName_ReturnValue) == 0x000420, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Observe_C_ExecuteUbergraph_HUD_Observe, CallFunc_Conv_StringToText_ReturnValue) == 0x000430, "Member 'HUD_Observe_C_ExecuteUbergraph_HUD_Observe::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

