#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_Observe

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD_Observe.HUD_Observe_C
// 0x0058 (0x02B8 - 0x0260)
class UHUD_Observe_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           CanvasPanel_Ob;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_EnterTips;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_131;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arms;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      Image_InputButton;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      Image_InuptButton_Middle;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Level;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ObName;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ReviveTips;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APBCharacter*                           ObserveCharacter;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUD_Observe(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_Observe_C">();
	}
	static class UHUD_Observe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_Observe_C>();
	}
};
static_assert(alignof(UHUD_Observe_C) == 0x000008, "Wrong alignment on UHUD_Observe_C");
static_assert(sizeof(UHUD_Observe_C) == 0x0002B8, "Wrong size on UHUD_Observe_C");
static_assert(offsetof(UHUD_Observe_C, UberGraphFrame) == 0x000260, "Member 'UHUD_Observe_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, CanvasPanel_Ob) == 0x000268, "Member 'UHUD_Observe_C::CanvasPanel_Ob' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, HorizontalBox_EnterTips) == 0x000270, "Member 'UHUD_Observe_C::HorizontalBox_EnterTips' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, Image_131) == 0x000278, "Member 'UHUD_Observe_C::Image_131' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, Image_Arms) == 0x000280, "Member 'UHUD_Observe_C::Image_Arms' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, Image_InputButton) == 0x000288, "Member 'UHUD_Observe_C::Image_InputButton' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, Image_InuptButton_Middle) == 0x000290, "Member 'UHUD_Observe_C::Image_InuptButton_Middle' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, TextBlock_Level) == 0x000298, "Member 'UHUD_Observe_C::TextBlock_Level' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, TextBlock_ObName) == 0x0002A0, "Member 'UHUD_Observe_C::TextBlock_ObName' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, TextBlock_ReviveTips) == 0x0002A8, "Member 'UHUD_Observe_C::TextBlock_ReviveTips' has a wrong offset!");
static_assert(offsetof(UHUD_Observe_C, ObserveCharacter) == 0x0002B0, "Member 'UHUD_Observe_C::ObserveCharacter' has a wrong offset!");

}

