#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_BeingRescue

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HUD_BeingRescue.HUD_BeingRescue_C.ExecuteUbergraph_HUD_BeingRescue
// 0x0088 (0x0088 - 0x0000)
struct HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBeingRescuedPercent_ReturnValue;       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBeingRescuedEscapeTime_ReturnValue;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0070(0x0018)()
};
static_assert(alignof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue) == 0x000008, "Wrong alignment on HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue");
static_assert(sizeof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue) == 0x000088, "Wrong size on HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, EntryPoint) == 0x000000, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, K2Node_Event_MyGeometry) == 0x000004, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, CallFunc_K2_GetPawn_ReturnValue) == 0x000050, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, K2Node_DynamicCast_AsPBCharacter) == 0x000058, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::K2Node_DynamicCast_AsPBCharacter' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, CallFunc_GetBeingRescuedPercent_ReturnValue) == 0x000064, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::CallFunc_GetBeingRescuedPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, CallFunc_GetBeingRescuedEscapeTime_ReturnValue) == 0x000068, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::CallFunc_GetBeingRescuedEscapeTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue, CallFunc_Conv_FloatToText_ReturnValue) == 0x000070, "Member 'HUD_BeingRescue_C_ExecuteUbergraph_HUD_BeingRescue::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");

// Function HUD_BeingRescue.HUD_BeingRescue_C.Tick
// 0x003C (0x003C - 0x0000)
struct HUD_BeingRescue_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_BeingRescue_C_Tick) == 0x000004, "Wrong alignment on HUD_BeingRescue_C_Tick");
static_assert(sizeof(HUD_BeingRescue_C_Tick) == 0x00003C, "Wrong size on HUD_BeingRescue_C_Tick");
static_assert(offsetof(HUD_BeingRescue_C_Tick, MyGeometry) == 0x000000, "Member 'HUD_BeingRescue_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(HUD_BeingRescue_C_Tick, InDeltaTime) == 0x000038, "Member 'HUD_BeingRescue_C_Tick::InDeltaTime' has a wrong offset!");

}

