#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_HitDown

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HUD_HitDown.HUD_HitDown_C.ExecuteUbergraph_HUD_HitDown
// 0x0070 (0x0070 - 0x0000)
struct HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEnableQuickRespawnRemainTime_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEnableQuickRespawnPercent_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerController*                    K2Node_DynamicCast_AsPBPlayer_Controller;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown) == 0x000008, "Wrong alignment on HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown");
static_assert(sizeof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown) == 0x000070, "Wrong size on HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, EntryPoint) == 0x000000, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, CallFunc_GetEnableQuickRespawnRemainTime_ReturnValue) == 0x000008, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::CallFunc_GetEnableQuickRespawnRemainTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, CallFunc_GetEnableQuickRespawnPercent_ReturnValue) == 0x000010, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::CallFunc_GetEnableQuickRespawnPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, K2Node_Event_MyGeometry) == 0x000014, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, K2Node_DynamicCast_AsPBPlayer_Controller) == 0x000060, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::K2Node_DynamicCast_AsPBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'HUD_HitDown_C_ExecuteUbergraph_HUD_HitDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function HUD_HitDown.HUD_HitDown_C.Tick
// 0x003C (0x003C - 0x0000)
struct HUD_HitDown_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_HitDown_C_Tick) == 0x000004, "Wrong alignment on HUD_HitDown_C_Tick");
static_assert(sizeof(HUD_HitDown_C_Tick) == 0x00003C, "Wrong size on HUD_HitDown_C_Tick");
static_assert(offsetof(HUD_HitDown_C_Tick, MyGeometry) == 0x000000, "Member 'HUD_HitDown_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(HUD_HitDown_C_Tick, InDeltaTime) == 0x000038, "Member 'HUD_HitDown_C_Tick::InDeltaTime' has a wrong offset!");

}

