#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameAchiFeedBack

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InGameAchiFeedBack.InGameAchiFeedBack_C
// 0x00F0 (0x0350 - 0x0260)
class UInGameAchiFeedBack_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LevelUpTextAnim;                                   // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconShakeStageColume;                              // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconShakeStage2;                                   // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconShakeStage1;                                   // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ArchivementNameText;                               // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelMain;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_0;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_1;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_2;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_3;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_4;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Main;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLevelNum;                                      // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                DefaultBlankImage;                                 // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   AchiDisplayText;                                   // 0x02D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FAchievementInfo>               ArchInfo;                                          // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LevelNum;                                          // 0x0300(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         LevelNumCache;                                     // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              PlayEnd;                                           // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          AreWeTheOnlyOneIcon;                               // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAchievementInfo>               ArchInfoTest;                                      // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShake1IsPlaying;                                  // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLevelUpIsPlaying;                                 // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_InGameAchiFeedBack(int32 EntryPoint);
	void WidgetAnimationEvt_IconShakeStage2_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_LevelUpTextAnim_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_IconShakeStage1_K2Node_WidgetAnimationEvent_0();
	void Construct();
	void UpdateWidgetAndStartAnim();
	void UpdateLevelNum();
	void UpdateSubWidget(bool HaveValue, class UImage* ImageWidget, class UObject* Image);
	void AdditemAndPlayAnim(bool* ShouldPlayAnim, bool* LevelUp);
	void InitWidget(TArray<struct FAchievementInfo>& ArchInfo_0);
	void UpdateArchiColumContent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGameAchiFeedBack_C">();
	}
	static class UInGameAchiFeedBack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInGameAchiFeedBack_C>();
	}
};
static_assert(alignof(UInGameAchiFeedBack_C) == 0x000008, "Wrong alignment on UInGameAchiFeedBack_C");
static_assert(sizeof(UInGameAchiFeedBack_C) == 0x000350, "Wrong size on UInGameAchiFeedBack_C");
static_assert(offsetof(UInGameAchiFeedBack_C, UberGraphFrame) == 0x000260, "Member 'UInGameAchiFeedBack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, LevelUpTextAnim) == 0x000268, "Member 'UInGameAchiFeedBack_C::LevelUpTextAnim' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, IconShakeStageColume) == 0x000270, "Member 'UInGameAchiFeedBack_C::IconShakeStageColume' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, IconShakeStage2) == 0x000278, "Member 'UInGameAchiFeedBack_C::IconShakeStage2' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, IconShakeStage1) == 0x000280, "Member 'UInGameAchiFeedBack_C::IconShakeStage1' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, ArchivementNameText) == 0x000288, "Member 'UInGameAchiFeedBack_C::ArchivementNameText' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, CanvasPanelMain) == 0x000290, "Member 'UInGameAchiFeedBack_C::CanvasPanelMain' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, IMG_0) == 0x000298, "Member 'UInGameAchiFeedBack_C::IMG_0' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, IMG_1) == 0x0002A0, "Member 'UInGameAchiFeedBack_C::IMG_1' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, IMG_2) == 0x0002A8, "Member 'UInGameAchiFeedBack_C::IMG_2' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, IMG_3) == 0x0002B0, "Member 'UInGameAchiFeedBack_C::IMG_3' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, IMG_4) == 0x0002B8, "Member 'UInGameAchiFeedBack_C::IMG_4' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, IMG_Main) == 0x0002C0, "Member 'UInGameAchiFeedBack_C::IMG_Main' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, TextLevelNum) == 0x0002C8, "Member 'UInGameAchiFeedBack_C::TextLevelNum' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, DefaultBlankImage) == 0x0002D0, "Member 'UInGameAchiFeedBack_C::DefaultBlankImage' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, AchiDisplayText) == 0x0002D8, "Member 'UInGameAchiFeedBack_C::AchiDisplayText' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, ArchInfo) == 0x0002F0, "Member 'UInGameAchiFeedBack_C::ArchInfo' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, LevelNum) == 0x000300, "Member 'UInGameAchiFeedBack_C::LevelNum' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, LevelNumCache) == 0x000318, "Member 'UInGameAchiFeedBack_C::LevelNumCache' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, PlayEnd) == 0x000320, "Member 'UInGameAchiFeedBack_C::PlayEnd' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, AreWeTheOnlyOneIcon) == 0x000330, "Member 'UInGameAchiFeedBack_C::AreWeTheOnlyOneIcon' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, ArchInfoTest) == 0x000338, "Member 'UInGameAchiFeedBack_C::ArchInfoTest' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, bShake1IsPlaying) == 0x000348, "Member 'UInGameAchiFeedBack_C::bShake1IsPlaying' has a wrong offset!");
static_assert(offsetof(UInGameAchiFeedBack_C, bLevelUpIsPlaying) == 0x000349, "Member 'UInGameAchiFeedBack_C::bLevelUpIsPlaying' has a wrong offset!");

}

