#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameOption_V2

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InGameOption_V2.InGameOption_V2_C
// 0x0078 (0x0398 - 0x0320)
class UInGameOption_V2_C final : public UPBCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Setting;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Setting;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_181;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBottomTips_C*                          EscTips;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OptionPad;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InGameFieldMod_C*                  UMG_InGameFieldMod;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MapName;                                           // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APlayerController_BP_C*                 TheController;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                TempDisplayerActor;                                // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                LeaveMatchHint;                                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewShow;                                           // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_InGameOption_V2(int32 EntryPoint);
	void BP_OnDeactivated();
	void BndEvt__InGameOption_V2_Button_Setting_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__InGameOption_V2_Button_Setting_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BP_OnActivated();
	void Construct();
	void PromptInGameOption();
	void CustomEvent_1(int32 Index_0);
	void CustomEvent_0(int32 Index_0);
	void BndEvt__InGameOption_V2_Button_Setting_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__InGameOption_V2_UMG_InGameFieldMod_K2Node_ComponentBoundEvent_1_ClickDeploy__DelegateSignature();
	void Back();
	void CloseEvent();
	void OnInitialized();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply GamepadBackKey(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void InitFieldMod();
	void InGameOption_V2_AutoGenFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGameOption_V2_C">();
	}
	static class UInGameOption_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInGameOption_V2_C>();
	}
};
static_assert(alignof(UInGameOption_V2_C) == 0x000008, "Wrong alignment on UInGameOption_V2_C");
static_assert(sizeof(UInGameOption_V2_C) == 0x000398, "Wrong size on UInGameOption_V2_C");
static_assert(offsetof(UInGameOption_V2_C, UberGraphFrame) == 0x000320, "Member 'UInGameOption_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, Border_Setting) == 0x000328, "Member 'UInGameOption_V2_C::Border_Setting' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, Button_Setting) == 0x000330, "Member 'UInGameOption_V2_C::Button_Setting' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, CommonActionWidget_181) == 0x000338, "Member 'UInGameOption_V2_C::CommonActionWidget_181' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, EscTips) == 0x000340, "Member 'UInGameOption_V2_C::EscTips' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, OptionPad) == 0x000348, "Member 'UInGameOption_V2_C::OptionPad' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, SafeZone_1) == 0x000350, "Member 'UInGameOption_V2_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, UMG_InGameFieldMod) == 0x000358, "Member 'UInGameOption_V2_C::UMG_InGameFieldMod' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, MapName) == 0x000360, "Member 'UInGameOption_V2_C::MapName' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, TheController) == 0x000378, "Member 'UInGameOption_V2_C::TheController' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, TempDisplayerActor) == 0x000380, "Member 'UInGameOption_V2_C::TempDisplayerActor' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, LeaveMatchHint) == 0x000388, "Member 'UInGameOption_V2_C::LeaveMatchHint' has a wrong offset!");
static_assert(offsetof(UInGameOption_V2_C, NewShow) == 0x000390, "Member 'UInGameOption_V2_C::NewShow' has a wrong offset!");

}

