#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputConsumerForKeyBinding

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass InputConsumerForKeyBinding.InputConsumerForKeyBinding_C
// 0x0050 (0x0270 - 0x0220)
class AInputConsumerForKeyBinding_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Cancel, TArray<struct FKey>& RetKey, bool Shift, bool Ctrl, bool Alt)> Return;                                            // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bGamepadKey;                                       // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           AvaliableGamepadKeys;                              // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DoubleKeys;                                        // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           RetKeys;                                           // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_InputConsumerForKeyBinding(int32 EntryPoint);
	void ReceiveBeginPlay();
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void TryToReturn(bool Cancel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InputConsumerForKeyBinding_C">();
	}
	static class AInputConsumerForKeyBinding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInputConsumerForKeyBinding_C>();
	}
};
static_assert(alignof(AInputConsumerForKeyBinding_C) == 0x000008, "Wrong alignment on AInputConsumerForKeyBinding_C");
static_assert(sizeof(AInputConsumerForKeyBinding_C) == 0x000270, "Wrong size on AInputConsumerForKeyBinding_C");
static_assert(offsetof(AInputConsumerForKeyBinding_C, UberGraphFrame) == 0x000220, "Member 'AInputConsumerForKeyBinding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AInputConsumerForKeyBinding_C, DefaultSceneRoot) == 0x000228, "Member 'AInputConsumerForKeyBinding_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AInputConsumerForKeyBinding_C, Return) == 0x000230, "Member 'AInputConsumerForKeyBinding_C::Return' has a wrong offset!");
static_assert(offsetof(AInputConsumerForKeyBinding_C, bGamepadKey) == 0x000240, "Member 'AInputConsumerForKeyBinding_C::bGamepadKey' has a wrong offset!");
static_assert(offsetof(AInputConsumerForKeyBinding_C, AvaliableGamepadKeys) == 0x000248, "Member 'AInputConsumerForKeyBinding_C::AvaliableGamepadKeys' has a wrong offset!");
static_assert(offsetof(AInputConsumerForKeyBinding_C, DoubleKeys) == 0x000258, "Member 'AInputConsumerForKeyBinding_C::DoubleKeys' has a wrong offset!");
static_assert(offsetof(AInputConsumerForKeyBinding_C, RetKeys) == 0x000260, "Member 'AInputConsumerForKeyBinding_C::RetKeys' has a wrong offset!");

}

