#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillItem

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KillItem.KillItem_C
// 0x0170 (0x03D8 - 0x0268)
class UKillItem_C final : public UPBWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimOpacity;                                       // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_57;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Causer;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Instigator;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Skeleton;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Deceased;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Killer;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         NowPositionY;                                      // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         position;                                          // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFade;                                             // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            MyColor;                                           // 0x02C8(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            EnemyColor;                                        // 0x02F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            FriendColor;                                       // 0x0318(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UKillList_C*                            father;                                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WaitForFadeTimer;                                  // 0x0348(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WaitingForReset;                                   // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            DefalutColor;                                      // 0x0358(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            ED;                                                // 0x0380(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            FD;                                                // 0x03A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Hight;                                             // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_KillItem(int32 EntryPoint);
	void CustomEvent_0();
	void PreConstruct(bool IsDesignTime);
	void WidgetAnimationEvt_FadeOutAnim_K2Node_WidgetAnimationEvent_0();
	void Reset();
	void FadeOut();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Fade();
	void Construct();
	void ConfigKillType(EPBHitZone HitZone);
	void Config_Icon(const class UDamageType* DamageType, class UTexture* Icon, class UTextureRenderTarget2D* RenderTarget, class AActor* DamageCauser);
	void InitKillItem(class APBPlayerState* Killer, class APBPlayerState* Deceased, const class UDamageType* DamageType, EPBHitZone HitZone, class UTexture* Icon, class UTextureRenderTarget2D* RenderTarget, class AActor* DamageCauser);
	void ConfigName(class APBPlayerState* KillerPlayerState, class APBPlayerState* DeceasedPlayerState);
	void ConfigColor(class APBPlayerState* InKillerPlayerState, class APBPlayerState* InDeceasedPlayerState);
	void InitPlayerEnterInfo(class APBPlayerState* PBPlayerState, bool Enter);
	void UpdateColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KillItem_C">();
	}
	static class UKillItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillItem_C>();
	}
};
static_assert(alignof(UKillItem_C) == 0x000008, "Wrong alignment on UKillItem_C");
static_assert(sizeof(UKillItem_C) == 0x0003D8, "Wrong size on UKillItem_C");
static_assert(offsetof(UKillItem_C, UberGraphFrame) == 0x000268, "Member 'UKillItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKillItem_C, FadeOutAnim) == 0x000270, "Member 'UKillItem_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UKillItem_C, AnimOpacity) == 0x000278, "Member 'UKillItem_C::AnimOpacity' has a wrong offset!");
static_assert(offsetof(UKillItem_C, Image_57) == 0x000280, "Member 'UKillItem_C::Image_57' has a wrong offset!");
static_assert(offsetof(UKillItem_C, Image_Causer) == 0x000288, "Member 'UKillItem_C::Image_Causer' has a wrong offset!");
static_assert(offsetof(UKillItem_C, Image_Instigator) == 0x000290, "Member 'UKillItem_C::Image_Instigator' has a wrong offset!");
static_assert(offsetof(UKillItem_C, Image_Skeleton) == 0x000298, "Member 'UKillItem_C::Image_Skeleton' has a wrong offset!");
static_assert(offsetof(UKillItem_C, SizeBox_0) == 0x0002A0, "Member 'UKillItem_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UKillItem_C, Text_Deceased) == 0x0002A8, "Member 'UKillItem_C::Text_Deceased' has a wrong offset!");
static_assert(offsetof(UKillItem_C, Text_Killer) == 0x0002B0, "Member 'UKillItem_C::Text_Killer' has a wrong offset!");
static_assert(offsetof(UKillItem_C, NowPositionY) == 0x0002B8, "Member 'UKillItem_C::NowPositionY' has a wrong offset!");
static_assert(offsetof(UKillItem_C, position) == 0x0002BC, "Member 'UKillItem_C::position' has a wrong offset!");
static_assert(offsetof(UKillItem_C, bFade) == 0x0002C0, "Member 'UKillItem_C::bFade' has a wrong offset!");
static_assert(offsetof(UKillItem_C, MyColor) == 0x0002C8, "Member 'UKillItem_C::MyColor' has a wrong offset!");
static_assert(offsetof(UKillItem_C, EnemyColor) == 0x0002F0, "Member 'UKillItem_C::EnemyColor' has a wrong offset!");
static_assert(offsetof(UKillItem_C, FriendColor) == 0x000318, "Member 'UKillItem_C::FriendColor' has a wrong offset!");
static_assert(offsetof(UKillItem_C, father) == 0x000340, "Member 'UKillItem_C::father' has a wrong offset!");
static_assert(offsetof(UKillItem_C, WaitForFadeTimer) == 0x000348, "Member 'UKillItem_C::WaitForFadeTimer' has a wrong offset!");
static_assert(offsetof(UKillItem_C, WaitingForReset) == 0x000350, "Member 'UKillItem_C::WaitingForReset' has a wrong offset!");
static_assert(offsetof(UKillItem_C, DefalutColor) == 0x000358, "Member 'UKillItem_C::DefalutColor' has a wrong offset!");
static_assert(offsetof(UKillItem_C, ED) == 0x000380, "Member 'UKillItem_C::ED' has a wrong offset!");
static_assert(offsetof(UKillItem_C, FD) == 0x0003A8, "Member 'UKillItem_C::FD' has a wrong offset!");
static_assert(offsetof(UKillItem_C, Hight) == 0x0003D0, "Member 'UKillItem_C::Hight' has a wrong offset!");

}

