#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function KillItem.KillItem_C.ExecuteUbergraph_KillItem
// 0x00E0 (0x00E0 - 0x0000)
struct KillItem_C_ExecuteUbergraph_KillItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0050(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBPersistentUser*                      CallFunc_GetPBPersistentUser_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBPersistentUser_BP_C*                 K2Node_DynamicCast_AsPBPersistent_User_BP;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillItem_C_ExecuteUbergraph_KillItem) == 0x000008, "Wrong alignment on KillItem_C_ExecuteUbergraph_KillItem");
static_assert(sizeof(KillItem_C_ExecuteUbergraph_KillItem) == 0x0000E0, "Wrong size on KillItem_C_ExecuteUbergraph_KillItem");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, EntryPoint) == 0x000000, "Member 'KillItem_C_ExecuteUbergraph_KillItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'KillItem_C_ExecuteUbergraph_KillItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'KillItem_C_ExecuteUbergraph_KillItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'KillItem_C_ExecuteUbergraph_KillItem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000048, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, K2Node_Event_MyGeometry) == 0x000050, "Member 'KillItem_C_ExecuteUbergraph_KillItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, K2Node_Event_InDeltaTime) == 0x000088, "Member 'KillItem_C_ExecuteUbergraph_KillItem::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000090, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000094, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_MakeVector2D_ReturnValue_1) == 0x000098, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000A0, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000B0, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, K2Node_Event_IsDesignTime) == 0x0000B8, "Member 'KillItem_C_ExecuteUbergraph_KillItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_GetPBPersistentUser_ReturnValue) == 0x0000C0, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_GetPBPersistentUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, K2Node_DynamicCast_AsPBPersistent_User_BP) == 0x0000C8, "Member 'KillItem_C_ExecuteUbergraph_KillItem::K2Node_DynamicCast_AsPBPersistent_User_BP' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'KillItem_C_ExecuteUbergraph_KillItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0000D4, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x0000D8, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KillItem_C_ExecuteUbergraph_KillItem, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000DC, "Member 'KillItem_C_ExecuteUbergraph_KillItem::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function KillItem.KillItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct KillItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillItem_C_PreConstruct) == 0x000001, "Wrong alignment on KillItem_C_PreConstruct");
static_assert(sizeof(KillItem_C_PreConstruct) == 0x000001, "Wrong size on KillItem_C_PreConstruct");
static_assert(offsetof(KillItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'KillItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function KillItem.KillItem_C.Tick
// 0x003C (0x003C - 0x0000)
struct KillItem_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillItem_C_Tick) == 0x000004, "Wrong alignment on KillItem_C_Tick");
static_assert(sizeof(KillItem_C_Tick) == 0x00003C, "Wrong size on KillItem_C_Tick");
static_assert(offsetof(KillItem_C_Tick, MyGeometry) == 0x000000, "Member 'KillItem_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(KillItem_C_Tick, InDeltaTime) == 0x000038, "Member 'KillItem_C_Tick::InDeltaTime' has a wrong offset!");

// Function KillItem.KillItem_C.ConfigKillType
// 0x0002 (0x0002 - 0x0000)
struct KillItem_C_ConfigKillType final
{
public:
	EPBHitZone                                    HitZone;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillItem_C_ConfigKillType) == 0x000001, "Wrong alignment on KillItem_C_ConfigKillType");
static_assert(sizeof(KillItem_C_ConfigKillType) == 0x000002, "Wrong size on KillItem_C_ConfigKillType");
static_assert(offsetof(KillItem_C_ConfigKillType, HitZone) == 0x000000, "Member 'KillItem_C_ConfigKillType::HitZone' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigKillType, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'KillItem_C_ConfigKillType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function KillItem.KillItem_C.Config Icon
// 0x0080 (0x0080 - 0x0000)
struct KillItem_C_Config_Icon final
{
public:
	const class UDamageType*                      DamageType;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Icon;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LocalMaterial;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon*                              K2Node_DynamicCast_AsPBWeapon;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetWeaponIcon_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPBDamageType*                    K2Node_DynamicCast_AsPBDamage_Type;                // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillItem_C_Config_Icon) == 0x000008, "Wrong alignment on KillItem_C_Config_Icon");
static_assert(sizeof(KillItem_C_Config_Icon) == 0x000080, "Wrong size on KillItem_C_Config_Icon");
static_assert(offsetof(KillItem_C_Config_Icon, DamageType) == 0x000000, "Member 'KillItem_C_Config_Icon::DamageType' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, Icon) == 0x000008, "Member 'KillItem_C_Config_Icon::Icon' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, RenderTarget) == 0x000010, "Member 'KillItem_C_Config_Icon::RenderTarget' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, DamageCauser) == 0x000018, "Member 'KillItem_C_Config_Icon::DamageCauser' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, LocalMaterial) == 0x000020, "Member 'KillItem_C_Config_Icon::LocalMaterial' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, K2Node_DynamicCast_AsPBWeapon) == 0x000028, "Member 'KillItem_C_Config_Icon::K2Node_DynamicCast_AsPBWeapon' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'KillItem_C_Config_Icon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, CallFunc_GetWeaponIcon_ReturnValue) == 0x000038, "Member 'KillItem_C_Config_Icon::CallFunc_GetWeaponIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'KillItem_C_Config_Icon::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'KillItem_C_Config_Icon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, K2Node_DynamicCast_AsTexture_2D) == 0x000050, "Member 'KillItem_C_Config_Icon::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'KillItem_C_Config_Icon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, K2Node_DynamicCast_AsPBDamage_Type) == 0x000060, "Member 'KillItem_C_Config_Icon::K2Node_DynamicCast_AsPBDamage_Type' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'KillItem_C_Config_Icon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'KillItem_C_Config_Icon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, K2Node_DynamicCast_AsTexture_2D_1) == 0x000070, "Member 'KillItem_C_Config_Icon::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_Config_Icon, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'KillItem_C_Config_Icon::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function KillItem.KillItem_C.InitKillItem
// 0x0038 (0x0038 - 0x0000)
struct KillItem_C_InitKillItem final
{
public:
	class APBPlayerState*                         Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         Deceased;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBHitZone                                    HitZone;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Icon;                                              // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillItem_C_InitKillItem) == 0x000008, "Wrong alignment on KillItem_C_InitKillItem");
static_assert(sizeof(KillItem_C_InitKillItem) == 0x000038, "Wrong size on KillItem_C_InitKillItem");
static_assert(offsetof(KillItem_C_InitKillItem, Killer) == 0x000000, "Member 'KillItem_C_InitKillItem::Killer' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitKillItem, Deceased) == 0x000008, "Member 'KillItem_C_InitKillItem::Deceased' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitKillItem, DamageType) == 0x000010, "Member 'KillItem_C_InitKillItem::DamageType' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitKillItem, HitZone) == 0x000018, "Member 'KillItem_C_InitKillItem::HitZone' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitKillItem, Icon) == 0x000020, "Member 'KillItem_C_InitKillItem::Icon' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitKillItem, RenderTarget) == 0x000028, "Member 'KillItem_C_InitKillItem::RenderTarget' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitKillItem, DamageCauser) == 0x000030, "Member 'KillItem_C_InitKillItem::DamageCauser' has a wrong offset!");

// Function KillItem.KillItem_C.ConfigName
// 0x00A8 (0x00A8 - 0x0000)
struct KillItem_C_ConfigName final
{
public:
	class APBPlayerState*                         KillerPlayerState;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         DeceasedPlayerState;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0050(0x0018)()
	class UPBFriendManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBlockPlayerList_BP_ReturnValue;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBFriendManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBlockPlayerDisplayName_BP_ReturnValue; // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0090(0x0018)()
};
static_assert(alignof(KillItem_C_ConfigName) == 0x000008, "Wrong alignment on KillItem_C_ConfigName");
static_assert(sizeof(KillItem_C_ConfigName) == 0x0000A8, "Wrong size on KillItem_C_ConfigName");
static_assert(offsetof(KillItem_C_ConfigName, KillerPlayerState) == 0x000000, "Member 'KillItem_C_ConfigName::KillerPlayerState' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, DeceasedPlayerState) == 0x000008, "Member 'KillItem_C_ConfigName::DeceasedPlayerState' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'KillItem_C_ConfigName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_GetPlayerName_ReturnValue) == 0x000018, "Member 'KillItem_C_ConfigName::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'KillItem_C_ConfigName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_GetPlayerName_ReturnValue_1) == 0x000040, "Member 'KillItem_C_ConfigName::CallFunc_GetPlayerName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000050, "Member 'KillItem_C_ConfigName::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000068, "Member 'KillItem_C_ConfigName::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_IsInBlockPlayerList_BP_ReturnValue) == 0x000070, "Member 'KillItem_C_ConfigName::CallFunc_IsInBlockPlayerList_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000078, "Member 'KillItem_C_ConfigName::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_GetBlockPlayerDisplayName_BP_ReturnValue) == 0x000080, "Member 'KillItem_C_ConfigName::CallFunc_GetBlockPlayerDisplayName_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigName, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000090, "Member 'KillItem_C_ConfigName::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");

// Function KillItem.KillItem_C.ConfigColor
// 0x0050 (0x0050 - 0x0000)
struct KillItem_C_ConfigColor final
{
public:
	class APBPlayerState*                         InKillerPlayerState;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         InDeceasedPlayerState;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         KillerPlayerState;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         DeceasedPlayerState;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         MyPlayerState;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DeceasedSameTeam;                                  // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          KillerSameTeam;                                    // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBCamp                                       CallFunc_GetCampAttitude_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBCamp                                       CallFunc_GetCampAttitude_ReturnValue_1;            // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillItem_C_ConfigColor) == 0x000008, "Wrong alignment on KillItem_C_ConfigColor");
static_assert(sizeof(KillItem_C_ConfigColor) == 0x000050, "Wrong size on KillItem_C_ConfigColor");
static_assert(offsetof(KillItem_C_ConfigColor, InKillerPlayerState) == 0x000000, "Member 'KillItem_C_ConfigColor::InKillerPlayerState' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, InDeceasedPlayerState) == 0x000008, "Member 'KillItem_C_ConfigColor::InDeceasedPlayerState' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, KillerPlayerState) == 0x000010, "Member 'KillItem_C_ConfigColor::KillerPlayerState' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, DeceasedPlayerState) == 0x000018, "Member 'KillItem_C_ConfigColor::DeceasedPlayerState' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, MyPlayerState) == 0x000020, "Member 'KillItem_C_ConfigColor::MyPlayerState' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, DeceasedSameTeam) == 0x000028, "Member 'KillItem_C_ConfigColor::DeceasedSameTeam' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, KillerSameTeam) == 0x000029, "Member 'KillItem_C_ConfigColor::KillerSameTeam' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_IsValid_ReturnValue) == 0x00002A, "Member 'KillItem_C_ConfigColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_IsValid_ReturnValue_1) == 0x00002B, "Member 'KillItem_C_ConfigColor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_GetCampAttitude_ReturnValue) == 0x00002C, "Member 'KillItem_C_ConfigColor::CallFunc_GetCampAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_IsValid_ReturnValue_2) == 0x00002D, "Member 'KillItem_C_ConfigColor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002E, "Member 'KillItem_C_ConfigColor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_GetCampAttitude_ReturnValue_1) == 0x00002F, "Member 'KillItem_C_ConfigColor::CallFunc_GetCampAttitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000030, "Member 'KillItem_C_ConfigColor::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000031, "Member 'KillItem_C_ConfigColor::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000032, "Member 'KillItem_C_ConfigColor::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'KillItem_C_ConfigColor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, K2Node_DynamicCast_AsPBPlayer_State) == 0x000040, "Member 'KillItem_C_ConfigColor::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(KillItem_C_ConfigColor, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'KillItem_C_ConfigColor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function KillItem.KillItem_C.InitPlayerEnterInfo
// 0x0078 (0x0078 - 0x0000)
struct KillItem_C_InitPlayerEnterInfo final
{
public:
	class APBPlayerState*                         PBPlayerState;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enter;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class UPBFriendManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBlockPlayerList_BP_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBFriendManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBlockPlayerDisplayName_BP_ReturnValue; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0060(0x0018)()
};
static_assert(alignof(KillItem_C_InitPlayerEnterInfo) == 0x000008, "Wrong alignment on KillItem_C_InitPlayerEnterInfo");
static_assert(sizeof(KillItem_C_InitPlayerEnterInfo) == 0x000078, "Wrong size on KillItem_C_InitPlayerEnterInfo");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, PBPlayerState) == 0x000000, "Member 'KillItem_C_InitPlayerEnterInfo::PBPlayerState' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, Enter) == 0x000008, "Member 'KillItem_C_InitPlayerEnterInfo::Enter' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'KillItem_C_InitPlayerEnterInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, CallFunc_GetPlayerName_ReturnValue) == 0x000010, "Member 'KillItem_C_InitPlayerEnterInfo::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'KillItem_C_InitPlayerEnterInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'KillItem_C_InitPlayerEnterInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, CallFunc_IsInBlockPlayerList_BP_ReturnValue) == 0x000040, "Member 'KillItem_C_InitPlayerEnterInfo::CallFunc_IsInBlockPlayerList_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000048, "Member 'KillItem_C_InitPlayerEnterInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, CallFunc_GetBlockPlayerDisplayName_BP_ReturnValue) == 0x000050, "Member 'KillItem_C_InitPlayerEnterInfo::CallFunc_GetBlockPlayerDisplayName_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_InitPlayerEnterInfo, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000060, "Member 'KillItem_C_InitPlayerEnterInfo::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function KillItem.KillItem_C.UpdateColor
// 0x00F0 (0x00F0 - 0x0000)
struct KillItem_C_UpdateColor final
{
public:
	class UPBPersistentUser*                      CallFunc_GetPBPersistentUser_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBPersistentUser_BP_C*                 K2Node_DynamicCast_AsPBPersistent_User_BP;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_1;    // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0028)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00C8(0x0028)()
};
static_assert(alignof(KillItem_C_UpdateColor) == 0x000008, "Wrong alignment on KillItem_C_UpdateColor");
static_assert(sizeof(KillItem_C_UpdateColor) == 0x0000F0, "Wrong size on KillItem_C_UpdateColor");
static_assert(offsetof(KillItem_C_UpdateColor, CallFunc_GetPBPersistentUser_ReturnValue) == 0x000000, "Member 'KillItem_C_UpdateColor::CallFunc_GetPBPersistentUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillItem_C_UpdateColor, K2Node_DynamicCast_AsPBPersistent_User_BP) == 0x000008, "Member 'KillItem_C_UpdateColor::K2Node_DynamicCast_AsPBPersistent_User_BP' has a wrong offset!");
static_assert(offsetof(KillItem_C_UpdateColor, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'KillItem_C_UpdateColor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillItem_C_UpdateColor, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'KillItem_C_UpdateColor::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
