#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillList

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function KillList.KillList_C.ExecuteUbergraph_KillList
// 0x0078 (0x0078 - 0x0000)
struct KillList_C_ExecuteUbergraph_KillList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_CustomEvent_Killer;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_CustomEvent_Deceased;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_CustomEvent_DamageType;                     // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBHitZone                                    K2Node_CustomEvent_HitZone;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_CustomEvent_Icon;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_CustomEvent_RenderTarget;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillItem_C*                            CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillItem_C*                            CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKillItem_C*                            CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillList_C_ExecuteUbergraph_KillList) == 0x000008, "Wrong alignment on KillList_C_ExecuteUbergraph_KillList");
static_assert(sizeof(KillList_C_ExecuteUbergraph_KillList) == 0x000078, "Wrong size on KillList_C_ExecuteUbergraph_KillList");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, EntryPoint) == 0x000000, "Member 'KillList_C_ExecuteUbergraph_KillList::EntryPoint' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, K2Node_CustomEvent_Killer) == 0x000008, "Member 'KillList_C_ExecuteUbergraph_KillList::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, K2Node_CustomEvent_Deceased) == 0x000010, "Member 'KillList_C_ExecuteUbergraph_KillList::K2Node_CustomEvent_Deceased' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, K2Node_CustomEvent_DamageType) == 0x000018, "Member 'KillList_C_ExecuteUbergraph_KillList::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, K2Node_CustomEvent_HitZone) == 0x000020, "Member 'KillList_C_ExecuteUbergraph_KillList::K2Node_CustomEvent_HitZone' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, K2Node_CustomEvent_Icon) == 0x000028, "Member 'KillList_C_ExecuteUbergraph_KillList::K2Node_CustomEvent_Icon' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, K2Node_CustomEvent_RenderTarget) == 0x000030, "Member 'KillList_C_ExecuteUbergraph_KillList::K2Node_CustomEvent_RenderTarget' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, K2Node_CustomEvent_DamageCauser) == 0x000038, "Member 'KillList_C_ExecuteUbergraph_KillList::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, Temp_int_Variable) == 0x000040, "Member 'KillList_C_ExecuteUbergraph_KillList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'KillList_C_ExecuteUbergraph_KillList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'KillList_C_ExecuteUbergraph_KillList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, CallFunc_Array_Get_Item) == 0x000050, "Member 'KillList_C_ExecuteUbergraph_KillList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'KillList_C_ExecuteUbergraph_KillList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, CallFunc_Create_ReturnValue) == 0x000060, "Member 'KillList_C_ExecuteUbergraph_KillList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'KillList_C_ExecuteUbergraph_KillList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'KillList_C_ExecuteUbergraph_KillList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_ExecuteUbergraph_KillList, CallFunc_Array_Add_ReturnValue_1) == 0x000074, "Member 'KillList_C_ExecuteUbergraph_KillList::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function KillList.KillList_C.AddKillItem
// 0x0038 (0x0038 - 0x0000)
struct KillList_C_AddKillItem final
{
public:
	class APBPlayerState*                         Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         Deceased;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBHitZone                                    HitZone;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Icon;                                              // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillList_C_AddKillItem) == 0x000008, "Wrong alignment on KillList_C_AddKillItem");
static_assert(sizeof(KillList_C_AddKillItem) == 0x000038, "Wrong size on KillList_C_AddKillItem");
static_assert(offsetof(KillList_C_AddKillItem, Killer) == 0x000000, "Member 'KillList_C_AddKillItem::Killer' has a wrong offset!");
static_assert(offsetof(KillList_C_AddKillItem, Deceased) == 0x000008, "Member 'KillList_C_AddKillItem::Deceased' has a wrong offset!");
static_assert(offsetof(KillList_C_AddKillItem, DamageType) == 0x000010, "Member 'KillList_C_AddKillItem::DamageType' has a wrong offset!");
static_assert(offsetof(KillList_C_AddKillItem, HitZone) == 0x000018, "Member 'KillList_C_AddKillItem::HitZone' has a wrong offset!");
static_assert(offsetof(KillList_C_AddKillItem, Icon) == 0x000020, "Member 'KillList_C_AddKillItem::Icon' has a wrong offset!");
static_assert(offsetof(KillList_C_AddKillItem, RenderTarget) == 0x000028, "Member 'KillList_C_AddKillItem::RenderTarget' has a wrong offset!");
static_assert(offsetof(KillList_C_AddKillItem, DamageCauser) == 0x000030, "Member 'KillList_C_AddKillItem::DamageCauser' has a wrong offset!");

// Function KillList.KillList_C.PlayAnim
// 0x0030 (0x0030 - 0x0000)
struct KillList_C_PlayAnim final
{
public:
	class UKillItem_C*                            NewKillItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillItem_C*                            CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillList_C_PlayAnim) == 0x000008, "Wrong alignment on KillList_C_PlayAnim");
static_assert(sizeof(KillList_C_PlayAnim) == 0x000030, "Wrong size on KillList_C_PlayAnim");
static_assert(offsetof(KillList_C_PlayAnim, NewKillItem) == 0x000000, "Member 'KillList_C_PlayAnim::NewKillItem' has a wrong offset!");
static_assert(offsetof(KillList_C_PlayAnim, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'KillList_C_PlayAnim::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_PlayAnim, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'KillList_C_PlayAnim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_PlayAnim, CallFunc_Array_AddUnique_ReturnValue) == 0x000010, "Member 'KillList_C_PlayAnim::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_PlayAnim, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'KillList_C_PlayAnim::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_PlayAnim, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'KillList_C_PlayAnim::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillList_C_PlayAnim, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00001C, "Member 'KillList_C_PlayAnim::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillList_C_PlayAnim, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'KillList_C_PlayAnim::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_PlayAnim, CallFunc_Array_Get_Item) == 0x000028, "Member 'KillList_C_PlayAnim::CallFunc_Array_Get_Item' has a wrong offset!");

// Function KillList.KillList_C.RemoveAll
// 0x0020 (0x0020 - 0x0000)
struct KillList_C_RemoveAll final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillItem_C*                            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillList_C_RemoveAll) == 0x000008, "Wrong alignment on KillList_C_RemoveAll");
static_assert(sizeof(KillList_C_RemoveAll) == 0x000020, "Wrong size on KillList_C_RemoveAll");
static_assert(offsetof(KillList_C_RemoveAll, Temp_int_Array_Index_Variable) == 0x000000, "Member 'KillList_C_RemoveAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KillList_C_RemoveAll, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'KillList_C_RemoveAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KillList_C_RemoveAll, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'KillList_C_RemoveAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_RemoveAll, CallFunc_Array_Get_Item) == 0x000010, "Member 'KillList_C_RemoveAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KillList_C_RemoveAll, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'KillList_C_RemoveAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_RemoveAll, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'KillList_C_RemoveAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function KillList.KillList_C.ResetItem
// 0x0010 (0x0010 - 0x0000)
struct KillList_C_ResetItem final
{
public:
	class UKillItem_C*                            FadeItem_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillList_C_ResetItem) == 0x000008, "Wrong alignment on KillList_C_ResetItem");
static_assert(sizeof(KillList_C_ResetItem) == 0x000010, "Wrong size on KillList_C_ResetItem");
static_assert(offsetof(KillList_C_ResetItem, FadeItem_0) == 0x000000, "Member 'KillList_C_ResetItem::FadeItem_0' has a wrong offset!");
static_assert(offsetof(KillList_C_ResetItem, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'KillList_C_ResetItem::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_ResetItem, CallFunc_Array_RemoveItem_ReturnValue) == 0x00000C, "Member 'KillList_C_ResetItem::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function KillList.KillList_C.FadeItem
// 0x0030 (0x0030 - 0x0000)
struct KillList_C_FadeItem final
{
public:
	class UKillItem_C*                            FadeItem_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKillItem_C*                            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillList_C_FadeItem) == 0x000008, "Wrong alignment on KillList_C_FadeItem");
static_assert(sizeof(KillList_C_FadeItem) == 0x000030, "Wrong size on KillList_C_FadeItem");
static_assert(offsetof(KillList_C_FadeItem, FadeItem_0) == 0x000000, "Member 'KillList_C_FadeItem::FadeItem_0' has a wrong offset!");
static_assert(offsetof(KillList_C_FadeItem, Temp_int_Array_Index_Variable) == 0x000008, "Member 'KillList_C_FadeItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KillList_C_FadeItem, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'KillList_C_FadeItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KillList_C_FadeItem, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'KillList_C_FadeItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_FadeItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'KillList_C_FadeItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_FadeItem, CallFunc_Array_Get_Item) == 0x000018, "Member 'KillList_C_FadeItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KillList_C_FadeItem, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'KillList_C_FadeItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillList_C_FadeItem, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000024, "Member 'KillList_C_FadeItem::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillList_C_FadeItem, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'KillList_C_FadeItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function KillList.KillList_C.InitPlayerEnterInfo
// 0x0028 (0x0028 - 0x0000)
struct KillList_C_InitPlayerEnterInfo final
{
public:
	class APBPlayerState*                         PBPlayerState;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enter;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillItem_C*                            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKillItem_C*                            CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillList_C_InitPlayerEnterInfo) == 0x000008, "Wrong alignment on KillList_C_InitPlayerEnterInfo");
static_assert(sizeof(KillList_C_InitPlayerEnterInfo) == 0x000028, "Wrong size on KillList_C_InitPlayerEnterInfo");
static_assert(offsetof(KillList_C_InitPlayerEnterInfo, PBPlayerState) == 0x000000, "Member 'KillList_C_InitPlayerEnterInfo::PBPlayerState' has a wrong offset!");
static_assert(offsetof(KillList_C_InitPlayerEnterInfo, Enter) == 0x000008, "Member 'KillList_C_InitPlayerEnterInfo::Enter' has a wrong offset!");
static_assert(offsetof(KillList_C_InitPlayerEnterInfo, CallFunc_Array_Get_Item) == 0x000010, "Member 'KillList_C_InitPlayerEnterInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KillList_C_InitPlayerEnterInfo, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'KillList_C_InitPlayerEnterInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(KillList_C_InitPlayerEnterInfo, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'KillList_C_InitPlayerEnterInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

