#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillList

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KillList.KillList_C
// 0x0058 (0x02B8 - 0x0260)
class UKillList_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UKillItem_C*>                    KillItemArray;                                     // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ListSize;                                          // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UKillItem_C*>                    KillItemPool;                                      // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UKillItem_C*>                    InUsePool;                                         // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentIndex;                                      // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillItem_C*                            PendingKillItem;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_KillList(int32 EntryPoint);
	void Construct();
	void AddKillItem(class APBPlayerState* Killer, class APBPlayerState* Deceased, const class UDamageType* DamageType, EPBHitZone HitZone, class UTexture* Icon, class UTextureRenderTarget2D* RenderTarget, class AActor* DamageCauser);
	void PlayAnim(class UKillItem_C* NewKillItem);
	void RemoveAll();
	void ResetItem(class UKillItem_C* FadeItem_0);
	void FadeItem(class UKillItem_C* FadeItem_0);
	void InitPlayerEnterInfo(class APBPlayerState* PBPlayerState, bool Enter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KillList_C">();
	}
	static class UKillList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillList_C>();
	}
};
static_assert(alignof(UKillList_C) == 0x000008, "Wrong alignment on UKillList_C");
static_assert(sizeof(UKillList_C) == 0x0002B8, "Wrong size on UKillList_C");
static_assert(offsetof(UKillList_C, UberGraphFrame) == 0x000260, "Member 'UKillList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKillList_C, CanvasPanel_0) == 0x000268, "Member 'UKillList_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UKillList_C, KillItemArray) == 0x000270, "Member 'UKillList_C::KillItemArray' has a wrong offset!");
static_assert(offsetof(UKillList_C, ListSize) == 0x000280, "Member 'UKillList_C::ListSize' has a wrong offset!");
static_assert(offsetof(UKillList_C, KillItemPool) == 0x000288, "Member 'UKillList_C::KillItemPool' has a wrong offset!");
static_assert(offsetof(UKillList_C, InUsePool) == 0x000298, "Member 'UKillList_C::InUsePool' has a wrong offset!");
static_assert(offsetof(UKillList_C, CurrentIndex) == 0x0002A8, "Member 'UKillList_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(UKillList_C, PendingKillItem) == 0x0002B0, "Member 'UKillList_C::PendingKillItem' has a wrong offset!");

}

