#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LensBroken_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LensBroken_BP.LensBroken_BP_C
// 0x0598 (0x05E0 - 0x0048)
class ULensBroken_BP_C final : public UCameraModifier
{
public:
	class UObject*                                Character;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RedVersionThreshold;                               // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RedVersionColor;                                   // 0x0054(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalVersionColor;                                // 0x0064(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEMPEffectOn;                                     // 0x0074(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0xB];                                       // 0x0075(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   LensBrokenPP;                                      // 0x0080(0x0560)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BlueprintModifyPostProcess(float DeltaTime, float* PostProcessBlendWeight, struct FPostProcessSettings* PostProcessSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LensBroken_BP_C">();
	}
	static class ULensBroken_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULensBroken_BP_C>();
	}
};
static_assert(alignof(ULensBroken_BP_C) == 0x000010, "Wrong alignment on ULensBroken_BP_C");
static_assert(sizeof(ULensBroken_BP_C) == 0x0005E0, "Wrong size on ULensBroken_BP_C");
static_assert(offsetof(ULensBroken_BP_C, Character) == 0x000048, "Member 'ULensBroken_BP_C::Character' has a wrong offset!");
static_assert(offsetof(ULensBroken_BP_C, RedVersionThreshold) == 0x000050, "Member 'ULensBroken_BP_C::RedVersionThreshold' has a wrong offset!");
static_assert(offsetof(ULensBroken_BP_C, RedVersionColor) == 0x000054, "Member 'ULensBroken_BP_C::RedVersionColor' has a wrong offset!");
static_assert(offsetof(ULensBroken_BP_C, NormalVersionColor) == 0x000064, "Member 'ULensBroken_BP_C::NormalVersionColor' has a wrong offset!");
static_assert(offsetof(ULensBroken_BP_C, IsEMPEffectOn) == 0x000074, "Member 'ULensBroken_BP_C::IsEMPEffectOn' has a wrong offset!");
static_assert(offsetof(ULensBroken_BP_C, LensBrokenPP) == 0x000080, "Member 'ULensBroken_BP_C::LensBrokenPP' has a wrong offset!");

}

