#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadScreen

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadScreen.LoadScreen_C
// 0x0078 (0x0358 - 0x02E0)
class ULoadScreen_C final : public UPBMainMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Fader;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_127;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBG;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingImage;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuTitle_C*                        MainTitle;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Map_Information_Box;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MAP_Location;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MAP_Name;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MapBox;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuTitleSub_C*                     UI_MenuTitleSub_124;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsChineseLanguage;                                 // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           TipsArray;                                         // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_LoadScreen(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void InitTexts();
	void InitMapName();
	void InitModeName();
	void NewTips();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadScreen_C">();
	}
	static class ULoadScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadScreen_C>();
	}
};
static_assert(alignof(ULoadScreen_C) == 0x000008, "Wrong alignment on ULoadScreen_C");
static_assert(sizeof(ULoadScreen_C) == 0x000358, "Wrong size on ULoadScreen_C");
static_assert(offsetof(ULoadScreen_C, UberGraphFrame) == 0x0002E0, "Member 'ULoadScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, Fader) == 0x0002E8, "Member 'ULoadScreen_C::Fader' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, Image_1) == 0x0002F0, "Member 'ULoadScreen_C::Image_1' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, Image_127) == 0x0002F8, "Member 'ULoadScreen_C::Image_127' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, ImageBG) == 0x000300, "Member 'ULoadScreen_C::ImageBG' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, LoadingImage) == 0x000308, "Member 'ULoadScreen_C::LoadingImage' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, MainTitle) == 0x000310, "Member 'ULoadScreen_C::MainTitle' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, Map_Information_Box) == 0x000318, "Member 'ULoadScreen_C::Map_Information_Box' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, MAP_Location) == 0x000320, "Member 'ULoadScreen_C::MAP_Location' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, MAP_Name) == 0x000328, "Member 'ULoadScreen_C::MAP_Name' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, MapBox) == 0x000330, "Member 'ULoadScreen_C::MapBox' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, UI_MenuTitleSub_124) == 0x000338, "Member 'ULoadScreen_C::UI_MenuTitleSub_124' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, IsChineseLanguage) == 0x000340, "Member 'ULoadScreen_C::IsChineseLanguage' has a wrong offset!");
static_assert(offsetof(ULoadScreen_C, TipsArray) == 0x000348, "Member 'ULoadScreen_C::TipsArray' has a wrong offset!");

}

