#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mach_Arm_RigR_Skeleton_ABP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Mach_Arm_RigR_Skeleton_ABP.Mach_Arm_RigR_Skeleton_ABP_C
// 0x0400 (0x06E0 - 0x02E0)
class UMach_Arm_RigR_Skeleton_ABP_C final : public UPBAnimInstance_MachArm
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02E8(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0318(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03B8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03D8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x03F8(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0500(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0548(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05C8(0x0080)()
	bool                                          bIsDeployed;                                       // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsRecoildMod;                                     // 0x0649(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A[0x2];                                      // 0x064A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FireOffset;                                        // 0x064C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationOffset;                                    // 0x0658(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AxisInput;                                         // 0x0664(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeed;                                       // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationOffsetScale;                               // 0x0674(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UpLookSwayIntensity;                               // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftLookSwayIntensity;                             // 0x067C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WorldDeltaTime;                                    // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  ControlledPawn;                                    // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  LastControlledPawn;                                // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController_BP_C*                 CastedPlayerControllerBP;                          // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CastedGACBP;                                       // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMKIII_ABP_C*                           MKIII_ABP;                                         // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GagetLookSwayRecoverTime;                          // 0x06B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationInputOffset;                               // 0x06BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RotationOffsetScale;                               // 0x06C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MouseInputX;                                       // 0x06CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MouseInputY;                                       // 0x06D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDeploymentFinished;                             // 0x06D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D5[0x3];                                      // 0x06D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeploymentDuration;                                // 0x06D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UndeploymentDuration;                              // 0x06DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP(int32 EntryPoint);
	void AnimNotify_OnUndeployFinished();
	void AnimNotify_OnDeployFinished();
	void OutRecoilMod();
	void IntoRecoilMod();
	void FireOffset_Anim(const struct FVector& FireOffset_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void GetRotationOffsetFromController();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mach_Arm_RigR_Skeleton_ABP_C">();
	}
	static class UMach_Arm_RigR_Skeleton_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMach_Arm_RigR_Skeleton_ABP_C>();
	}
};
static_assert(alignof(UMach_Arm_RigR_Skeleton_ABP_C) == 0x000010, "Wrong alignment on UMach_Arm_RigR_Skeleton_ABP_C");
static_assert(sizeof(UMach_Arm_RigR_Skeleton_ABP_C) == 0x0006E0, "Wrong size on UMach_Arm_RigR_Skeleton_ABP_C");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, UberGraphFrame) == 0x0002E0, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, AnimGraphNode_Root) == 0x0002E8, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, AnimGraphNode_BlendListByBool) == 0x000318, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, AnimGraphNode_LocalToComponentSpace) == 0x0003B8, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003D8, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, AnimGraphNode_ModifyBone) == 0x0003F8, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, AnimGraphNode_Slot) == 0x000500, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, AnimGraphNode_SequencePlayer_1) == 0x000548, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, AnimGraphNode_SequencePlayer) == 0x0005C8, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, bIsDeployed) == 0x000648, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::bIsDeployed' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, bIsRecoildMod) == 0x000649, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::bIsRecoildMod' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, FireOffset) == 0x00064C, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::FireOffset' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, LocationOffset) == 0x000658, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::LocationOffset' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, AxisInput) == 0x000664, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::AxisInput' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, InterpSpeed) == 0x000670, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::InterpSpeed' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, LocationOffsetScale) == 0x000674, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::LocationOffsetScale' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, UpLookSwayIntensity) == 0x000678, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::UpLookSwayIntensity' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, LeftLookSwayIntensity) == 0x00067C, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::LeftLookSwayIntensity' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, WorldDeltaTime) == 0x000680, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::WorldDeltaTime' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, ControlledPawn) == 0x000688, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::ControlledPawn' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, LastControlledPawn) == 0x000690, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::LastControlledPawn' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, PlayerController) == 0x000698, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, CastedPlayerControllerBP) == 0x0006A0, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::CastedPlayerControllerBP' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, CastedGACBP) == 0x0006A8, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::CastedGACBP' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, MKIII_ABP) == 0x0006B0, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::MKIII_ABP' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, GagetLookSwayRecoverTime) == 0x0006B8, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::GagetLookSwayRecoverTime' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, RotationInputOffset) == 0x0006BC, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::RotationInputOffset' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, RotationOffsetScale) == 0x0006C8, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::RotationOffsetScale' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, MouseInputX) == 0x0006CC, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::MouseInputX' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, MouseInputY) == 0x0006D0, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::MouseInputY' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, bIsDeploymentFinished) == 0x0006D4, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::bIsDeploymentFinished' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, DeploymentDuration) == 0x0006D8, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::DeploymentDuration' has a wrong offset!");
static_assert(offsetof(UMach_Arm_RigR_Skeleton_ABP_C, UndeploymentDuration) == 0x0006DC, "Member 'UMach_Arm_RigR_Skeleton_ABP_C::UndeploymentDuration' has a wrong offset!");

}

