#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mach_Arm_RigR_Skeleton_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Mach_Arm_RigR_Skeleton_ABP.Mach_Arm_RigR_Skeleton_ABP_C.ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP
// 0x0030 (0x0030 - 0x0000)
struct Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_FireOffset;                     // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBLauncher*                            K2Node_DynamicCast_AsPBLauncher;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDeloyingOrDeployed_ReturnValue;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP) == 0x000008, "Wrong alignment on Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP");
static_assert(sizeof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP) == 0x000030, "Wrong size on Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP, EntryPoint) == 0x000000, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP, K2Node_CustomEvent_FireOffset) == 0x000008, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP::K2Node_CustomEvent_FireOffset' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP, CallFunc_GetOwningActor_ReturnValue) == 0x000018, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP, K2Node_DynamicCast_AsPBLauncher) == 0x000020, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP::K2Node_DynamicCast_AsPBLauncher' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP, CallFunc_IsDeloyingOrDeployed_ReturnValue) == 0x00002A, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_ExecuteUbergraph_Mach_Arm_RigR_Skeleton_ABP::CallFunc_IsDeloyingOrDeployed_ReturnValue' has a wrong offset!");

// Function Mach_Arm_RigR_Skeleton_ABP.Mach_Arm_RigR_Skeleton_ABP_C.FireOffset_Anim
// 0x000C (0x000C - 0x0000)
struct Mach_Arm_RigR_Skeleton_ABP_C_FireOffset_Anim final
{
public:
	struct FVector                                FireOffset_0;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mach_Arm_RigR_Skeleton_ABP_C_FireOffset_Anim) == 0x000004, "Wrong alignment on Mach_Arm_RigR_Skeleton_ABP_C_FireOffset_Anim");
static_assert(sizeof(Mach_Arm_RigR_Skeleton_ABP_C_FireOffset_Anim) == 0x00000C, "Wrong size on Mach_Arm_RigR_Skeleton_ABP_C_FireOffset_Anim");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_FireOffset_Anim, FireOffset_0) == 0x000000, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_FireOffset_Anim::FireOffset_0' has a wrong offset!");

// Function Mach_Arm_RigR_Skeleton_ABP.Mach_Arm_RigR_Skeleton_ABP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Mach_Arm_RigR_Skeleton_ABP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mach_Arm_RigR_Skeleton_ABP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Mach_Arm_RigR_Skeleton_ABP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Mach_Arm_RigR_Skeleton_ABP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Mach_Arm_RigR_Skeleton_ABP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Mach_Arm_RigR_Skeleton_ABP.Mach_Arm_RigR_Skeleton_ABP_C.GetRotationOffsetFromController
// 0x0054 (0x0054 - 0x0000)
struct Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController) == 0x000004, "Wrong alignment on Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController");
static_assert(sizeof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController) == 0x000054, "Wrong size on Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000004, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000010, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000014, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000024, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000028, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000030, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_FClamp_ReturnValue) == 0x000034, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_FClamp_ReturnValue_1) == 0x000038, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_MapRangeClamped_ReturnValue) == 0x00003C, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000040, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000044, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000048, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_FInterpTo_ReturnValue) == 0x00004C, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController, CallFunc_FInterpTo_ReturnValue_1) == 0x000050, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_GetRotationOffsetFromController::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");

// Function Mach_Arm_RigR_Skeleton_ABP.Mach_Arm_RigR_Skeleton_ABP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Mach_Arm_RigR_Skeleton_ABP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Mach_Arm_RigR_Skeleton_ABP_C_AnimGraph) == 0x000008, "Wrong alignment on Mach_Arm_RigR_Skeleton_ABP_C_AnimGraph");
static_assert(sizeof(Mach_Arm_RigR_Skeleton_ABP_C_AnimGraph) == 0x000010, "Wrong size on Mach_Arm_RigR_Skeleton_ABP_C_AnimGraph");
static_assert(offsetof(Mach_Arm_RigR_Skeleton_ABP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Mach_Arm_RigR_Skeleton_ABP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

