#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MagAnimBP.MagAnimBP_C.ExecuteUbergraph_MagAnimBP
// 0x0004 (0x0004 - 0x0000)
struct MagAnimBP_C_ExecuteUbergraph_MagAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MagAnimBP_C_ExecuteUbergraph_MagAnimBP) == 0x000004, "Wrong alignment on MagAnimBP_C_ExecuteUbergraph_MagAnimBP");
static_assert(sizeof(MagAnimBP_C_ExecuteUbergraph_MagAnimBP) == 0x000004, "Wrong size on MagAnimBP_C_ExecuteUbergraph_MagAnimBP");
static_assert(offsetof(MagAnimBP_C_ExecuteUbergraph_MagAnimBP, EntryPoint) == 0x000000, "Member 'MagAnimBP_C_ExecuteUbergraph_MagAnimBP::EntryPoint' has a wrong offset!");

// Function MagAnimBP.MagAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MagAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MagAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on MagAnimBP_C_AnimGraph");
static_assert(sizeof(MagAnimBP_C_AnimGraph) == 0x000010, "Wrong size on MagAnimBP_C_AnimGraph");
static_assert(offsetof(MagAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'MagAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

