#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuWidget_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MainMenuWidget_Base.MainMenuWidget_Base_C.ExecuteUbergraph_MainMenuWidget_Base
// 0x0018 (0x0018 - 0x0000)
struct MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
	bool                                          K2Node_CustomEvent_NewInteractable;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base) == 0x000004, "Wrong alignment on MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base");
static_assert(sizeof(MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base) == 0x000018, "Wrong size on MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base");
static_assert(offsetof(MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base, EntryPoint) == 0x000000, "Member 'MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base, K2Node_CustomEvent_NewInteractable) == 0x000014, "Member 'MainMenuWidget_Base_C_ExecuteUbergraph_MainMenuWidget_Base::K2Node_CustomEvent_NewInteractable' has a wrong offset!");

// Function MainMenuWidget_Base.MainMenuWidget_Base_C.SetInteractableOnKeyboard
// 0x0001 (0x0001 - 0x0000)
struct MainMenuWidget_Base_C_SetInteractableOnKeyboard final
{
public:
	bool                                          NewInteractable;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenuWidget_Base_C_SetInteractableOnKeyboard) == 0x000001, "Wrong alignment on MainMenuWidget_Base_C_SetInteractableOnKeyboard");
static_assert(sizeof(MainMenuWidget_Base_C_SetInteractableOnKeyboard) == 0x000001, "Wrong size on MainMenuWidget_Base_C_SetInteractableOnKeyboard");
static_assert(offsetof(MainMenuWidget_Base_C_SetInteractableOnKeyboard, NewInteractable) == 0x000000, "Member 'MainMenuWidget_Base_C_SetInteractableOnKeyboard::NewInteractable' has a wrong offset!");

// Function MainMenuWidget_Base.MainMenuWidget_Base_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct MainMenuWidget_Base_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(MainMenuWidget_Base_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on MainMenuWidget_Base_C_OnAddedToFocusPath");
static_assert(sizeof(MainMenuWidget_Base_C_OnAddedToFocusPath) == 0x000008, "Wrong size on MainMenuWidget_Base_C_OnAddedToFocusPath");
static_assert(offsetof(MainMenuWidget_Base_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'MainMenuWidget_Base_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function MainMenuWidget_Base.MainMenuWidget_Base_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct MainMenuWidget_Base_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(MainMenuWidget_Base_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on MainMenuWidget_Base_C_OnRemovedFromFocusPath");
static_assert(sizeof(MainMenuWidget_Base_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on MainMenuWidget_Base_C_OnRemovedFromFocusPath");
static_assert(offsetof(MainMenuWidget_Base_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'MainMenuWidget_Base_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function MainMenuWidget_Base.MainMenuWidget_Base_C.FillIntoOverlay
// 0x0028 (0x0028 - 0x0000)
struct MainMenuWidget_Base_C_FillIntoOverlay final
{
public:
	class UOverlay*                               InOverlay;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Content;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenuWidget_Base_C_FillIntoOverlay) == 0x000008, "Wrong alignment on MainMenuWidget_Base_C_FillIntoOverlay");
static_assert(sizeof(MainMenuWidget_Base_C_FillIntoOverlay) == 0x000028, "Wrong size on MainMenuWidget_Base_C_FillIntoOverlay");
static_assert(offsetof(MainMenuWidget_Base_C_FillIntoOverlay, InOverlay) == 0x000000, "Member 'MainMenuWidget_Base_C_FillIntoOverlay::InOverlay' has a wrong offset!");
static_assert(offsetof(MainMenuWidget_Base_C_FillIntoOverlay, Content) == 0x000008, "Member 'MainMenuWidget_Base_C_FillIntoOverlay::Content' has a wrong offset!");
static_assert(offsetof(MainMenuWidget_Base_C_FillIntoOverlay, K2Node_MakeStruct_Margin) == 0x000010, "Member 'MainMenuWidget_Base_C_FillIntoOverlay::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MainMenuWidget_Base_C_FillIntoOverlay, CallFunc_AddChildToOverlay_ReturnValue) == 0x000020, "Member 'MainMenuWidget_Base_C_FillIntoOverlay::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");

}

