#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MarkType

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct MarkType.MarkType
// 0x00C8 (0x00C8 - 0x0000)
struct FMarkType final
{
public:
	class FText                                   Type_11_2A4082C441E8082479DE0798C3FD234D;          // 0x0000(0x0018)(Edit, BlueprintVisible)
	struct FSlateBrush                            Image_5_01FF37C4423E895FF207F1A1228E8EF5;          // 0x0018(0x0088)(Edit, BlueprintVisible)
	struct FSlateColor                            Color_10_EC67F86B40F0C78C9E5CB2AA0AE1214D;         // 0x00A0(0x0028)(Edit, BlueprintVisible)
};
static_assert(alignof(FMarkType) == 0x000008, "Wrong alignment on FMarkType");
static_assert(sizeof(FMarkType) == 0x0000C8, "Wrong size on FMarkType");
static_assert(offsetof(FMarkType, Type_11_2A4082C441E8082479DE0798C3FD234D) == 0x000000, "Member 'FMarkType::Type_11_2A4082C441E8082479DE0798C3FD234D' has a wrong offset!");
static_assert(offsetof(FMarkType, Image_5_01FF37C4423E895FF207F1A1228E8EF5) == 0x000018, "Member 'FMarkType::Image_5_01FF37C4423E895FF207F1A1228E8EF5' has a wrong offset!");
static_assert(offsetof(FMarkType, Color_10_EC67F86B40F0C78C9E5CB2AA0AE1214D) == 0x0000A0, "Member 'FMarkType::Color_10_EC67F86B40F0C78C9E5CB2AA0AE1214D' has a wrong offset!");

}

