#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MarkWidget

#include "Basic.hpp"

#include "MarkType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MarkWidget.MarkWidget_C.ExecuteUbergraph_MarkWidget
// 0x01B0 (0x01B0 - 0x0000)
struct MarkWidget_C_ExecuteUbergraph_MarkWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_1;             // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetViewportWidgetGeometry_ReturnValue;    // 0x00AC(0x0038)(IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue_1;            // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue_1;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0128(0x0018)()
	struct FVector2D                              CallFunc_GetScreenPositionFromWorldLocation_ScreenPosition; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScreenPositionFromWorldLocation_ReturnValue; // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x017C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ScreenToWidgetLocal_LocalCoordinate;      // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_3;                     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ScreenToWidgetLocal_LocalCoordinate_1;    // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MarkWidget_C_ExecuteUbergraph_MarkWidget) == 0x000008, "Wrong alignment on MarkWidget_C_ExecuteUbergraph_MarkWidget");
static_assert(sizeof(MarkWidget_C_ExecuteUbergraph_MarkWidget) == 0x0001B0, "Wrong size on MarkWidget_C_ExecuteUbergraph_MarkWidget");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, EntryPoint) == 0x000000, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, K2Node_Event_MyGeometry) == 0x000004, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_GetAbsoluteSize_ReturnValue) == 0x000040, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000048, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_X) == 0x000050, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_Y) == 0x000054, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_X_1) == 0x000058, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_Y_1) == 0x00005C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_GetPlayerPawn_ReturnValue) == 0x000060, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_GetDesiredSize_ReturnValue) == 0x000074, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_GetDesiredSize_ReturnValue_1) == 0x00007C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_GetDesiredSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_X_2) == 0x000084, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_Y_2) == 0x000088, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_X_3) == 0x00008C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_Y_3) == 0x000090, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000094, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000098, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00009C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0000A4, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x0000A8, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_GetViewportWidgetGeometry_ReturnValue) == 0x0000AC, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_GetViewportWidgetGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_GetAbsoluteSize_ReturnValue_1) == 0x0000E4, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_GetAbsoluteSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_X_4) == 0x0000EC, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_Y_4) == 0x0000F0, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000F4, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Square_ReturnValue) == 0x000100, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_VSize_ReturnValue) == 0x000104, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Square_ReturnValue_1) == 0x000108, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Square_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00010C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Add_FloatFloat_ReturnValue) == 0x000110, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_MapRangeClamped_ReturnValue) == 0x000114, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Sqrt_ReturnValue) == 0x000118, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_MakeVector2D_ReturnValue) == 0x00011C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Conv_FloatToText_ReturnValue) == 0x000128, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_GetScreenPositionFromWorldLocation_ScreenPosition) == 0x000140, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_GetScreenPositionFromWorldLocation_ScreenPosition' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_GetScreenPositionFromWorldLocation_ReturnValue) == 0x000148, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_GetScreenPositionFromWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x00014C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_X_5) == 0x000154, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_Y_5) == 0x000158, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Normal2D_ReturnValue) == 0x00015C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_FClamp_ReturnValue) == 0x000164, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Multiply_Vector2DFloat_ReturnValue_1) == 0x000168, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Multiply_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_FClamp_ReturnValue_1) == 0x000170, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000174, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_MakeVector2D_ReturnValue_1) == 0x00017C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_X_6) == 0x000184, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_X_6' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_BreakVector2D_Y_6) == 0x000188, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_BreakVector2D_Y_6' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_ScreenToWidgetLocal_LocalCoordinate) == 0x00018C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_ScreenToWidgetLocal_LocalCoordinate' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_FClamp_ReturnValue_2) == 0x000194, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_FClamp_ReturnValue_3) == 0x000198, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_MakeVector2D_ReturnValue_2) == 0x00019C, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_ExecuteUbergraph_MarkWidget, CallFunc_ScreenToWidgetLocal_LocalCoordinate_1) == 0x0001A4, "Member 'MarkWidget_C_ExecuteUbergraph_MarkWidget::CallFunc_ScreenToWidgetLocal_LocalCoordinate_1' has a wrong offset!");

// Function MarkWidget.MarkWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct MarkWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MarkWidget_C_Tick) == 0x000004, "Wrong alignment on MarkWidget_C_Tick");
static_assert(sizeof(MarkWidget_C_Tick) == 0x00003C, "Wrong size on MarkWidget_C_Tick");
static_assert(offsetof(MarkWidget_C_Tick, MyGeometry) == 0x000000, "Member 'MarkWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'MarkWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function MarkWidget.MarkWidget_C.MULTIMARK
// 0x00C8 (0x00C8 - 0x0000)
struct MarkWidget_C_MULTIMARK final
{
public:
	struct FMarkType                              CallFunc_Array_Get_Item;                           // 0x0000(0x00C8)(HasGetValueTypeHash)
};
static_assert(alignof(MarkWidget_C_MULTIMARK) == 0x000008, "Wrong alignment on MarkWidget_C_MULTIMARK");
static_assert(sizeof(MarkWidget_C_MULTIMARK) == 0x0000C8, "Wrong size on MarkWidget_C_MULTIMARK");
static_assert(offsetof(MarkWidget_C_MULTIMARK, CallFunc_Array_Get_Item) == 0x000000, "Member 'MarkWidget_C_MULTIMARK::CallFunc_Array_Get_Item' has a wrong offset!");

// Function MarkWidget.MarkWidget_C.SetMark
// 0x00C8 (0x00C8 - 0x0000)
struct MarkWidget_C_SetMark final
{
public:
	struct FMarkType                              MarkType_0;                                        // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(MarkWidget_C_SetMark) == 0x000008, "Wrong alignment on MarkWidget_C_SetMark");
static_assert(sizeof(MarkWidget_C_SetMark) == 0x0000C8, "Wrong size on MarkWidget_C_SetMark");
static_assert(offsetof(MarkWidget_C_SetMark, MarkType_0) == 0x000000, "Member 'MarkWidget_C_SetMark::MarkType_0' has a wrong offset!");

// Function MarkWidget.MarkWidget_C.IsPawn
// 0x02B0 (0x02B0 - 0x0000)
struct MarkWidget_C_IsPawn final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInCharacterLifeStatus_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State_1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarkType                              CallFunc_Array_Get_Item;                           // 0x0050(0x00C8)(HasGetValueTypeHash)
	EPBCamp                                       CallFunc_GetCampAttitude_ReturnValue;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarkType                              CallFunc_Array_Get_Item_1;                         // 0x0120(0x00C8)(HasGetValueTypeHash)
	struct FMarkType                              CallFunc_Array_Get_Item_2;                         // 0x01E8(0x00C8)(HasGetValueTypeHash)
};
static_assert(alignof(MarkWidget_C_IsPawn) == 0x000008, "Wrong alignment on MarkWidget_C_IsPawn");
static_assert(sizeof(MarkWidget_C_IsPawn) == 0x0002B0, "Wrong size on MarkWidget_C_IsPawn");
static_assert(offsetof(MarkWidget_C_IsPawn, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'MarkWidget_C_IsPawn::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'MarkWidget_C_IsPawn::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000010, "Member 'MarkWidget_C_IsPawn::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MarkWidget_C_IsPawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, K2Node_DynamicCast_AsPBCharacter_BP_1) == 0x000020, "Member 'MarkWidget_C_IsPawn::K2Node_DynamicCast_AsPBCharacter_BP_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'MarkWidget_C_IsPawn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, CallFunc_IsInCharacterLifeStatus_ReturnValue) == 0x000029, "Member 'MarkWidget_C_IsPawn::CallFunc_IsInCharacterLifeStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, K2Node_DynamicCast_AsPBPlayer_State) == 0x000030, "Member 'MarkWidget_C_IsPawn::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, K2Node_DynamicCast_bSuccess_2) == 0x000038, "Member 'MarkWidget_C_IsPawn::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, K2Node_DynamicCast_AsPBPlayer_State_1) == 0x000040, "Member 'MarkWidget_C_IsPawn::K2Node_DynamicCast_AsPBPlayer_State_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, K2Node_DynamicCast_bSuccess_3) == 0x000048, "Member 'MarkWidget_C_IsPawn::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, CallFunc_Array_Get_Item) == 0x000050, "Member 'MarkWidget_C_IsPawn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, CallFunc_GetCampAttitude_ReturnValue) == 0x000118, "Member 'MarkWidget_C_IsPawn::CallFunc_GetCampAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, K2Node_SwitchEnum_CmpSuccess) == 0x000119, "Member 'MarkWidget_C_IsPawn::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, CallFunc_Array_Get_Item_1) == 0x000120, "Member 'MarkWidget_C_IsPawn::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsPawn, CallFunc_Array_Get_Item_2) == 0x0001E8, "Member 'MarkWidget_C_IsPawn::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function MarkWidget.MarkWidget_C.IsMine
// 0x0118 (0x0118 - 0x0000)
struct MarkWidget_C_IsMine final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarkType                              CallFunc_Array_Get_Item;                           // 0x0010(0x00C8)(HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBMine*                                K2Node_DynamicCast_AsPBMine;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         CallFunc_GetOwnerPlayerState_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCamp                                       CallFunc_GetCampAttitude_ReturnValue;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MarkWidget_C_IsMine) == 0x000008, "Wrong alignment on MarkWidget_C_IsMine");
static_assert(sizeof(MarkWidget_C_IsMine) == 0x000118, "Wrong size on MarkWidget_C_IsMine");
static_assert(offsetof(MarkWidget_C_IsMine, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'MarkWidget_C_IsMine::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'MarkWidget_C_IsMine::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, CallFunc_Array_Get_Item) == 0x000010, "Member 'MarkWidget_C_IsMine::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, K2Node_DynamicCast_AsPBCharacter_BP) == 0x0000D8, "Member 'MarkWidget_C_IsMine::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'MarkWidget_C_IsMine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, K2Node_DynamicCast_AsPBPlayer_State) == 0x0000E8, "Member 'MarkWidget_C_IsMine::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'MarkWidget_C_IsMine::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, K2Node_DynamicCast_AsPBMine) == 0x0000F8, "Member 'MarkWidget_C_IsMine::K2Node_DynamicCast_AsPBMine' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'MarkWidget_C_IsMine::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, CallFunc_GetOwnerPlayerState_ReturnValue) == 0x000108, "Member 'MarkWidget_C_IsMine::CallFunc_GetOwnerPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, CallFunc_GetCampAttitude_ReturnValue) == 0x000110, "Member 'MarkWidget_C_IsMine::CallFunc_GetCampAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsMine, K2Node_SwitchEnum_CmpSuccess) == 0x000111, "Member 'MarkWidget_C_IsMine::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function MarkWidget.MarkWidget_C.IsSansor
// 0x0118 (0x0118 - 0x0000)
struct MarkWidget_C_IsSansor final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarkType                              CallFunc_Array_Get_Item;                           // 0x0010(0x00C8)(HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBSensor*                              K2Node_DynamicCast_AsPBSensor;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         CallFunc_GetOwnerPlayerState_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCamp                                       CallFunc_GetCampAttitude_ReturnValue;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MarkWidget_C_IsSansor) == 0x000008, "Wrong alignment on MarkWidget_C_IsSansor");
static_assert(sizeof(MarkWidget_C_IsSansor) == 0x000118, "Wrong size on MarkWidget_C_IsSansor");
static_assert(offsetof(MarkWidget_C_IsSansor, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'MarkWidget_C_IsSansor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsSansor, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'MarkWidget_C_IsSansor::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsSansor, CallFunc_Array_Get_Item) == 0x000010, "Member 'MarkWidget_C_IsSansor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MarkWidget_C_IsSansor, K2Node_DynamicCast_AsPBCharacter_BP) == 0x0000D8, "Member 'MarkWidget_C_IsSansor::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
