#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MarkWidget

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MarkType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MarkWidget.MarkWidget_C
// 0x0060 (0x02C0 - 0x0260)
class UMarkWidget_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Distance;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             M;                                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TargetDistance;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TargetImage;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TargetNote;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 MarkActor;                                         // 0x0290(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Lenghth;                                           // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MarkLocation;                                      // 0x029C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMarkType>                      MarkType;                                          // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bEnermy;                                           // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MarkWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void MULTIMARK();
	void SetMark(const struct FMarkType& MarkType_0);
	void OnRep_MarkActor();
	void IsPawn();
	void IsMine();
	void IsSansor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MarkWidget_C">();
	}
	static class UMarkWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarkWidget_C>();
	}
};
static_assert(alignof(UMarkWidget_C) == 0x000008, "Wrong alignment on UMarkWidget_C");
static_assert(sizeof(UMarkWidget_C) == 0x0002C0, "Wrong size on UMarkWidget_C");
static_assert(offsetof(UMarkWidget_C, UberGraphFrame) == 0x000260, "Member 'UMarkWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, Distance) == 0x000268, "Member 'UMarkWidget_C::Distance' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, M) == 0x000270, "Member 'UMarkWidget_C::M' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, TargetDistance) == 0x000278, "Member 'UMarkWidget_C::TargetDistance' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, TargetImage) == 0x000280, "Member 'UMarkWidget_C::TargetImage' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, TargetNote) == 0x000288, "Member 'UMarkWidget_C::TargetNote' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, MarkActor) == 0x000290, "Member 'UMarkWidget_C::MarkActor' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, Lenghth) == 0x000298, "Member 'UMarkWidget_C::Lenghth' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, MarkLocation) == 0x00029C, "Member 'UMarkWidget_C::MarkLocation' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, MarkType) == 0x0002A8, "Member 'UMarkWidget_C::MarkType' has a wrong offset!");
static_assert(offsetof(UMarkWidget_C, bEnermy) == 0x0002B8, "Member 'UMarkWidget_C::bEnermy' has a wrong offset!");

}

