#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MarkActor

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MarkResult_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MarkActor.MarkActor_C
// 0x0048 (0x0268 - 0x0220)
class AMarkActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMarkWidget_C*                          MarkWidget;                                        // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWarning;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bEnermy;                                           // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarkResult                            MarkResult;                                        // 0x0248(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          TurnWarning;                                       // 0x0258(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DestroyTime;                                       // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MarkActor(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void MULTIMARK();
	void OnRep_MarkResult();
	void OnRep_TurnWarning();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MarkActor_C">();
	}
	static class AMarkActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMarkActor_C>();
	}
};
static_assert(alignof(AMarkActor_C) == 0x000008, "Wrong alignment on AMarkActor_C");
static_assert(sizeof(AMarkActor_C) == 0x000268, "Wrong size on AMarkActor_C");
static_assert(offsetof(AMarkActor_C, UberGraphFrame) == 0x000220, "Member 'AMarkActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMarkActor_C, Sphere) == 0x000228, "Member 'AMarkActor_C::Sphere' has a wrong offset!");
static_assert(offsetof(AMarkActor_C, DefaultSceneRoot) == 0x000230, "Member 'AMarkActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMarkActor_C, MarkWidget) == 0x000238, "Member 'AMarkActor_C::MarkWidget' has a wrong offset!");
static_assert(offsetof(AMarkActor_C, bWarning) == 0x000240, "Member 'AMarkActor_C::bWarning' has a wrong offset!");
static_assert(offsetof(AMarkActor_C, bEnermy) == 0x000241, "Member 'AMarkActor_C::bEnermy' has a wrong offset!");
static_assert(offsetof(AMarkActor_C, MarkResult) == 0x000248, "Member 'AMarkActor_C::MarkResult' has a wrong offset!");
static_assert(offsetof(AMarkActor_C, TurnWarning) == 0x000258, "Member 'AMarkActor_C::TurnWarning' has a wrong offset!");
static_assert(offsetof(AMarkActor_C, DestroyTime) == 0x00025C, "Member 'AMarkActor_C::DestroyTime' has a wrong offset!");
static_assert(offsetof(AMarkActor_C, DelayTime) == 0x000260, "Member 'AMarkActor_C::DelayTime' has a wrong offset!");

}

