#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MKIII_DisplayChar_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MKIII_DisplayChar_ABP.MKIII_DisplayChar_ABP_C.ExecuteUbergraph_MKIII_DisplayChar_ABP
// 0x0014 (0x0014 - 0x0000)
struct MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP) == 0x000004, "Wrong alignment on MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP");
static_assert(sizeof(MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP) == 0x000014, "Wrong size on MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP");
static_assert(offsetof(MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP, EntryPoint) == 0x000000, "Member 'MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP, Temp_bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP, Temp_bool_IsClosed_Variable) == 0x00000D, "Member 'MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP, CallFunc_MapRangeClamped_ReturnValue) == 0x000010, "Member 'MKIII_DisplayChar_ABP_C_ExecuteUbergraph_MKIII_DisplayChar_ABP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function MKIII_DisplayChar_ABP.MKIII_DisplayChar_ABP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct MKIII_DisplayChar_ABP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MKIII_DisplayChar_ABP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on MKIII_DisplayChar_ABP_C_BlueprintUpdateAnimation");
static_assert(sizeof(MKIII_DisplayChar_ABP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on MKIII_DisplayChar_ABP_C_BlueprintUpdateAnimation");
static_assert(offsetof(MKIII_DisplayChar_ABP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'MKIII_DisplayChar_ABP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function MKIII_DisplayChar_ABP.MKIII_DisplayChar_ABP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MKIII_DisplayChar_ABP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MKIII_DisplayChar_ABP_C_AnimGraph) == 0x000008, "Wrong alignment on MKIII_DisplayChar_ABP_C_AnimGraph");
static_assert(sizeof(MKIII_DisplayChar_ABP_C_AnimGraph) == 0x000010, "Wrong size on MKIII_DisplayChar_ABP_C_AnimGraph");
static_assert(offsetof(MKIII_DisplayChar_ABP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'MKIII_DisplayChar_ABP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

