#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MKIII_TP_ABP_Post

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MKIII_TP_ABP_Post.MKIII_TP_ABP_Post_C.ExecuteUbergraph_MKIII_TP_ABP_Post
// 0x0004 (0x0004 - 0x0000)
struct MKIII_TP_ABP_Post_C_ExecuteUbergraph_MKIII_TP_ABP_Post final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MKIII_TP_ABP_Post_C_ExecuteUbergraph_MKIII_TP_ABP_Post) == 0x000004, "Wrong alignment on MKIII_TP_ABP_Post_C_ExecuteUbergraph_MKIII_TP_ABP_Post");
static_assert(sizeof(MKIII_TP_ABP_Post_C_ExecuteUbergraph_MKIII_TP_ABP_Post) == 0x000004, "Wrong size on MKIII_TP_ABP_Post_C_ExecuteUbergraph_MKIII_TP_ABP_Post");
static_assert(offsetof(MKIII_TP_ABP_Post_C_ExecuteUbergraph_MKIII_TP_ABP_Post, EntryPoint) == 0x000000, "Member 'MKIII_TP_ABP_Post_C_ExecuteUbergraph_MKIII_TP_ABP_Post::EntryPoint' has a wrong offset!");

// Function MKIII_TP_ABP_Post.MKIII_TP_ABP_Post_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct MKIII_TP_ABP_Post_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MKIII_TP_ABP_Post_C_AnimGraph) == 0x000008, "Wrong alignment on MKIII_TP_ABP_Post_C_AnimGraph");
static_assert(sizeof(MKIII_TP_ABP_Post_C_AnimGraph) == 0x000020, "Wrong size on MKIII_TP_ABP_Post_C_AnimGraph");
static_assert(offsetof(MKIII_TP_ABP_Post_C_AnimGraph, InPose) == 0x000000, "Member 'MKIII_TP_ABP_Post_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(MKIII_TP_ABP_Post_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'MKIII_TP_ABP_Post_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function MKIII_TP_ABP_Post.MKIII_TP_ABP_Post_C.FootIKLayer
// 0x0020 (0x0020 - 0x0000)
struct MKIII_TP_ABP_Post_C_FootIKLayer final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FootIKLayer_0;                                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MKIII_TP_ABP_Post_C_FootIKLayer) == 0x000008, "Wrong alignment on MKIII_TP_ABP_Post_C_FootIKLayer");
static_assert(sizeof(MKIII_TP_ABP_Post_C_FootIKLayer) == 0x000020, "Wrong size on MKIII_TP_ABP_Post_C_FootIKLayer");
static_assert(offsetof(MKIII_TP_ABP_Post_C_FootIKLayer, InPose_0) == 0x000000, "Member 'MKIII_TP_ABP_Post_C_FootIKLayer::InPose_0' has a wrong offset!");
static_assert(offsetof(MKIII_TP_ABP_Post_C_FootIKLayer, FootIKLayer_0) == 0x000010, "Member 'MKIII_TP_ABP_Post_C_FootIKLayer::FootIKLayer_0' has a wrong offset!");

}

