#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MKIII_ABP_Char_LeftHand_Launcher

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MKIII_ABP_Char_LeftHand_Launcher.MKIII_ABP_Char_LeftHand_Launcher_C.ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher
// 0x0038 (0x0038 - 0x0000)
struct MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMKIII_ABP_C*                           K2Node_DynamicCast_AsMKIII_ABP;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher) == 0x000008, "Wrong alignment on MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher");
static_assert(sizeof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher) == 0x000038, "Wrong size on MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, EntryPoint) == 0x000000, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000010, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, K2Node_DynamicCast_AsMKIII_ABP) == 0x000028, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::K2Node_DynamicCast_AsMKIII_ABP' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000032, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000033, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, CallFunc_BooleanOR_ReturnValue) == 0x000034, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher, CallFunc_BooleanOR_ReturnValue_1) == 0x000035, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Launcher::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function MKIII_ABP_Char_LeftHand_Launcher.MKIII_ABP_Char_LeftHand_Launcher_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct MKIII_ABP_Char_LeftHand_Launcher_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MKIII_ABP_Char_LeftHand_Launcher_C_AnimGraph) == 0x000008, "Wrong alignment on MKIII_ABP_Char_LeftHand_Launcher_C_AnimGraph");
static_assert(sizeof(MKIII_ABP_Char_LeftHand_Launcher_C_AnimGraph) == 0x000020, "Wrong size on MKIII_ABP_Char_LeftHand_Launcher_C_AnimGraph");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_AnimGraph, InPose) == 0x000000, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Launcher_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'MKIII_ABP_Char_LeftHand_Launcher_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

