#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MKIII_ABP_Char_LeftHand_Hook

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MKIII_ABP_Char_LeftHand_Hook.MKIII_ABP_Char_LeftHand_Hook_C
// 0x0D00 (0x0FC0 - 0x02C0)
class UMKIII_ABP_Char_LeftHand_Hook_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0410(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04D0(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0550(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0610(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0658(0x0080)()
	uint8                                         Pad_6D8[0x8];                                      // 0x06D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x06E0(0x01E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x08C0(0x0108)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x09C8(0x00F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0AB8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0AD8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0AF8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0C50(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0C78(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0CA0(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0D40(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0E98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0EC0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0EE8(0x00A0)()
	class APBCharacter_BP_C*                      OwningCharacter;                                   // 0x0F88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HookSnapping_;                                     // 0x0F90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHookUsing_;                                      // 0x0F91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F92[0x2];                                      // 0x0F92(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HookingHandOffset;                                 // 0x0F94(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HookCaughtLocation;                                // 0x0FA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UseGraple_AfterInterp;                             // 0x0FAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBStateInHookUsing                           HookState;                                         // 0x0FB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RaiseHand_;                                        // 0x0FB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void SetInterpSpeedAndIntrep();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MKIII_ABP_Char_LeftHand_Hook_C">();
	}
	static class UMKIII_ABP_Char_LeftHand_Hook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMKIII_ABP_Char_LeftHand_Hook_C>();
	}
};
static_assert(alignof(UMKIII_ABP_Char_LeftHand_Hook_C) == 0x000010, "Wrong alignment on UMKIII_ABP_Char_LeftHand_Hook_C");
static_assert(sizeof(UMKIII_ABP_Char_LeftHand_Hook_C) == 0x000FC0, "Wrong size on UMKIII_ABP_Char_LeftHand_Hook_C");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, UberGraphFrame) == 0x0002C0, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_LayeredBoneBlend_1) == 0x000410, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_SequencePlayer_1) == 0x0004D0, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_LayeredBoneBlend) == 0x000550, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_Slot) == 0x000610, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_SequencePlayer) == 0x000658, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_TwoBoneIK) == 0x0006E0, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_ModifyBone) == 0x0008C0, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_CopyBone) == 0x0009C8, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_LocalToComponentSpace) == 0x000AB8, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_ComponentToLocalSpace) == 0x000AD8, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_SaveCachedPose_1) == 0x000AF8, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_UseCachedPose_3) == 0x000C50, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_UseCachedPose_2) == 0x000C78, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_BlendListByBool_1) == 0x000CA0, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_SaveCachedPose) == 0x000D40, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_UseCachedPose_1) == 0x000E98, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_UseCachedPose) == 0x000EC0, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, AnimGraphNode_BlendListByBool) == 0x000EE8, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, OwningCharacter) == 0x000F88, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::OwningCharacter' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, HookSnapping_) == 0x000F90, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::HookSnapping_' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, IsHookUsing_) == 0x000F91, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::IsHookUsing_' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, HookingHandOffset) == 0x000F94, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::HookingHandOffset' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, HookCaughtLocation) == 0x000FA0, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::HookCaughtLocation' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, UseGraple_AfterInterp) == 0x000FAC, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::UseGraple_AfterInterp' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, HookState) == 0x000FB0, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::HookState' has a wrong offset!");
static_assert(offsetof(UMKIII_ABP_Char_LeftHand_Hook_C, RaiseHand_) == 0x000FB1, "Member 'UMKIII_ABP_Char_LeftHand_Hook_C::RaiseHand_' has a wrong offset!");

}

