#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MKIII_ABP_Char_LeftHand_Hook

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MKIII_ABP_Char_LeftHand_Hook.MKIII_ABP_Char_LeftHand_Hook_C.ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook
// 0x0030 (0x0030 - 0x0000)
struct MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInHookUsingState_ReturnValue;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook) == 0x000008, "Wrong alignment on MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook");
static_assert(sizeof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook) == 0x000030, "Wrong size on MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, EntryPoint) == 0x000000, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::EntryPoint' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, CallFunc_IsInHookUsingState_ReturnValue) == 0x000007, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::CallFunc_IsInHookUsingState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000D, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000018, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, CallFunc_Montage_Play_ReturnValue) == 0x000024, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000028, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_ExecuteUbergraph_MKIII_ABP_Char_LeftHand_Hook::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");

// Function MKIII_ABP_Char_LeftHand_Hook.MKIII_ABP_Char_LeftHand_Hook_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct MKIII_ABP_Char_LeftHand_Hook_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MKIII_ABP_Char_LeftHand_Hook_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on MKIII_ABP_Char_LeftHand_Hook_C_BlueprintUpdateAnimation");
static_assert(sizeof(MKIII_ABP_Char_LeftHand_Hook_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on MKIII_ABP_Char_LeftHand_Hook_C_BlueprintUpdateAnimation");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function MKIII_ABP_Char_LeftHand_Hook.MKIII_ABP_Char_LeftHand_Hook_C.SetInterpSpeedAndIntrep
// 0x0028 (0x0028 - 0x0000)
struct MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep final
{
public:
	bool                                          bIsInHookState;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpSpeed;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep) == 0x000004, "Wrong alignment on MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep");
static_assert(sizeof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep) == 0x000028, "Wrong size on MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, bIsInHookState) == 0x000000, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::bIsInHookState' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, InterpSpeed) == 0x000004, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::InterpSpeed' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, Temp_bool_Variable) == 0x000008, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00000C, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000010, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000014, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x000018, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, CallFunc_FInterpTo_ReturnValue) == 0x00001C, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000020, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep, K2Node_Select_Default) == 0x000024, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_SetInterpSpeedAndIntrep::K2Node_Select_Default' has a wrong offset!");

// Function MKIII_ABP_Char_LeftHand_Hook.MKIII_ABP_Char_LeftHand_Hook_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct MKIII_ABP_Char_LeftHand_Hook_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MKIII_ABP_Char_LeftHand_Hook_C_AnimGraph) == 0x000008, "Wrong alignment on MKIII_ABP_Char_LeftHand_Hook_C_AnimGraph");
static_assert(sizeof(MKIII_ABP_Char_LeftHand_Hook_C_AnimGraph) == 0x000020, "Wrong size on MKIII_ABP_Char_LeftHand_Hook_C_AnimGraph");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_AnimGraph, InPose) == 0x000000, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(MKIII_ABP_Char_LeftHand_Hook_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'MKIII_ABP_Char_LeftHand_Hook_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

