#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MKIII_DisplayChar_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MKIII_DisplayChar_ABP.MKIII_DisplayChar_ABP_C
// 0x20E0 (0x23A0 - 0x02C0)
class UMKIII_DisplayChar_ABP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x02C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x03D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x04D8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x05E0(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x06E8(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0840(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0998(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x09C0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A88(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0AB0(0x0158)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0C08(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0C88(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0DE0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0E28(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x0EA8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0F70(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1010(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x10F8(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x11B8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1238(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x12D8(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1398(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1418(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1498(0x0080)()
	uint8                                         Pad_1518[0x8];                                     // 0x1518(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x1520(0x01E0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1700(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x17C8(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1848(0x0108)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1950(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1A18(0x0080)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x1A98(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x1B88(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1C78(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1D80(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1E88(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1F90(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1FB0(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2070(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x20F0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2138(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2168(0x0080)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x21E8(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x2208(0x00C8)()
	struct FVector                                WeaponLocationOffset;                              // 0x22D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ADS;                                               // 0x22DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               WeaponRotationOffset;                              // 0x22E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22EC[0x4];                                     // 0x22EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      PawnIdlePose;                                      // 0x22F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      PawnADS_Pose;                                      // 0x22F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EquipTrigger;                                      // 0x2300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DeployDirection;                                   // 0x2301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2302[0x6];                                     // 0x2302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          DeploySequence;                                    // 0x2308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EquipPlayRate;                                     // 0x2310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeployPosition;                                    // 0x2314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentFOV;                                        // 0x2318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x231C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x2320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VertDir;                                           // 0x2324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AxisInputAcc;                                      // 0x2328(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsADS;                                             // 0x2334(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2335[0x3];                                     // 0x2335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UI_Ready;                                          // 0x2338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233C[0x4];                                     // 0x233C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      PawnIdleW1;                                        // 0x2340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      PawnIdleW2;                                        // 0x2348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HelLoc;                                            // 0x2350(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisHel;                                            // 0x235C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235D[0x3];                                     // 0x235D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      PawnIdleW1_New;                                    // 0x2360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      PawnIdleW2_New;                                    // 0x2368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UI_BlendSpeed;                                     // 0x2370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UI_WeaponSwitch;                                   // 0x2374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UI_ModdingTac;                                     // 0x2375(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2376[0x2];                                     // 0x2376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LayerBlendPerBoneValue;                            // 0x2378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayUIReadyBlendWeight;                            // 0x237C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CopyHandLAlpha;                                    // 0x2380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CopyHandRAlpha;                                    // 0x2384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HeavyHeadAlpha;                                    // 0x2388(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HelAlpha;                                          // 0x2394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MKIII_DisplayChar_ABP(int32 EntryPoint);
	void WeaponShiftTimer();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_DisplayChar_ABP_AnimGraphNode_SequencePlayer_1E40AA5D44B83D162AFD249E01893ED7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_DisplayChar_ABP_AnimGraphNode_TwoWayBlend_28F32D7F4FCB31F7ADE9C6BEC41E93ED();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MKIII_DisplayChar_ABP_C">();
	}
	static class UMKIII_DisplayChar_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMKIII_DisplayChar_ABP_C>();
	}
};
static_assert(alignof(UMKIII_DisplayChar_ABP_C) == 0x000010, "Wrong alignment on UMKIII_DisplayChar_ABP_C");
static_assert(sizeof(UMKIII_DisplayChar_ABP_C) == 0x0023A0, "Wrong size on UMKIII_DisplayChar_ABP_C");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, UberGraphFrame) == 0x0002C0, "Member 'UMKIII_DisplayChar_ABP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ModifyBone_7) == 0x0002C8, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ModifyBone_6) == 0x0003D0, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ModifyBone_5) == 0x0004D8, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ModifyBone_4) == 0x0005E0, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SaveCachedPose_3) == 0x0006E8, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SaveCachedPose_2) == 0x000840, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_UseCachedPose_1) == 0x000998, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_TwoWayBlend_1) == 0x0009C0, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_UseCachedPose) == 0x000A88, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SaveCachedPose_1) == 0x000AB0, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer_9) == 0x000C08, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SaveCachedPose) == 0x000C88, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_Slot_1) == 0x000DE0, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer_8) == 0x000E28, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ApplyAdditive_2) == 0x000EA8, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_BlendListByBool_1) == 0x000F70, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_BlendSpacePlayer) == 0x001010, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_LayeredBoneBlend_2) == 0x0010F8, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer_7) == 0x0011B8, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_BlendListByBool) == 0x001238, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x0012D8, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer_6) == 0x001398, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer_5) == 0x001418, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer_4) == 0x001498, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_TwoBoneIK) == 0x001520, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_TwoWayBlend) == 0x001700, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer_3) == 0x0017C8, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ModifyBone_3) == 0x001848, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ApplyAdditive_1) == 0x001950, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer_2) == 0x001A18, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_CopyBone_1) == 0x001A98, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_CopyBone) == 0x001B88, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ModifyBone_2) == 0x001C78, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ModifyBone_1) == 0x001D80, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ModifyBone) == 0x001E88, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_LocalToComponentSpace) == 0x001F90, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_LayeredBoneBlend) == 0x001FB0, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer_1) == 0x002070, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_Slot) == 0x0020F0, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_Root) == 0x002138, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_SequencePlayer) == 0x002168, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0021E8, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AnimGraphNode_ApplyAdditive) == 0x002208, "Member 'UMKIII_DisplayChar_ABP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, WeaponLocationOffset) == 0x0022D0, "Member 'UMKIII_DisplayChar_ABP_C::WeaponLocationOffset' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, ADS) == 0x0022DC, "Member 'UMKIII_DisplayChar_ABP_C::ADS' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, WeaponRotationOffset) == 0x0022E0, "Member 'UMKIII_DisplayChar_ABP_C::WeaponRotationOffset' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, PawnIdlePose) == 0x0022F0, "Member 'UMKIII_DisplayChar_ABP_C::PawnIdlePose' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, PawnADS_Pose) == 0x0022F8, "Member 'UMKIII_DisplayChar_ABP_C::PawnADS_Pose' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, EquipTrigger) == 0x002300, "Member 'UMKIII_DisplayChar_ABP_C::EquipTrigger' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, DeployDirection) == 0x002301, "Member 'UMKIII_DisplayChar_ABP_C::DeployDirection' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, DeploySequence) == 0x002308, "Member 'UMKIII_DisplayChar_ABP_C::DeploySequence' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, EquipPlayRate) == 0x002310, "Member 'UMKIII_DisplayChar_ABP_C::EquipPlayRate' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, DeployPosition) == 0x002314, "Member 'UMKIII_DisplayChar_ABP_C::DeployPosition' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, CurrentFOV) == 0x002318, "Member 'UMKIII_DisplayChar_ABP_C::CurrentFOV' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, Direction) == 0x00231C, "Member 'UMKIII_DisplayChar_ABP_C::Direction' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, Speed) == 0x002320, "Member 'UMKIII_DisplayChar_ABP_C::Speed' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, VertDir) == 0x002324, "Member 'UMKIII_DisplayChar_ABP_C::VertDir' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, AxisInputAcc) == 0x002328, "Member 'UMKIII_DisplayChar_ABP_C::AxisInputAcc' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, IsADS) == 0x002334, "Member 'UMKIII_DisplayChar_ABP_C::IsADS' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, UI_Ready) == 0x002338, "Member 'UMKIII_DisplayChar_ABP_C::UI_Ready' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, PawnIdleW1) == 0x002340, "Member 'UMKIII_DisplayChar_ABP_C::PawnIdleW1' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, PawnIdleW2) == 0x002348, "Member 'UMKIII_DisplayChar_ABP_C::PawnIdleW2' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, HelLoc) == 0x002350, "Member 'UMKIII_DisplayChar_ABP_C::HelLoc' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, DisHel) == 0x00235C, "Member 'UMKIII_DisplayChar_ABP_C::DisHel' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, PawnIdleW1_New) == 0x002360, "Member 'UMKIII_DisplayChar_ABP_C::PawnIdleW1_New' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, PawnIdleW2_New) == 0x002368, "Member 'UMKIII_DisplayChar_ABP_C::PawnIdleW2_New' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, UI_BlendSpeed) == 0x002370, "Member 'UMKIII_DisplayChar_ABP_C::UI_BlendSpeed' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, UI_WeaponSwitch) == 0x002374, "Member 'UMKIII_DisplayChar_ABP_C::UI_WeaponSwitch' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, UI_ModdingTac) == 0x002375, "Member 'UMKIII_DisplayChar_ABP_C::UI_ModdingTac' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, LayerBlendPerBoneValue) == 0x002378, "Member 'UMKIII_DisplayChar_ABP_C::LayerBlendPerBoneValue' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, PlayUIReadyBlendWeight) == 0x00237C, "Member 'UMKIII_DisplayChar_ABP_C::PlayUIReadyBlendWeight' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, CopyHandLAlpha) == 0x002380, "Member 'UMKIII_DisplayChar_ABP_C::CopyHandLAlpha' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, CopyHandRAlpha) == 0x002384, "Member 'UMKIII_DisplayChar_ABP_C::CopyHandRAlpha' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, HeavyHeadAlpha) == 0x002388, "Member 'UMKIII_DisplayChar_ABP_C::HeavyHeadAlpha' has a wrong offset!");
static_assert(offsetof(UMKIII_DisplayChar_ABP_C, HelAlpha) == 0x002394, "Member 'UMKIII_DisplayChar_ABP_C::HelAlpha' has a wrong offset!");

}

