#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NoMissileTargetWaring

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NoMissileTargetWaring.NoMissileTargetWaring_C.ExecuteUbergraph_NoMissileTargetWaring
// 0x0030 (0x0030 - 0x0000)
struct NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TimerExistsHandle_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerController*                    K2Node_DynamicCast_AsPBPlayer_Controller;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring) == 0x000008, "Wrong alignment on NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring");
static_assert(sizeof(NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring) == 0x000030, "Wrong size on NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring");
static_assert(offsetof(NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring, EntryPoint) == 0x000000, "Member 'NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring::EntryPoint' has a wrong offset!");
static_assert(offsetof(NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring, CallFunc_K2_TimerExistsHandle_ReturnValue) == 0x000010, "Member 'NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring::CallFunc_K2_TimerExistsHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring, K2Node_DynamicCast_AsPBPlayer_Controller) == 0x000020, "Member 'NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring::K2Node_DynamicCast_AsPBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'NoMissileTargetWaring_C_ExecuteUbergraph_NoMissileTargetWaring::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

