#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NormalFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function NormalFunctionLibrary.NormalFunctionLibrary_C.PlaySoundFXOnHitEnemy
// 0x0018 (0x0018 - 0x0000)
struct NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy final
{
public:
	EPBHitZone                                    HitZone;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy) == 0x000008, "Wrong alignment on NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy");
static_assert(sizeof(NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy) == 0x000018, "Wrong size on NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy");
static_assert(offsetof(NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy, HitZone) == 0x000000, "Member 'NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy::HitZone' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy, __WorldContext) == 0x000008, "Member 'NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy::__WorldContext' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'NormalFunctionLibrary_C_PlaySoundFXOnHitEnemy::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function NormalFunctionLibrary.NormalFunctionLibrary_C.BoxAdd
// 0x00D8 (0x00D8 - 0x0000)
struct NormalFunctionLibrary_C_BoxAdd final
{
public:
	struct FBox                                   A;                                                 // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBox                                   B;                                                 // 0x001C(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   Ret;                                               // 0x0040(0x001C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_2;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_MakeBox_ReturnValue;                      // 0x00BC(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NormalFunctionLibrary_C_BoxAdd) == 0x000008, "Wrong alignment on NormalFunctionLibrary_C_BoxAdd");
static_assert(sizeof(NormalFunctionLibrary_C_BoxAdd) == 0x0000D8, "Wrong size on NormalFunctionLibrary_C_BoxAdd");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, A) == 0x000000, "Member 'NormalFunctionLibrary_C_BoxAdd::A' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, B) == 0x00001C, "Member 'NormalFunctionLibrary_C_BoxAdd::B' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, __WorldContext) == 0x000038, "Member 'NormalFunctionLibrary_C_BoxAdd::__WorldContext' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, Ret) == 0x000040, "Member 'NormalFunctionLibrary_C_BoxAdd::Ret' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_X) == 0x00005C, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_Y) == 0x000060, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_Z) == 0x000064, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_X_1) == 0x000068, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_Y_1) == 0x00006C, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_Z_1) == 0x000070, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_X_2) == 0x000074, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_Y_2) == 0x000078, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_Z_2) == 0x00007C, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_FMax_ReturnValue) == 0x000080, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_FMax_ReturnValue_1) == 0x000084, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_FMax_ReturnValue_2) == 0x000088, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_X_3) == 0x00008C, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_Y_3) == 0x000090, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_BreakVector_Z_3) == 0x000094, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_FMin_ReturnValue) == 0x0000A4, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_FMin_ReturnValue_1) == 0x0000A8, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_FMin_ReturnValue_2) == 0x0000AC, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_FMin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_MakeVector_ReturnValue_1) == 0x0000B0, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_BoxAdd, CallFunc_MakeBox_ReturnValue) == 0x0000BC, "Member 'NormalFunctionLibrary_C_BoxAdd::CallFunc_MakeBox_ReturnValue' has a wrong offset!");

// Function NormalFunctionLibrary.NormalFunctionLibrary_C.GetCaptureMiniMapIconByName
// 0x0028 (0x0028 - 0x0000)
struct NormalFunctionLibrary_C_GetCaptureMiniMapIconByName final
{
public:
	class FString                                 InName;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             OutIcon;                                           // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NormalFunctionLibrary_C_GetCaptureMiniMapIconByName) == 0x000008, "Wrong alignment on NormalFunctionLibrary_C_GetCaptureMiniMapIconByName");
static_assert(sizeof(NormalFunctionLibrary_C_GetCaptureMiniMapIconByName) == 0x000028, "Wrong size on NormalFunctionLibrary_C_GetCaptureMiniMapIconByName");
static_assert(offsetof(NormalFunctionLibrary_C_GetCaptureMiniMapIconByName, InName) == 0x000000, "Member 'NormalFunctionLibrary_C_GetCaptureMiniMapIconByName::InName' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_GetCaptureMiniMapIconByName, __WorldContext) == 0x000010, "Member 'NormalFunctionLibrary_C_GetCaptureMiniMapIconByName::__WorldContext' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_GetCaptureMiniMapIconByName, OutIcon) == 0x000018, "Member 'NormalFunctionLibrary_C_GetCaptureMiniMapIconByName::OutIcon' has a wrong offset!");
static_assert(offsetof(NormalFunctionLibrary_C_GetCaptureMiniMapIconByName, K2Node_SwitchString_CmpSuccess) == 0x000020, "Member 'NormalFunctionLibrary_C_GetCaptureMiniMapIconByName::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

}

