#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NSSR_Mesh_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NSSR_Mesh_Skeleton_AnimBlueprint.NSSR_Mesh_Skeleton_AnimBlueprint_C.ExecuteUbergraph_NSSR_Mesh_Skeleton_AnimBlueprint
// 0x0004 (0x0004 - 0x0000)
struct NSSR_Mesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_NSSR_Mesh_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NSSR_Mesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_NSSR_Mesh_Skeleton_AnimBlueprint) == 0x000004, "Wrong alignment on NSSR_Mesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_NSSR_Mesh_Skeleton_AnimBlueprint");
static_assert(sizeof(NSSR_Mesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_NSSR_Mesh_Skeleton_AnimBlueprint) == 0x000004, "Wrong size on NSSR_Mesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_NSSR_Mesh_Skeleton_AnimBlueprint");
static_assert(offsetof(NSSR_Mesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_NSSR_Mesh_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'NSSR_Mesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_NSSR_Mesh_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");

// Function NSSR_Mesh_Skeleton_AnimBlueprint.NSSR_Mesh_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct NSSR_Mesh_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NSSR_Mesh_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on NSSR_Mesh_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(NSSR_Mesh_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on NSSR_Mesh_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(NSSR_Mesh_Skeleton_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'NSSR_Mesh_Skeleton_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

