#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnControllerConnectionChange

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function OnControllerConnectionChange.OnControllerConnectionChange_C.ExecuteUbergraph_OnControllerConnectionChange
// 0x00A0 (0x00A0 - 0x0000)
struct OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCustomizeUIManager_BP_C*             CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue_1;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue_2;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue_3;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBGameMode_ShowRoom*                   K2Node_DynamicCast_AsPBGame_Mode_Show_Room;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange) == 0x000008, "Wrong alignment on OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange");
static_assert(sizeof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange) == 0x0000A0, "Wrong size on OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, EntryPoint) == 0x000000, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::EntryPoint' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, Temp_byte_Variable) == 0x000010, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, Temp_byte_Variable_1) == 0x000011, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000018, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_GetPlatformName_ReturnValue) == 0x000020, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000038, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, Temp_bool_Variable) == 0x00003A, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_GetPlatformName_ReturnValue_1) == 0x000040, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_GetPlatformName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000050, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, K2Node_Select_Default) == 0x000051, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_GetPlatformName_ReturnValue_2) == 0x000058, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_GetPlatformName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_GetPlatformName_ReturnValue_3) == 0x000068, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_GetPlatformName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000078, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000079, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_GetGameMode_ReturnValue) == 0x000080, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, K2Node_DynamicCast_AsPBGame_Mode_Show_Room) == 0x000090, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::K2Node_DynamicCast_AsPBGame_Mode_Show_Room' has a wrong offset!");
static_assert(offsetof(OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'OnControllerConnectionChange_C_ExecuteUbergraph_OnControllerConnectionChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

