#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_ButtonSettings

#include "Basic.hpp"


namespace SDK::Params
{

// Function Option_ButtonSettings.Option_ButtonSettings_C.ExecuteUbergraph_Option_ButtonSettings
// 0x0030 (0x0030 - 0x0000)
struct Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsInGame, class UPBMainMenuManager* MainMenuManagerBP)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsInGame;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager*                     K2Node_CustomEvent_MainMenuManagerBP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager_BP_C*                K2Node_DynamicCast_AsPBMain_Menu_Manager_BP;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings) == 0x000008, "Wrong alignment on Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings");
static_assert(sizeof(Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings) == 0x000030, "Wrong size on Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings");
static_assert(offsetof(Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings, EntryPoint) == 0x000000, "Member 'Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings, K2Node_CustomEvent_bIsInGame) == 0x000014, "Member 'Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings::K2Node_CustomEvent_bIsInGame' has a wrong offset!");
static_assert(offsetof(Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings, K2Node_CustomEvent_MainMenuManagerBP) == 0x000018, "Member 'Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings::K2Node_CustomEvent_MainMenuManagerBP' has a wrong offset!");
static_assert(offsetof(Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings, K2Node_DynamicCast_AsPBMain_Menu_Manager_BP) == 0x000020, "Member 'Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings::K2Node_DynamicCast_AsPBMain_Menu_Manager_BP' has a wrong offset!");
static_assert(offsetof(Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Option_ButtonSettings_C_ExecuteUbergraph_Option_ButtonSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Option_ButtonSettings.Option_ButtonSettings_C.OnOptionClickEvent_Event_0
// 0x0010 (0x0010 - 0x0000)
struct Option_ButtonSettings_C_OnOptionClickEvent_Event_0 final
{
public:
	bool                                          bIsInGame;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager*                     MainMenuManagerBP;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Option_ButtonSettings_C_OnOptionClickEvent_Event_0) == 0x000008, "Wrong alignment on Option_ButtonSettings_C_OnOptionClickEvent_Event_0");
static_assert(sizeof(Option_ButtonSettings_C_OnOptionClickEvent_Event_0) == 0x000010, "Wrong size on Option_ButtonSettings_C_OnOptionClickEvent_Event_0");
static_assert(offsetof(Option_ButtonSettings_C_OnOptionClickEvent_Event_0, bIsInGame) == 0x000000, "Member 'Option_ButtonSettings_C_OnOptionClickEvent_Event_0::bIsInGame' has a wrong offset!");
static_assert(offsetof(Option_ButtonSettings_C_OnOptionClickEvent_Event_0, MainMenuManagerBP) == 0x000008, "Member 'Option_ButtonSettings_C_OnOptionClickEvent_Event_0::MainMenuManagerBP' has a wrong offset!");

// Function Option_ButtonSettings.Option_ButtonSettings_C.ShowControllerButtonSetting
// 0x0018 (0x0018 - 0x0000)
struct Option_ButtonSettings_C_ShowControllerButtonSetting final
{
public:
	bool                                          IsInGame;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                MainMenuManagerBP;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushMenu_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Option_ButtonSettings_C_ShowControllerButtonSetting) == 0x000008, "Wrong alignment on Option_ButtonSettings_C_ShowControllerButtonSetting");
static_assert(sizeof(Option_ButtonSettings_C_ShowControllerButtonSetting) == 0x000018, "Wrong size on Option_ButtonSettings_C_ShowControllerButtonSetting");
static_assert(offsetof(Option_ButtonSettings_C_ShowControllerButtonSetting, IsInGame) == 0x000000, "Member 'Option_ButtonSettings_C_ShowControllerButtonSetting::IsInGame' has a wrong offset!");
static_assert(offsetof(Option_ButtonSettings_C_ShowControllerButtonSetting, MainMenuManagerBP) == 0x000008, "Member 'Option_ButtonSettings_C_ShowControllerButtonSetting::MainMenuManagerBP' has a wrong offset!");
static_assert(offsetof(Option_ButtonSettings_C_ShowControllerButtonSetting, CallFunc_PushMenu_ReturnValue) == 0x000010, "Member 'Option_ButtonSettings_C_ShowControllerButtonSetting::CallFunc_PushMenu_ReturnValue' has a wrong offset!");

}

