#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_Resolution

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Option_Resolution.Option_Resolution_C.ExecuteUbergraph_Option_Resolution
// 0x0010 (0x0010 - 0x0000)
struct Option_Resolution_C_ExecuteUbergraph_Option_Resolution final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectBoundaryUserSettings*           CallFunc_GetProjectBoundaryUserSettings_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Option_Resolution_C_ExecuteUbergraph_Option_Resolution) == 0x000008, "Wrong alignment on Option_Resolution_C_ExecuteUbergraph_Option_Resolution");
static_assert(sizeof(Option_Resolution_C_ExecuteUbergraph_Option_Resolution) == 0x000010, "Wrong size on Option_Resolution_C_ExecuteUbergraph_Option_Resolution");
static_assert(offsetof(Option_Resolution_C_ExecuteUbergraph_Option_Resolution, EntryPoint) == 0x000000, "Member 'Option_Resolution_C_ExecuteUbergraph_Option_Resolution::EntryPoint' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_ExecuteUbergraph_Option_Resolution, K2Node_Event_bIsDependencyChanged) == 0x000004, "Member 'Option_Resolution_C_ExecuteUbergraph_Option_Resolution::K2Node_Event_bIsDependencyChanged' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_ExecuteUbergraph_Option_Resolution, CallFunc_GetProjectBoundaryUserSettings_ReturnValue) == 0x000008, "Member 'Option_Resolution_C_ExecuteUbergraph_Option_Resolution::CallFunc_GetProjectBoundaryUserSettings_ReturnValue' has a wrong offset!");

// Function Option_Resolution.Option_Resolution_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct Option_Resolution_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_Resolution_C_K2_Modify) == 0x000001, "Wrong alignment on Option_Resolution_C_K2_Modify");
static_assert(sizeof(Option_Resolution_C_K2_Modify) == 0x000001, "Wrong size on Option_Resolution_C_K2_Modify");
static_assert(offsetof(Option_Resolution_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'Option_Resolution_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

// Function Option_Resolution.Option_Resolution_C.InitResolution
// 0x0078 (0x0078 - 0x0000)
struct Option_Resolution_C_InitResolution final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      CallFunc_GetSupportedFullscreenResolutions_Resolutions; // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSupportedFullscreenResolutions_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntPointToString_ReturnValue;        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Option_Resolution_C_InitResolution) == 0x000008, "Wrong alignment on Option_Resolution_C_InitResolution");
static_assert(sizeof(Option_Resolution_C_InitResolution) == 0x000078, "Wrong size on Option_Resolution_C_InitResolution");
static_assert(offsetof(Option_Resolution_C_InitResolution, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Option_Resolution_C_InitResolution::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Option_Resolution_C_InitResolution::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Option_Resolution_C_InitResolution::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_GetPlatformName_ReturnValue) == 0x000010, "Member 'Option_Resolution_C_InitResolution::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_GetSupportedFullscreenResolutions_Resolutions) == 0x000020, "Member 'Option_Resolution_C_InitResolution::CallFunc_GetSupportedFullscreenResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_GetSupportedFullscreenResolutions_ReturnValue) == 0x000030, "Member 'Option_Resolution_C_InitResolution::CallFunc_GetSupportedFullscreenResolutions_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000031, "Member 'Option_Resolution_C_InitResolution::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_Array_Get_Item) == 0x000034, "Member 'Option_Resolution_C_InitResolution::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_Conv_IntPointToString_ReturnValue) == 0x000040, "Member 'Option_Resolution_C_InitResolution::CallFunc_Conv_IntPointToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'Option_Resolution_C_InitResolution::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'Option_Resolution_C_InitResolution::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'Option_Resolution_C_InitResolution::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_Resolution_C_InitResolution, CallFunc_Array_Add_ReturnValue) == 0x000074, "Member 'Option_Resolution_C_InitResolution::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

