#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_SuperResolutionQuality

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Option_EnumSettingBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Option_SuperResolutionQuality.Option_SuperResolutionQuality_C
// 0x0038 (0x0118 - 0x00E0)
class UOption_SuperResolutionQuality_C final : public UBP_Option_EnumSettingBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FText>                           DLSSQualityArray;                                  // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           FSRQuality;                                        // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           XESSQuality;                                       // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Option_SuperResolutionQuality(int32 EntryPoint);
	void K2_Modify(bool bIsDependencyChanged);
	void K2_GetValueTitleArray();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Option_SuperResolutionQuality_C">();
	}
	static class UOption_SuperResolutionQuality_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOption_SuperResolutionQuality_C>();
	}
};
static_assert(alignof(UOption_SuperResolutionQuality_C) == 0x000008, "Wrong alignment on UOption_SuperResolutionQuality_C");
static_assert(sizeof(UOption_SuperResolutionQuality_C) == 0x000118, "Wrong size on UOption_SuperResolutionQuality_C");
static_assert(offsetof(UOption_SuperResolutionQuality_C, UberGraphFrame) == 0x0000E0, "Member 'UOption_SuperResolutionQuality_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOption_SuperResolutionQuality_C, DLSSQualityArray) == 0x0000E8, "Member 'UOption_SuperResolutionQuality_C::DLSSQualityArray' has a wrong offset!");
static_assert(offsetof(UOption_SuperResolutionQuality_C, FSRQuality) == 0x0000F8, "Member 'UOption_SuperResolutionQuality_C::FSRQuality' has a wrong offset!");
static_assert(offsetof(UOption_SuperResolutionQuality_C, XESSQuality) == 0x000108, "Member 'UOption_SuperResolutionQuality_C::XESSQuality' has a wrong offset!");

}

