#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_VoiceChatRecordMode

#include "Basic.hpp"


namespace SDK::Params
{

// Function Option_VoiceChatRecordMode.Option_VoiceChatRecordMode_C.ExecuteUbergraph_Option_VoiceChatRecordMode
// 0x0018 (0x0018 - 0x0000)
struct Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectBoundaryUserSettings*           CallFunc_GetProjectBoundaryUserSettings_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode) == 0x000008, "Wrong alignment on Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode");
static_assert(sizeof(Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode) == 0x000018, "Wrong size on Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode");
static_assert(offsetof(Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode, EntryPoint) == 0x000000, "Member 'Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode, CallFunc_GetProjectBoundaryUserSettings_ReturnValue) == 0x000008, "Member 'Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode::CallFunc_GetProjectBoundaryUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode, K2Node_Event_bIsDependencyChanged) == 0x000010, "Member 'Option_VoiceChatRecordMode_C_ExecuteUbergraph_Option_VoiceChatRecordMode::K2Node_Event_bIsDependencyChanged' has a wrong offset!");

// Function Option_VoiceChatRecordMode.Option_VoiceChatRecordMode_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct Option_VoiceChatRecordMode_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_VoiceChatRecordMode_C_K2_Modify) == 0x000001, "Wrong alignment on Option_VoiceChatRecordMode_C_K2_Modify");
static_assert(sizeof(Option_VoiceChatRecordMode_C_K2_Modify) == 0x000001, "Wrong size on Option_VoiceChatRecordMode_C_K2_Modify");
static_assert(offsetof(Option_VoiceChatRecordMode_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'Option_VoiceChatRecordMode_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

}

