#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_AutoClimb

#include "Basic.hpp"


namespace SDK::Params
{

// Function Option_AutoClimb.Option_AutoClimb_C.ExecuteUbergraph_Option_AutoClimb
// 0x0008 (0x0008 - 0x0000)
struct Option_AutoClimb_C_ExecuteUbergraph_Option_AutoClimb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_AutoClimb_C_ExecuteUbergraph_Option_AutoClimb) == 0x000004, "Wrong alignment on Option_AutoClimb_C_ExecuteUbergraph_Option_AutoClimb");
static_assert(sizeof(Option_AutoClimb_C_ExecuteUbergraph_Option_AutoClimb) == 0x000008, "Wrong size on Option_AutoClimb_C_ExecuteUbergraph_Option_AutoClimb");
static_assert(offsetof(Option_AutoClimb_C_ExecuteUbergraph_Option_AutoClimb, EntryPoint) == 0x000000, "Member 'Option_AutoClimb_C_ExecuteUbergraph_Option_AutoClimb::EntryPoint' has a wrong offset!");
static_assert(offsetof(Option_AutoClimb_C_ExecuteUbergraph_Option_AutoClimb, K2Node_Event_bIsDependencyChanged) == 0x000004, "Member 'Option_AutoClimb_C_ExecuteUbergraph_Option_AutoClimb::K2Node_Event_bIsDependencyChanged' has a wrong offset!");

// Function Option_AutoClimb.Option_AutoClimb_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct Option_AutoClimb_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_AutoClimb_C_K2_Modify) == 0x000001, "Wrong alignment on Option_AutoClimb_C_K2_Modify");
static_assert(sizeof(Option_AutoClimb_C_K2_Modify) == 0x000001, "Wrong size on Option_AutoClimb_C_K2_Modify");
static_assert(offsetof(Option_AutoClimb_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'Option_AutoClimb_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

// Function Option_AutoClimb.Option_AutoClimb_C.SetChildrenConfigurability
// 0x0020 (0x0020 - 0x0000)
struct Option_AutoClimb_C_SetChildrenConfigurability final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSettingOption*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_AutoClimb_C_SetChildrenConfigurability) == 0x000008, "Wrong alignment on Option_AutoClimb_C_SetChildrenConfigurability");
static_assert(sizeof(Option_AutoClimb_C_SetChildrenConfigurability) == 0x000020, "Wrong size on Option_AutoClimb_C_SetChildrenConfigurability");
static_assert(offsetof(Option_AutoClimb_C_SetChildrenConfigurability, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Option_AutoClimb_C_SetChildrenConfigurability::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Option_AutoClimb_C_SetChildrenConfigurability, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Option_AutoClimb_C_SetChildrenConfigurability::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Option_AutoClimb_C_SetChildrenConfigurability, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Option_AutoClimb_C_SetChildrenConfigurability::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_AutoClimb_C_SetChildrenConfigurability, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'Option_AutoClimb_C_SetChildrenConfigurability::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_AutoClimb_C_SetChildrenConfigurability, CallFunc_Array_Get_Item) == 0x000010, "Member 'Option_AutoClimb_C_SetChildrenConfigurability::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Option_AutoClimb_C_SetChildrenConfigurability, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'Option_AutoClimb_C_SetChildrenConfigurability::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_AutoClimb_C_SetChildrenConfigurability, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'Option_AutoClimb_C_SetChildrenConfigurability::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

