#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_MotionBlur

#include "Basic.hpp"


namespace SDK::Params
{

// Function Option_MotionBlur.Option_MotionBlur_C.ExecuteUbergraph_Option_MotionBlur
// 0x0010 (0x0010 - 0x0000)
struct Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectBoundaryUserSettings*           CallFunc_GetProjectBoundaryUserSettings_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur) == 0x000008, "Wrong alignment on Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur");
static_assert(sizeof(Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur) == 0x000010, "Wrong size on Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur");
static_assert(offsetof(Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur, EntryPoint) == 0x000000, "Member 'Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur::EntryPoint' has a wrong offset!");
static_assert(offsetof(Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur, K2Node_Event_bIsDependencyChanged) == 0x000004, "Member 'Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur::K2Node_Event_bIsDependencyChanged' has a wrong offset!");
static_assert(offsetof(Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur, CallFunc_GetProjectBoundaryUserSettings_ReturnValue) == 0x000008, "Member 'Option_MotionBlur_C_ExecuteUbergraph_Option_MotionBlur::CallFunc_GetProjectBoundaryUserSettings_ReturnValue' has a wrong offset!");

// Function Option_MotionBlur.Option_MotionBlur_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct Option_MotionBlur_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_MotionBlur_C_K2_Modify) == 0x000001, "Wrong alignment on Option_MotionBlur_C_K2_Modify");
static_assert(sizeof(Option_MotionBlur_C_K2_Modify) == 0x000001, "Wrong size on Option_MotionBlur_C_K2_Modify");
static_assert(offsetof(Option_MotionBlur_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'Option_MotionBlur_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

}

