#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_SuperResolutionQuality

#include "Basic.hpp"


namespace SDK::Params
{

// Function Option_SuperResolutionQuality.Option_SuperResolutionQuality_C.ExecuteUbergraph_Option_SuperResolutionQuality
// 0x0058 (0x0058 - 0x0000)
struct Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSettingOption*                       CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Temp_text_Variable;                                // 0x0030(0x0010)(ReferenceParm)
	uint8                                         CallFunc_GetEnumOption_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_Select_Default;                             // 0x0048(0x0010)(ReferenceParm)
};
static_assert(alignof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality) == 0x000008, "Wrong alignment on Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality");
static_assert(sizeof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality) == 0x000058, "Wrong size on Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, EntryPoint) == 0x000000, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::EntryPoint' has a wrong offset!");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, Temp_name_Variable) == 0x000010, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, Temp_byte_Variable) == 0x000018, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, CallFunc_Map_Find_Value) == 0x000020, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, Temp_text_Variable) == 0x000030, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, CallFunc_GetEnumOption_ReturnValue) == 0x000040, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::CallFunc_GetEnumOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, K2Node_Event_bIsDependencyChanged) == 0x000041, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::K2Node_Event_bIsDependencyChanged' has a wrong offset!");
static_assert(offsetof(Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality, K2Node_Select_Default) == 0x000048, "Member 'Option_SuperResolutionQuality_C_ExecuteUbergraph_Option_SuperResolutionQuality::K2Node_Select_Default' has a wrong offset!");

// Function Option_SuperResolutionQuality.Option_SuperResolutionQuality_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct Option_SuperResolutionQuality_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_SuperResolutionQuality_C_K2_Modify) == 0x000001, "Wrong alignment on Option_SuperResolutionQuality_C_K2_Modify");
static_assert(sizeof(Option_SuperResolutionQuality_C_K2_Modify) == 0x000001, "Wrong size on Option_SuperResolutionQuality_C_K2_Modify");
static_assert(offsetof(Option_SuperResolutionQuality_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'Option_SuperResolutionQuality_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

}

