#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_VIbration

#include "Basic.hpp"


namespace SDK::Params
{

// Function Option_VIbration.Option_VIbration_C.ExecuteUbergraph_Option_VIbration
// 0x0008 (0x0008 - 0x0000)
struct Option_VIbration_C_ExecuteUbergraph_Option_VIbration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_VIbration_C_ExecuteUbergraph_Option_VIbration) == 0x000004, "Wrong alignment on Option_VIbration_C_ExecuteUbergraph_Option_VIbration");
static_assert(sizeof(Option_VIbration_C_ExecuteUbergraph_Option_VIbration) == 0x000008, "Wrong size on Option_VIbration_C_ExecuteUbergraph_Option_VIbration");
static_assert(offsetof(Option_VIbration_C_ExecuteUbergraph_Option_VIbration, EntryPoint) == 0x000000, "Member 'Option_VIbration_C_ExecuteUbergraph_Option_VIbration::EntryPoint' has a wrong offset!");
static_assert(offsetof(Option_VIbration_C_ExecuteUbergraph_Option_VIbration, K2Node_Event_bIsDependencyChanged) == 0x000004, "Member 'Option_VIbration_C_ExecuteUbergraph_Option_VIbration::K2Node_Event_bIsDependencyChanged' has a wrong offset!");

// Function Option_VIbration.Option_VIbration_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct Option_VIbration_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_VIbration_C_K2_Modify) == 0x000001, "Wrong alignment on Option_VIbration_C_K2_Modify");
static_assert(sizeof(Option_VIbration_C_K2_Modify) == 0x000001, "Wrong size on Option_VIbration_C_K2_Modify");
static_assert(offsetof(Option_VIbration_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'Option_VIbration_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

}

