#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_ManuallyDetachInput

#include "Basic.hpp"


namespace SDK::Params
{

// Function Option_ManuallyDetachInput.Option_ManuallyDetachInput_C.ExecuteUbergraph_Option_ManuallyDetachInput
// 0x0008 (0x0008 - 0x0000)
struct Option_ManuallyDetachInput_C_ExecuteUbergraph_Option_ManuallyDetachInput final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_ManuallyDetachInput_C_ExecuteUbergraph_Option_ManuallyDetachInput) == 0x000004, "Wrong alignment on Option_ManuallyDetachInput_C_ExecuteUbergraph_Option_ManuallyDetachInput");
static_assert(sizeof(Option_ManuallyDetachInput_C_ExecuteUbergraph_Option_ManuallyDetachInput) == 0x000008, "Wrong size on Option_ManuallyDetachInput_C_ExecuteUbergraph_Option_ManuallyDetachInput");
static_assert(offsetof(Option_ManuallyDetachInput_C_ExecuteUbergraph_Option_ManuallyDetachInput, EntryPoint) == 0x000000, "Member 'Option_ManuallyDetachInput_C_ExecuteUbergraph_Option_ManuallyDetachInput::EntryPoint' has a wrong offset!");
static_assert(offsetof(Option_ManuallyDetachInput_C_ExecuteUbergraph_Option_ManuallyDetachInput, K2Node_Event_bIsDependencyChanged) == 0x000004, "Member 'Option_ManuallyDetachInput_C_ExecuteUbergraph_Option_ManuallyDetachInput::K2Node_Event_bIsDependencyChanged' has a wrong offset!");

// Function Option_ManuallyDetachInput.Option_ManuallyDetachInput_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct Option_ManuallyDetachInput_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_ManuallyDetachInput_C_K2_Modify) == 0x000001, "Wrong alignment on Option_ManuallyDetachInput_C_K2_Modify");
static_assert(sizeof(Option_ManuallyDetachInput_C_K2_Modify) == 0x000001, "Wrong size on Option_ManuallyDetachInput_C_K2_Modify");
static_assert(offsetof(Option_ManuallyDetachInput_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'Option_ManuallyDetachInput_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

// Function Option_ManuallyDetachInput.Option_ManuallyDetachInput_C.ShouldBeConfigurable
// 0x0018 (0x0018 - 0x0000)
struct Option_ManuallyDetachInput_C_ShouldBeConfigurable final
{
public:
	bool                                          IsConfigurable;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectBoundaryUserSettings*           CallFunc_GetProjectBoundaryUserSettings_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumUserSetting_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_ManuallyDetachInput_C_ShouldBeConfigurable) == 0x000008, "Wrong alignment on Option_ManuallyDetachInput_C_ShouldBeConfigurable");
static_assert(sizeof(Option_ManuallyDetachInput_C_ShouldBeConfigurable) == 0x000018, "Wrong size on Option_ManuallyDetachInput_C_ShouldBeConfigurable");
static_assert(offsetof(Option_ManuallyDetachInput_C_ShouldBeConfigurable, IsConfigurable) == 0x000000, "Member 'Option_ManuallyDetachInput_C_ShouldBeConfigurable::IsConfigurable' has a wrong offset!");
static_assert(offsetof(Option_ManuallyDetachInput_C_ShouldBeConfigurable, CallFunc_GetProjectBoundaryUserSettings_ReturnValue) == 0x000008, "Member 'Option_ManuallyDetachInput_C_ShouldBeConfigurable::CallFunc_GetProjectBoundaryUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_ManuallyDetachInput_C_ShouldBeConfigurable, CallFunc_GetEnumUserSetting_ReturnValue) == 0x000010, "Member 'Option_ManuallyDetachInput_C_ShouldBeConfigurable::CallFunc_GetEnumUserSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_ManuallyDetachInput_C_ShouldBeConfigurable, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'Option_ManuallyDetachInput_C_ShouldBeConfigurable::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

