#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Option_SuperResolution

#include "Basic.hpp"


namespace SDK::Params
{

// Function Option_SuperResolution.Option_SuperResolution_C.ExecuteUbergraph_Option_SuperResolution
// 0x0078 (0x0078 - 0x0000)
struct Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDependencyChanged;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectBoundaryUserSettings*           CallFunc_GetProjectBoundaryUserSettings_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSettingOption*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSettingOption*                       CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBEnumSettingOption*                   K2Node_DynamicCast_AsPBEnum_Setting_Option;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_EnumOptionItem_C*                  K2Node_DynamicCast_AsUMG_Enum_Option_Item;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           CallFunc_GetValueTitleArray_ReturnValue;           // 0x0068(0x0010)(ReferenceParm)
};
static_assert(alignof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution) == 0x000008, "Wrong alignment on Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution");
static_assert(sizeof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution) == 0x000078, "Wrong size on Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, EntryPoint) == 0x000000, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::EntryPoint' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, K2Node_Event_bIsDependencyChanged) == 0x00001C, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::K2Node_Event_bIsDependencyChanged' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, CallFunc_GetProjectBoundaryUserSettings_ReturnValue) == 0x000020, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::CallFunc_GetProjectBoundaryUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, CallFunc_Array_Get_Item) == 0x000028, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, CallFunc_Map_Find_Value) == 0x000038, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, K2Node_DynamicCast_AsPBEnum_Setting_Option) == 0x000048, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::K2Node_DynamicCast_AsPBEnum_Setting_Option' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, K2Node_DynamicCast_AsUMG_Enum_Option_Item) == 0x000058, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::K2Node_DynamicCast_AsUMG_Enum_Option_Item' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution, CallFunc_GetValueTitleArray_ReturnValue) == 0x000068, "Member 'Option_SuperResolution_C_ExecuteUbergraph_Option_SuperResolution::CallFunc_GetValueTitleArray_ReturnValue' has a wrong offset!");

// Function Option_SuperResolution.Option_SuperResolution_C.K2_Modify
// 0x0001 (0x0001 - 0x0000)
struct Option_SuperResolution_C_K2_Modify final
{
public:
	bool                                          bIsDependencyChanged;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Option_SuperResolution_C_K2_Modify) == 0x000001, "Wrong alignment on Option_SuperResolution_C_K2_Modify");
static_assert(sizeof(Option_SuperResolution_C_K2_Modify) == 0x000001, "Wrong size on Option_SuperResolution_C_K2_Modify");
static_assert(offsetof(Option_SuperResolution_C_K2_Modify, bIsDependencyChanged) == 0x000000, "Member 'Option_SuperResolution_C_K2_Modify::bIsDependencyChanged' has a wrong offset!");

}

