#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PB_BurstVehicle_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicPackBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PB_BurstVehicle_BP.PB_BurstVehicle_BP_C
// 0x0020 (0x0380 - 0x0360)
class APB_BurstVehicle_BP_C final : public ABasicPackBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PB_BurstVehicle_BP_C;               // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   SimulatePhysicsBoneName;                           // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SimulatePhysicsBoneName1;                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SimulatePhysicsBoneName2;                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PB_BurstVehicle_BP(int32 EntryPoint);
	void ChangeMeshPhysics();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PB_BurstVehicle_BP_C">();
	}
	static class APB_BurstVehicle_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APB_BurstVehicle_BP_C>();
	}
};
static_assert(alignof(APB_BurstVehicle_BP_C) == 0x000008, "Wrong alignment on APB_BurstVehicle_BP_C");
static_assert(sizeof(APB_BurstVehicle_BP_C) == 0x000380, "Wrong size on APB_BurstVehicle_BP_C");
static_assert(offsetof(APB_BurstVehicle_BP_C, UberGraphFrame_PB_BurstVehicle_BP_C) == 0x000360, "Member 'APB_BurstVehicle_BP_C::UberGraphFrame_PB_BurstVehicle_BP_C' has a wrong offset!");
static_assert(offsetof(APB_BurstVehicle_BP_C, SimulatePhysicsBoneName) == 0x000368, "Member 'APB_BurstVehicle_BP_C::SimulatePhysicsBoneName' has a wrong offset!");
static_assert(offsetof(APB_BurstVehicle_BP_C, SimulatePhysicsBoneName1) == 0x000370, "Member 'APB_BurstVehicle_BP_C::SimulatePhysicsBoneName1' has a wrong offset!");
static_assert(offsetof(APB_BurstVehicle_BP_C, SimulatePhysicsBoneName2) == 0x000378, "Member 'APB_BurstVehicle_BP_C::SimulatePhysicsBoneName2' has a wrong offset!");

}

