#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBAutoCanonLauncher_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.ExecuteUbergraph_PBAutoCanonLauncher_BP
// 0x0088 (0x0088 - 0x0000)
struct PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Launcher_CrossHair_C*              K2Node_DynamicCast_AsUMG_Launcher_Cross_Hair;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Launcher_CrossHair_C*              K2Node_DynamicCast_AsUMG_Launcher_Cross_Hair_1;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP) == 0x000008, "Wrong alignment on PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP) == 0x000088, "Wrong size on PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, EntryPoint) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_GetActorForwardVector_ReturnValue) == 0x000008, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, K2Node_DynamicCast_AsUMG_Launcher_Cross_Hair) == 0x000018, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::K2Node_DynamicCast_AsUMG_Launcher_Cross_Hair' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_GetOwnerPawn_ReturnValue) == 0x000028, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_GetOwnerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_GetController_ReturnValue) == 0x000030, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, K2Node_DynamicCast_AsPlayer_Controller) == 0x000040, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_GetTimeSeconds_ReturnValue) == 0x00004C, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_IsValid_ReturnValue_3) == 0x000050, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, K2Node_DynamicCast_AsUMG_Launcher_Cross_Hair_1) == 0x000058, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::K2Node_DynamicCast_AsUMG_Launcher_Cross_Hair_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, K2Node_Event_DeltaSeconds) == 0x000064, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_GetForwardVector_ReturnValue) == 0x000068, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_Dot_VectorVector_ReturnValue) == 0x000074, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_DegAcos_ReturnValue) == 0x000078, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000080, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000084, "Member 'PBAutoCanonLauncher_BP_C_ExecuteUbergraph_PBAutoCanonLauncher_BP::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PBAutoCanonLauncher_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on PBAutoCanonLauncher_BP_C_ReceiveTick");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_ReceiveTick) == 0x000004, "Wrong size on PBAutoCanonLauncher_BP_C_ReceiveTick");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.CanonSpring
// 0x00B8 (0x00B8 - 0x0000)
struct PBAutoCanonLauncher_BP_C_CanonSpring final
{
public:
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x002C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_CanonSpring) == 0x000004, "Wrong alignment on PBAutoCanonLauncher_BP_C_CanonSpring");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_CanonSpring) == 0x0000B8, "Wrong size on PBAutoCanonLauncher_BP_C_CanonSpring");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000010, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000018, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00001C, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x00002C, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000B4, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_CanonSpring, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x0000B5, "Member 'PBAutoCanonLauncher_BP_C_CanonSpring::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.ShellEject
// 0x00B0 (0x00B0 - 0x0000)
struct PBAutoCanonLauncher_BP_C_ShellEject final
{
public:
	class UStaticMeshComponent*                   LocalShellComp;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_ShellEject) == 0x000010, "Wrong alignment on PBAutoCanonLauncher_BP_C_ShellEject");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_ShellEject) == 0x0000B0, "Wrong size on PBAutoCanonLauncher_BP_C_ShellEject");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, LocalShellComp) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::LocalShellComp' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_SetStaticMesh_ReturnValue) == 0x000008, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_RandomFloatInRange_ReturnValue) == 0x00000C, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000014, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000018, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000030, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000040, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_GetForwardVector_ReturnValue) == 0x00004C, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_GetRelativeTransform_ReturnValue) == 0x000070, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ShellEject, CallFunc_AddComponent_ReturnValue) == 0x0000A0, "Member 'PBAutoCanonLauncher_BP_C_ShellEject::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.muzzleflash
// 0x0060 (0x0060 - 0x0000)
struct PBAutoCanonLauncher_BP_C_muzzleflash final
{
public:
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_muzzleflash) == 0x000010, "Wrong alignment on PBAutoCanonLauncher_BP_C_muzzleflash");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_muzzleflash) == 0x000060, "Wrong size on PBAutoCanonLauncher_BP_C_muzzleflash");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_muzzleflash, CallFunc_GetSocketTransform_ReturnValue) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_muzzleflash::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_muzzleflash, CallFunc_BreakTransform_Location) == 0x000030, "Member 'PBAutoCanonLauncher_BP_C_muzzleflash::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_muzzleflash, CallFunc_BreakTransform_Rotation) == 0x00003C, "Member 'PBAutoCanonLauncher_BP_C_muzzleflash::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_muzzleflash, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'PBAutoCanonLauncher_BP_C_muzzleflash::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_muzzleflash, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000058, "Member 'PBAutoCanonLauncher_BP_C_muzzleflash::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.ReciolSpring
// 0x00A8 (0x00A8 - 0x0000)
struct PBAutoCanonLauncher_BP_C_ReciolSpring final
{
public:
	float                                         CallFunc_BreakVector2D_X;                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Vector2DVector2D_ReturnValue;  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_Vector2DVector2D_ReturnValue_1; // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_ReciolSpring) == 0x000004, "Wrong alignment on PBAutoCanonLauncher_BP_C_ReciolSpring");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_ReciolSpring) == 0x0000A8, "Wrong size on PBAutoCanonLauncher_BP_C_ReciolSpring");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_X) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_Y) == 0x000004, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_X_1) == 0x000008, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_Y_1) == 0x00000C, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_X_2) == 0x000014, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_Y_2) == 0x000018, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000024, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000028, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00002C, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000038, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_X_3) == 0x000040, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_Y_3) == 0x000044, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_X_4) == 0x000048, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_Y_4) == 0x00004C, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000050, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000054, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000058, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x00005C, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_MakeVector2D_ReturnValue_1) == 0x000060, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_MakeVector2D_ReturnValue_2) == 0x000068, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x000070, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_X_5) == 0x000078, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_Y_5) == 0x00007C, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_FClamp_ReturnValue) == 0x000084, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_FClamp_ReturnValue_1) == 0x000088, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_MakeVector2D_ReturnValue_3) == 0x00008C, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_X_6) == 0x000094, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_X_6' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_BreakVector2D_Y_6) == 0x000098, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_BreakVector2D_Y_6' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x00009C, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x0000A0, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_EqualEqual_Vector2DVector2D_ReturnValue) == 0x0000A4, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_EqualEqual_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_ReciolSpring, CallFunc_EqualEqual_Vector2DVector2D_ReturnValue_1) == 0x0000A5, "Member 'PBAutoCanonLauncher_BP_C_ReciolSpring::CallFunc_EqualEqual_Vector2DVector2D_ReturnValue_1' has a wrong offset!");

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.DestoryShell
// 0x0010 (0x0010 - 0x0000)
struct PBAutoCanonLauncher_BP_C_DestoryShell final
{
public:
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_DestoryShell) == 0x000008, "Wrong alignment on PBAutoCanonLauncher_BP_C_DestoryShell");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_DestoryShell) == 0x000010, "Wrong size on PBAutoCanonLauncher_BP_C_DestoryShell");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_DestoryShell, CallFunc_Array_Get_Item) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_DestoryShell::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_DestoryShell, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'PBAutoCanonLauncher_BP_C_DestoryShell::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.AddTubeForce
// 0x0018 (0x0018 - 0x0000)
struct PBAutoCanonLauncher_BP_C_AddTubeForce final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_AddTubeForce) == 0x000004, "Wrong alignment on PBAutoCanonLauncher_BP_C_AddTubeForce");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_AddTubeForce) == 0x000018, "Wrong size on PBAutoCanonLauncher_BP_C_AddTubeForce");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddTubeForce, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_AddTubeForce::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddTubeForce, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000004, "Member 'PBAutoCanonLauncher_BP_C_AddTubeForce::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddTubeForce, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'PBAutoCanonLauncher_BP_C_AddTubeForce::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddTubeForce, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'PBAutoCanonLauncher_BP_C_AddTubeForce::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddTubeForce, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000010, "Member 'PBAutoCanonLauncher_BP_C_AddTubeForce::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddTubeForce, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000014, "Member 'PBAutoCanonLauncher_BP_C_AddTubeForce::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.AddReciolForce
// 0x0068 (0x0068 - 0x0000)
struct PBAutoCanonLauncher_BP_C_AddReciolForce final
{
public:
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_AddReciolForce) == 0x000004, "Wrong alignment on PBAutoCanonLauncher_BP_C_AddReciolForce");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_AddReciolForce) == 0x000068, "Wrong size on PBAutoCanonLauncher_BP_C_AddReciolForce");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_RandomBool_ReturnValue) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_BreakVector2D_X) == 0x000004, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_SelectFloat_ReturnValue) == 0x00000C, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_RandomBool_ReturnValue_1) == 0x000010, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_RandomBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_SelectFloat_ReturnValue_1) == 0x000014, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_BreakVector2D_X_1) == 0x000018, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_BreakVector2D_Y_1) == 0x00001C, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_BreakVector2D_X_2) == 0x000020, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_BreakVector2D_Y_2) == 0x000024, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_BreakVector2D_X_3) == 0x00002C, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_BreakVector2D_Y_3) == 0x000030, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000038, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00003C, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Add_FloatFloat_ReturnValue) == 0x000040, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000044, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000048, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x00004C, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000050, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000054, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x000058, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00005C, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_AddReciolForce, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'PBAutoCanonLauncher_BP_C_AddReciolForce::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function PBAutoCanonLauncher_BP.PBAutoCanonLauncher_BP_C.SetSpring
// 0x0010 (0x0010 - 0x0000)
struct PBAutoCanonLauncher_BP_C_SetSpring final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBAutoCanonLauncher_BP_C_SetSpring) == 0x000008, "Wrong alignment on PBAutoCanonLauncher_BP_C_SetSpring");
static_assert(sizeof(PBAutoCanonLauncher_BP_C_SetSpring) == 0x000010, "Wrong size on PBAutoCanonLauncher_BP_C_SetSpring");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_SetSpring, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'PBAutoCanonLauncher_BP_C_SetSpring::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBAutoCanonLauncher_BP_C_SetSpring, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000008, "Member 'PBAutoCanonLauncher_BP_C_SetSpring::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");

}

