#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBCharacter_BP_Tank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBCharacter_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBCharacter_BP_Tank.PBCharacter_BP_Tank_C
// 0x0010 (0x25B0 - 0x25A0)
class APBCharacter_BP_Tank_C : public APBCharacter_BP_C
{
public:
	uint8                                         Pad_2594[0x4];                                     // 0x2594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PBCharacter_BP_Tank_C;              // 0x2598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         OriginalAmmoNumInClipBeforeWeaponMounted;          // 0x25A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OriginalAmmoNumBeforeWeaponMounted;                // 0x25A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBCharacter_BP_Tank(int32 EntryPoint);
	void K2_OnDeployWeaponMounted();
	void ReceiveBeginPlay();
	void K2_OnDeactivateWeaponMounted();
	void K2_OnActivateWeaponMounted();
	void K2_OnUndeployWeaponMounted();
	void SetAmmo_WeaponMounted();
	void RecoverAmmo_WeaponMounted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBCharacter_BP_Tank_C">();
	}
	static class APBCharacter_BP_Tank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBCharacter_BP_Tank_C>();
	}
};
static_assert(alignof(APBCharacter_BP_Tank_C) == 0x000010, "Wrong alignment on APBCharacter_BP_Tank_C");
static_assert(sizeof(APBCharacter_BP_Tank_C) == 0x0025B0, "Wrong size on APBCharacter_BP_Tank_C");
static_assert(offsetof(APBCharacter_BP_Tank_C, UberGraphFrame_PBCharacter_BP_Tank_C) == 0x002598, "Member 'APBCharacter_BP_Tank_C::UberGraphFrame_PBCharacter_BP_Tank_C' has a wrong offset!");
static_assert(offsetof(APBCharacter_BP_Tank_C, OriginalAmmoNumInClipBeforeWeaponMounted) == 0x0025A0, "Member 'APBCharacter_BP_Tank_C::OriginalAmmoNumInClipBeforeWeaponMounted' has a wrong offset!");
static_assert(offsetof(APBCharacter_BP_Tank_C, OriginalAmmoNumBeforeWeaponMounted) == 0x0025A4, "Member 'APBCharacter_BP_Tank_C::OriginalAmmoNumBeforeWeaponMounted' has a wrong offset!");

}

