#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBCustomManager_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBCustomManager_BP.PBCustomManager_BP_C
// 0x0030 (0x0248 - 0x0218)
class UPBCustomManager_BP_C final : public UPBCustomizeManager
{
public:
	class UUMG_WaitingTips_C*                     UMG_WaitingForServerTips;                          // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_UnlockTips_C*                      UMG_UnlockTips;                                    // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool bSuccess)> UnlockComplete_0;                                  // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           TempTimer;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                PBDisplayActorManager;                             // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowWaitingForServerTips(class UObject* Outer_0);
	void HideWaitingForServerTips();
	void ShowAskWetherUnlockItemTips(class UObject* Outer_0, const TDelegate<void(bool bYES)>& Event);
	void ShowTipsAboutCantUnlockDueToChallenge(class UObject* Outer_0, class FName InUnlockID, const TDelegate<void()>& Event);
	void BP_TryToUnlock(const TDelegate<void(bool bSuccess)>& Event, const class FName& InItemID, class FName InRoleID, class FName InWeaponID, class APlayerController* PlayerController);
	void FocusFirstWeapon(bool IsFirstWeapon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBCustomManager_BP_C">();
	}
	static class UPBCustomManager_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBCustomManager_BP_C>();
	}
};
static_assert(alignof(UPBCustomManager_BP_C) == 0x000008, "Wrong alignment on UPBCustomManager_BP_C");
static_assert(sizeof(UPBCustomManager_BP_C) == 0x000248, "Wrong size on UPBCustomManager_BP_C");
static_assert(offsetof(UPBCustomManager_BP_C, UMG_WaitingForServerTips) == 0x000218, "Member 'UPBCustomManager_BP_C::UMG_WaitingForServerTips' has a wrong offset!");
static_assert(offsetof(UPBCustomManager_BP_C, UMG_UnlockTips) == 0x000220, "Member 'UPBCustomManager_BP_C::UMG_UnlockTips' has a wrong offset!");
static_assert(offsetof(UPBCustomManager_BP_C, UnlockComplete_0) == 0x000228, "Member 'UPBCustomManager_BP_C::UnlockComplete_0' has a wrong offset!");
static_assert(offsetof(UPBCustomManager_BP_C, TempTimer) == 0x000238, "Member 'UPBCustomManager_BP_C::TempTimer' has a wrong offset!");
static_assert(offsetof(UPBCustomManager_BP_C, PBDisplayActorManager) == 0x000240, "Member 'UPBCustomManager_BP_C::PBDisplayActorManager' has a wrong offset!");

}

