#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBDeployableADS_BP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBDeployableADS_BP.PBDeployableADS_BP_C
// 0x0088 (0x0758 - 0x06D0)
class APBDeployableADS_BP_C final : public APBDeployableADS
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SphereFX;                                          // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraFX;                                         // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SphereCollison;                                    // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DefencePoint;                                      // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   redlight;                                          // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Scale_Timeline_scale_B7FE35B340EB274773FCDF955FC072E4; // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Scale_Timeline__Direction_B7FE35B340EB274773FCDF955FC072E4; // 0x0714(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_715[0x3];                                      // 0x0715(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Scale_Timeline;                                    // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleEmitter;                                   // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFXLoopTime;                                       // 0x0730(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDeployed;                                       // 0x0734(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_735[0x3];                                      // 0x0735(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InterceptionWheelRotation;                         // 0x0738(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLookAtInterception;                               // 0x0744(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InterceptionWeaponRotation;                        // 0x0748(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PBDeployableADS_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void K2_DelayDefence();
	void K2_StartDefence();
	void K2_StopDefence();
	void K2_DefenceSuccessful(const struct FVector& InDefencePoint);
	void OnCompleted_3DAEFDD447E31CFDCCA56EAB9E91978D(class FName NotifyName);
	void OnBlendOut_3DAEFDD447E31CFDCCA56EAB9E91978D(class FName NotifyName);
	void OnInterrupted_3DAEFDD447E31CFDCCA56EAB9E91978D(class FName NotifyName);
	void OnNotifyBegin_3DAEFDD447E31CFDCCA56EAB9E91978D(class FName NotifyName);
	void OnNotifyEnd_3DAEFDD447E31CFDCCA56EAB9E91978D(class FName NotifyName);
	void Scale_Timeline__UpdateFunc();
	void Scale_Timeline__FinishedFunc();
	void UserConstructionScript();
	void CalculateLookAtRotation(const struct FVector& Intercept_Location, const struct FVector& Origin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBDeployableADS_BP_C">();
	}
	static class APBDeployableADS_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBDeployableADS_BP_C>();
	}
};
static_assert(alignof(APBDeployableADS_BP_C) == 0x000008, "Wrong alignment on APBDeployableADS_BP_C");
static_assert(sizeof(APBDeployableADS_BP_C) == 0x000758, "Wrong size on APBDeployableADS_BP_C");
static_assert(offsetof(APBDeployableADS_BP_C, UberGraphFrame) == 0x0006D0, "Member 'APBDeployableADS_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, SphereFX) == 0x0006D8, "Member 'APBDeployableADS_BP_C::SphereFX' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, Box) == 0x0006E0, "Member 'APBDeployableADS_BP_C::Box' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, NiagaraFX) == 0x0006E8, "Member 'APBDeployableADS_BP_C::NiagaraFX' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, SphereCollison) == 0x0006F0, "Member 'APBDeployableADS_BP_C::SphereCollison' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, DefencePoint) == 0x0006F8, "Member 'APBDeployableADS_BP_C::DefencePoint' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, redlight) == 0x000700, "Member 'APBDeployableADS_BP_C::redlight' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, SkeletalMesh) == 0x000708, "Member 'APBDeployableADS_BP_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, Scale_Timeline_scale_B7FE35B340EB274773FCDF955FC072E4) == 0x000710, "Member 'APBDeployableADS_BP_C::Scale_Timeline_scale_B7FE35B340EB274773FCDF955FC072E4' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, Scale_Timeline__Direction_B7FE35B340EB274773FCDF955FC072E4) == 0x000714, "Member 'APBDeployableADS_BP_C::Scale_Timeline__Direction_B7FE35B340EB274773FCDF955FC072E4' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, Scale_Timeline) == 0x000718, "Member 'APBDeployableADS_BP_C::Scale_Timeline' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, NiagaraSystem) == 0x000720, "Member 'APBDeployableADS_BP_C::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, ParticleEmitter) == 0x000728, "Member 'APBDeployableADS_BP_C::ParticleEmitter' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, VFXLoopTime) == 0x000730, "Member 'APBDeployableADS_BP_C::VFXLoopTime' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, bIsDeployed) == 0x000734, "Member 'APBDeployableADS_BP_C::bIsDeployed' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, InterceptionWheelRotation) == 0x000738, "Member 'APBDeployableADS_BP_C::InterceptionWheelRotation' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, bLookAtInterception) == 0x000744, "Member 'APBDeployableADS_BP_C::bLookAtInterception' has a wrong offset!");
static_assert(offsetof(APBDeployableADS_BP_C, InterceptionWeaponRotation) == 0x000748, "Member 'APBDeployableADS_BP_C::InterceptionWeaponRotation' has a wrong offset!");

}

