#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBDeployableADS_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function PBDeployableADS_BP.PBDeployableADS_BP_C.ExecuteUbergraph_PBDeployableADS_BP
// 0x0130 (0x0130 - 0x0000)
struct PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         CallFunc_GetOwnerPlayerState_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBCamp                                       CallFunc_GetCampAttitude_ReturnValue;              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_InDefencePoint;                       // 0x00A8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInHardcoreMode_ReturnValue;             // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP) == 0x000008, "Wrong alignment on PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP");
static_assert(sizeof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP) == 0x000130, "Wrong size on PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, EntryPoint) == 0x000000, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CustomEvent_NotifyName_1) == 0x000004, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CustomEvent_NotifyName) == 0x00000C, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, Temp_name_Variable) == 0x000024, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000050, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000058, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_GetOwnerPlayerState_ReturnValue) == 0x000060, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_GetOwnerPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000068, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_DynamicCast_AsPBPlayer_State) == 0x000078, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_GetCampAttitude_ReturnValue) == 0x000081, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_GetCampAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000082, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CustomEvent_NotifyName_2) == 0x000084, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00009C, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CustomEvent_NotifyName_3) == 0x0000A0, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_Event_InDefencePoint) == 0x0000A8, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_Event_InDefencePoint' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000B8, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000C0, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000CC, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_Normal_ReturnValue) == 0x0000D8, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0000E4, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E8, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CustomEvent_NotifyName_4) == 0x0000F8, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000100, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000110, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_MakeVector_ReturnValue) == 0x000114, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000120, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_IsValid_ReturnValue_2) == 0x000129, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP, CallFunc_IsInHardcoreMode_ReturnValue) == 0x00012A, "Member 'PBDeployableADS_BP_C_ExecuteUbergraph_PBDeployableADS_BP::CallFunc_IsInHardcoreMode_ReturnValue' has a wrong offset!");

// Function PBDeployableADS_BP.PBDeployableADS_BP_C.K2_DefenceSuccessful
// 0x000C (0x000C - 0x0000)
struct PBDeployableADS_BP_C_K2_DefenceSuccessful final
{
public:
	struct FVector                                InDefencePoint;                                    // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBDeployableADS_BP_C_K2_DefenceSuccessful) == 0x000004, "Wrong alignment on PBDeployableADS_BP_C_K2_DefenceSuccessful");
static_assert(sizeof(PBDeployableADS_BP_C_K2_DefenceSuccessful) == 0x00000C, "Wrong size on PBDeployableADS_BP_C_K2_DefenceSuccessful");
static_assert(offsetof(PBDeployableADS_BP_C_K2_DefenceSuccessful, InDefencePoint) == 0x000000, "Member 'PBDeployableADS_BP_C_K2_DefenceSuccessful::InDefencePoint' has a wrong offset!");

// Function PBDeployableADS_BP.PBDeployableADS_BP_C.OnCompleted_3DAEFDD447E31CFDCCA56EAB9E91978D
// 0x0008 (0x0008 - 0x0000)
struct PBDeployableADS_BP_C_OnCompleted_3DAEFDD447E31CFDCCA56EAB9E91978D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBDeployableADS_BP_C_OnCompleted_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000004, "Wrong alignment on PBDeployableADS_BP_C_OnCompleted_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(sizeof(PBDeployableADS_BP_C_OnCompleted_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000008, "Wrong size on PBDeployableADS_BP_C_OnCompleted_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(offsetof(PBDeployableADS_BP_C_OnCompleted_3DAEFDD447E31CFDCCA56EAB9E91978D, NotifyName) == 0x000000, "Member 'PBDeployableADS_BP_C_OnCompleted_3DAEFDD447E31CFDCCA56EAB9E91978D::NotifyName' has a wrong offset!");

// Function PBDeployableADS_BP.PBDeployableADS_BP_C.OnBlendOut_3DAEFDD447E31CFDCCA56EAB9E91978D
// 0x0008 (0x0008 - 0x0000)
struct PBDeployableADS_BP_C_OnBlendOut_3DAEFDD447E31CFDCCA56EAB9E91978D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBDeployableADS_BP_C_OnBlendOut_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000004, "Wrong alignment on PBDeployableADS_BP_C_OnBlendOut_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(sizeof(PBDeployableADS_BP_C_OnBlendOut_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000008, "Wrong size on PBDeployableADS_BP_C_OnBlendOut_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(offsetof(PBDeployableADS_BP_C_OnBlendOut_3DAEFDD447E31CFDCCA56EAB9E91978D, NotifyName) == 0x000000, "Member 'PBDeployableADS_BP_C_OnBlendOut_3DAEFDD447E31CFDCCA56EAB9E91978D::NotifyName' has a wrong offset!");

// Function PBDeployableADS_BP.PBDeployableADS_BP_C.OnInterrupted_3DAEFDD447E31CFDCCA56EAB9E91978D
// 0x0008 (0x0008 - 0x0000)
struct PBDeployableADS_BP_C_OnInterrupted_3DAEFDD447E31CFDCCA56EAB9E91978D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBDeployableADS_BP_C_OnInterrupted_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000004, "Wrong alignment on PBDeployableADS_BP_C_OnInterrupted_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(sizeof(PBDeployableADS_BP_C_OnInterrupted_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000008, "Wrong size on PBDeployableADS_BP_C_OnInterrupted_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(offsetof(PBDeployableADS_BP_C_OnInterrupted_3DAEFDD447E31CFDCCA56EAB9E91978D, NotifyName) == 0x000000, "Member 'PBDeployableADS_BP_C_OnInterrupted_3DAEFDD447E31CFDCCA56EAB9E91978D::NotifyName' has a wrong offset!");

// Function PBDeployableADS_BP.PBDeployableADS_BP_C.OnNotifyBegin_3DAEFDD447E31CFDCCA56EAB9E91978D
// 0x0008 (0x0008 - 0x0000)
struct PBDeployableADS_BP_C_OnNotifyBegin_3DAEFDD447E31CFDCCA56EAB9E91978D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBDeployableADS_BP_C_OnNotifyBegin_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000004, "Wrong alignment on PBDeployableADS_BP_C_OnNotifyBegin_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(sizeof(PBDeployableADS_BP_C_OnNotifyBegin_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000008, "Wrong size on PBDeployableADS_BP_C_OnNotifyBegin_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(offsetof(PBDeployableADS_BP_C_OnNotifyBegin_3DAEFDD447E31CFDCCA56EAB9E91978D, NotifyName) == 0x000000, "Member 'PBDeployableADS_BP_C_OnNotifyBegin_3DAEFDD447E31CFDCCA56EAB9E91978D::NotifyName' has a wrong offset!");

// Function PBDeployableADS_BP.PBDeployableADS_BP_C.OnNotifyEnd_3DAEFDD447E31CFDCCA56EAB9E91978D
// 0x0008 (0x0008 - 0x0000)
struct PBDeployableADS_BP_C_OnNotifyEnd_3DAEFDD447E31CFDCCA56EAB9E91978D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBDeployableADS_BP_C_OnNotifyEnd_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000004, "Wrong alignment on PBDeployableADS_BP_C_OnNotifyEnd_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(sizeof(PBDeployableADS_BP_C_OnNotifyEnd_3DAEFDD447E31CFDCCA56EAB9E91978D) == 0x000008, "Wrong size on PBDeployableADS_BP_C_OnNotifyEnd_3DAEFDD447E31CFDCCA56EAB9E91978D");
static_assert(offsetof(PBDeployableADS_BP_C_OnNotifyEnd_3DAEFDD447E31CFDCCA56EAB9E91978D, NotifyName) == 0x000000, "Member 'PBDeployableADS_BP_C_OnNotifyEnd_3DAEFDD447E31CFDCCA56EAB9E91978D::NotifyName' has a wrong offset!");

// Function PBDeployableADS_BP.PBDeployableADS_BP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct PBDeployableADS_BP_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBDeployableADS_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on PBDeployableADS_BP_C_UserConstructionScript");
static_assert(sizeof(PBDeployableADS_BP_C_UserConstructionScript) == 0x000010, "Wrong size on PBDeployableADS_BP_C_UserConstructionScript");
static_assert(offsetof(PBDeployableADS_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'PBDeployableADS_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000004, "Member 'PBDeployableADS_BP_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");

// Function PBDeployableADS_BP.PBDeployableADS_BP_C.CalculateLookAtRotation
// 0x00C8 (0x00C8 - 0x0000)
struct PBDeployableADS_BP_C_CalculateLookAtRotation final
{
public:
	struct FVector                                Intercept_Location;                                // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Origin;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAt;                                            // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue_1;     // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBDeployableADS_BP_C_CalculateLookAtRotation) == 0x000008, "Wrong alignment on PBDeployableADS_BP_C_CalculateLookAtRotation");
static_assert(sizeof(PBDeployableADS_BP_C_CalculateLookAtRotation) == 0x0000C8, "Wrong size on PBDeployableADS_BP_C_CalculateLookAtRotation");
static_assert(offsetof(PBDeployableADS_BP_C_CalculateLookAtRotation, Intercept_Location) == 0x000000, "Member 'PBDeployableADS_BP_C_CalculateLookAtRotation::Intercept_Location' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_CalculateLookAtRotation, Origin) == 0x00000C, "Member 'PBDeployableADS_BP_C_CalculateLookAtRotation::Origin' has a wrong offset!");
static_assert(offsetof(PBDeployableADS_BP_C_CalculateLookAtRotation, LookAt) == 0x000018, "Member 'PBDeployableADS_BP_C_CalculateLookAtRotation::LookAt' has a wrong offset!");
