#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBEMPGrenadeLauncher_Auto_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBLauncher_Deploy_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBEMPGrenadeLauncher_Auto_BP.PBEMPGrenadeLauncher_Auto_BP_C
// 0x0020 (0x06B8 - 0x0698)
class APBEMPGrenadeLauncher_Auto_BP_C final : public APBLauncher_Deploy_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PBEMPGrenadeLauncher_Auto_BP_C;     // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBFireComponent_Projectile*            PBFireComponent_Projectile;                        // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OriginParent;                                      // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FireMuzzle_VFX;                                    // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP(int32 EntryPoint);
	void K2_SimuilateFire();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBEMPGrenadeLauncher_Auto_BP_C">();
	}
	static class APBEMPGrenadeLauncher_Auto_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBEMPGrenadeLauncher_Auto_BP_C>();
	}
};
static_assert(alignof(APBEMPGrenadeLauncher_Auto_BP_C) == 0x000008, "Wrong alignment on APBEMPGrenadeLauncher_Auto_BP_C");
static_assert(sizeof(APBEMPGrenadeLauncher_Auto_BP_C) == 0x0006B8, "Wrong size on APBEMPGrenadeLauncher_Auto_BP_C");
static_assert(offsetof(APBEMPGrenadeLauncher_Auto_BP_C, UberGraphFrame_PBEMPGrenadeLauncher_Auto_BP_C) == 0x000698, "Member 'APBEMPGrenadeLauncher_Auto_BP_C::UberGraphFrame_PBEMPGrenadeLauncher_Auto_BP_C' has a wrong offset!");
static_assert(offsetof(APBEMPGrenadeLauncher_Auto_BP_C, PBFireComponent_Projectile) == 0x0006A0, "Member 'APBEMPGrenadeLauncher_Auto_BP_C::PBFireComponent_Projectile' has a wrong offset!");
static_assert(offsetof(APBEMPGrenadeLauncher_Auto_BP_C, OriginParent) == 0x0006A8, "Member 'APBEMPGrenadeLauncher_Auto_BP_C::OriginParent' has a wrong offset!");
static_assert(offsetof(APBEMPGrenadeLauncher_Auto_BP_C, FireMuzzle_VFX) == 0x0006B0, "Member 'APBEMPGrenadeLauncher_Auto_BP_C::FireMuzzle_VFX' has a wrong offset!");

}

