#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBEMPGrenadeLauncher_Auto_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PBEMPGrenadeLauncher_Auto_BP.PBEMPGrenadeLauncher_Auto_BP_C.ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP
// 0x0080 (0x0080 - 0x0000)
struct PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP) == 0x000010, "Wrong alignment on PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP");
static_assert(sizeof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP) == 0x000080, "Wrong size on PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, EntryPoint) == 0x000000, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, Temp_bool_Variable) == 0x000004, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, CallFunc_GetOwnerPawn_ReturnValue) == 0x000008, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::CallFunc_GetOwnerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, CallFunc_IsLocallyControlled_ReturnValue) == 0x000010, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, K2Node_Select_Default) == 0x000018, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, CallFunc_GetSocketTransform_ReturnValue) == 0x000020, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, CallFunc_BreakTransform_Location) == 0x000050, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000078, "Member 'PBEMPGrenadeLauncher_Auto_BP_C_ExecuteUbergraph_PBEMPGrenadeLauncher_Auto_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

