#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGameStateMenu_BP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBGameStateMenu_BP.PBGameStateMenu_BP_C
// 0x0060 (0x02D0 - 0x0270)
class APBGameStateMenu_BP_C final : public APBGameState_Menu
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 ModeName;                                          // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UTexture*                               MapTexture;                                        // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           OptionName;                                        // 0x0290(0x0010)(Edit, BlueprintVisible)
	class ATutorialLevelManager_C*                TutorialLevelManager;                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackFader_C*                          FaderWidget;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              EnterTestFieldDelegate;                            // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bTestSecondWeapon;                                 // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EPBCharacterSlotType                          TestSlot;                                          // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ShootingRangeWidget_C*             ShootingRangePanel;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UBlackFader_C* CreateFaderWidget();
	void FaderWidgetShow();
	void ExitShootingRangeSettingPage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBGameStateMenu_BP_C">();
	}
	static class APBGameStateMenu_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBGameStateMenu_BP_C>();
	}
};
static_assert(alignof(APBGameStateMenu_BP_C) == 0x000008, "Wrong alignment on APBGameStateMenu_BP_C");
static_assert(sizeof(APBGameStateMenu_BP_C) == 0x0002D0, "Wrong size on APBGameStateMenu_BP_C");
static_assert(offsetof(APBGameStateMenu_BP_C, DefaultSceneRoot) == 0x000270, "Member 'APBGameStateMenu_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APBGameStateMenu_BP_C, ModeName) == 0x000278, "Member 'APBGameStateMenu_BP_C::ModeName' has a wrong offset!");
static_assert(offsetof(APBGameStateMenu_BP_C, MapTexture) == 0x000288, "Member 'APBGameStateMenu_BP_C::MapTexture' has a wrong offset!");
static_assert(offsetof(APBGameStateMenu_BP_C, OptionName) == 0x000290, "Member 'APBGameStateMenu_BP_C::OptionName' has a wrong offset!");
static_assert(offsetof(APBGameStateMenu_BP_C, TutorialLevelManager) == 0x0002A0, "Member 'APBGameStateMenu_BP_C::TutorialLevelManager' has a wrong offset!");
static_assert(offsetof(APBGameStateMenu_BP_C, FaderWidget) == 0x0002A8, "Member 'APBGameStateMenu_BP_C::FaderWidget' has a wrong offset!");
static_assert(offsetof(APBGameStateMenu_BP_C, EnterTestFieldDelegate) == 0x0002B0, "Member 'APBGameStateMenu_BP_C::EnterTestFieldDelegate' has a wrong offset!");
static_assert(offsetof(APBGameStateMenu_BP_C, bTestSecondWeapon) == 0x0002C0, "Member 'APBGameStateMenu_BP_C::bTestSecondWeapon' has a wrong offset!");
static_assert(offsetof(APBGameStateMenu_BP_C, TestSlot) == 0x0002C1, "Member 'APBGameStateMenu_BP_C::TestSlot' has a wrong offset!");
static_assert(offsetof(APBGameStateMenu_BP_C, ShootingRangePanel) == 0x0002C8, "Member 'APBGameStateMenu_BP_C::ShootingRangePanel' has a wrong offset!");

}

