#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGameStateMenu_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function PBGameStateMenu_BP.PBGameStateMenu_BP_C.CreateFaderWidget
// 0x0018 (0x0018 - 0x0000)
struct PBGameStateMenu_BP_C_CreateFaderWidget final
{
public:
	class UBlackFader_C*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackFader_C*                          CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBGameStateMenu_BP_C_CreateFaderWidget) == 0x000008, "Wrong alignment on PBGameStateMenu_BP_C_CreateFaderWidget");
static_assert(sizeof(PBGameStateMenu_BP_C_CreateFaderWidget) == 0x000018, "Wrong size on PBGameStateMenu_BP_C_CreateFaderWidget");
static_assert(offsetof(PBGameStateMenu_BP_C_CreateFaderWidget, ReturnValue) == 0x000000, "Member 'PBGameStateMenu_BP_C_CreateFaderWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameStateMenu_BP_C_CreateFaderWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'PBGameStateMenu_BP_C_CreateFaderWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameStateMenu_BP_C_CreateFaderWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'PBGameStateMenu_BP_C_CreateFaderWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function PBGameStateMenu_BP.PBGameStateMenu_BP_C.FaderWidgetShow
// 0x0010 (0x0010 - 0x0000)
struct PBGameStateMenu_BP_C_FaderWidgetShow final
{
public:
	class UBlackFader_C*                          CallFunc_CreateFaderWidget_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingAnimation_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBGameStateMenu_BP_C_FaderWidgetShow) == 0x000008, "Wrong alignment on PBGameStateMenu_BP_C_FaderWidgetShow");
static_assert(sizeof(PBGameStateMenu_BP_C_FaderWidgetShow) == 0x000010, "Wrong size on PBGameStateMenu_BP_C_FaderWidgetShow");
static_assert(offsetof(PBGameStateMenu_BP_C_FaderWidgetShow, CallFunc_CreateFaderWidget_ReturnValue) == 0x000000, "Member 'PBGameStateMenu_BP_C_FaderWidgetShow::CallFunc_CreateFaderWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameStateMenu_BP_C_FaderWidgetShow, CallFunc_IsPlayingAnimation_ReturnValue) == 0x000008, "Member 'PBGameStateMenu_BP_C_FaderWidgetShow::CallFunc_IsPlayingAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameStateMenu_BP_C_FaderWidgetShow, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'PBGameStateMenu_BP_C_FaderWidgetShow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

