#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGameEventManager_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBGameEventManager_BP.PBGameEventManager_BP_C
// 0x00D0 (0x0438 - 0x0368)
class APBGameEventManager_BP_C final : public APBGameEventManager
{
public:
	TMulticastInlineDelegate<void(class APBPlayerState* InPlayerState, bool bIsPlayer)> RescurePlayerEventDispatcher;                      // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(float Damage, const struct FDamageEvent& DamageType, class APawn* PawnInstigator, class AActor* DamageCauser, class APlayerState* ShieldPlayerState)> ShieldDamageEventDispatchers;                      // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool KillShot, bool headshot, bool ArmorShot, float Damage)> HitTargetEventDispatcher;                          // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UObject* InCapturableZone)> CapturableZoneCreateEventDispatcher;               // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class APBPlayerState* InPlayerState, class FName RealTimeChallegeID, class FName ItemId)> ServerRealCompleteDispatcher;                      // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool bIsMute, bool bHide)> UpdateMuteStateEventDispatcher;                    // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              UpdateMuteAllStateNewEventDispatcher;              // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              CapturableWillActive;                              // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Test;                                              // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(TArray<struct FVector2D>& UIScreenPosition)> RefreshCustomizeLocationEventDispatchers;          // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              RotateDisplayActorCameraEventDispatchers;          // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              InitDisplayActorCompleteEventDispatchers;          // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              RefreshWeaponCompleteEventDispatcher;              // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBGameEventManager_BP_C">();
	}
	static class APBGameEventManager_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBGameEventManager_BP_C>();
	}
};
static_assert(alignof(APBGameEventManager_BP_C) == 0x000008, "Wrong alignment on APBGameEventManager_BP_C");
static_assert(sizeof(APBGameEventManager_BP_C) == 0x000438, "Wrong size on APBGameEventManager_BP_C");
static_assert(offsetof(APBGameEventManager_BP_C, RescurePlayerEventDispatcher) == 0x000368, "Member 'APBGameEventManager_BP_C::RescurePlayerEventDispatcher' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, ShieldDamageEventDispatchers) == 0x000378, "Member 'APBGameEventManager_BP_C::ShieldDamageEventDispatchers' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, HitTargetEventDispatcher) == 0x000388, "Member 'APBGameEventManager_BP_C::HitTargetEventDispatcher' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, CapturableZoneCreateEventDispatcher) == 0x000398, "Member 'APBGameEventManager_BP_C::CapturableZoneCreateEventDispatcher' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, ServerRealCompleteDispatcher) == 0x0003A8, "Member 'APBGameEventManager_BP_C::ServerRealCompleteDispatcher' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, UpdateMuteStateEventDispatcher) == 0x0003B8, "Member 'APBGameEventManager_BP_C::UpdateMuteStateEventDispatcher' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, UpdateMuteAllStateNewEventDispatcher) == 0x0003C8, "Member 'APBGameEventManager_BP_C::UpdateMuteAllStateNewEventDispatcher' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, CapturableWillActive) == 0x0003D8, "Member 'APBGameEventManager_BP_C::CapturableWillActive' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, Test) == 0x0003E8, "Member 'APBGameEventManager_BP_C::Test' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, RefreshCustomizeLocationEventDispatchers) == 0x0003F8, "Member 'APBGameEventManager_BP_C::RefreshCustomizeLocationEventDispatchers' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, RotateDisplayActorCameraEventDispatchers) == 0x000408, "Member 'APBGameEventManager_BP_C::RotateDisplayActorCameraEventDispatchers' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, InitDisplayActorCompleteEventDispatchers) == 0x000418, "Member 'APBGameEventManager_BP_C::InitDisplayActorCompleteEventDispatchers' has a wrong offset!");
static_assert(offsetof(APBGameEventManager_BP_C, RefreshWeaponCompleteEventDispatcher) == 0x000428, "Member 'APBGameEventManager_BP_C::RefreshWeaponCompleteEventDispatcher' has a wrong offset!");

}

