#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGameMode_Tutorials

#include "Basic.hpp"


namespace SDK::Params
{

// Function PBGameMode_Tutorials.PBGameMode_Tutorials_C.CalculateMatchExperience
// 0x000C (0x000C - 0x0000)
struct PBGameMode_Tutorials_C_CalculateMatchExperience final
{
public:
	int32                                         PlayerScore;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateExperience_result;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBGameMode_Tutorials_C_CalculateMatchExperience) == 0x000004, "Wrong alignment on PBGameMode_Tutorials_C_CalculateMatchExperience");
static_assert(sizeof(PBGameMode_Tutorials_C_CalculateMatchExperience) == 0x00000C, "Wrong size on PBGameMode_Tutorials_C_CalculateMatchExperience");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateMatchExperience, PlayerScore) == 0x000000, "Member 'PBGameMode_Tutorials_C_CalculateMatchExperience::PlayerScore' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateMatchExperience, ReturnValue) == 0x000004, "Member 'PBGameMode_Tutorials_C_CalculateMatchExperience::ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateMatchExperience, CallFunc_CalculateExperience_result) == 0x000008, "Member 'PBGameMode_Tutorials_C_CalculateMatchExperience::CallFunc_CalculateExperience_result' has a wrong offset!");

// Function PBGameMode_Tutorials.PBGameMode_Tutorials_C.CalculateFunctionOne
// 0x0028 (0x0028 - 0x0000)
struct PBGameMode_Tutorials_C_CalculateFunctionOne final
{
public:
	int32                                         Score;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number1;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Number2;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number3;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TruncateFloatCeil_OutValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBGameMode_Tutorials_C_CalculateFunctionOne) == 0x000004, "Wrong alignment on PBGameMode_Tutorials_C_CalculateFunctionOne");
static_assert(sizeof(PBGameMode_Tutorials_C_CalculateFunctionOne) == 0x000028, "Wrong size on PBGameMode_Tutorials_C_CalculateFunctionOne");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, Score) == 0x000000, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::Score' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, Number1) == 0x000004, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::Number1' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, Number2) == 0x000008, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::Number2' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, Number3) == 0x00000C, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::Number3' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, Result) == 0x000010, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::Result' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, CallFunc_TruncateFloatCeil_OutValue) == 0x000020, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::CallFunc_TruncateFloatCeil_OutValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionOne, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'PBGameMode_Tutorials_C_CalculateFunctionOne::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function PBGameMode_Tutorials.PBGameMode_Tutorials_C.CalculateFunctionTwo
// 0x0028 (0x0028 - 0x0000)
struct PBGameMode_Tutorials_C_CalculateFunctionTwo final
{
public:
	int32                                         Score;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number1;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Number2;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number3;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Log_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TruncateFloatCeil_OutValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBGameMode_Tutorials_C_CalculateFunctionTwo) == 0x000004, "Wrong alignment on PBGameMode_Tutorials_C_CalculateFunctionTwo");
static_assert(sizeof(PBGameMode_Tutorials_C_CalculateFunctionTwo) == 0x000028, "Wrong size on PBGameMode_Tutorials_C_CalculateFunctionTwo");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, Score) == 0x000000, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::Score' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, Number1) == 0x000004, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::Number1' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, Number2) == 0x000008, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::Number2' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, Number3) == 0x00000C, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::Number3' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, Result) == 0x000010, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::Result' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, CallFunc_Log_ReturnValue) == 0x00001C, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::CallFunc_Log_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, CallFunc_TruncateFloatCeil_OutValue) == 0x000020, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::CallFunc_TruncateFloatCeil_OutValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateFunctionTwo, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'PBGameMode_Tutorials_C_CalculateFunctionTwo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function PBGameMode_Tutorials.PBGameMode_Tutorials_C.CalculateExperience
// 0x0024 (0x0024 - 0x0000)
struct PBGameMode_Tutorials_C_CalculateExperience final
{
public:
	int32                                         Score;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalculateFunctionTwo_Result;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateFunctionOne_Result;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateFunctionOne_Result_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateFunctionOne_Result_2;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_1;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_2;             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_3;             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_4;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBGameMode_Tutorials_C_CalculateExperience) == 0x000004, "Wrong alignment on PBGameMode_Tutorials_C_CalculateExperience");
static_assert(sizeof(PBGameMode_Tutorials_C_CalculateExperience) == 0x000024, "Wrong size on PBGameMode_Tutorials_C_CalculateExperience");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, Score) == 0x000000, "Member 'PBGameMode_Tutorials_C_CalculateExperience::Score' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, Result) == 0x000004, "Member 'PBGameMode_Tutorials_C_CalculateExperience::Result' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_CalculateFunctionTwo_Result) == 0x00000C, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_CalculateFunctionTwo_Result' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_CalculateFunctionOne_Result) == 0x000010, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_CalculateFunctionOne_Result' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_CalculateFunctionOne_Result_1) == 0x000014, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_CalculateFunctionOne_Result_1' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_CalculateFunctionOne_Result_2) == 0x000018, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_CalculateFunctionOne_Result_2' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_InRange_IntInt_ReturnValue) == 0x00001C, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_InRange_IntInt_ReturnValue_1) == 0x00001D, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_InRange_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_InRange_IntInt_ReturnValue_2) == 0x00001E, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_InRange_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_InRange_IntInt_ReturnValue_3) == 0x00001F, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_InRange_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_CalculateExperience, CallFunc_InRange_IntInt_ReturnValue_4) == 0x000020, "Member 'PBGameMode_Tutorials_C_CalculateExperience::CallFunc_InRange_IntInt_ReturnValue_4' has a wrong offset!");

// Function PBGameMode_Tutorials.PBGameMode_Tutorials_C.TruncateFloatCeil
// 0x0040 (0x0040 - 0x0000)
struct PBGameMode_Tutorials_C_TruncateFloatCeil final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FractionalDigits;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutValue;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0010(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBGameMode_Tutorials_C_TruncateFloatCeil) == 0x000008, "Wrong alignment on PBGameMode_Tutorials_C_TruncateFloatCeil");
static_assert(sizeof(PBGameMode_Tutorials_C_TruncateFloatCeil) == 0x000040, "Wrong size on PBGameMode_Tutorials_C_TruncateFloatCeil");
static_assert(offsetof(PBGameMode_Tutorials_C_TruncateFloatCeil, InValue) == 0x000000, "Member 'PBGameMode_Tutorials_C_TruncateFloatCeil::InValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_TruncateFloatCeil, FractionalDigits) == 0x000004, "Member 'PBGameMode_Tutorials_C_TruncateFloatCeil::FractionalDigits' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_TruncateFloatCeil, OutValue) == 0x000008, "Member 'PBGameMode_Tutorials_C_TruncateFloatCeil::OutValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_TruncateFloatCeil, CallFunc_Conv_FloatToText_ReturnValue) == 0x000010, "Member 'PBGameMode_Tutorials_C_TruncateFloatCeil::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_TruncateFloatCeil, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'PBGameMode_Tutorials_C_TruncateFloatCeil::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_TruncateFloatCeil, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000038, "Member 'PBGameMode_Tutorials_C_TruncateFloatCeil::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBGameMode_Tutorials_C_TruncateFloatCeil, CallFunc_FCeil_ReturnValue) == 0x00003C, "Member 'PBGameMode_Tutorials_C_TruncateFloatCeil::CallFunc_FCeil_ReturnValue' has a wrong offset!");

}

