#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGameState_Tutorials_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "Enum_GameStateLastMusicTime_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBGameState_Tutorials_BP.PBGameState_Tutorials_BP_C
// 0x0058 (0x0610 - 0x05B8)
class APBGameState_Tutorials_BP_C final : public APBGameState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TopScoreBoardWidgetClass;                          // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBTopScoreBoardWidget*                 TopScoreBoardWidget;                               // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEffect_SubWinBoard_C*                  RoundResultWidget;                                 // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCountDown_C*                           CountDownWidget;                                   // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBUserWidget*                          CurrentGameStateWidget;                            // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            SelectStartSpotsViewWidget;                        // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FinishAnimationNameInRoundResultWidget;            // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_GameStateLastMusicTime                   SoundConfig;                                       // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffect_WinBoard_C*                     MatchResultWidget;                                 // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBGameState_Tutorials_BP(int32 EntryPoint);
	void RemoveMatchResultWidgetWhenStateChanged(class FName InChangeToState);
	void RemoveCountDownWidgetWhenStateChanged(class FName InChangeToState);
	void RemoveRoundResultWidgetWhenStateChanged(class FName InChangeToState);
	void K2_StartShowingMatchResult();
	void PlaySoundAtLast90s();
	void PlaySoundAtLast60s();
	void PlaySoundAtLast30s();
	void K2_StartWaitingToJoin();
	void K2_StartMatchEnding();
	void K2_StartCountdownToStart();
	void K2_StartMatchIntro();
	void K2_StartRoleSelection();
	void K2_UpdateTeamMemberInfo();
	void ReceiveDestroyed();
	void K2_RoundHasEnded();
	void K2_RoundHasStarted();
	void ReceiveBeginPlay();
	void RemoveCurrentGameStateWidgetWhenStateChanged(class FName InChangeToState);
	void CommonInit();
	void ServerInit();
	void ClientInit();
	void CreateWidgets();
	void ToggleGameEffectWidget(bool bIsVisible);
	void ShowCountDownWidget();
	void ShowCurrentGameStateWidget();
	void Prohibit_Players_from_Joining_the_Match();
	void RemoveMatchState();

	void IsLastRound(bool* bIsLastRound) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBGameState_Tutorials_BP_C">();
	}
	static class APBGameState_Tutorials_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBGameState_Tutorials_BP_C>();
	}
};
static_assert(alignof(APBGameState_Tutorials_BP_C) == 0x000008, "Wrong alignment on APBGameState_Tutorials_BP_C");
static_assert(sizeof(APBGameState_Tutorials_BP_C) == 0x000610, "Wrong size on APBGameState_Tutorials_BP_C");
static_assert(offsetof(APBGameState_Tutorials_BP_C, UberGraphFrame) == 0x0005B8, "Member 'APBGameState_Tutorials_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, DefaultSceneRoot) == 0x0005C0, "Member 'APBGameState_Tutorials_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, TopScoreBoardWidgetClass) == 0x0005C8, "Member 'APBGameState_Tutorials_BP_C::TopScoreBoardWidgetClass' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, TopScoreBoardWidget) == 0x0005D0, "Member 'APBGameState_Tutorials_BP_C::TopScoreBoardWidget' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, RoundResultWidget) == 0x0005D8, "Member 'APBGameState_Tutorials_BP_C::RoundResultWidget' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, CountDownWidget) == 0x0005E0, "Member 'APBGameState_Tutorials_BP_C::CountDownWidget' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, CurrentGameStateWidget) == 0x0005E8, "Member 'APBGameState_Tutorials_BP_C::CurrentGameStateWidget' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, SelectStartSpotsViewWidget) == 0x0005F0, "Member 'APBGameState_Tutorials_BP_C::SelectStartSpotsViewWidget' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, FinishAnimationNameInRoundResultWidget) == 0x0005F8, "Member 'APBGameState_Tutorials_BP_C::FinishAnimationNameInRoundResultWidget' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, SoundConfig) == 0x000600, "Member 'APBGameState_Tutorials_BP_C::SoundConfig' has a wrong offset!");
static_assert(offsetof(APBGameState_Tutorials_BP_C, MatchResultWidget) == 0x000608, "Member 'APBGameState_Tutorials_BP_C::MatchResultWidget' has a wrong offset!");

}

