#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGameState_Range_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBGameState_Range_BP.PBGameState_Range_BP_C
// 0x0018 (0x0288 - 0x0270)
class APBGameState_Range_BP_C final : public APBGameState_Range
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUMG_ShootingRangeWidget_C*             ShootingRangeWidget;                               // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBGameState_Range_BP(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBGameState_Range_BP_C">();
	}
	static class APBGameState_Range_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBGameState_Range_BP_C>();
	}
};
static_assert(alignof(APBGameState_Range_BP_C) == 0x000008, "Wrong alignment on APBGameState_Range_BP_C");
static_assert(sizeof(APBGameState_Range_BP_C) == 0x000288, "Wrong size on APBGameState_Range_BP_C");
static_assert(offsetof(APBGameState_Range_BP_C, UberGraphFrame) == 0x000270, "Member 'APBGameState_Range_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBGameState_Range_BP_C, DefaultSceneRoot) == 0x000278, "Member 'APBGameState_Range_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APBGameState_Range_BP_C, ShootingRangeWidget) == 0x000280, "Member 'APBGameState_Range_BP_C::ShootingRangeWidget' has a wrong offset!");

}

