#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGrenadeLauncher_CQB_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBLauncher_Delay_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBGrenadeLauncher_CQB_BP.PBGrenadeLauncher_CQB_BP_C
// 0x0020 (0x0698 - 0x0678)
class APBGrenadeLauncher_CQB_BP_C final : public APBLauncher_Delay_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PBGrenadeLauncher_CQB_BP_C;         // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBFireComponent_Projectile*            PBFireComponent_Projectile;                        // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FireMuzzle_VFX;                                    // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Fire;                                              // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBGrenadeLauncher_CQB_BP(int32 EntryPoint);
	void K2_SimuilateFire();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBGrenadeLauncher_CQB_BP_C">();
	}
	static class APBGrenadeLauncher_CQB_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBGrenadeLauncher_CQB_BP_C>();
	}
};
static_assert(alignof(APBGrenadeLauncher_CQB_BP_C) == 0x000008, "Wrong alignment on APBGrenadeLauncher_CQB_BP_C");
static_assert(sizeof(APBGrenadeLauncher_CQB_BP_C) == 0x000698, "Wrong size on APBGrenadeLauncher_CQB_BP_C");
static_assert(offsetof(APBGrenadeLauncher_CQB_BP_C, UberGraphFrame_PBGrenadeLauncher_CQB_BP_C) == 0x000678, "Member 'APBGrenadeLauncher_CQB_BP_C::UberGraphFrame_PBGrenadeLauncher_CQB_BP_C' has a wrong offset!");
static_assert(offsetof(APBGrenadeLauncher_CQB_BP_C, PBFireComponent_Projectile) == 0x000680, "Member 'APBGrenadeLauncher_CQB_BP_C::PBFireComponent_Projectile' has a wrong offset!");
static_assert(offsetof(APBGrenadeLauncher_CQB_BP_C, FireMuzzle_VFX) == 0x000688, "Member 'APBGrenadeLauncher_CQB_BP_C::FireMuzzle_VFX' has a wrong offset!");
static_assert(offsetof(APBGrenadeLauncher_CQB_BP_C, Fire) == 0x000690, "Member 'APBGrenadeLauncher_CQB_BP_C::Fire' has a wrong offset!");

}

