#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGrenadeLauncher_Longrange_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBLauncher_Deploy_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBGrenadeLauncher_Longrange_BP.PBGrenadeLauncher_Longrange_BP_C
// 0x0020 (0x06B8 - 0x0698)
class APBGrenadeLauncher_Longrange_BP_C final : public APBLauncher_Deploy_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PBGrenadeLauncher_Longrange_BP_C;   // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBFireComponent_Projectile*            PBFireComponent_Projectile;                        // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FireMuzzle_VFX;                                    // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Fire;                                              // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBGrenadeLauncher_Longrange_BP(int32 EntryPoint);
	void K2_SimuilateFire();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBGrenadeLauncher_Longrange_BP_C">();
	}
	static class APBGrenadeLauncher_Longrange_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBGrenadeLauncher_Longrange_BP_C>();
	}
};
static_assert(alignof(APBGrenadeLauncher_Longrange_BP_C) == 0x000008, "Wrong alignment on APBGrenadeLauncher_Longrange_BP_C");
static_assert(sizeof(APBGrenadeLauncher_Longrange_BP_C) == 0x0006B8, "Wrong size on APBGrenadeLauncher_Longrange_BP_C");
static_assert(offsetof(APBGrenadeLauncher_Longrange_BP_C, UberGraphFrame_PBGrenadeLauncher_Longrange_BP_C) == 0x000698, "Member 'APBGrenadeLauncher_Longrange_BP_C::UberGraphFrame_PBGrenadeLauncher_Longrange_BP_C' has a wrong offset!");
static_assert(offsetof(APBGrenadeLauncher_Longrange_BP_C, PBFireComponent_Projectile) == 0x0006A0, "Member 'APBGrenadeLauncher_Longrange_BP_C::PBFireComponent_Projectile' has a wrong offset!");
static_assert(offsetof(APBGrenadeLauncher_Longrange_BP_C, FireMuzzle_VFX) == 0x0006A8, "Member 'APBGrenadeLauncher_Longrange_BP_C::FireMuzzle_VFX' has a wrong offset!");
static_assert(offsetof(APBGrenadeLauncher_Longrange_BP_C, Fire) == 0x0006B0, "Member 'APBGrenadeLauncher_Longrange_BP_C::Fire' has a wrong offset!");

}

