#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBLauncher_Direct_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBLauncher_Direct_BP.PBLauncher_Direct_BP_C
// 0x0048 (0x0670 - 0x0628)
class APBLauncher_Direct_BP_C final : public APBLauncher_Direct
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBProjectilePathTracer_BP_C*           ProjectilePathTracer;                              // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFireRecoil_C*                          FireRocoil;                                        // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Recoil;                                            // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Direction;                                         // 0x0644(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RightArm_DeployingCollision;                       // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LeftArm_DeployingCollision;                        // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RightArm_UndeployingCollision;                     // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LeftArm_UndeployingCollision;                      // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ProjectileClass;                                   // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBLauncher_Direct_BP(int32 EntryPoint);
	void K2_Ready();
	void K2_Standby();
	void K2_Undeploying();
	void K2_Deploying();
	void K2_OnEquip();
	void K2_Fired();
	void K2_SimuilateFire();
	void Fired();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBLauncher_Direct_BP_C">();
	}
	static class APBLauncher_Direct_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBLauncher_Direct_BP_C>();
	}
};
static_assert(alignof(APBLauncher_Direct_BP_C) == 0x000008, "Wrong alignment on APBLauncher_Direct_BP_C");
static_assert(sizeof(APBLauncher_Direct_BP_C) == 0x000670, "Wrong size on APBLauncher_Direct_BP_C");
static_assert(offsetof(APBLauncher_Direct_BP_C, UberGraphFrame) == 0x000628, "Member 'APBLauncher_Direct_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBLauncher_Direct_BP_C, ProjectilePathTracer) == 0x000630, "Member 'APBLauncher_Direct_BP_C::ProjectilePathTracer' has a wrong offset!");
static_assert(offsetof(APBLauncher_Direct_BP_C, FireRocoil) == 0x000638, "Member 'APBLauncher_Direct_BP_C::FireRocoil' has a wrong offset!");
static_assert(offsetof(APBLauncher_Direct_BP_C, Recoil) == 0x000640, "Member 'APBLauncher_Direct_BP_C::Recoil' has a wrong offset!");
static_assert(offsetof(APBLauncher_Direct_BP_C, Direction) == 0x000644, "Member 'APBLauncher_Direct_BP_C::Direction' has a wrong offset!");
static_assert(offsetof(APBLauncher_Direct_BP_C, RightArm_DeployingCollision) == 0x000648, "Member 'APBLauncher_Direct_BP_C::RightArm_DeployingCollision' has a wrong offset!");
static_assert(offsetof(APBLauncher_Direct_BP_C, LeftArm_DeployingCollision) == 0x000650, "Member 'APBLauncher_Direct_BP_C::LeftArm_DeployingCollision' has a wrong offset!");
static_assert(offsetof(APBLauncher_Direct_BP_C, RightArm_UndeployingCollision) == 0x000658, "Member 'APBLauncher_Direct_BP_C::RightArm_UndeployingCollision' has a wrong offset!");
static_assert(offsetof(APBLauncher_Direct_BP_C, LeftArm_UndeployingCollision) == 0x000660, "Member 'APBLauncher_Direct_BP_C::LeftArm_UndeployingCollision' has a wrong offset!");
static_assert(offsetof(APBLauncher_Direct_BP_C, ProjectileClass) == 0x000668, "Member 'APBLauncher_Direct_BP_C::ProjectileClass' has a wrong offset!");

}

