#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBLocalPlayer_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBLocalPlayer_BP.PBLocalPlayer_BP_C
// 0x0020 (0x04B0 - 0x0490)
class UPBLocalPlayer_BP_C final : public UPBLocalPlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCard_ConfirmPage_C*                    ConfirmPage;                                       // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Chat_InMatching_C*                 ChatWidget;                                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackFader_C*                          FaderWidget;                                       // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBLocalPlayer_BP(int32 EntryPoint);
	void CustomEvent_0();
	void K2_UpdateChatUIVisibility(ESlateVisibility Visibility);
	void K2_GoToShowRoom(float GoToShowRoomDelayTime);
	void K2_GoToRange(float GoToRangeDelayTime);
	void K2_GoToMainMenu(float GoToMainMenuDelayTime);
	void K2_MatchHasEnded();
	void K2_MatchHasStarted();
	void OnConfirmFromUI(bool bYES);
	void K2_SetConfirmPage();
	class UBlackFader_C* Get_Fader_Widget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBLocalPlayer_BP_C">();
	}
	static class UPBLocalPlayer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBLocalPlayer_BP_C>();
	}
};
static_assert(alignof(UPBLocalPlayer_BP_C) == 0x000008, "Wrong alignment on UPBLocalPlayer_BP_C");
static_assert(sizeof(UPBLocalPlayer_BP_C) == 0x0004B0, "Wrong size on UPBLocalPlayer_BP_C");
static_assert(offsetof(UPBLocalPlayer_BP_C, UberGraphFrame) == 0x000490, "Member 'UPBLocalPlayer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPBLocalPlayer_BP_C, ConfirmPage) == 0x000498, "Member 'UPBLocalPlayer_BP_C::ConfirmPage' has a wrong offset!");
static_assert(offsetof(UPBLocalPlayer_BP_C, ChatWidget) == 0x0004A0, "Member 'UPBLocalPlayer_BP_C::ChatWidget' has a wrong offset!");
static_assert(offsetof(UPBLocalPlayer_BP_C, FaderWidget) == 0x0004A8, "Member 'UPBLocalPlayer_BP_C::FaderWidget' has a wrong offset!");

}

