#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBMainMenuManager_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function PBMainMenuManager_BP.PBMainMenuManager_BP_C.GetTopPromptWidget
// 0x0010 (0x0010 - 0x0000)
struct PBMainMenuManager_BP_C_GetTopPromptWidget final
{
public:
	class UCommonActivatableWidget*               TopPrompt;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBMainMenuManager_BP_C_GetTopPromptWidget) == 0x000008, "Wrong alignment on PBMainMenuManager_BP_C_GetTopPromptWidget");
static_assert(sizeof(PBMainMenuManager_BP_C_GetTopPromptWidget) == 0x000010, "Wrong size on PBMainMenuManager_BP_C_GetTopPromptWidget");
static_assert(offsetof(PBMainMenuManager_BP_C_GetTopPromptWidget, TopPrompt) == 0x000000, "Member 'PBMainMenuManager_BP_C_GetTopPromptWidget::TopPrompt' has a wrong offset!");
static_assert(offsetof(PBMainMenuManager_BP_C_GetTopPromptWidget, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'PBMainMenuManager_BP_C_GetTopPromptWidget::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");

// Function PBMainMenuManager_BP.PBMainMenuManager_BP_C.GetTopInGameWidget
// 0x0010 (0x0010 - 0x0000)
struct PBMainMenuManager_BP_C_GetTopInGameWidget final
{
public:
	class UCommonActivatableWidget*               TopInGameMenu;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBMainMenuManager_BP_C_GetTopInGameWidget) == 0x000008, "Wrong alignment on PBMainMenuManager_BP_C_GetTopInGameWidget");
static_assert(sizeof(PBMainMenuManager_BP_C_GetTopInGameWidget) == 0x000010, "Wrong size on PBMainMenuManager_BP_C_GetTopInGameWidget");
static_assert(offsetof(PBMainMenuManager_BP_C_GetTopInGameWidget, TopInGameMenu) == 0x000000, "Member 'PBMainMenuManager_BP_C_GetTopInGameWidget::TopInGameMenu' has a wrong offset!");
static_assert(offsetof(PBMainMenuManager_BP_C_GetTopInGameWidget, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'PBMainMenuManager_BP_C_GetTopInGameWidget::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");

// Function PBMainMenuManager_BP.PBMainMenuManager_BP_C.GetTopMenuWidget
// 0x0010 (0x0010 - 0x0000)
struct PBMainMenuManager_BP_C_GetTopMenuWidget final
{
public:
	class UCommonActivatableWidget*               OutTopMenuWidget;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBMainMenuManager_BP_C_GetTopMenuWidget) == 0x000008, "Wrong alignment on PBMainMenuManager_BP_C_GetTopMenuWidget");
static_assert(sizeof(PBMainMenuManager_BP_C_GetTopMenuWidget) == 0x000010, "Wrong size on PBMainMenuManager_BP_C_GetTopMenuWidget");
static_assert(offsetof(PBMainMenuManager_BP_C_GetTopMenuWidget, OutTopMenuWidget) == 0x000000, "Member 'PBMainMenuManager_BP_C_GetTopMenuWidget::OutTopMenuWidget' has a wrong offset!");
static_assert(offsetof(PBMainMenuManager_BP_C_GetTopMenuWidget, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'PBMainMenuManager_BP_C_GetTopMenuWidget::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");

}

