#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBMedicine_BP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBMedicine_BP.PBMedicine_BP_C
// 0x0018 (0x0708 - 0x06F0)
class APBMedicine_BP_C final : public APBMedicine
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBMedicine_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void K2_StartScan();
	void MulticastSpawnEffect();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBMedicine_BP_C">();
	}
	static class APBMedicine_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBMedicine_BP_C>();
	}
};
static_assert(alignof(APBMedicine_BP_C) == 0x000008, "Wrong alignment on APBMedicine_BP_C");
static_assert(sizeof(APBMedicine_BP_C) == 0x000708, "Wrong size on APBMedicine_BP_C");
static_assert(offsetof(APBMedicine_BP_C, UberGraphFrame) == 0x0006F0, "Member 'APBMedicine_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBMedicine_BP_C, Sphere) == 0x0006F8, "Member 'APBMedicine_BP_C::Sphere' has a wrong offset!");
static_assert(offsetof(APBMedicine_BP_C, SkeletalMesh) == 0x000700, "Member 'APBMedicine_BP_C::SkeletalMesh' has a wrong offset!");

}

