#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBMotionScanActor_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBMotionScanActor_BP.PBMotionScanActor_BP_C
// 0x0090 (0x02B0 - 0x0220)
class APBMotionScanActor_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   BP_Laser_perspective_mode_HL2;                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Laser_perspective_mode_HL;                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_4_NewTrack_0_40738CDB45EE5AC43C3C13AF42767A88; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_4__Direction_40738CDB45EE5AC43C3C13AF42767A88; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_4;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_z_40B609AD4BC7522FA4BA76B78F7F374D;     // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_y_40B609AD4BC7522FA4BA76B78F7F374D;     // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_x_40B609AD4BC7522FA4BA76B78F7F374D;     // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_40B609AD4BC7522FA4BA76B78F7F374D; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_A174667248A0766648479CBCC524DE49; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_A174667248A0766648479CBCC524DE49; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              PlayScan;                                          // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              PlayDisaprear;                                     // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         Radius;                                            // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LaserColor;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBMotionScanActor_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void PlatDisaprear_Event();
	void PlayScan_Event();
	void Timeline_4__UpdateFunc();
	void Timeline_4__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void ShowOrHide(float TimeLineInput);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBMotionScanActor_BP_C">();
	}
	static class APBMotionScanActor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBMotionScanActor_BP_C>();
	}
};
static_assert(alignof(APBMotionScanActor_BP_C) == 0x000008, "Wrong alignment on APBMotionScanActor_BP_C");
static_assert(sizeof(APBMotionScanActor_BP_C) == 0x0002B0, "Wrong size on APBMotionScanActor_BP_C");
static_assert(offsetof(APBMotionScanActor_BP_C, UberGraphFrame) == 0x000220, "Member 'APBMotionScanActor_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, BP_Laser_perspective_mode_HL2) == 0x000228, "Member 'APBMotionScanActor_BP_C::BP_Laser_perspective_mode_HL2' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, BP_Laser_perspective_mode_HL) == 0x000230, "Member 'APBMotionScanActor_BP_C::BP_Laser_perspective_mode_HL' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, DefaultSceneRoot) == 0x000238, "Member 'APBMotionScanActor_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_4_NewTrack_0_40738CDB45EE5AC43C3C13AF42767A88) == 0x000240, "Member 'APBMotionScanActor_BP_C::Timeline_4_NewTrack_0_40738CDB45EE5AC43C3C13AF42767A88' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_4__Direction_40738CDB45EE5AC43C3C13AF42767A88) == 0x000244, "Member 'APBMotionScanActor_BP_C::Timeline_4__Direction_40738CDB45EE5AC43C3C13AF42767A88' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_4) == 0x000248, "Member 'APBMotionScanActor_BP_C::Timeline_4' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_2_z_40B609AD4BC7522FA4BA76B78F7F374D) == 0x000250, "Member 'APBMotionScanActor_BP_C::Timeline_2_z_40B609AD4BC7522FA4BA76B78F7F374D' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_2_y_40B609AD4BC7522FA4BA76B78F7F374D) == 0x000254, "Member 'APBMotionScanActor_BP_C::Timeline_2_y_40B609AD4BC7522FA4BA76B78F7F374D' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_2_x_40B609AD4BC7522FA4BA76B78F7F374D) == 0x000258, "Member 'APBMotionScanActor_BP_C::Timeline_2_x_40B609AD4BC7522FA4BA76B78F7F374D' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_2__Direction_40B609AD4BC7522FA4BA76B78F7F374D) == 0x00025C, "Member 'APBMotionScanActor_BP_C::Timeline_2__Direction_40B609AD4BC7522FA4BA76B78F7F374D' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_2) == 0x000260, "Member 'APBMotionScanActor_BP_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_1_NewTrack_0_A174667248A0766648479CBCC524DE49) == 0x000268, "Member 'APBMotionScanActor_BP_C::Timeline_1_NewTrack_0_A174667248A0766648479CBCC524DE49' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_1__Direction_A174667248A0766648479CBCC524DE49) == 0x00026C, "Member 'APBMotionScanActor_BP_C::Timeline_1__Direction_A174667248A0766648479CBCC524DE49' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Timeline_1) == 0x000270, "Member 'APBMotionScanActor_BP_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, PlayScan) == 0x000278, "Member 'APBMotionScanActor_BP_C::PlayScan' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, PlayDisaprear) == 0x000288, "Member 'APBMotionScanActor_BP_C::PlayDisaprear' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, Radius) == 0x000298, "Member 'APBMotionScanActor_BP_C::Radius' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, DelayTime) == 0x00029C, "Member 'APBMotionScanActor_BP_C::DelayTime' has a wrong offset!");
static_assert(offsetof(APBMotionScanActor_BP_C, LaserColor) == 0x0002A0, "Member 'APBMotionScanActor_BP_C::LaserColor' has a wrong offset!");

}

