#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBMotionSensor_BP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBMotionSensor_BP.PBMotionSensor_BP_C
// 0x0030 (0x0708 - 0x06D8)
class APBMotionSensor_BP_C final : public APBMotionSensor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   scanPoint;                                         // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   redlight;                                          // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APBMotionScanActor_BP_C*                scanLine;                                          // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBMotionSensor_BP(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void K2_StopScan();
	void K2_StartScan();
	void HasScannedEnemy(bool InBool);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBMotionSensor_BP_C">();
	}
	static class APBMotionSensor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBMotionSensor_BP_C>();
	}
};
static_assert(alignof(APBMotionSensor_BP_C) == 0x000008, "Wrong alignment on APBMotionSensor_BP_C");
static_assert(sizeof(APBMotionSensor_BP_C) == 0x000708, "Wrong size on APBMotionSensor_BP_C");
static_assert(offsetof(APBMotionSensor_BP_C, UberGraphFrame) == 0x0006D8, "Member 'APBMotionSensor_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBMotionSensor_BP_C, scanPoint) == 0x0006E0, "Member 'APBMotionSensor_BP_C::scanPoint' has a wrong offset!");
static_assert(offsetof(APBMotionSensor_BP_C, redlight) == 0x0006E8, "Member 'APBMotionSensor_BP_C::redlight' has a wrong offset!");
static_assert(offsetof(APBMotionSensor_BP_C, Sphere) == 0x0006F0, "Member 'APBMotionSensor_BP_C::Sphere' has a wrong offset!");
static_assert(offsetof(APBMotionSensor_BP_C, SkeletalMesh) == 0x0006F8, "Member 'APBMotionSensor_BP_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(APBMotionSensor_BP_C, scanLine) == 0x000700, "Member 'APBMotionSensor_BP_C::scanLine' has a wrong offset!");

}

