#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBMotionSensorLauncher_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBLauncher_Deploy_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBMotionSensorLauncher_BP.PBMotionSensorLauncher_BP_C
// 0x0018 (0x06B0 - 0x0698)
class APBMotionSensorLauncher_BP_C final : public APBLauncher_Deploy_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PBMotionSensorLauncher_BP_C;        // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FakeProjectileMesh;                                // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPBFireComponent_Projectile*            PBFireComponent_Projectile;                        // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBMotionSensorLauncher_BP(int32 EntryPoint);
	void K2_ASingleAmmoReloaded();
	void K2_SimuilateFire();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBMotionSensorLauncher_BP_C">();
	}
	static class APBMotionSensorLauncher_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBMotionSensorLauncher_BP_C>();
	}
};
static_assert(alignof(APBMotionSensorLauncher_BP_C) == 0x000008, "Wrong alignment on APBMotionSensorLauncher_BP_C");
static_assert(sizeof(APBMotionSensorLauncher_BP_C) == 0x0006B0, "Wrong size on APBMotionSensorLauncher_BP_C");
static_assert(offsetof(APBMotionSensorLauncher_BP_C, UberGraphFrame_PBMotionSensorLauncher_BP_C) == 0x000698, "Member 'APBMotionSensorLauncher_BP_C::UberGraphFrame_PBMotionSensorLauncher_BP_C' has a wrong offset!");
static_assert(offsetof(APBMotionSensorLauncher_BP_C, FakeProjectileMesh) == 0x0006A0, "Member 'APBMotionSensorLauncher_BP_C::FakeProjectileMesh' has a wrong offset!");
static_assert(offsetof(APBMotionSensorLauncher_BP_C, PBFireComponent_Projectile) == 0x0006A8, "Member 'APBMotionSensorLauncher_BP_C::PBFireComponent_Projectile' has a wrong offset!");

}

