#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBPersistentUser_BP

#include "Basic.hpp"

#include "TutorialEnum_structs.hpp"


namespace SDK::Params
{

// Function PBPersistentUser_BP.PBPersistentUser_BP_C.TutorialTargetConfirmFunction
// 0x0006 (0x0006 - 0x0000)
struct PBPersistentUser_BP_C_TutorialTargetConfirmFunction final
{
public:
	ETutorialEnum                                 NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Finish;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFinish;                                          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBPersistentUser_BP_C_TutorialTargetConfirmFunction) == 0x000001, "Wrong alignment on PBPersistentUser_BP_C_TutorialTargetConfirmFunction");
static_assert(sizeof(PBPersistentUser_BP_C_TutorialTargetConfirmFunction) == 0x000006, "Wrong size on PBPersistentUser_BP_C_TutorialTargetConfirmFunction");
static_assert(offsetof(PBPersistentUser_BP_C_TutorialTargetConfirmFunction, NewParam) == 0x000000, "Member 'PBPersistentUser_BP_C_TutorialTargetConfirmFunction::NewParam' has a wrong offset!");
static_assert(offsetof(PBPersistentUser_BP_C_TutorialTargetConfirmFunction, Finish) == 0x000001, "Member 'PBPersistentUser_BP_C_TutorialTargetConfirmFunction::Finish' has a wrong offset!");
static_assert(offsetof(PBPersistentUser_BP_C_TutorialTargetConfirmFunction, IsFinish) == 0x000002, "Member 'PBPersistentUser_BP_C_TutorialTargetConfirmFunction::IsFinish' has a wrong offset!");
static_assert(offsetof(PBPersistentUser_BP_C_TutorialTargetConfirmFunction, Temp_bool_Variable) == 0x000003, "Member 'PBPersistentUser_BP_C_TutorialTargetConfirmFunction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PBPersistentUser_BP_C_TutorialTargetConfirmFunction, CallFunc_Map_Find_Value) == 0x000004, "Member 'PBPersistentUser_BP_C_TutorialTargetConfirmFunction::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PBPersistentUser_BP_C_TutorialTargetConfirmFunction, CallFunc_Map_Find_ReturnValue) == 0x000005, "Member 'PBPersistentUser_BP_C_TutorialTargetConfirmFunction::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

