#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBPersistentUser_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TutorialEnum_structs.hpp"
#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBPersistentUser_BP.PBPersistentUser_BP_C
// 0x0128 (0x0308 - 0x01E0)
class UPBPersistentUser_BP_C final : public UPBPersistentUser
{
public:
	TMap<class FString, bool>                     AllChallenge;                                      // 0x01E0(0x0050)(Edit, BlueprintVisible, SaveGame)
	int32                                         ColorAssistType;                                   // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              UpdateColorAssistType;                             // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class FName, int32>                      RoleIDWins;                                        // 0x0248(0x0050)(Edit, BlueprintVisible, SaveGame)
	TMap<ETutorialEnum, bool>                     TutorialFinish;                                    // 0x0298(0x0050)(Edit, BlueprintVisible)
	bool                                          IsFirstTimeEnterGame;                              // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          IsForceMarkable;                                   // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x2];                                      // 0x02EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraBaseSpeed;                                   // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CameraXYSpeed;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimBaseSpeed;                                      // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AimXYSpeed;                                        // 0x02FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TutorialTargetConfirmFunction(ETutorialEnum NewParam, bool* Finish);
	void Save_Tutorial_Finish();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBPersistentUser_BP_C">();
	}
	static class UPBPersistentUser_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBPersistentUser_BP_C>();
	}
};
static_assert(alignof(UPBPersistentUser_BP_C) == 0x000008, "Wrong alignment on UPBPersistentUser_BP_C");
static_assert(sizeof(UPBPersistentUser_BP_C) == 0x000308, "Wrong size on UPBPersistentUser_BP_C");
static_assert(offsetof(UPBPersistentUser_BP_C, AllChallenge) == 0x0001E0, "Member 'UPBPersistentUser_BP_C::AllChallenge' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, ColorAssistType) == 0x000230, "Member 'UPBPersistentUser_BP_C::ColorAssistType' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, UpdateColorAssistType) == 0x000238, "Member 'UPBPersistentUser_BP_C::UpdateColorAssistType' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, RoleIDWins) == 0x000248, "Member 'UPBPersistentUser_BP_C::RoleIDWins' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, TutorialFinish) == 0x000298, "Member 'UPBPersistentUser_BP_C::TutorialFinish' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, IsFirstTimeEnterGame) == 0x0002E8, "Member 'UPBPersistentUser_BP_C::IsFirstTimeEnterGame' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, IsForceMarkable) == 0x0002E9, "Member 'UPBPersistentUser_BP_C::IsForceMarkable' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, CameraBaseSpeed) == 0x0002EC, "Member 'UPBPersistentUser_BP_C::CameraBaseSpeed' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, CameraXYSpeed) == 0x0002F0, "Member 'UPBPersistentUser_BP_C::CameraXYSpeed' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, AimBaseSpeed) == 0x0002F8, "Member 'UPBPersistentUser_BP_C::AimBaseSpeed' has a wrong offset!");
static_assert(offsetof(UPBPersistentUser_BP_C, AimXYSpeed) == 0x0002FC, "Member 'UPBPersistentUser_BP_C::AimXYSpeed' has a wrong offset!");

}

