#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBPlayerController_Menu_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBPlayerController_Menu_BP.PBPlayerController_Menu_BP_C
// 0x0018 (0x0598 - 0x0580)
class APBPlayerController_Menu_BP_C final : public APBPlayerController_Menu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBlackFader_C*                          FaderWidget;                                       // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCard_ConfirmPage_C*                    ConfirmPage;                                       // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBPlayerController_Menu_BP(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBPlayerController_Menu_BP_C">();
	}
	static class APBPlayerController_Menu_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBPlayerController_Menu_BP_C>();
	}
};
static_assert(alignof(APBPlayerController_Menu_BP_C) == 0x000008, "Wrong alignment on APBPlayerController_Menu_BP_C");
static_assert(sizeof(APBPlayerController_Menu_BP_C) == 0x000598, "Wrong size on APBPlayerController_Menu_BP_C");
static_assert(offsetof(APBPlayerController_Menu_BP_C, UberGraphFrame) == 0x000580, "Member 'APBPlayerController_Menu_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBPlayerController_Menu_BP_C, FaderWidget) == 0x000588, "Member 'APBPlayerController_Menu_BP_C::FaderWidget' has a wrong offset!");
static_assert(offsetof(APBPlayerController_Menu_BP_C, ConfirmPage) == 0x000590, "Member 'APBPlayerController_Menu_BP_C::ConfirmPage' has a wrong offset!");

}

