#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBProjectileTracerFunLabFunction_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function PBProjectileTracerFunLabFunction_BP.PBProjectileTracerFunLabFunction_BP_C.Tracer Cal Trace Path
// 0x0428 (0x0428 - 0x0000)
struct PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Divisions;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_Bounces;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Object_Type;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AActor*>                         Actors_To_Ignore;                                  // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Restitution;                                       // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Friction;                                          // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayProjectile_Movement;                           // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Location_Array;                                    // 0x0060(0x0010)(Parm, OutParm)
	struct FHitResult                             Out_Hit;                                           // 0x0070(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             Hit_Result_Structure;                              // 0x00F8(0x0088)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Bounce_Index;                                      // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Collision_Index;                                   // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Index;                                     // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Current_Velocity;                                  // 0x018C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Current_Location;                                  // 0x0198(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start_Location;                                    // 0x01A4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        LocationArray;                                     // 0x01B0(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFrictionCombineMode                          Temp_byte_Variable;                                // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EE[0x2];                                      // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0224(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue_1;               // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue_2;               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue_3;               // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue_1;               // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default_1;                           // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue_1;     // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path) == 0x000008, "Wrong alignment on PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path");
static_assert(sizeof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path) == 0x000428, "Wrong size on PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Location) == 0x000000, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Location' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Velocity) == 0x00000C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Velocity' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Divisions) == 0x000018, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Divisions' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Duration) == 0x00001C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Duration' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Max_Bounces) == 0x000020, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Max_Bounces' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Radius) == 0x000024, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Radius' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Object_Type) == 0x000028, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Object_Type' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Actors_To_Ignore) == 0x000038, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Actors_To_Ignore' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Restitution) == 0x000048, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Restitution' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Friction) == 0x00004C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Friction' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, PlayProjectile_Movement) == 0x000050, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::PlayProjectile_Movement' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, __WorldContext) == 0x000058, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::__WorldContext' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Location_Array) == 0x000060, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Location_Array' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Out_Hit) == 0x000070, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Out_Hit' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Hit_Result_Structure) == 0x0000F8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Hit_Result_Structure' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Bounce_Index) == 0x000180, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Bounce_Index' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Collision_Index) == 0x000184, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Collision_Index' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Current_Index) == 0x000188, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Current_Index' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Current_Velocity) == 0x00018C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Current_Velocity' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Current_Location) == 0x000198, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Current_Location' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Start_Location) == 0x0001A4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Start_Location' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, LocationArray) == 0x0001B0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::LocationArray' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Temp_bool_Variable) == 0x0001C0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001C4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001C8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001CC, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001D0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Add_IntInt_ReturnValue) == 0x0001D4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Greater_IntInt_ReturnValue) == 0x0001D8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Temp_int_Variable) == 0x0001DC, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001E0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001E4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Temp_byte_Variable) == 0x0001E5, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001E8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Temp_bool_Variable_1) == 0x0001EC, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Temp_bool_Variable_2) == 0x0001ED, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001F0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001F4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, K2Node_Select_Default) == 0x0001F8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0001FC, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_MakeVector_ReturnValue) == 0x000200, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00020C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Add_VectorVector_ReturnValue) == 0x000218, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000224, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x0002AC, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, Temp_bool_Variable_3) == 0x0002AD, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Not_PreBool_ReturnValue) == 0x0002AE, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BooleanAND_ReturnValue) == 0x0002AF, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_bBlockingHit) == 0x0002B0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002B1, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_Time) == 0x0002B4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_Distance) == 0x0002B8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_Location) == 0x0002BC, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_ImpactPoint) == 0x0002C8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_Normal) == 0x0002D4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_ImpactNormal) == 0x0002E0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_PhysMat) == 0x0002F0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_HitActor) == 0x0002F8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_HitComponent) == 0x000300, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_HitBoneName) == 0x000308, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_HitItem) == 0x000310, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_ElementIndex) == 0x000314, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_FaceIndex) == 0x000318, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_TraceStart) == 0x00031C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BreakHitResult_TraceEnd) == 0x000328, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Array_Add_ReturnValue) == 0x000334, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000338, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000344, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_VSize_ReturnValue) == 0x000350, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000354, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000360, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_MirrorVectorByNormal_ReturnValue) == 0x000364, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_MirrorVectorByNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_BooleanAND_ReturnValue_1) == 0x000370, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000374, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x000380, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_MakeRotFromZ_ReturnValue) == 0x00038C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, K2Node_MathExpression_ReturnValue) == 0x000398, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, K2Node_MathExpression_ReturnValue_1) == 0x00039C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, K2Node_MathExpression_ReturnValue_2) == 0x0003A0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::K2Node_MathExpression_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, K2Node_MathExpression_ReturnValue_3) == 0x0003A4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::K2Node_MathExpression_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_MakeRotFromZ_ReturnValue_1) == 0x0003A8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_MakeRotFromZ_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, K2Node_Select_Default_1) == 0x0003B4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x0003B8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, K2Node_Select_Default_2) == 0x0003C4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0003C8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, K2Node_Select_Default_3) == 0x0003D4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_MakeVector_ReturnValue_1) == 0x0003D8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Array_Add_ReturnValue_1) == 0x0003E4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0003E8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0003F4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Array_Add_ReturnValue_2) == 0x000400, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_LessLess_VectorRotator_ReturnValue_1) == 0x000404, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_LessLess_VectorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000410, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path, CallFunc_GreaterGreater_VectorRotator_ReturnValue_1) == 0x00041C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Cal_Trace_Path::CallFunc_GreaterGreater_VectorRotator_ReturnValue_1' has a wrong offset!");

// Function PBProjectileTracerFunLabFunction_BP.PBProjectileTracerFunLabFunction_BP_C.Tracer Set Particles Position
// 0x02F0 (0x02F0 - 0x0000)
struct PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position final
{
public:
	TArray<struct FVector>                        LocationsArray;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UParticleSystemComponent*>       BeamsReference;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               MarkerReference;                                   // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_Result;                                        // 0x0028(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0180(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_1;                         // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0250(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Array_Get_Item_3;                         // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position) == 0x000010, "Wrong alignment on PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position");
static_assert(sizeof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position) == 0x0002F0, "Wrong size on PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, LocationsArray) == 0x000000, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::LocationsArray' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, BeamsReference) == 0x000010, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::BeamsReference' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, MarkerReference) == 0x000020, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::MarkerReference' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, Hit_Result) == 0x000028, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::Hit_Result' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, __WorldContext) == 0x0000B0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::__WorldContext' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B9, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_Time) == 0x0000BC, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_Distance) == 0x0000C0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_Location) == 0x0000C4, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_ImpactPoint) == 0x0000D0, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_Normal) == 0x0000DC, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_ImpactNormal) == 0x0000E8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_PhysMat) == 0x0000F8, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_HitActor) == 0x000100, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_HitComponent) == 0x000108, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_HitBoneName) == 0x000110, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_HitItem) == 0x000118, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_ElementIndex) == 0x00011C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_FaceIndex) == 0x000120, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_TraceStart) == 0x000124, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_BreakHitResult_TraceEnd) == 0x000130, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_MakeRotFromZ_ReturnValue) == 0x00013C, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_MakeTransform_ReturnValue) == 0x000150, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000180, "Member 'PBProjectileTracerFunLabFunction_BP_C_Tracer_Set_Particles_Position::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
