#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBProjectilePathTracer_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FPBProjectileTracerTexStruct_BP_structs.hpp"


namespace SDK::Params
{

// Function PBProjectilePathTracer_BP.PBProjectilePathTracer_BP_C.ExecuteUbergraph_PBProjectilePathTracer_BP
// 0x0210 (0x0210 - 0x0000)
struct PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBLauncher*                            K2Node_DynamicCast_AsPBLauncher;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketRotation_ReturnValue;            // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPBProjectileTracerTexStruct_BP       K2Node_MakeStruct_FPBProjectileTracerTexStruct_BP; // 0x00D0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       CallFunc_Tracer_Spawn_Particles_Beam_Reference;    // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               CallFunc_Tracer_Spawn_Particles_Marker_Reference;  // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_Tracer_Cal_Trace_Path_Location_Array;     // 0x0158(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_Tracer_Cal_Trace_Path_Out_Hit;            // 0x0168(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_1;                         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP) == 0x000008, "Wrong alignment on PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP");
static_assert(sizeof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP) == 0x000210, "Wrong size on PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, EntryPoint) == 0x000000, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_Event_EndPlayReason) == 0x000004, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000020, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, Temp_int_Array_Index_Variable) == 0x000030, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_MakeArray_Array) == 0x000040, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_MakeArray_Array_1) == 0x000050, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_BreakVector_X) == 0x000070, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_BreakVector_Y) == 0x000074, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_BreakVector_Z) == 0x000078, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_MakeStruct_LinearColor) == 0x00007C, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_GetOwner_ReturnValue) == 0x0000A0, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_DynamicCast_AsPBLauncher) == 0x0000A8, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_DynamicCast_AsPBLauncher' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_GetSocketLocation_ReturnValue) == 0x0000B4, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_GetSocketRotation_ReturnValue) == 0x0000C0, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, K2Node_MakeStruct_FPBProjectileTracerTexStruct_BP) == 0x0000D0, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::K2Node_MakeStruct_FPBProjectileTracerTexStruct_BP' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000E0, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_GetForwardVector_ReturnValue) == 0x0000EC, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Tracer_Spawn_Particles_Beam_Reference) == 0x0000F8, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Tracer_Spawn_Particles_Beam_Reference' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Tracer_Spawn_Particles_Marker_Reference) == 0x000108, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Tracer_Spawn_Particles_Marker_Reference' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000110, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_IsValid_ReturnValue) == 0x00011C, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Add_VectorVector_ReturnValue) == 0x000120, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_IsValid_ReturnValue_1) == 0x00012C, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Array_Get_Item) == 0x000130, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_IsValid_ReturnValue_2) == 0x00013C, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Less_IntInt_ReturnValue) == 0x00013D, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000140, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000144, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000150, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Tracer_Cal_Trace_Path_Location_Array) == 0x000158, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Tracer_Cal_Trace_Path_Location_Array' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Tracer_Cal_Trace_Path_Out_Hit) == 0x000168, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Tracer_Cal_Trace_Path_Out_Hit' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_BooleanAND_ReturnValue) == 0x0001F0, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, Temp_int_Array_Index_Variable_1) == 0x0001F4, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, Temp_bool_Has_Been_Initd_Variable) == 0x0001F8, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_Array_Get_Item_1) == 0x000200, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, CallFunc_IsValid_ReturnValue_3) == 0x000208, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP, Temp_bool_IsClosed_Variable) == 0x000209, "Member 'PBProjectilePathTracer_BP_C_ExecuteUbergraph_PBProjectilePathTracer_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function PBProjectilePathTracer_BP.PBProjectilePathTracer_BP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct PBProjectilePathTracer_BP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBProjectilePathTracer_BP_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on PBProjectilePathTracer_BP_C_ReceiveEndPlay");
static_assert(sizeof(PBProjectilePathTracer_BP_C_ReceiveEndPlay) == 0x000001, "Wrong size on PBProjectilePathTracer_BP_C_ReceiveEndPlay");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'PBProjectilePathTracer_BP_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function PBProjectilePathTracer_BP.PBProjectilePathTracer_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PBProjectilePathTracer_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBProjectilePathTracer_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on PBProjectilePathTracer_BP_C_ReceiveTick");
static_assert(sizeof(PBProjectilePathTracer_BP_C_ReceiveTick) == 0x000004, "Wrong size on PBProjectilePathTracer_BP_C_ReceiveTick");
static_assert(offsetof(PBProjectilePathTracer_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PBProjectilePathTracer_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

