#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBProjectilePathTracer_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBProjectilePathTracer_BP.PBProjectilePathTracer_BP_C
// 0x0080 (0x0130 - 0x00B0)
class UPBProjectilePathTracer_BP_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         BulletVelocity;                                    // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BeamNums;                                          // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        BeamColor;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Beam_Size;                                         // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxBounces;                                        // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              FireReleased;                                      // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              FirePressed;                                       // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UParticleSystemComponent*>       BeamRefArray;                                      // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UParticleSystemComponent*               Marker_Ref;                                        // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHidden;                                          // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UParticleSystemComponent*               canDestroy;                                        // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBProjectilePathTracer_BP(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnHidden_Event();
	void FirePressed_Event();
	void FireReleased_Event();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBProjectilePathTracer_BP_C">();
	}
	static class UPBProjectilePathTracer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBProjectilePathTracer_BP_C>();
	}
};
static_assert(alignof(UPBProjectilePathTracer_BP_C) == 0x000008, "Wrong alignment on UPBProjectilePathTracer_BP_C");
static_assert(sizeof(UPBProjectilePathTracer_BP_C) == 0x000130, "Wrong size on UPBProjectilePathTracer_BP_C");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, UberGraphFrame) == 0x0000B0, "Member 'UPBProjectilePathTracer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, BulletVelocity) == 0x0000B8, "Member 'UPBProjectilePathTracer_BP_C::BulletVelocity' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, BeamNums) == 0x0000BC, "Member 'UPBProjectilePathTracer_BP_C::BeamNums' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, BeamColor) == 0x0000C0, "Member 'UPBProjectilePathTracer_BP_C::BeamColor' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, Beam_Size) == 0x0000D0, "Member 'UPBProjectilePathTracer_BP_C::Beam_Size' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, Duration) == 0x0000D4, "Member 'UPBProjectilePathTracer_BP_C::Duration' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, MaxBounces) == 0x0000D8, "Member 'UPBProjectilePathTracer_BP_C::MaxBounces' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, FireReleased) == 0x0000E0, "Member 'UPBProjectilePathTracer_BP_C::FireReleased' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, FirePressed) == 0x0000F0, "Member 'UPBProjectilePathTracer_BP_C::FirePressed' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, BeamRefArray) == 0x000100, "Member 'UPBProjectilePathTracer_BP_C::BeamRefArray' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, Marker_Ref) == 0x000110, "Member 'UPBProjectilePathTracer_BP_C::Marker_Ref' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, OnHidden) == 0x000118, "Member 'UPBProjectilePathTracer_BP_C::OnHidden' has a wrong offset!");
static_assert(offsetof(UPBProjectilePathTracer_BP_C, canDestroy) == 0x000128, "Member 'UPBProjectilePathTracer_BP_C::canDestroy' has a wrong offset!");

}

