#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBScanActor_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PBScanActor_BP.PBScanActor_BP_C.ExecuteUbergraph_PBScanActor_BP
// 0x00C0 (0x00C0 - 0x0000)
struct PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0038(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP) == 0x000004, "Wrong alignment on PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP");
static_assert(sizeof(PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP) == 0x0000C0, "Wrong size on PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP");
static_assert(offsetof(PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP, EntryPoint) == 0x000000, "Member 'PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP, K2Node_Event_EndPlayReason) == 0x000034, "Member 'PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000038, "Member 'PBScanActor_BP_C_ExecuteUbergraph_PBScanActor_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function PBScanActor_BP.PBScanActor_BP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct PBScanActor_BP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBScanActor_BP_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on PBScanActor_BP_C_ReceiveEndPlay");
static_assert(sizeof(PBScanActor_BP_C_ReceiveEndPlay) == 0x000001, "Wrong size on PBScanActor_BP_C_ReceiveEndPlay");
static_assert(offsetof(PBScanActor_BP_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'PBScanActor_BP_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function PBScanActor_BP.PBScanActor_BP_C.ShowOrHide
// 0x0040 (0x0040 - 0x0000)
struct PBScanActor_BP_C_ShowOrHide final
{
public:
	float                                         Timeline;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBLaserPerspective_BP_C*               K2Node_DynamicCast_AsPBLaser_Perspective_BP;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBLaserPerspective_BP_C*               K2Node_DynamicCast_AsPBLaser_Perspective_BP_1;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBScanActor_BP_C_ShowOrHide) == 0x000008, "Wrong alignment on PBScanActor_BP_C_ShowOrHide");
static_assert(sizeof(PBScanActor_BP_C_ShowOrHide) == 0x000040, "Wrong size on PBScanActor_BP_C_ShowOrHide");
static_assert(offsetof(PBScanActor_BP_C_ShowOrHide, Timeline) == 0x000000, "Member 'PBScanActor_BP_C_ShowOrHide::Timeline' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ShowOrHide, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'PBScanActor_BP_C_ShowOrHide::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ShowOrHide, K2Node_DynamicCast_AsPBLaser_Perspective_BP) == 0x000008, "Member 'PBScanActor_BP_C_ShowOrHide::K2Node_DynamicCast_AsPBLaser_Perspective_BP' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ShowOrHide, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PBScanActor_BP_C_ShowOrHide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ShowOrHide, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'PBScanActor_BP_C_ShowOrHide::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ShowOrHide, CallFunc_MakeVector_ReturnValue_1) == 0x000020, "Member 'PBScanActor_BP_C_ShowOrHide::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ShowOrHide, K2Node_DynamicCast_AsPBLaser_Perspective_BP_1) == 0x000030, "Member 'PBScanActor_BP_C_ShowOrHide::K2Node_DynamicCast_AsPBLaser_Perspective_BP_1' has a wrong offset!");
static_assert(offsetof(PBScanActor_BP_C_ShowOrHide, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'PBScanActor_BP_C_ShowOrHide::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

