#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBScanActor_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBScanActor_BP.PBScanActor_BP_C
// 0x00A8 (0x02C8 - 0x0220)
class APBScanActor_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   BP_Laser_perspective_mode_HL2;                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Laser_perspective_mode_HL;                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_73C3930D48C2B743FA2257A60385A99A; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_73C3930D48C2B743FA2257A60385A99A; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_z_D219E6AF44A81E95735085A9D629BFAE;     // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_y_D219E6AF44A81E95735085A9D629BFAE;     // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_x_D219E6AF44A81E95735085A9D629BFAE;     // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_3__Direction_D219E6AF44A81E95735085A9D629BFAE; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_3;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_NewTrack_0_4A81CAEC48DC7DAB68F19CA6DD700E1A; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_4A81CAEC48DC7DAB68F19CA6DD700E1A; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_z_FD3B7D5E4CE501F80878E887854A9928;     // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_y_FD3B7D5E4CE501F80878E887854A9928;     // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_x_FD3B7D5E4CE501F80878E887854A9928;     // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_FD3B7D5E4CE501F80878E887854A9928; // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              PlayScan;                                          // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              PlayDisaprear;                                     // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         Radius;                                            // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LaserColor;                                        // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBScanActor_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PlatDisaprear_Event();
	void PlayScan_Event();
	void Timeline_3__UpdateFunc();
	void Timeline_3__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void ShowOrHide(float Timeline);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBScanActor_BP_C">();
	}
	static class APBScanActor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBScanActor_BP_C>();
	}
};
static_assert(alignof(APBScanActor_BP_C) == 0x000008, "Wrong alignment on APBScanActor_BP_C");
static_assert(sizeof(APBScanActor_BP_C) == 0x0002C8, "Wrong size on APBScanActor_BP_C");
static_assert(offsetof(APBScanActor_BP_C, UberGraphFrame) == 0x000220, "Member 'APBScanActor_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, BP_Laser_perspective_mode_HL2) == 0x000228, "Member 'APBScanActor_BP_C::BP_Laser_perspective_mode_HL2' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, BP_Laser_perspective_mode_HL) == 0x000230, "Member 'APBScanActor_BP_C::BP_Laser_perspective_mode_HL' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, DefaultSceneRoot) == 0x000238, "Member 'APBScanActor_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_1_NewTrack_0_73C3930D48C2B743FA2257A60385A99A) == 0x000240, "Member 'APBScanActor_BP_C::Timeline_1_NewTrack_0_73C3930D48C2B743FA2257A60385A99A' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_1__Direction_73C3930D48C2B743FA2257A60385A99A) == 0x000244, "Member 'APBScanActor_BP_C::Timeline_1__Direction_73C3930D48C2B743FA2257A60385A99A' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_1) == 0x000248, "Member 'APBScanActor_BP_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_3_z_D219E6AF44A81E95735085A9D629BFAE) == 0x000250, "Member 'APBScanActor_BP_C::Timeline_3_z_D219E6AF44A81E95735085A9D629BFAE' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_3_y_D219E6AF44A81E95735085A9D629BFAE) == 0x000254, "Member 'APBScanActor_BP_C::Timeline_3_y_D219E6AF44A81E95735085A9D629BFAE' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_3_x_D219E6AF44A81E95735085A9D629BFAE) == 0x000258, "Member 'APBScanActor_BP_C::Timeline_3_x_D219E6AF44A81E95735085A9D629BFAE' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_3__Direction_D219E6AF44A81E95735085A9D629BFAE) == 0x00025C, "Member 'APBScanActor_BP_C::Timeline_3__Direction_D219E6AF44A81E95735085A9D629BFAE' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_3) == 0x000260, "Member 'APBScanActor_BP_C::Timeline_3' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_2_NewTrack_0_4A81CAEC48DC7DAB68F19CA6DD700E1A) == 0x000268, "Member 'APBScanActor_BP_C::Timeline_2_NewTrack_0_4A81CAEC48DC7DAB68F19CA6DD700E1A' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_2__Direction_4A81CAEC48DC7DAB68F19CA6DD700E1A) == 0x00026C, "Member 'APBScanActor_BP_C::Timeline_2__Direction_4A81CAEC48DC7DAB68F19CA6DD700E1A' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_2) == 0x000270, "Member 'APBScanActor_BP_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_0_z_FD3B7D5E4CE501F80878E887854A9928) == 0x000278, "Member 'APBScanActor_BP_C::Timeline_0_z_FD3B7D5E4CE501F80878E887854A9928' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_0_y_FD3B7D5E4CE501F80878E887854A9928) == 0x00027C, "Member 'APBScanActor_BP_C::Timeline_0_y_FD3B7D5E4CE501F80878E887854A9928' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_0_x_FD3B7D5E4CE501F80878E887854A9928) == 0x000280, "Member 'APBScanActor_BP_C::Timeline_0_x_FD3B7D5E4CE501F80878E887854A9928' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_0__Direction_FD3B7D5E4CE501F80878E887854A9928) == 0x000284, "Member 'APBScanActor_BP_C::Timeline_0__Direction_FD3B7D5E4CE501F80878E887854A9928' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Timeline_0) == 0x000288, "Member 'APBScanActor_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, PlayScan) == 0x000290, "Member 'APBScanActor_BP_C::PlayScan' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, PlayDisaprear) == 0x0002A0, "Member 'APBScanActor_BP_C::PlayDisaprear' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, Radius) == 0x0002B0, "Member 'APBScanActor_BP_C::Radius' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, DelayTime) == 0x0002B4, "Member 'APBScanActor_BP_C::DelayTime' has a wrong offset!");
static_assert(offsetof(APBScanActor_BP_C, LaserColor) == 0x0002B8, "Member 'APBScanActor_BP_C::LaserColor' has a wrong offset!");

}

