#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBSensor_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function PBSensor_BP.PBSensor_BP_C.ExecuteUbergraph_PBSensor_BP
// 0x0058 (0x0058 - 0x0000)
struct PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInHardcoreMode_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCamp                                       CallFunc_GetCampAttitude_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP) == 0x000008, "Wrong alignment on PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP");
static_assert(sizeof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP) == 0x000058, "Wrong size on PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, EntryPoint) == 0x000000, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, CallFunc_IsInHardcoreMode_ReturnValue) == 0x000004, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::CallFunc_IsInHardcoreMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, CallFunc_IsValid_ReturnValue_2) == 0x000011, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000018, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000030, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, K2Node_DynamicCast_AsPBPlayer_State) == 0x000038, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000048, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, CallFunc_GetCampAttitude_ReturnValue) == 0x000050, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::CallFunc_GetCampAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'PBSensor_BP_C_ExecuteUbergraph_PBSensor_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

