#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBSensor_BP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBSensor_BP.PBSensor_BP_C
// 0x0020 (0x0700 - 0x06E0)
class APBSensor_BP_C final : public APBSensor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Sensor_Skinned_Mesh;                               // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBSensor_BP(int32 EntryPoint);
	void SpwanEffect();
	void K2_StartScan();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBSensor_BP_C">();
	}
	static class APBSensor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBSensor_BP_C>();
	}
};
static_assert(alignof(APBSensor_BP_C) == 0x000010, "Wrong alignment on APBSensor_BP_C");
static_assert(sizeof(APBSensor_BP_C) == 0x000700, "Wrong size on APBSensor_BP_C");
static_assert(offsetof(APBSensor_BP_C, UberGraphFrame) == 0x0006E0, "Member 'APBSensor_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBSensor_BP_C, Sensor_Skinned_Mesh) == 0x0006E8, "Member 'APBSensor_BP_C::Sensor_Skinned_Mesh' has a wrong offset!");
static_assert(offsetof(APBSensor_BP_C, Sphere) == 0x0006F0, "Member 'APBSensor_BP_C::Sphere' has a wrong offset!");

}

