#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBShieldHover_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBShieldHover_BP.PBShieldHover_BP_C
// 0x0038 (0x06D0 - 0x0698)
class APBShieldHover_BP_C final : public APBShieldHover
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box4;                                              // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box3;                                              // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box2;                                              // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBShieldHover_BP(int32 EntryPoint);
	void ReceivePointDamage(float Damage, const class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
	void K2_ForceDeploy();
	void K2_DelayDeploy();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBShieldHover_BP_C">();
	}
	static class APBShieldHover_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBShieldHover_BP_C>();
	}
};
static_assert(alignof(APBShieldHover_BP_C) == 0x000008, "Wrong alignment on APBShieldHover_BP_C");
static_assert(sizeof(APBShieldHover_BP_C) == 0x0006D0, "Wrong size on APBShieldHover_BP_C");
static_assert(offsetof(APBShieldHover_BP_C, UberGraphFrame) == 0x000698, "Member 'APBShieldHover_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBShieldHover_BP_C, Box4) == 0x0006A0, "Member 'APBShieldHover_BP_C::Box4' has a wrong offset!");
static_assert(offsetof(APBShieldHover_BP_C, Box3) == 0x0006A8, "Member 'APBShieldHover_BP_C::Box3' has a wrong offset!");
static_assert(offsetof(APBShieldHover_BP_C, Box2) == 0x0006B0, "Member 'APBShieldHover_BP_C::Box2' has a wrong offset!");
static_assert(offsetof(APBShieldHover_BP_C, Box1) == 0x0006B8, "Member 'APBShieldHover_BP_C::Box1' has a wrong offset!");
static_assert(offsetof(APBShieldHover_BP_C, Box) == 0x0006C0, "Member 'APBShieldHover_BP_C::Box' has a wrong offset!");
static_assert(offsetof(APBShieldHover_BP_C, SkeletalMesh) == 0x0006C8, "Member 'APBShieldHover_BP_C::SkeletalMesh' has a wrong offset!");

}

