#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBSnapshorGrenade_BP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PBSnapshorGrenade_BP.PBSnapshorGrenade_BP_C.ExecuteUbergraph_PBSnapshorGrenade_BP
// 0x0110 (0x0110 - 0x0000)
struct PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Impact;                               // 0x0024(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPBCamp                                       CallFunc_GetCampAttitude_ReturnValue;              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBScanActor_BP_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBScanActor_BP_C*                      CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP) == 0x000010, "Wrong alignment on PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP");
static_assert(sizeof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP) == 0x000110, "Wrong size on PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, EntryPoint) == 0x000000, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, K2Node_DynamicCast_AsPBPlayer_State) == 0x000018, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, K2Node_Event_Impact) == 0x000024, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::K2Node_Event_Impact' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_GetCampAttitude_ReturnValue) == 0x0000AC, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_GetCampAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, K2Node_SwitchEnum_CmpSuccess) == 0x0000AD, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000F8, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000100, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000108, "Member 'PBSnapshorGrenade_BP_C_ExecuteUbergraph_PBSnapshorGrenade_BP::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

// Function PBSnapshorGrenade_BP.PBSnapshorGrenade_BP_C.K2_Explode
// 0x0088 (0x0088 - 0x0000)
struct PBSnapshorGrenade_BP_C_K2_Explode final
{
public:
	struct FHitResult                             Impact;                                            // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PBSnapshorGrenade_BP_C_K2_Explode) == 0x000004, "Wrong alignment on PBSnapshorGrenade_BP_C_K2_Explode");
static_assert(sizeof(PBSnapshorGrenade_BP_C_K2_Explode) == 0x000088, "Wrong size on PBSnapshorGrenade_BP_C_K2_Explode");
static_assert(offsetof(PBSnapshorGrenade_BP_C_K2_Explode, Impact) == 0x000000, "Member 'PBSnapshorGrenade_BP_C_K2_Explode::Impact' has a wrong offset!");

}

