#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBSoundManager_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function PBSoundManager_BP.PBSoundManager_BP_C.PlayInteractiveMusic
// 0x0068 (0x0068 - 0x0000)
struct PBSoundManager_BP_C_PlayInteractiveMusic final
{
public:
	class APlayerController*                      Player_Controller;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMusicStartTime_Music_Start_Time;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMusicStartTime_Music_Start_Time_1;     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USoundWave* PlayingSoundWave, float PlaybackPercent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USoundWave* PlayingSoundWave, float PlaybackPercent)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(PBSoundManager_BP_C_PlayInteractiveMusic) == 0x000008, "Wrong alignment on PBSoundManager_BP_C_PlayInteractiveMusic");
static_assert(sizeof(PBSoundManager_BP_C_PlayInteractiveMusic) == 0x000068, "Wrong size on PBSoundManager_BP_C_PlayInteractiveMusic");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, Player_Controller) == 0x000000, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::Player_Controller' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, Sound) == 0x000008, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::Sound' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000018, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000020, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000028, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000030, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_SetMusicStartTime_Music_Start_Time) == 0x000038, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_SetMusicStartTime_Music_Start_Time' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_SetMusicStartTime_Music_Start_Time_1) == 0x00003C, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_SetMusicStartTime_Music_Start_Time_1' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_IsValid_ReturnValue_2) == 0x000054, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, CallFunc_IsValid_ReturnValue_3) == 0x000055, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PlayInteractiveMusic, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'PBSoundManager_BP_C_PlayInteractiveMusic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function PBSoundManager_BP.PBSoundManager_BP_C.PrintCurrentPlayingMusicInfo
// 0x0010 (0x0010 - 0x0000)
struct PBSoundManager_BP_C_PrintCurrentPlayingMusicInfo final
{
public:
	const class USoundWave*                       PlayingSoundWave;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackPercent;                                   // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBSoundManager_BP_C_PrintCurrentPlayingMusicInfo) == 0x000008, "Wrong alignment on PBSoundManager_BP_C_PrintCurrentPlayingMusicInfo");
static_assert(sizeof(PBSoundManager_BP_C_PrintCurrentPlayingMusicInfo) == 0x000010, "Wrong size on PBSoundManager_BP_C_PrintCurrentPlayingMusicInfo");
static_assert(offsetof(PBSoundManager_BP_C_PrintCurrentPlayingMusicInfo, PlayingSoundWave) == 0x000000, "Member 'PBSoundManager_BP_C_PrintCurrentPlayingMusicInfo::PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_PrintCurrentPlayingMusicInfo, PlaybackPercent) == 0x000008, "Member 'PBSoundManager_BP_C_PrintCurrentPlayingMusicInfo::PlaybackPercent' has a wrong offset!");

// Function PBSoundManager_BP.PBSoundManager_BP_C.StopInteractiveMusic
// 0x0002 (0x0002 - 0x0000)
struct PBSoundManager_BP_C_StopInteractiveMusic final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBSoundManager_BP_C_StopInteractiveMusic) == 0x000001, "Wrong alignment on PBSoundManager_BP_C_StopInteractiveMusic");
static_assert(sizeof(PBSoundManager_BP_C_StopInteractiveMusic) == 0x000002, "Wrong size on PBSoundManager_BP_C_StopInteractiveMusic");
static_assert(offsetof(PBSoundManager_BP_C_StopInteractiveMusic, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PBSoundManager_BP_C_StopInteractiveMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_StopInteractiveMusic, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'PBSoundManager_BP_C_StopInteractiveMusic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function PBSoundManager_BP.PBSoundManager_BP_C.SetMusicStartTime
// 0x0010 (0x0010 - 0x0000)
struct PBSoundManager_BP_C_SetMusicStartTime final
{
public:
	float                                         Music_Start_Time;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBSoundManager_BP_C_SetMusicStartTime) == 0x000004, "Wrong alignment on PBSoundManager_BP_C_SetMusicStartTime");
static_assert(sizeof(PBSoundManager_BP_C_SetMusicStartTime) == 0x000010, "Wrong size on PBSoundManager_BP_C_SetMusicStartTime");
static_assert(offsetof(PBSoundManager_BP_C_SetMusicStartTime, Music_Start_Time) == 0x000000, "Member 'PBSoundManager_BP_C_SetMusicStartTime::Music_Start_Time' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_SetMusicStartTime, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'PBSoundManager_BP_C_SetMusicStartTime::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_SetMusicStartTime, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'PBSoundManager_BP_C_SetMusicStartTime::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBSoundManager_BP_C_SetMusicStartTime, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'PBSoundManager_BP_C_SetMusicStartTime::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

}

