#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBTrapGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PBTrapGrenade.PBTrapGrenade_C.ExecuteUbergraph_PBTrapGrenade
// 0x0168 (0x0168 - 0x0000)
struct PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInHardcoreMode_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Impact;                               // 0x0008(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00D0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade) == 0x000008, "Wrong alignment on PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade");
static_assert(sizeof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade) == 0x000168, "Wrong size on PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, EntryPoint) == 0x000000, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, CallFunc_IsInHardcoreMode_ReturnValue) == 0x000004, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::CallFunc_IsInHardcoreMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, K2Node_Event_Impact) == 0x000008, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::K2Node_Event_Impact' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, K2Node_Event_MyComp) == 0x000090, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, K2Node_Event_Other) == 0x000098, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, K2Node_Event_OtherComp) == 0x0000A0, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, K2Node_Event_bSelfMoved) == 0x0000A8, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, K2Node_Event_HitLocation) == 0x0000AC, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, K2Node_Event_HitNormal) == 0x0000B8, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, K2Node_Event_NormalImpulse) == 0x0000C4, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, K2Node_Event_Hit) == 0x0000D0, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000158, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000164, "Member 'PBTrapGrenade_C_ExecuteUbergraph_PBTrapGrenade::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function PBTrapGrenade.PBTrapGrenade_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct PBTrapGrenade_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PBTrapGrenade_C_ReceiveHit) == 0x000008, "Wrong alignment on PBTrapGrenade_C_ReceiveHit");
static_assert(sizeof(PBTrapGrenade_C_ReceiveHit) == 0x0000C8, "Wrong size on PBTrapGrenade_C_ReceiveHit");
static_assert(offsetof(PBTrapGrenade_C_ReceiveHit, MyComp) == 0x000000, "Member 'PBTrapGrenade_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ReceiveHit, Other) == 0x000008, "Member 'PBTrapGrenade_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ReceiveHit, OtherComp) == 0x000010, "Member 'PBTrapGrenade_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'PBTrapGrenade_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'PBTrapGrenade_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ReceiveHit, HitNormal) == 0x000028, "Member 'PBTrapGrenade_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'PBTrapGrenade_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(PBTrapGrenade_C_ReceiveHit, Hit) == 0x000040, "Member 'PBTrapGrenade_C_ReceiveHit::Hit' has a wrong offset!");

// Function PBTrapGrenade.PBTrapGrenade_C.K2_Explode
// 0x0088 (0x0088 - 0x0000)
struct PBTrapGrenade_C_K2_Explode final
{
public:
	struct FHitResult                             Impact;                                            // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PBTrapGrenade_C_K2_Explode) == 0x000004, "Wrong alignment on PBTrapGrenade_C_K2_Explode");
static_assert(sizeof(PBTrapGrenade_C_K2_Explode) == 0x000088, "Wrong size on PBTrapGrenade_C_K2_Explode");
static_assert(offsetof(PBTrapGrenade_C_K2_Explode, Impact) == 0x000000, "Member 'PBTrapGrenade_C_K2_Explode::Impact' has a wrong offset!");

}

