#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDW_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PDW_ABP.PDW_ABP_C.ExecuteUbergraph_PDW_ABP
// 0x0004 (0x0004 - 0x0000)
struct PDW_ABP_C_ExecuteUbergraph_PDW_ABP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PDW_ABP_C_ExecuteUbergraph_PDW_ABP) == 0x000004, "Wrong alignment on PDW_ABP_C_ExecuteUbergraph_PDW_ABP");
static_assert(sizeof(PDW_ABP_C_ExecuteUbergraph_PDW_ABP) == 0x000004, "Wrong size on PDW_ABP_C_ExecuteUbergraph_PDW_ABP");
static_assert(offsetof(PDW_ABP_C_ExecuteUbergraph_PDW_ABP, EntryPoint) == 0x000000, "Member 'PDW_ABP_C_ExecuteUbergraph_PDW_ABP::EntryPoint' has a wrong offset!");

// Function PDW_ABP.PDW_ABP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PDW_ABP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PDW_ABP_C_AnimGraph) == 0x000008, "Wrong alignment on PDW_ABP_C_AnimGraph");
static_assert(sizeof(PDW_ABP_C_AnimGraph) == 0x000010, "Wrong size on PDW_ABP_C_AnimGraph");
static_assert(offsetof(PDW_ABP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PDW_ABP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

