#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerController_BP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerController_BP.PlayerController_BP_C
// 0x01A8 (0x0B30 - 0x0988)
class APlayerController_BP_C : public APBPlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0988(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChatComponent_C*                       ChatComponent;                                     // 0x0990(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPBUserWidget*                          BattleMatchInfor;                                  // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFinalBattleBoard_V2_C*                 FinalBattleBoard;                                  // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CloseWideget;                                      // 0x09A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              CanWarmUp;                                         // 0x09B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              StartWaitingToJoin;                                // 0x09C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPBMainMenuWidget*                      CSTMWidget;                                        // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBUserWidget*                          WinnerWidget;                                      // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWaitToStart;                                      // 0x09E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWarmupEnd;                                        // 0x09E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9EA[0x2];                                      // 0x09EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Pitch;                                             // 0x09EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x09F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnRate;                                          // 0x09F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookUpRate;                                        // 0x09F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9FC[0x4];                                      // 0x09FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 WinnerWidgetClass;                                 // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LeaveTestWeaponTimerHandle;                        // 0x0A08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ShowGameBoardWidget;                               // 0x0A10(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USetMouseInput_C*                       SetMouseSensitivity;                               // 0x0A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MouseY;                                            // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MouseX;                                            // 0x0A2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DyingCamraTurnRate;                                // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DyingCameraLookUpRate;                             // 0x0A34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DyingCameraPitch;                                  // 0x0A38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DyingCameraYaw;                                    // 0x0A3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            FOVMap;                                            // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInTutorialLevel;                                 // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A49[0x7];                                      // 0x0A49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ShowTrainingWidget;                                // 0x0A50(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool Open)>     ShowOptionDispatcher;                              // 0x0A60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UObject*                                HackEnterTutorial;                                 // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InputF;                                            // 0x0A78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InputU;                                            // 0x0A7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InputR;                                            // 0x0A80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasInput;                                          // 0x0A84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A85[0x3];                                      // 0x0A85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalInputVector;                                  // 0x0A88(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInDyingCameraState;                             // 0x0A94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A95[0x3];                                      // 0x0A95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           BP_KillCamFocusTemp;                               // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCard_ConfirmPage_C*                    ConfirmPage;                                       // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool bConfirm)> TempCaller;                                        // 0x0AA8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UInGameOption_V2_C*                     InGameOption;                                      // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInGameOption_V2_C*                     RoleSelectionWidget;                               // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        modifyCam;                                         // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        modifyCamShadow;                                   // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        modifyCamAO;                                       // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        modifyCamReflect;                                  // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Tool;                                              // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                VoxelWorld;                                        // 0x0AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VoxelSize;                                         // 0x0AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VoxelLocationOffset;                               // 0x0AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              BlueprintInteract;                                 // 0x0B00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class APBCharacter_BP_C*                      OriginalPlayerCharacter;                           // 0x0B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AFreeCamChar_C*                         FreeCamChar;                                       // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFocusingControlledCharacter;                      // 0x0B20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B21[0x3];                                      // 0x0B21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PendingVoxelWorldCount;                            // 0x0B24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CameraActorDeath_C*                 DeathCameraActor;                                  // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerController_BP(int32 EntryPoint);
	void K2_ControllerClientRestart();
	void K2_PawnReplicatedPossess();
	void K2_ExitObserverState();
	void K2_EnterObserverState();
	void OnScoreBoardDestruct();
	void K2_OpenExitTutorial();
	void K2_OpenFeedback();
	void ServerVoxelReady();
	void K2_PawnReplicatedUnpossess();
	void K2_StopThirdPersonCamera();
	void K2_StartThirdPersonCamera();
	void ShowCursor();
	void NotifyUpdateKillCamera(float DeltaTime);
	void NotifyStopKillCamera();
	void NotifyStartKillCamera();
	void K2_OpenInGameSelectRole();
	void K2_CloseScoreBoardForKeyboard();
	void K2_PressedScoreBoard();
	void K2_NotifyBeKilled(class APBPlayerState* KillerPlayerState, class APBPlayerState* KilledPlayerState, const class UDamageType* KillerDamageType, EPBHitZone HitZone, const class UTextureRenderTarget2D* InInstigatorRenderTarget, const class UTexture* InInstigatorTexture);
	void OnConfirmFromUI(bool bYES);
	void NotifyOnConfirmMessageShowUp(const struct FConfirmInfo& Info);
	void Event_CheckInput();
	void ServerHaveNoInput();
	void ServerHasInput();
	void ReceiveTick(float DeltaSeconds);
	void ShowSelectWeaponWidget();
	void K2_OnMVPShowStop_Experiment();
	void NotifyEndWarmUp();
	void NotifyStartWarmUp();
	void CloseOptionMenu();
	void NotifyFirstTimeInGame();
	void NotifyClearInterface();
	void EventOnMatchEnd();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void K2_OnMVPShowStart_Experiment();
	void K2_EndRoleSelection();
	void K2_BeginRoleSelection();
	void SwitchPossessMultiCast(bool ToFreeCam);
	void LaunchFreeCam();
	void InpActEvt_ReduceCameraSensitivity_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_ReduceCameraSensitivity_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_ReduceAimSensitivity_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_ReduceAimSensitivity_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_AddAimSensitivity_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_AddAimSensitivity_K2Node_InputActionEvent_5(const struct FKey& Key);
	void InpActEvt_AddCameraSensitivity_K2Node_InputActionEvent_6(const struct FKey& Key);
	void InpActEvt_AddCameraSensitivity_K2Node_InputActionEvent_7(const struct FKey& Key);
	void InpActEvt_U_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Y_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void GetBattleMatchBoardClass(class UClass** battleBoardClass);
	void ReadyLeaveTestWeapon();
	void BackMainWidget();
	void Reset_View_Target_on_Close_Option();
	void IsGamePlaying(bool* Display);
	void SetADSSensitivityDown();
	void SetADSSensitivityUp();
	void SetCameraSensitivityDown();
	void SetCameraSensitivityUp();
	void BP_NotifyStartKillCamera();
	void BP_NotifyStopKillCamera();
	void BP_NotifyStartThreePersonCamera();
	void BP_NotifyStopThreePersonCamera();
	void BP_UpdateKillCamera(float DeltaTime);
	void BP_UpdateThreePersonCamera(float DeltaTime);
	void CanShowFader();
	void LeaveTutorialLevel();
	void Show_Scoreboard(bool NewShow);
	void DisableOutlineWithFocuseCharacter();
	void EnableOutlineWithFocuesCharacter();
	void SetInputValue();
	void ShowDisplayMap();
	void BlockedUserInGAME();
	void HandleConfirmLeaveGAME(bool Condition);
	void IsShowGameOption(bool* Result);
	void GetKillCameraTargetPoint(struct FVector* TargetPoint);
	void HandleVoxel(bool Subtractive, const struct FVector& position, const struct FVector& Normal, float Brush_Size);
	void GetVoxelBallBuildSpec(float HowFarInfront, float HowBig, struct FVector* Location, struct FVector* Direction, float* Size);
	void PossessOn();
	void StartControlledPawnThridPersonCamera();
	void StopControlledPawnThirdPersonCamera();
	void UpdateControlledPawnThirdPersonCamera();
	void ClearScreenFX();
	void SendVoxelEditHistory(class UObject* InVoxelWorld, TArray<struct FFVoxelEditHistory>& PendingEdit);
	void CheckVoxelReady();
	void VoxelReady();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerController_BP_C">();
	}
	static class APlayerController_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerController_BP_C>();
	}
};
static_assert(alignof(APlayerController_BP_C) == 0x000008, "Wrong alignment on APlayerController_BP_C");
static_assert(sizeof(APlayerController_BP_C) == 0x000B30, "Wrong size on APlayerController_BP_C");
static_assert(offsetof(APlayerController_BP_C, UberGraphFrame) == 0x000988, "Member 'APlayerController_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, ChatComponent) == 0x000990, "Member 'APlayerController_BP_C::ChatComponent' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, BattleMatchInfor) == 0x000998, "Member 'APlayerController_BP_C::BattleMatchInfor' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, FinalBattleBoard) == 0x0009A0, "Member 'APlayerController_BP_C::FinalBattleBoard' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, CloseWideget) == 0x0009A8, "Member 'APlayerController_BP_C::CloseWideget' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, CanWarmUp) == 0x0009B8, "Member 'APlayerController_BP_C::CanWarmUp' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, StartWaitingToJoin) == 0x0009C8, "Member 'APlayerController_BP_C::StartWaitingToJoin' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, CSTMWidget) == 0x0009D8, "Member 'APlayerController_BP_C::CSTMWidget' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, WinnerWidget) == 0x0009E0, "Member 'APlayerController_BP_C::WinnerWidget' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, bWaitToStart) == 0x0009E8, "Member 'APlayerController_BP_C::bWaitToStart' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, bWarmupEnd) == 0x0009E9, "Member 'APlayerController_BP_C::bWarmupEnd' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, Pitch) == 0x0009EC, "Member 'APlayerController_BP_C::Pitch' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, Yaw) == 0x0009F0, "Member 'APlayerController_BP_C::Yaw' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, TurnRate) == 0x0009F4, "Member 'APlayerController_BP_C::TurnRate' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, LookUpRate) == 0x0009F8, "Member 'APlayerController_BP_C::LookUpRate' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, WinnerWidgetClass) == 0x000A00, "Member 'APlayerController_BP_C::WinnerWidgetClass' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, LeaveTestWeaponTimerHandle) == 0x000A08, "Member 'APlayerController_BP_C::LeaveTestWeaponTimerHandle' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, ShowGameBoardWidget) == 0x000A10, "Member 'APlayerController_BP_C::ShowGameBoardWidget' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, SetMouseSensitivity) == 0x000A20, "Member 'APlayerController_BP_C::SetMouseSensitivity' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, MouseY) == 0x000A28, "Member 'APlayerController_BP_C::MouseY' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, MouseX) == 0x000A2C, "Member 'APlayerController_BP_C::MouseX' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, DyingCamraTurnRate) == 0x000A30, "Member 'APlayerController_BP_C::DyingCamraTurnRate' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, DyingCameraLookUpRate) == 0x000A34, "Member 'APlayerController_BP_C::DyingCameraLookUpRate' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, DyingCameraPitch) == 0x000A38, "Member 'APlayerController_BP_C::DyingCameraPitch' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, DyingCameraYaw) == 0x000A3C, "Member 'APlayerController_BP_C::DyingCameraYaw' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, FOVMap) == 0x000A40, "Member 'APlayerController_BP_C::FOVMap' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, IsInTutorialLevel) == 0x000A48, "Member 'APlayerController_BP_C::IsInTutorialLevel' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, ShowTrainingWidget) == 0x000A50, "Member 'APlayerController_BP_C::ShowTrainingWidget' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, ShowOptionDispatcher) == 0x000A60, "Member 'APlayerController_BP_C::ShowOptionDispatcher' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, HackEnterTutorial) == 0x000A70, "Member 'APlayerController_BP_C::HackEnterTutorial' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, InputF) == 0x000A78, "Member 'APlayerController_BP_C::InputF' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, InputU) == 0x000A7C, "Member 'APlayerController_BP_C::InputU' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, InputR) == 0x000A80, "Member 'APlayerController_BP_C::InputR' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, HasInput) == 0x000A84, "Member 'APlayerController_BP_C::HasInput' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, LocalInputVector) == 0x000A88, "Member 'APlayerController_BP_C::LocalInputVector' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, bIsInDyingCameraState) == 0x000A94, "Member 'APlayerController_BP_C::bIsInDyingCameraState' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, BP_KillCamFocusTemp) == 0x000A98, "Member 'APlayerController_BP_C::BP_KillCamFocusTemp' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, ConfirmPage) == 0x000AA0, "Member 'APlayerController_BP_C::ConfirmPage' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, TempCaller) == 0x000AA8, "Member 'APlayerController_BP_C::TempCaller' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, InGameOption) == 0x000AB8, "Member 'APlayerController_BP_C::InGameOption' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, RoleSelectionWidget) == 0x000AC0, "Member 'APlayerController_BP_C::RoleSelectionWidget' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, modifyCam) == 0x000AC8, "Member 'APlayerController_BP_C::modifyCam' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, modifyCamShadow) == 0x000AD0, "Member 'APlayerController_BP_C::modifyCamShadow' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, modifyCamAO) == 0x000AD8, "Member 'APlayerController_BP_C::modifyCamAO' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, modifyCamReflect) == 0x000AE0, "Member 'APlayerController_BP_C::modifyCamReflect' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, Tool) == 0x000AE8, "Member 'APlayerController_BP_C::Tool' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, VoxelWorld) == 0x000AF0, "Member 'APlayerController_BP_C::VoxelWorld' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, VoxelSize) == 0x000AF8, "Member 'APlayerController_BP_C::VoxelSize' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, VoxelLocationOffset) == 0x000AFC, "Member 'APlayerController_BP_C::VoxelLocationOffset' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, BlueprintInteract) == 0x000B00, "Member 'APlayerController_BP_C::BlueprintInteract' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, OriginalPlayerCharacter) == 0x000B10, "Member 'APlayerController_BP_C::OriginalPlayerCharacter' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, FreeCamChar) == 0x000B18, "Member 'APlayerController_BP_C::FreeCamChar' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, bFocusingControlledCharacter) == 0x000B20, "Member 'APlayerController_BP_C::bFocusingControlledCharacter' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, PendingVoxelWorldCount) == 0x000B24, "Member 'APlayerController_BP_C::PendingVoxelWorldCount' has a wrong offset!");
static_assert(offsetof(APlayerController_BP_C, DeathCameraActor) == 0x000B28, "Member 'APlayerController_BP_C::DeathCameraActor' has a wrong offset!");

}

