#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerHUD_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function PlayerHUD_BP.PlayerHUD_BP_C.ExecuteUbergraph_PlayerHUD_BP
// 0x0138 (0x0138 - 0x0000)
struct PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_InGameUI_HitTargetFeedbackFork_C*  CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_MatchMessage_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_VoiceMessageTips_C*                CallFunc_Create_ReturnValue_2;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_Event_KillerPlayerState_1;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_Event_KilledPlayerState;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBHitZone                                    K2Node_Event_HitZone;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTextureRenderTarget2D*           K2Node_Event_InInstigatorRenderTarget;             // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UTexture*                         K2Node_Event_InInstigatorTexture;                  // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerState*                         K2Node_Event_KillerPlayerState;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnter;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUD_QuickRespawnTips_C*                CallFunc_Create_ReturnValue_3;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWaitingToRestartProgress_C*            CallFunc_Create_ReturnValue_4;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUD_HitDown_C*                         CallFunc_Create_ReturnValue_5;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_KillerInfo_C*                      CallFunc_Create_ReturnValue_6;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBMessageInfo                         K2Node_Event_InMessageInfo;                        // 0x00B0(0x0058)(ConstParm)
	class FString                                 K2Node_Event_ChannelName;                          // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_PlayerName;                           // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsTalking;                           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillList_C*                            CallFunc_Create_ReturnValue_7;                     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP) == 0x000008, "Wrong alignment on PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP");
static_assert(sizeof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP) == 0x000138, "Wrong size on PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, EntryPoint) == 0x000000, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_Create_ReturnValue) == 0x000008, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsValid_ReturnValue_2) == 0x000010, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsValid_ReturnValue_3) == 0x000011, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_Create_ReturnValue_1) == 0x000018, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsValid_ReturnValue_4) == 0x000020, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_Create_ReturnValue_2) == 0x000028, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_KillerPlayerState_1) == 0x000030, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_KillerPlayerState_1' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_KilledPlayerState) == 0x000038, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_KilledPlayerState' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_DamageType) == 0x000040, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_HitZone) == 0x000048, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_HitZone' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_InInstigatorRenderTarget) == 0x000050, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_InInstigatorRenderTarget' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_InInstigatorTexture) == 0x000058, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_InInstigatorTexture' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_DamageCauser) == 0x000060, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_EndPlayReason) == 0x000068, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_KillerPlayerState) == 0x000070, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_KillerPlayerState' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_bEnter) == 0x000078, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_bEnter' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsValid_ReturnValue_5) == 0x000079, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000080, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_Create_ReturnValue_3) == 0x000088, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_Create_ReturnValue_4) == 0x000090, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_Create_ReturnValue_5) == 0x000098, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_Create_ReturnValue_6) == 0x0000A0, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsValid_ReturnValue_6) == 0x0000A8, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsInViewport_ReturnValue) == 0x0000A9, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsValid_ReturnValue_7) == 0x0000AA, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_InMessageInfo) == 0x0000B0, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_InMessageInfo' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_ChannelName) == 0x000108, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_ChannelName' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_PlayerName) == 0x000118, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_PlayerName' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, K2Node_Event_bIsTalking) == 0x000128, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::K2Node_Event_bIsTalking' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_IsValid_ReturnValue_8) == 0x000129, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP, CallFunc_Create_ReturnValue_7) == 0x000130, "Member 'PlayerHUD_BP_C_ExecuteUbergraph_PlayerHUD_BP::CallFunc_Create_ReturnValue_7' has a wrong offset!");

// Function PlayerHUD_BP.PlayerHUD_BP_C.K2_OnVoiceChatPlayerTalkingUpdated
// 0x0028 (0x0028 - 0x0000)
struct PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated final
{
public:
	class FString                                 ChannelName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PlayerName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsTalking;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated) == 0x000008, "Wrong alignment on PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated");
static_assert(sizeof(PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated) == 0x000028, "Wrong size on PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated");
static_assert(offsetof(PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated, ChannelName) == 0x000000, "Member 'PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated::ChannelName' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated, PlayerName) == 0x000010, "Member 'PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated::PlayerName' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated, bIsTalking) == 0x000020, "Member 'PlayerHUD_BP_C_K2_OnVoiceChatPlayerTalkingUpdated::bIsTalking' has a wrong offset!");

// Function PlayerHUD_BP.PlayerHUD_BP_C.K2_ReceiveMessage
// 0x0058 (0x0058 - 0x0000)
struct PlayerHUD_BP_C_K2_ReceiveMessage final
{
public:
	struct FPBMessageInfo                         InMessageInfo;                                     // 0x0000(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PlayerHUD_BP_C_K2_ReceiveMessage) == 0x000008, "Wrong alignment on PlayerHUD_BP_C_K2_ReceiveMessage");
static_assert(sizeof(PlayerHUD_BP_C_K2_ReceiveMessage) == 0x000058, "Wrong size on PlayerHUD_BP_C_K2_ReceiveMessage");
static_assert(offsetof(PlayerHUD_BP_C_K2_ReceiveMessage, InMessageInfo) == 0x000000, "Member 'PlayerHUD_BP_C_K2_ReceiveMessage::InMessageInfo' has a wrong offset!");

// Function PlayerHUD_BP.PlayerHUD_BP_C.NotifyPlayerEnter
// 0x0010 (0x0010 - 0x0000)
struct PlayerHUD_BP_C_NotifyPlayerEnter final
{
public:
	class APBPlayerState*                         KillerPlayerState;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnter;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerHUD_BP_C_NotifyPlayerEnter) == 0x000008, "Wrong alignment on PlayerHUD_BP_C_NotifyPlayerEnter");
static_assert(sizeof(PlayerHUD_BP_C_NotifyPlayerEnter) == 0x000010, "Wrong size on PlayerHUD_BP_C_NotifyPlayerEnter");
static_assert(offsetof(PlayerHUD_BP_C_NotifyPlayerEnter, KillerPlayerState) == 0x000000, "Member 'PlayerHUD_BP_C_NotifyPlayerEnter::KillerPlayerState' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_NotifyPlayerEnter, bEnter) == 0x000008, "Member 'PlayerHUD_BP_C_NotifyPlayerEnter::bEnter' has a wrong offset!");

// Function PlayerHUD_BP.PlayerHUD_BP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct PlayerHUD_BP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerHUD_BP_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on PlayerHUD_BP_C_ReceiveEndPlay");
static_assert(sizeof(PlayerHUD_BP_C_ReceiveEndPlay) == 0x000001, "Wrong size on PlayerHUD_BP_C_ReceiveEndPlay");
static_assert(offsetof(PlayerHUD_BP_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'PlayerHUD_BP_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function PlayerHUD_BP.PlayerHUD_BP_C.NotifyBeKilled
// 0x0038 (0x0038 - 0x0000)
struct PlayerHUD_BP_C_NotifyBeKilled final
{
public:
	class APBPlayerState*                         KillerPlayerState;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         KilledPlayerState;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBHitZone                                    HitZone;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTextureRenderTarget2D*           InInstigatorRenderTarget;                          // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UTexture*                         InInstigatorTexture;                               // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerHUD_BP_C_NotifyBeKilled) == 0x000008, "Wrong alignment on PlayerHUD_BP_C_NotifyBeKilled");
static_assert(sizeof(PlayerHUD_BP_C_NotifyBeKilled) == 0x000038, "Wrong size on PlayerHUD_BP_C_NotifyBeKilled");
static_assert(offsetof(PlayerHUD_BP_C_NotifyBeKilled, KillerPlayerState) == 0x000000, "Member 'PlayerHUD_BP_C_NotifyBeKilled::KillerPlayerState' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_NotifyBeKilled, KilledPlayerState) == 0x000008, "Member 'PlayerHUD_BP_C_NotifyBeKilled::KilledPlayerState' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_NotifyBeKilled, DamageType) == 0x000010, "Member 'PlayerHUD_BP_C_NotifyBeKilled::DamageType' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_NotifyBeKilled, HitZone) == 0x000018, "Member 'PlayerHUD_BP_C_NotifyBeKilled::HitZone' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_NotifyBeKilled, InInstigatorRenderTarget) == 0x000020, "Member 'PlayerHUD_BP_C_NotifyBeKilled::InInstigatorRenderTarget' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_NotifyBeKilled, InInstigatorTexture) == 0x000028, "Member 'PlayerHUD_BP_C_NotifyBeKilled::InInstigatorTexture' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_NotifyBeKilled, DamageCauser) == 0x000030, "Member 'PlayerHUD_BP_C_NotifyBeKilled::DamageCauser' has a wrong offset!");

// Function PlayerHUD_BP.PlayerHUD_BP_C.RemoveWidgetOnEndPlay
// 0x0001 (0x0001 - 0x0000)
struct PlayerHUD_BP_C_RemoveWidgetOnEndPlay final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerHUD_BP_C_RemoveWidgetOnEndPlay) == 0x000001, "Wrong alignment on PlayerHUD_BP_C_RemoveWidgetOnEndPlay");
static_assert(sizeof(PlayerHUD_BP_C_RemoveWidgetOnEndPlay) == 0x000001, "Wrong size on PlayerHUD_BP_C_RemoveWidgetOnEndPlay");
static_assert(offsetof(PlayerHUD_BP_C_RemoveWidgetOnEndPlay, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PlayerHUD_BP_C_RemoveWidgetOnEndPlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PlayerHUD_BP.PlayerHUD_BP_C.UpdateKillInfoShowDemoWidget
// 0x0028 (0x0028 - 0x0000)
struct PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget final
{
public:
	class APBPlayerState*                         KillerPlayerState;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         KilledPlayerState;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget) == 0x000008, "Wrong alignment on PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget");
static_assert(sizeof(PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget) == 0x000028, "Wrong size on PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget");
static_assert(offsetof(PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget, KillerPlayerState) == 0x000000, "Member 'PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget::KillerPlayerState' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget, KilledPlayerState) == 0x000008, "Member 'PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget::KilledPlayerState' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000018, "Member 'PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'PlayerHUD_BP_C_UpdateKillInfoShowDemoWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

