#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerCameraMgr_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerCameraMgr_BP.PlayerCameraMgr_BP_C
// 0x0020 (0x2870 - 0x2850)
class APlayerCameraMgr_BP_C final : public APBPlayerCameraManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2850(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               PostProcessMatOfEMP;                               // 0x2858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        ScreenDamageCameraModifier;                        // 0x2860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        ScreenArmorBreakModifier;                          // 0x2868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerCameraMgr_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RemoveScreenArmorBreakModifier();
	void RemoveScreenDamageModifier();
	void AddScreenArmorBreakModifier(class UBP_CameraModifier_ScreenArmorBreak_C** Return_Value);
	void AddScreenDamageModifier(class UBP_CameraModifier_ScreenDamage_C** Return_Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerCameraMgr_BP_C">();
	}
	static class APlayerCameraMgr_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerCameraMgr_BP_C>();
	}
};
static_assert(alignof(APlayerCameraMgr_BP_C) == 0x000010, "Wrong alignment on APlayerCameraMgr_BP_C");
static_assert(sizeof(APlayerCameraMgr_BP_C) == 0x002870, "Wrong size on APlayerCameraMgr_BP_C");
static_assert(offsetof(APlayerCameraMgr_BP_C, UberGraphFrame) == 0x002850, "Member 'APlayerCameraMgr_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerCameraMgr_BP_C, PostProcessMatOfEMP) == 0x002858, "Member 'APlayerCameraMgr_BP_C::PostProcessMatOfEMP' has a wrong offset!");
static_assert(offsetof(APlayerCameraMgr_BP_C, ScreenDamageCameraModifier) == 0x002860, "Member 'APlayerCameraMgr_BP_C::ScreenDamageCameraModifier' has a wrong offset!");
static_assert(offsetof(APlayerCameraMgr_BP_C, ScreenArmorBreakModifier) == 0x002868, "Member 'APlayerCameraMgr_BP_C::ScreenArmorBreakModifier' has a wrong offset!");

}

