#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerInfo.PlayerInfo_C
// 0x00A0 (0x0300 - 0x0260)
class UPlayerInfo_C final : public UPBUserWidget
{
public:
	class UImage*                                 ClassIcon;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ClassIconBG;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InactiveCoverMain;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InactiveCoverSec;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LevelIcon;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MainAlpha;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainLable;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerLevel;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyColor;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThrobbeClassIcon;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APBPlayerState*                         PlayerState;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DarkBlue;                                          // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightBlue;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DarkRed;                                           // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightRed;                                          // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetValues(bool PlayerExsist, bool PlayerIsMe, bool ChangeTeamColor, bool blueteam, bool ChangePlayerName, const class FText& PlayerName_0, bool ChangeClass, TSoftObjectPtr<class UTexture2D> ClassIcon_0, bool ChangeLevel, class UTexture2D* LevelIcon_0, const class FText& PlayerLevel_0, bool ChangeReady, bool Ready);
	void Init(class APBPlayerState* InitWithPlayerState);
	void GetDisplayNameForBlockPlayer(class APBPlayerState* InPlayerState, class FString* OutDisplayName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerInfo_C">();
	}
	static class UPlayerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerInfo_C>();
	}
};
static_assert(alignof(UPlayerInfo_C) == 0x000008, "Wrong alignment on UPlayerInfo_C");
static_assert(sizeof(UPlayerInfo_C) == 0x000300, "Wrong size on UPlayerInfo_C");
static_assert(offsetof(UPlayerInfo_C, ClassIcon) == 0x000260, "Member 'UPlayerInfo_C::ClassIcon' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, ClassIconBG) == 0x000268, "Member 'UPlayerInfo_C::ClassIconBG' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, InactiveCoverMain) == 0x000270, "Member 'UPlayerInfo_C::InactiveCoverMain' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, InactiveCoverSec) == 0x000278, "Member 'UPlayerInfo_C::InactiveCoverSec' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, LevelIcon) == 0x000280, "Member 'UPlayerInfo_C::LevelIcon' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, MainAlpha) == 0x000288, "Member 'UPlayerInfo_C::MainAlpha' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, MainLable) == 0x000290, "Member 'UPlayerInfo_C::MainLable' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, PlayerLevel) == 0x000298, "Member 'UPlayerInfo_C::PlayerLevel' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, PlayerName) == 0x0002A0, "Member 'UPlayerInfo_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, ReadyColor) == 0x0002A8, "Member 'UPlayerInfo_C::ReadyColor' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, ThrobbeClassIcon) == 0x0002B0, "Member 'UPlayerInfo_C::ThrobbeClassIcon' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, PlayerState) == 0x0002B8, "Member 'UPlayerInfo_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, DarkBlue) == 0x0002C0, "Member 'UPlayerInfo_C::DarkBlue' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, LightBlue) == 0x0002D0, "Member 'UPlayerInfo_C::LightBlue' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, DarkRed) == 0x0002E0, "Member 'UPlayerInfo_C::DarkRed' has a wrong offset!");
static_assert(offsetof(UPlayerInfo_C, LightRed) == 0x0002F0, "Member 'UPlayerInfo_C::LightRed' has a wrong offset!");

}

