#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSXLPHeatDetector_BP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PSXLPHeatDetector_BP.PSXLPHeatDetector_BP_C
// 0x0028 (0x03E8 - 0x03C0)
class APSXLPHeatDetector_BP_C final : public APBRadar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           EnemyColor;                                        // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FriendlyColor;                                     // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PSXLPHeatDetector_BP(int32 EntryPoint);
	void CustomEvent_0();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PSXLPHeatDetector_BP_C">();
	}
	static class APSXLPHeatDetector_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APSXLPHeatDetector_BP_C>();
	}
};
static_assert(alignof(APSXLPHeatDetector_BP_C) == 0x000008, "Wrong alignment on APSXLPHeatDetector_BP_C");
static_assert(sizeof(APSXLPHeatDetector_BP_C) == 0x0003E8, "Wrong size on APSXLPHeatDetector_BP_C");
static_assert(offsetof(APSXLPHeatDetector_BP_C, UberGraphFrame) == 0x0003C0, "Member 'APSXLPHeatDetector_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APSXLPHeatDetector_BP_C, EnemyColor) == 0x0003C8, "Member 'APSXLPHeatDetector_BP_C::EnemyColor' has a wrong offset!");
static_assert(offsetof(APSXLPHeatDetector_BP_C, FriendlyColor) == 0x0003D8, "Member 'APSXLPHeatDetector_BP_C::FriendlyColor' has a wrong offset!");

}

