#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PTRD_SelectMesh_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PTRD_SelectMesh_Skeleton_AnimBlueprint.PTRD_SelectMesh_Skeleton_AnimBlueprint_C.ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint
// 0x0040 (0x0040 - 0x0000)
struct PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBWeapon*                              CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint");
static_assert(sizeof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint) == 0x000040, "Wrong size on PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, K2Node_DynamicCast_AsPBCharacter) == 0x000018, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::K2Node_DynamicCast_AsPBCharacter' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000028, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, CallFunc_GetCurrentAmmoInClip_ReturnValue) == 0x000034, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::CallFunc_GetCurrentAmmoInClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_ExecuteUbergraph_PTRD_SelectMesh_Skeleton_AnimBlueprint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PTRD_SelectMesh_Skeleton_AnimBlueprint.PTRD_SelectMesh_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct PTRD_SelectMesh_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on PTRD_SelectMesh_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on PTRD_SelectMesh_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function PTRD_SelectMesh_Skeleton_AnimBlueprint.PTRD_SelectMesh_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PTRD_SelectMesh_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on PTRD_SelectMesh_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on PTRD_SelectMesh_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(PTRD_SelectMesh_Skeleton_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PTRD_SelectMesh_Skeleton_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

