#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RayEMPLauncher_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBLauncher_Delay_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RayEMPLauncher_BP.RayEMPLauncher_BP_C
// 0x0020 (0x0698 - 0x0678)
class ARayEMPLauncher_BP_C final : public APBLauncher_Delay_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_RayEMPLauncher_BP_C;                // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBFireComponent_RayProjectile*         PBFireComponent_RayProjectile;                     // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OriginParent;                                      // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FireMuzzle_VFX;                                    // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RayEMPLauncher_BP(int32 EntryPoint);
	void K2_Undeploying();
	void K2_Deploying();
	void K2_SimuilateFire();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RayEMPLauncher_BP_C">();
	}
	static class ARayEMPLauncher_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARayEMPLauncher_BP_C>();
	}
};
static_assert(alignof(ARayEMPLauncher_BP_C) == 0x000008, "Wrong alignment on ARayEMPLauncher_BP_C");
static_assert(sizeof(ARayEMPLauncher_BP_C) == 0x000698, "Wrong size on ARayEMPLauncher_BP_C");
static_assert(offsetof(ARayEMPLauncher_BP_C, UberGraphFrame_RayEMPLauncher_BP_C) == 0x000678, "Member 'ARayEMPLauncher_BP_C::UberGraphFrame_RayEMPLauncher_BP_C' has a wrong offset!");
static_assert(offsetof(ARayEMPLauncher_BP_C, PBFireComponent_RayProjectile) == 0x000680, "Member 'ARayEMPLauncher_BP_C::PBFireComponent_RayProjectile' has a wrong offset!");
static_assert(offsetof(ARayEMPLauncher_BP_C, OriginParent) == 0x000688, "Member 'ARayEMPLauncher_BP_C::OriginParent' has a wrong offset!");
static_assert(offsetof(ARayEMPLauncher_BP_C, FireMuzzle_VFX) == 0x000690, "Member 'ARayEMPLauncher_BP_C::FireMuzzle_VFX' has a wrong offset!");

}

