#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RayGrenadeLauncher_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RayGrenadeLauncher_BP.RayGrenadeLauncher_BP_C.ExecuteUbergraph_RayGrenadeLauncher_BP
// 0x0090 (0x0090 - 0x0000)
struct RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetFireSocketName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP) == 0x000010, "Wrong alignment on RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP");
static_assert(sizeof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP) == 0x000090, "Wrong size on RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, EntryPoint) == 0x000000, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, Temp_bool_Variable) == 0x000004, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, CallFunc_GetOwnerPawn_ReturnValue) == 0x000008, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::CallFunc_GetOwnerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, CallFunc_IsLocallyControlled_ReturnValue) == 0x000010, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, K2Node_Select_Default) == 0x000018, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, CallFunc_GetFireSocketName_ReturnValue) == 0x000020, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::CallFunc_GetFireSocketName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, CallFunc_GetSocketTransform_ReturnValue) == 0x000030, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, CallFunc_BreakTransform_Location) == 0x000060, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000088, "Member 'RayGrenadeLauncher_BP_C_ExecuteUbergraph_RayGrenadeLauncher_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

