#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RCVR_GSW_AR_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RCVR_GSW_AR_Skeleton_AnimBlueprint.RCVR_GSW_AR_Skeleton_AnimBlueprint_C.ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint
// 0x001C (0x001C - 0x0000)
struct RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_BarrelOffset;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_MuzzleOffset;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint) == 0x000004, "Wrong alignment on RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint");
static_assert(sizeof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint) == 0x00001C, "Wrong size on RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint");
static_assert(offsetof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint, K2Node_CustomEvent_BarrelOffset) == 0x000004, "Member 'RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint::K2Node_CustomEvent_BarrelOffset' has a wrong offset!");
static_assert(offsetof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint, K2Node_CustomEvent_MuzzleOffset) == 0x000010, "Member 'RCVR_GSW_AR_Skeleton_AnimBlueprint_C_ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint::K2Node_CustomEvent_MuzzleOffset' has a wrong offset!");

// Function RCVR_GSW_AR_Skeleton_AnimBlueprint.RCVR_GSW_AR_Skeleton_AnimBlueprint_C.UpdateOffsets
// 0x0018 (0x0018 - 0x0000)
struct RCVR_GSW_AR_Skeleton_AnimBlueprint_C_UpdateOffsets final
{
public:
	struct FVector                                BarrelOffset_0;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MuzzleOffset_0;                                    // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_UpdateOffsets) == 0x000004, "Wrong alignment on RCVR_GSW_AR_Skeleton_AnimBlueprint_C_UpdateOffsets");
static_assert(sizeof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_UpdateOffsets) == 0x000018, "Wrong size on RCVR_GSW_AR_Skeleton_AnimBlueprint_C_UpdateOffsets");
static_assert(offsetof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_UpdateOffsets, BarrelOffset_0) == 0x000000, "Member 'RCVR_GSW_AR_Skeleton_AnimBlueprint_C_UpdateOffsets::BarrelOffset_0' has a wrong offset!");
static_assert(offsetof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_UpdateOffsets, MuzzleOffset_0) == 0x00000C, "Member 'RCVR_GSW_AR_Skeleton_AnimBlueprint_C_UpdateOffsets::MuzzleOffset_0' has a wrong offset!");

// Function RCVR_GSW_AR_Skeleton_AnimBlueprint.RCVR_GSW_AR_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct RCVR_GSW_AR_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on RCVR_GSW_AR_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on RCVR_GSW_AR_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(RCVR_GSW_AR_Skeleton_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'RCVR_GSW_AR_Skeleton_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

