#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RCVR_GSW_AR_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RCVR_GSW_AR_Skeleton_AnimBlueprint.RCVR_GSW_AR_Skeleton_AnimBlueprint_C
// 0x0330 (0x05F0 - 0x02C0)
class URCVR_GSW_AR_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x02F8(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0400(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0420(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04A0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x04C0(0x0108)()
	struct FVector                                BarrelOffset;                                      // 0x05C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACSTM_Base_C*                           OwnerWeapon;                                       // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MuzzleOffset;                                      // 0x05E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RCVR_GSW_AR_Skeleton_AnimBlueprint(int32 EntryPoint);
	void UpdateOffsets(const struct FVector& BarrelOffset_0, const struct FVector& MuzzleOffset_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RCVR_GSW_AR_Skeleton_AnimBlueprint_C">();
	}
	static class URCVR_GSW_AR_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCVR_GSW_AR_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on URCVR_GSW_AR_Skeleton_AnimBlueprint_C");
static_assert(sizeof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C) == 0x0005F0, "Wrong size on URCVR_GSW_AR_Skeleton_AnimBlueprint_C");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x0002F8, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000400, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000420, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0004A0, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x0004C0, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, BarrelOffset) == 0x0005C8, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::BarrelOffset' has a wrong offset!");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, OwnerWeapon) == 0x0005D8, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::OwnerWeapon' has a wrong offset!");
static_assert(offsetof(URCVR_GSW_AR_Skeleton_AnimBlueprint_C, MuzzleOffset) == 0x0005E0, "Member 'URCVR_GSW_AR_Skeleton_AnimBlueprint_C::MuzzleOffset' has a wrong offset!");

}

