#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SoundTheme

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_SoundTheme.S_SoundTheme
// 0x0028 (0x0028 - 0x0000)
struct FS_SoundTheme final
{
public:
	class USoundBase*                             ButtonClick_2_440C5DAD43AFA1D1573359BAF64A8292;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ButtonFocuse_8_137D33BE47910773350C13BEFA4C843B;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NotifyWindow_4_48E458AD4A7E2870FB4451A4F6D4232B;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MenuBGM_9_05BB14054E147C94BEF576BA1518932D;        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MenuRadioChatter_12_D9CE427B48BE733DFDD0C4BE60B06E0A; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_SoundTheme) == 0x000008, "Wrong alignment on FS_SoundTheme");
static_assert(sizeof(FS_SoundTheme) == 0x000028, "Wrong size on FS_SoundTheme");
static_assert(offsetof(FS_SoundTheme, ButtonClick_2_440C5DAD43AFA1D1573359BAF64A8292) == 0x000000, "Member 'FS_SoundTheme::ButtonClick_2_440C5DAD43AFA1D1573359BAF64A8292' has a wrong offset!");
static_assert(offsetof(FS_SoundTheme, ButtonFocuse_8_137D33BE47910773350C13BEFA4C843B) == 0x000008, "Member 'FS_SoundTheme::ButtonFocuse_8_137D33BE47910773350C13BEFA4C843B' has a wrong offset!");
static_assert(offsetof(FS_SoundTheme, NotifyWindow_4_48E458AD4A7E2870FB4451A4F6D4232B) == 0x000010, "Member 'FS_SoundTheme::NotifyWindow_4_48E458AD4A7E2870FB4451A4F6D4232B' has a wrong offset!");
static_assert(offsetof(FS_SoundTheme, MenuBGM_9_05BB14054E147C94BEF576BA1518932D) == 0x000018, "Member 'FS_SoundTheme::MenuBGM_9_05BB14054E147C94BEF576BA1518932D' has a wrong offset!");
static_assert(offsetof(FS_SoundTheme, MenuRadioChatter_12_D9CE427B48BE733DFDD0C4BE60B06E0A) == 0x000020, "Member 'FS_SoundTheme::MenuRadioChatter_12_D9CE427B48BE733DFDD0C4BE60B06E0A' has a wrong offset!");

}

