#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScrollText

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScrollText.ScrollText_C
// 0x00F0 (0x0350 - 0x0260)
class UScrollText_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             ScrollBox;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScrollText;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ScrollOffset;                                      // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         BoxWidth;                                          // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsDoubleText;                                      // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            TextColor;                                         // 0x02B0(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         ScrollSpeed;                                       // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPause;                                           // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          TextAlignment;                                     // 0x02DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2DE[0x2];                                      // 0x02DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollEdgeFadeValue_L;                             // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScrollEdgeFadeValue_R;                             // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x02E8(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLinearColor                           ShadowColor;                                       // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ScrollText(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetTitleText(const class FText& Text_0);
	void SetStyle(const struct FSlateColor& TextColor_0);
	void SetInfo(const class FText& Text_0);
	void BreakPause();
	void Set_Text_Info(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScrollText_C">();
	}
	static class UScrollText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScrollText_C>();
	}
};
static_assert(alignof(UScrollText_C) == 0x000008, "Wrong alignment on UScrollText_C");
static_assert(sizeof(UScrollText_C) == 0x000350, "Wrong size on UScrollText_C");
static_assert(offsetof(UScrollText_C, UberGraphFrame) == 0x000260, "Member 'UScrollText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScrollText_C, ScrollBox) == 0x000268, "Member 'UScrollText_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UScrollText_C, ScrollText) == 0x000270, "Member 'UScrollText_C::ScrollText' has a wrong offset!");
static_assert(offsetof(UScrollText_C, SizeBox) == 0x000278, "Member 'UScrollText_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UScrollText_C, ScrollOffset) == 0x000280, "Member 'UScrollText_C::ScrollOffset' has a wrong offset!");
static_assert(offsetof(UScrollText_C, Text) == 0x000288, "Member 'UScrollText_C::Text' has a wrong offset!");
static_assert(offsetof(UScrollText_C, BoxWidth) == 0x0002A0, "Member 'UScrollText_C::BoxWidth' has a wrong offset!");
static_assert(offsetof(UScrollText_C, IsDoubleText) == 0x0002A4, "Member 'UScrollText_C::IsDoubleText' has a wrong offset!");
static_assert(offsetof(UScrollText_C, FontSize) == 0x0002A8, "Member 'UScrollText_C::FontSize' has a wrong offset!");
static_assert(offsetof(UScrollText_C, TextColor) == 0x0002B0, "Member 'UScrollText_C::TextColor' has a wrong offset!");
static_assert(offsetof(UScrollText_C, ScrollSpeed) == 0x0002D8, "Member 'UScrollText_C::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(UScrollText_C, IsPause) == 0x0002DC, "Member 'UScrollText_C::IsPause' has a wrong offset!");
static_assert(offsetof(UScrollText_C, TextAlignment) == 0x0002DD, "Member 'UScrollText_C::TextAlignment' has a wrong offset!");
static_assert(offsetof(UScrollText_C, ScrollEdgeFadeValue_L) == 0x0002E0, "Member 'UScrollText_C::ScrollEdgeFadeValue_L' has a wrong offset!");
static_assert(offsetof(UScrollText_C, ScrollEdgeFadeValue_R) == 0x0002E4, "Member 'UScrollText_C::ScrollEdgeFadeValue_R' has a wrong offset!");
static_assert(offsetof(UScrollText_C, Font) == 0x0002E8, "Member 'UScrollText_C::Font' has a wrong offset!");
static_assert(offsetof(UScrollText_C, ShadowColor) == 0x000340, "Member 'UScrollText_C::ShadowColor' has a wrong offset!");

}

