#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScrollTextV2

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScrollTextV2.ScrollTextV2_C
// 0x00F0 (0x0350 - 0x0260)
class UScrollTextV2_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScrollText;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         BoxWidth;                                          // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0290(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            TextColor;                                         // 0x02A8(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FLinearColor                           ShadowColor;                                       // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x02E0(0x0058)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	EHorizontalAlignment                          TextAlignment;                                     // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsWidthOverride;                                  // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollSpeed;                                       // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         ScrollTextX;                                       // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeBoxX;                                          // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPause;                                          // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ScrollTextV2(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetTitleText(const class FText& Text_0);
	void PreConstruct(bool IsDesignTime);
	void Finished_70CCB2FF465FCD3312A28EB6F6A51161();

	void IsTextOverflow(bool* bIsOverflow) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScrollTextV2_C">();
	}
	static class UScrollTextV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScrollTextV2_C>();
	}
};
static_assert(alignof(UScrollTextV2_C) == 0x000008, "Wrong alignment on UScrollTextV2_C");
static_assert(sizeof(UScrollTextV2_C) == 0x000350, "Wrong size on UScrollTextV2_C");
static_assert(offsetof(UScrollTextV2_C, UberGraphFrame) == 0x000260, "Member 'UScrollTextV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, FadeOut) == 0x000268, "Member 'UScrollTextV2_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, ScrollBox) == 0x000270, "Member 'UScrollTextV2_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, ScrollText) == 0x000278, "Member 'UScrollTextV2_C::ScrollText' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, SizeBox) == 0x000280, "Member 'UScrollTextV2_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, BoxWidth) == 0x000288, "Member 'UScrollTextV2_C::BoxWidth' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, FontSize) == 0x00028C, "Member 'UScrollTextV2_C::FontSize' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, Text) == 0x000290, "Member 'UScrollTextV2_C::Text' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, TextColor) == 0x0002A8, "Member 'UScrollTextV2_C::TextColor' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, ShadowColor) == 0x0002D0, "Member 'UScrollTextV2_C::ShadowColor' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, Font) == 0x0002E0, "Member 'UScrollTextV2_C::Font' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, TextAlignment) == 0x000338, "Member 'UScrollTextV2_C::TextAlignment' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, bIsWidthOverride) == 0x000339, "Member 'UScrollTextV2_C::bIsWidthOverride' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, ScrollSpeed) == 0x00033C, "Member 'UScrollTextV2_C::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, ScrollTextX) == 0x000340, "Member 'UScrollTextV2_C::ScrollTextX' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, SizeBoxX) == 0x000344, "Member 'UScrollTextV2_C::SizeBoxX' has a wrong offset!");
static_assert(offsetof(UScrollTextV2_C, bIsPause) == 0x000348, "Member 'UScrollTextV2_C::bIsPause' has a wrong offset!");

}

