#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetMouseInput

#include "Basic.hpp"


namespace SDK::Params
{

// Function SetMouseInput.SetMouseInput_C.SetCameraSensitivity
// 0x0058 (0x0058 - 0x0000)
struct SetMouseInput_C_SetCameraSensitivity final
{
public:
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatOption_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SetMouseInput_C_SetCameraSensitivity) == 0x000008, "Wrong alignment on SetMouseInput_C_SetCameraSensitivity");
static_assert(sizeof(SetMouseInput_C_SetCameraSensitivity) == 0x000058, "Wrong size on SetMouseInput_C_SetCameraSensitivity");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000000, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_GetFloatOption_ReturnValue) == 0x000008, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_GetFloatOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_IsInViewport_ReturnValue) == 0x000010, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000014, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000038, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000048, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetCameraSensitivity, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'SetMouseInput_C_SetCameraSensitivity::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function SetMouseInput.SetMouseInput_C.SetADSSensitivity
// 0x0058 (0x0058 - 0x0000)
struct SetMouseInput_C_SetADSSensitivity final
{
public:
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatOption_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SetMouseInput_C_SetADSSensitivity) == 0x000008, "Wrong alignment on SetMouseInput_C_SetADSSensitivity");
static_assert(sizeof(SetMouseInput_C_SetADSSensitivity) == 0x000058, "Wrong size on SetMouseInput_C_SetADSSensitivity");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000000, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_GetFloatOption_ReturnValue) == 0x000008, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_GetFloatOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_IsInViewport_ReturnValue) == 0x000030, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000034, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000048, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetMouseInput_C_SetADSSensitivity, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'SetMouseInput_C_SetADSSensitivity::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

