#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shaker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Shaker.ShakerComponent.Disable
// 0x0001 (0x0001 - 0x0000)
struct ShakerComponent_Disable final
{
public:
	bool                                          bImmediate;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ShakerComponent_Disable) == 0x000001, "Wrong alignment on ShakerComponent_Disable");
static_assert(sizeof(ShakerComponent_Disable) == 0x000001, "Wrong size on ShakerComponent_Disable");
static_assert(offsetof(ShakerComponent_Disable, bImmediate) == 0x000000, "Member 'ShakerComponent_Disable::bImmediate' has a wrong offset!");

// Function Shaker.ShakerComponent.PlayShake
// 0x0018 (0x0018 - 0x0000)
struct ShakerComponent_PlayShake final
{
public:
	TSubclassOf<class UShakerShake>               Shake;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UShakerShake*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ShakerComponent_PlayShake) == 0x000008, "Wrong alignment on ShakerComponent_PlayShake");
static_assert(sizeof(ShakerComponent_PlayShake) == 0x000018, "Wrong size on ShakerComponent_PlayShake");
static_assert(offsetof(ShakerComponent_PlayShake, Shake) == 0x000000, "Member 'ShakerComponent_PlayShake::Shake' has a wrong offset!");
static_assert(offsetof(ShakerComponent_PlayShake, Scale) == 0x000008, "Member 'ShakerComponent_PlayShake::Scale' has a wrong offset!");
static_assert(offsetof(ShakerComponent_PlayShake, ReturnValue) == 0x000010, "Member 'ShakerComponent_PlayShake::ReturnValue' has a wrong offset!");

// Function Shaker.ShakerComponent.StopAllInstancesOfShake
// 0x0010 (0x0010 - 0x0000)
struct ShakerComponent_StopAllInstancesOfShake final
{
public:
	TSubclassOf<class UShakerShake>               Shake;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImmediately;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ShakerComponent_StopAllInstancesOfShake) == 0x000008, "Wrong alignment on ShakerComponent_StopAllInstancesOfShake");
static_assert(sizeof(ShakerComponent_StopAllInstancesOfShake) == 0x000010, "Wrong size on ShakerComponent_StopAllInstancesOfShake");
static_assert(offsetof(ShakerComponent_StopAllInstancesOfShake, Shake) == 0x000000, "Member 'ShakerComponent_StopAllInstancesOfShake::Shake' has a wrong offset!");
static_assert(offsetof(ShakerComponent_StopAllInstancesOfShake, bImmediately) == 0x000008, "Member 'ShakerComponent_StopAllInstancesOfShake::bImmediately' has a wrong offset!");

// Function Shaker.ShakerComponent.StopAllShakes
// 0x0001 (0x0001 - 0x0000)
struct ShakerComponent_StopAllShakes final
{
public:
	bool                                          Immediately;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ShakerComponent_StopAllShakes) == 0x000001, "Wrong alignment on ShakerComponent_StopAllShakes");
static_assert(sizeof(ShakerComponent_StopAllShakes) == 0x000001, "Wrong size on ShakerComponent_StopAllShakes");
static_assert(offsetof(ShakerComponent_StopAllShakes, Immediately) == 0x000000, "Member 'ShakerComponent_StopAllShakes::Immediately' has a wrong offset!");

// Function Shaker.ShakerComponent.StopShake
// 0x0010 (0x0010 - 0x0000)
struct ShakerComponent_StopShake final
{
public:
	class UShakerShake*                           Shake;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImmediately;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ShakerComponent_StopShake) == 0x000008, "Wrong alignment on ShakerComponent_StopShake");
static_assert(sizeof(ShakerComponent_StopShake) == 0x000010, "Wrong size on ShakerComponent_StopShake");
static_assert(offsetof(ShakerComponent_StopShake, Shake) == 0x000000, "Member 'ShakerComponent_StopShake::Shake' has a wrong offset!");
static_assert(offsetof(ShakerComponent_StopShake, bImmediately) == 0x000008, "Member 'ShakerComponent_StopShake::bImmediately' has a wrong offset!");

// Function Shaker.ShakerComponent.IsDisabled
// 0x0001 (0x0001 - 0x0000)
struct ShakerComponent_IsDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ShakerComponent_IsDisabled) == 0x000001, "Wrong alignment on ShakerComponent_IsDisabled");
static_assert(sizeof(ShakerComponent_IsDisabled) == 0x000001, "Wrong size on ShakerComponent_IsDisabled");
static_assert(offsetof(ShakerComponent_IsDisabled, ReturnValue) == 0x000000, "Member 'ShakerComponent_IsDisabled::ReturnValue' has a wrong offset!");

// Function Shaker.ShakerShake.ReceivePlay
// 0x0004 (0x0004 - 0x0000)
struct ShakerShake_ReceivePlay final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ShakerShake_ReceivePlay) == 0x000004, "Wrong alignment on ShakerShake_ReceivePlay");
static_assert(sizeof(ShakerShake_ReceivePlay) == 0x000004, "Wrong size on ShakerShake_ReceivePlay");
static_assert(offsetof(ShakerShake_ReceivePlay, Scale) == 0x000000, "Member 'ShakerShake_ReceivePlay::Scale' has a wrong offset!");

// Function Shaker.ShakerShake.ReceiveStop
// 0x0001 (0x0001 - 0x0000)
struct ShakerShake_ReceiveStop final
{
public:
	bool                                          bImmediately;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ShakerShake_ReceiveStop) == 0x000001, "Wrong alignment on ShakerShake_ReceiveStop");
static_assert(sizeof(ShakerShake_ReceiveStop) == 0x000001, "Wrong size on ShakerShake_ReceiveStop");
static_assert(offsetof(ShakerShake_ReceiveStop, bImmediately) == 0x000000, "Member 'ShakerShake_ReceiveStop::bImmediately' has a wrong offset!");

// Function Shaker.ShakerShake.ReceiveTick
// 0x0040 (0x0040 - 0x0000)
struct ShakerShake_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ALPHA;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Offset;                                            // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ShakerShake_ReceiveTick) == 0x000010, "Wrong alignment on ShakerShake_ReceiveTick");
static_assert(sizeof(ShakerShake_ReceiveTick) == 0x000040, "Wrong size on ShakerShake_ReceiveTick");
static_assert(offsetof(ShakerShake_ReceiveTick, DeltaTime) == 0x000000, "Member 'ShakerShake_ReceiveTick::DeltaTime' has a wrong offset!");
static_assert(offsetof(ShakerShake_ReceiveTick, ALPHA) == 0x000004, "Member 'ShakerShake_ReceiveTick::ALPHA' has a wrong offset!");
static_assert(offsetof(ShakerShake_ReceiveTick, Offset) == 0x000010, "Member 'ShakerShake_ReceiveTick::Offset' has a wrong offset!");

// Function Shaker.ShakerShake.ReceiveIsFinished
// 0x0001 (0x0001 - 0x0000)
struct ShakerShake_ReceiveIsFinished final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ShakerShake_ReceiveIsFinished) == 0x000001, "Wrong alignment on ShakerShake_ReceiveIsFinished");
static_assert(sizeof(ShakerShake_ReceiveIsFinished) == 0x000001, "Wrong size on ShakerShake_ReceiveIsFinished");
static_assert(offsetof(ShakerShake_ReceiveIsFinished, ReturnValue) == 0x000000, "Member 'ShakerShake_ReceiveIsFinished::ReturnValue' has a wrong offset!");

}

