#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShieldModel_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ShieldModel_Skeleton_AnimBlueprint.ShieldModel_Skeleton_AnimBlueprint_C.ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint
// 0x0014 (0x0014 - 0x0000)
struct ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint) == 0x000004, "Wrong alignment on ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint");
static_assert(sizeof(ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint) == 0x000014, "Wrong size on ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x00000C, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000010, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000011, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_ExecuteUbergraph_ShieldModel_Skeleton_AnimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function ShieldModel_Skeleton_AnimBlueprint.ShieldModel_Skeleton_AnimBlueprint_C.DeployShield
// 0x0004 (0x0004 - 0x0000)
struct ShieldModel_Skeleton_AnimBlueprint_C_DeployShield final
{
public:
	int32                                         DeployingTime;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldModel_Skeleton_AnimBlueprint_C_DeployShield) == 0x000004, "Wrong alignment on ShieldModel_Skeleton_AnimBlueprint_C_DeployShield");
static_assert(sizeof(ShieldModel_Skeleton_AnimBlueprint_C_DeployShield) == 0x000004, "Wrong size on ShieldModel_Skeleton_AnimBlueprint_C_DeployShield");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_DeployShield, DeployingTime) == 0x000000, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_DeployShield::DeployingTime' has a wrong offset!");

// Function ShieldModel_Skeleton_AnimBlueprint.ShieldModel_Skeleton_AnimBlueprint_C.UndeployShield
// 0x0004 (0x0004 - 0x0000)
struct ShieldModel_Skeleton_AnimBlueprint_C_UndeployShield final
{
public:
	int32                                         Undeploying;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldModel_Skeleton_AnimBlueprint_C_UndeployShield) == 0x000004, "Wrong alignment on ShieldModel_Skeleton_AnimBlueprint_C_UndeployShield");
static_assert(sizeof(ShieldModel_Skeleton_AnimBlueprint_C_UndeployShield) == 0x000004, "Wrong size on ShieldModel_Skeleton_AnimBlueprint_C_UndeployShield");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_UndeployShield, Undeploying) == 0x000000, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_UndeployShield::Undeploying' has a wrong offset!");

// Function ShieldModel_Skeleton_AnimBlueprint.ShieldModel_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ShieldModel_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ShieldModel_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on ShieldModel_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(ShieldModel_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on ShieldModel_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(ShieldModel_Skeleton_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ShieldModel_Skeleton_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

