#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleRotObject_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SimpleRotObject_BP.SimpleRotObject_BP_C
// 0x0030 (0x0250 - 0x0220)
class ASimpleRotObject_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotating_Rate;                                     // 0x0238(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Static_Mesh;                                       // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_SimpleRotObject_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SimpleRotObject_BP_C">();
	}
	static class ASimpleRotObject_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASimpleRotObject_BP_C>();
	}
};
static_assert(alignof(ASimpleRotObject_BP_C) == 0x000008, "Wrong alignment on ASimpleRotObject_BP_C");
static_assert(sizeof(ASimpleRotObject_BP_C) == 0x000250, "Wrong size on ASimpleRotObject_BP_C");
static_assert(offsetof(ASimpleRotObject_BP_C, UberGraphFrame) == 0x000220, "Member 'ASimpleRotObject_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASimpleRotObject_BP_C, RotatingMovement) == 0x000228, "Member 'ASimpleRotObject_BP_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ASimpleRotObject_BP_C, StaticMesh) == 0x000230, "Member 'ASimpleRotObject_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ASimpleRotObject_BP_C, Rotating_Rate) == 0x000238, "Member 'ASimpleRotObject_BP_C::Rotating_Rate' has a wrong offset!");
static_assert(offsetof(ASimpleRotObject_BP_C, Static_Mesh) == 0x000248, "Member 'ASimpleRotObject_BP_C::Static_Mesh' has a wrong offset!");

}

