#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_HelmetHit

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_HelmetHit.SMEvent_Medal_HelmetHit_C
// 0x0CB0 (0x13A8 - 0x06F8)
class USMEvent_Medal_HelmetHit_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_A66845FF4E5BF956C200029BD5C26DC2; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_321CD1EF4EF1A075A16089AB5AF641DE; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_43896E5146B72B446852E3B3C4210424; // 0x0AF0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_4174F79F4136442B99EB479025C8D884; // 0x0CD0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_B97235964A372CC614720AAF6FA62D33; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_A2C5BA0E4AE23CF7A0DD8E96AE980238; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_B425FEEE43182E3F20F53C96B1FD71B7; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_033D2A854ECE830B53BDF2AADB497A34; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_0764101E4C7E19473D82BC81F0A350BA; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_08D3960F4E54D2DF58192CAB876D607A; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_C56DFAA04DE134A4744374BFA00DC367; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_85774A1245D5821BEA6C5BB5DF0DA672; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_8292694147753967B2CBB28C93053556; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_73B4B36A4B44595F5C4D109C7487F91A; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_333490964BF94F963E737FA17408925B; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_951013FE479E9E6976C71994284F48FE; // 0x1360(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_HelmetHit(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_4CC11BDD49683E13FFE594BF5870AF68();
	void SMGraphK2Node_GraphPropertyNode_10_518353AF11A99FDFEEDB66B6418EA001_A042BED049B6F6111A006EB6BA1E2C44();
	void SMGraphK2Node_GraphPropertyNode_9_3DA64C0AB489BBF8EAE713CAEED73534_9E0DCAC5493596B8BBEA48BC7B104D7A();
	void SMGraphK2Node_GraphPropertyNode_8_3826ADFE8B326640698CC908CCA3F28F_4E73EC98423CADC2EE251F9BA093C6CA();
	void SMGraphK2Node_GraphPropertyNode_7_1D5AE3AF69E079B559EF8AF2950B22F1_EB569229457F89F33608CBA087465993();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_85615AF84092FA621F9AE5B395C75FAF();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_1BB9D17143AED9B4E98A05AC0155F1A9();
	void SMGraphK2Node_GraphPropertyNode_6_DFCF228DCE31F7B7DE4D5893884342DB_CB4F64664798A65507115CA962FA1F01();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_B7B8CAD84092954985BEA889C5E2907C();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_7DC2497C492E05F939446886E4A57E8A();
	void SMGraphK2Node_GraphPropertyNode_5_DFC5DDF9620519B0185FE1F473B6BA24_BB7AA09B4288648860A3989FA668C60A();
	void SMGraphK2Node_GraphPropertyNode_4_F5981CACB7D9769440965527229065DD_2B72524A4AF184AB323172B1AEAF3BFB();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_HelmetHit_C">();
	}
	static class USMEvent_Medal_HelmetHit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_HelmetHit_C>();
	}
};
static_assert(alignof(USMEvent_Medal_HelmetHit_C) == 0x000008, "Wrong alignment on USMEvent_Medal_HelmetHit_C");
static_assert(sizeof(USMEvent_Medal_HelmetHit_C) == 0x0013A8, "Wrong size on USMEvent_Medal_HelmetHit_C");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_HelmetHit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_TransitionResultNode_1_A66845FF4E5BF956C200029BD5C26DC2) == 0x000700, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_TransitionResultNode_1_A66845FF4E5BF956C200029BD5C26DC2' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_TransitionResultNode_321CD1EF4EF1A075A16089AB5AF641DE) == 0x0008F8, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_TransitionResultNode_321CD1EF4EF1A075A16089AB5AF641DE' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_ConduitResultNode_1_43896E5146B72B446852E3B3C4210424) == 0x000AF0, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_ConduitResultNode_1_43896E5146B72B446852E3B3C4210424' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_ConduitResultNode_4174F79F4136442B99EB479025C8D884) == 0x000CD0, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_ConduitResultNode_4174F79F4136442B99EB479025C8D884' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_StateEntryNode_B97235964A372CC614720AAF6FA62D33) == 0x000EB0, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_StateEntryNode_B97235964A372CC614720AAF6FA62D33' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_10_A2C5BA0E4AE23CF7A0DD8E96AE980238) == 0x001090, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_10_A2C5BA0E4AE23CF7A0DD8E96AE980238' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_9_B425FEEE43182E3F20F53C96B1FD71B7) == 0x0010D8, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_9_B425FEEE43182E3F20F53C96B1FD71B7' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_8_033D2A854ECE830B53BDF2AADB497A34) == 0x001120, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_8_033D2A854ECE830B53BDF2AADB497A34' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_7_0764101E4C7E19473D82BC81F0A350BA) == 0x001168, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_7_0764101E4C7E19473D82BC81F0A350BA' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_6_08D3960F4E54D2DF58192CAB876D607A) == 0x0011B0, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_6_08D3960F4E54D2DF58192CAB876D607A' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_5_C56DFAA04DE134A4744374BFA00DC367) == 0x0011F8, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_5_C56DFAA04DE134A4744374BFA00DC367' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_4_85774A1245D5821BEA6C5BB5DF0DA672) == 0x001240, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_4_85774A1245D5821BEA6C5BB5DF0DA672' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_3_8292694147753967B2CBB28C93053556) == 0x001288, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_3_8292694147753967B2CBB28C93053556' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_2_73B4B36A4B44595F5C4D109C7487F91A) == 0x0012D0, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_2_73B4B36A4B44595F5C4D109C7487F91A' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_1_333490964BF94F963E737FA17408925B) == 0x001318, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_1_333490964BF94F963E737FA17408925B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HelmetHit_C, SMGraphK2Node_GraphPropertyNode_951013FE479E9E6976C71994284F48FE) == 0x001360, "Member 'USMEvent_Medal_HelmetHit_C::SMGraphK2Node_GraphPropertyNode_951013FE479E9E6976C71994284F48FE' has a wrong offset!");

}

