#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill.SMEvent_Kill_C
// 0x0278 (0x0970 - 0x06F8)
class USMEvent_Kill_C : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_8D11D4BE4AB4F9BF76D52FBE43876214; // 0x0700(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_565E8B4A45BCD8893F4152895D61CAB9; // 0x08E0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_90C8D1AB407527BB63B951B18521B509; // 0x0928(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_612E7B90478BFD031ED04087BB43FD15();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_A73381AF40BC6BF3ACB639BC70728000();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_A527BC1B4EBD406BC181609C549DC3A7();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_C">();
	}
	static class USMEvent_Kill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_C>();
	}
};
static_assert(alignof(USMEvent_Kill_C) == 0x000008, "Wrong alignment on USMEvent_Kill_C");
static_assert(sizeof(USMEvent_Kill_C) == 0x000970, "Wrong size on USMEvent_Kill_C");
static_assert(offsetof(USMEvent_Kill_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_C, SMGraphK2Node_StateEntryNode_8D11D4BE4AB4F9BF76D52FBE43876214) == 0x000700, "Member 'USMEvent_Kill_C::SMGraphK2Node_StateEntryNode_8D11D4BE4AB4F9BF76D52FBE43876214' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_C, SMGraphK2Node_GraphPropertyNode_1_565E8B4A45BCD8893F4152895D61CAB9) == 0x0008E0, "Member 'USMEvent_Kill_C::SMGraphK2Node_GraphPropertyNode_1_565E8B4A45BCD8893F4152895D61CAB9' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_C, SMGraphK2Node_GraphPropertyNode_90C8D1AB407527BB63B951B18521B509) == 0x000928, "Member 'USMEvent_Kill_C::SMGraphK2Node_GraphPropertyNode_90C8D1AB407527BB63B951B18521B509' has a wrong offset!");

}

