#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_TP82

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_TP82.SMEvent_Kill_TP82_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_TP82_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_4CE4C27E45EBCA923F5EC2AC5AF66144; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_45C5032A4437E7E7E169A7A14C6A8E67; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_4DEBB83F48F13251E20F51980504D3F5; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_3AC500BC42654C9F821CA794F664F48B; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_6A0693FD476F8D1602B67CAE2A82A5A7; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_437C00B24E7FCA37CFACBCA6EF3D1BC6; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_19084AA04E7A43F9F559C9821005E367; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_3C6B6BD54D85DFC47E3E5785ACDFD72F; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_2C0A1D4B48DEB9FD27934CADB8F2ECF9; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_8BA5C52E4A00F2286D0E1BA66BB5F554; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_A415EFC24AAAD613107ADFA7751CE3AB; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_B1CD664C4D7A85E683725A9548A2D7E6; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_52E3C0C04C230702390DFBBCD8B83F55; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_F5CCE610468999C20135008D17160F35; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_TP82(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_EC0D1C524F9534B3C17F3785CD1B3C96();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_E7B0F1A2405D9B7338A2FDBD0C3EB2BD();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_5C11A8FD418BF1D425C95CAFA31B91B1();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_427640344838B70FA4C930915633D0A1();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_E426E6A94FB94990468FBB82BDA7E041();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_E9756F2C4C91241A60A40798A65055D1();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_25A37DE34BE8C9D0B695D5A34F0E8DF4();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_EE44CC894CA65B70DB41F0ADCF9412A4();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_106667DC43ABFB07AEB48796BA447169();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_E4821DE5418F54BBAA7C28BF96DDEE1C();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_5B999F014A2EB1C141C860A64925B0FF();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_8BBAA2784CF3C50B551D93B2C97DBB55();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_TP82_C">();
	}
	static class USMEvent_Kill_TP82_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_TP82_C>();
	}
};
static_assert(alignof(USMEvent_Kill_TP82_C) == 0x000008, "Wrong alignment on USMEvent_Kill_TP82_C");
static_assert(sizeof(USMEvent_Kill_TP82_C) == 0x000FD0, "Wrong size on USMEvent_Kill_TP82_C");
static_assert(offsetof(USMEvent_Kill_TP82_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_TP82_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_TransitionResultNode_4CE4C27E45EBCA923F5EC2AC5AF66144) == 0x000700, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_TransitionResultNode_4CE4C27E45EBCA923F5EC2AC5AF66144' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_StateEntryNode_45C5032A4437E7E7E169A7A14C6A8E67) == 0x0008F8, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_StateEntryNode_45C5032A4437E7E7E169A7A14C6A8E67' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_ConduitResultNode_4DEBB83F48F13251E20F51980504D3F5) == 0x000AD8, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_ConduitResultNode_4DEBB83F48F13251E20F51980504D3F5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_10_3AC500BC42654C9F821CA794F664F48B) == 0x000CB8, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_10_3AC500BC42654C9F821CA794F664F48B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_9_6A0693FD476F8D1602B67CAE2A82A5A7) == 0x000D00, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_9_6A0693FD476F8D1602B67CAE2A82A5A7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_8_437C00B24E7FCA37CFACBCA6EF3D1BC6) == 0x000D48, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_8_437C00B24E7FCA37CFACBCA6EF3D1BC6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_7_19084AA04E7A43F9F559C9821005E367) == 0x000D90, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_7_19084AA04E7A43F9F559C9821005E367' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_6_3C6B6BD54D85DFC47E3E5785ACDFD72F) == 0x000DD8, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_6_3C6B6BD54D85DFC47E3E5785ACDFD72F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_5_2C0A1D4B48DEB9FD27934CADB8F2ECF9) == 0x000E20, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_5_2C0A1D4B48DEB9FD27934CADB8F2ECF9' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_4_8BA5C52E4A00F2286D0E1BA66BB5F554) == 0x000E68, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_4_8BA5C52E4A00F2286D0E1BA66BB5F554' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_3_A415EFC24AAAD613107ADFA7751CE3AB) == 0x000EB0, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_3_A415EFC24AAAD613107ADFA7751CE3AB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_2_B1CD664C4D7A85E683725A9548A2D7E6) == 0x000EF8, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_2_B1CD664C4D7A85E683725A9548A2D7E6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_1_52E3C0C04C230702390DFBBCD8B83F55) == 0x000F40, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_1_52E3C0C04C230702390DFBBCD8B83F55' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_TP82_C, SMGraphK2Node_GraphPropertyNode_F5CCE610468999C20135008D17160F35) == 0x000F88, "Member 'USMEvent_Kill_TP82_C::SMGraphK2Node_GraphPropertyNode_F5CCE610468999C20135008D17160F35' has a wrong offset!");

}

