#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillInCapturing

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_KillInCapturing.SMEvent_KillInCapturing_C
// 0x0728 (0x0E20 - 0x06F8)
class USMEvent_KillInCapturing_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_201F14DA4097A0D0F12834A28BBB0500; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_ED655EC5447713B60FD53AAE8714CC76; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_A7D33CE74CCA1195C9A0A2A83A85787B; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_E1EAD0DF4D9ED34BB08A91865D8CECBF; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_5F638BA14E08831CFDDBFFAE3A7D6ADE; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_6961D0F04632634EB4EDA4BF77150422; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_67E3C1E34473D523C64E58819B201B00; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_76C40BBB43FC339E6B69B1ADC6B2628D; // 0x0DD8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_KillInCapturing(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_6196F2C14D929FFC8824268741A4A711_7425433D44DDB6DEAFC3F48A196BBB90();
	void SMGraphK2Node_GraphPropertyNode_4_3DA64C0AB489BBF8EAE713CAEED73534_781E7175469CCC3FCE2EEF88161AE166();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_2B0584694CAF31CEDDE7949ABE03456D();
	void SMGraphK2Node_GraphPropertyNode_2_9AAB7B4493245BEFF13EB6F013D07131_86A7696641689B33CBCEADA2EA96B39D();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_1325D8A640C3FFE9E5FBD9A9F99EE0F3();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_BE8BEC604F8105B079DD61986F7A14A2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_KillInCapturing_C">();
	}
	static class USMEvent_KillInCapturing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_KillInCapturing_C>();
	}
};
static_assert(alignof(USMEvent_KillInCapturing_C) == 0x000008, "Wrong alignment on USMEvent_KillInCapturing_C");
static_assert(sizeof(USMEvent_KillInCapturing_C) == 0x000E20, "Wrong size on USMEvent_KillInCapturing_C");
static_assert(offsetof(USMEvent_KillInCapturing_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_KillInCapturing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_KillInCapturing_C, SMGraphK2Node_TransitionResultNode_201F14DA4097A0D0F12834A28BBB0500) == 0x000700, "Member 'USMEvent_KillInCapturing_C::SMGraphK2Node_TransitionResultNode_201F14DA4097A0D0F12834A28BBB0500' has a wrong offset!");
static_assert(offsetof(USMEvent_KillInCapturing_C, SMGraphK2Node_ConduitResultNode_ED655EC5447713B60FD53AAE8714CC76) == 0x0008F8, "Member 'USMEvent_KillInCapturing_C::SMGraphK2Node_ConduitResultNode_ED655EC5447713B60FD53AAE8714CC76' has a wrong offset!");
static_assert(offsetof(USMEvent_KillInCapturing_C, SMGraphK2Node_StateEntryNode_A7D33CE74CCA1195C9A0A2A83A85787B) == 0x000AD8, "Member 'USMEvent_KillInCapturing_C::SMGraphK2Node_StateEntryNode_A7D33CE74CCA1195C9A0A2A83A85787B' has a wrong offset!");
static_assert(offsetof(USMEvent_KillInCapturing_C, SMGraphK2Node_GraphPropertyNode_4_E1EAD0DF4D9ED34BB08A91865D8CECBF) == 0x000CB8, "Member 'USMEvent_KillInCapturing_C::SMGraphK2Node_GraphPropertyNode_4_E1EAD0DF4D9ED34BB08A91865D8CECBF' has a wrong offset!");
static_assert(offsetof(USMEvent_KillInCapturing_C, SMGraphK2Node_GraphPropertyNode_3_5F638BA14E08831CFDDBFFAE3A7D6ADE) == 0x000D00, "Member 'USMEvent_KillInCapturing_C::SMGraphK2Node_GraphPropertyNode_3_5F638BA14E08831CFDDBFFAE3A7D6ADE' has a wrong offset!");
static_assert(offsetof(USMEvent_KillInCapturing_C, SMGraphK2Node_GraphPropertyNode_2_6961D0F04632634EB4EDA4BF77150422) == 0x000D48, "Member 'USMEvent_KillInCapturing_C::SMGraphK2Node_GraphPropertyNode_2_6961D0F04632634EB4EDA4BF77150422' has a wrong offset!");
static_assert(offsetof(USMEvent_KillInCapturing_C, SMGraphK2Node_GraphPropertyNode_1_67E3C1E34473D523C64E58819B201B00) == 0x000D90, "Member 'USMEvent_KillInCapturing_C::SMGraphK2Node_GraphPropertyNode_1_67E3C1E34473D523C64E58819B201B00' has a wrong offset!");
static_assert(offsetof(USMEvent_KillInCapturing_C, SMGraphK2Node_GraphPropertyNode_76C40BBB43FC339E6B69B1ADC6B2628D) == 0x000DD8, "Member 'USMEvent_KillInCapturing_C::SMGraphK2Node_GraphPropertyNode_76C40BBB43FC339E6B69B1ADC6B2628D' has a wrong offset!");

}

