#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_PCC

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_PCC.SMEvent_Kill_PCC_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_PCC_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_3AF0F1F94C2E101662D88B82394598A3; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_1186953048C040A522485B90E29B50F1; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_DBB4BA2649A87B2F1C12D6930532E8D6; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_A872A9674867B3DF6B6FD9B5B62E6D3D; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_20B744084212E7A9FBFF38A174AACF5B; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_99E7C2CB4841CDDC16231F86AFD2B69E; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_88775A0F45C509B5454AED80D7BED395; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_419435BC474F6611818B6B9AC50A1335; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_F481E2A34D1BC606D392739AE098304A; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_80B3D2D4438B6881CEFE58A718776DFE; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_4B2045BF423811FC1F5C3FAE874E5C8A; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_C7EB48854F8055E2D26AAFBF45DFA5A9; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_0520FC1E4C71668365BCBE8F5F61AE50; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_B4B71E0E4E065606E50BD9BC9AF3C1CC; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_PCC(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_E07C15384B2F9D7F3E0311A28D62AEAF();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_03C39D6D478B0433F715DFA69B9AB2E9();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_487EE669452F0D5CB5EAE0943A473A0A();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_F437375143724710F357F7B3C8915BB2();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_ABED398C4181CFA0A220E4AD0FD75700();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_8EAD1F90461E4E85A7275E8A57FC0B05();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_CF333B9E4041BA802A34A38F621FD958();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_2B9301C04F3A79823569FBA69766B358();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_24C5199E49E862A24A6018805E143D81();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_F2F41DA347F6A4E732908FBB49D11E98();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_A444ADA24C84ABB43313BBBA051E5EA5();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_299880E74984C199D09E489C950817B9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_PCC_C">();
	}
	static class USMEvent_Kill_PCC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_PCC_C>();
	}
};
static_assert(alignof(USMEvent_Kill_PCC_C) == 0x000008, "Wrong alignment on USMEvent_Kill_PCC_C");
static_assert(sizeof(USMEvent_Kill_PCC_C) == 0x000FD0, "Wrong size on USMEvent_Kill_PCC_C");
static_assert(offsetof(USMEvent_Kill_PCC_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_PCC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_TransitionResultNode_3AF0F1F94C2E101662D88B82394598A3) == 0x000700, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_TransitionResultNode_3AF0F1F94C2E101662D88B82394598A3' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_StateEntryNode_1186953048C040A522485B90E29B50F1) == 0x0008F8, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_StateEntryNode_1186953048C040A522485B90E29B50F1' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_ConduitResultNode_DBB4BA2649A87B2F1C12D6930532E8D6) == 0x000AD8, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_ConduitResultNode_DBB4BA2649A87B2F1C12D6930532E8D6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_10_A872A9674867B3DF6B6FD9B5B62E6D3D) == 0x000CB8, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_10_A872A9674867B3DF6B6FD9B5B62E6D3D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_9_20B744084212E7A9FBFF38A174AACF5B) == 0x000D00, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_9_20B744084212E7A9FBFF38A174AACF5B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_8_99E7C2CB4841CDDC16231F86AFD2B69E) == 0x000D48, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_8_99E7C2CB4841CDDC16231F86AFD2B69E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_7_88775A0F45C509B5454AED80D7BED395) == 0x000D90, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_7_88775A0F45C509B5454AED80D7BED395' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_6_419435BC474F6611818B6B9AC50A1335) == 0x000DD8, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_6_419435BC474F6611818B6B9AC50A1335' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_5_F481E2A34D1BC606D392739AE098304A) == 0x000E20, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_5_F481E2A34D1BC606D392739AE098304A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_4_80B3D2D4438B6881CEFE58A718776DFE) == 0x000E68, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_4_80B3D2D4438B6881CEFE58A718776DFE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_3_4B2045BF423811FC1F5C3FAE874E5C8A) == 0x000EB0, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_3_4B2045BF423811FC1F5C3FAE874E5C8A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_2_C7EB48854F8055E2D26AAFBF45DFA5A9) == 0x000EF8, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_2_C7EB48854F8055E2D26AAFBF45DFA5A9' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_1_0520FC1E4C71668365BCBE8F5F61AE50) == 0x000F40, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_1_0520FC1E4C71668365BCBE8F5F61AE50' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PCC_C, SMGraphK2Node_GraphPropertyNode_B4B71E0E4E065606E50BD9BC9AF3C1CC) == 0x000F88, "Member 'USMEvent_Kill_PCC_C::SMGraphK2Node_GraphPropertyNode_B4B71E0E4E065606E50BD9BC9AF3C1CC' has a wrong offset!");

}

