#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_Vengeance

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_Vengeance.SMEvent_Medal_Vengeance_C
// 0x06E0 (0x0DD8 - 0x06F8)
class USMEvent_Medal_Vengeance_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1C0C4CC048ED3DCAEF8A6C9A58A1D6ED; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_72F9211A4DAA81615CAC0AAC76AC51D8; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_AACBB7374CFFC8F74F626BA8127896CA; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_BCC9A1DC459D2FCAA834BB90EE90B0FA; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_7F122D444BCC2FF30E4FDE98BAD5D523; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_DE50DBCC4BC7E45077EE04B90ECE0987; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_775CAE134B4F5026F98C1994A3DE6E8D; // 0x0D90(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_Vengeance(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_AFBF83694EEF41DE0F5A7685E0612D6C();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_16F9782D4850FBD7DC46A29D88EB9153();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_D1833D4142CEC741A154C2A8A1B76F1A();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_DC82BD804529E05AC1E9A9899ED476A3();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_ADAC6F674035C8184D8BAABB01677FC1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_Vengeance_C">();
	}
	static class USMEvent_Medal_Vengeance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_Vengeance_C>();
	}
};
static_assert(alignof(USMEvent_Medal_Vengeance_C) == 0x000008, "Wrong alignment on USMEvent_Medal_Vengeance_C");
static_assert(sizeof(USMEvent_Medal_Vengeance_C) == 0x000DD8, "Wrong size on USMEvent_Medal_Vengeance_C");
static_assert(offsetof(USMEvent_Medal_Vengeance_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_Vengeance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Vengeance_C, SMGraphK2Node_TransitionResultNode_1C0C4CC048ED3DCAEF8A6C9A58A1D6ED) == 0x000700, "Member 'USMEvent_Medal_Vengeance_C::SMGraphK2Node_TransitionResultNode_1C0C4CC048ED3DCAEF8A6C9A58A1D6ED' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Vengeance_C, SMGraphK2Node_ConduitResultNode_72F9211A4DAA81615CAC0AAC76AC51D8) == 0x0008F8, "Member 'USMEvent_Medal_Vengeance_C::SMGraphK2Node_ConduitResultNode_72F9211A4DAA81615CAC0AAC76AC51D8' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Vengeance_C, SMGraphK2Node_StateEntryNode_AACBB7374CFFC8F74F626BA8127896CA) == 0x000AD8, "Member 'USMEvent_Medal_Vengeance_C::SMGraphK2Node_StateEntryNode_AACBB7374CFFC8F74F626BA8127896CA' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Vengeance_C, SMGraphK2Node_GraphPropertyNode_3_BCC9A1DC459D2FCAA834BB90EE90B0FA) == 0x000CB8, "Member 'USMEvent_Medal_Vengeance_C::SMGraphK2Node_GraphPropertyNode_3_BCC9A1DC459D2FCAA834BB90EE90B0FA' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Vengeance_C, SMGraphK2Node_GraphPropertyNode_2_7F122D444BCC2FF30E4FDE98BAD5D523) == 0x000D00, "Member 'USMEvent_Medal_Vengeance_C::SMGraphK2Node_GraphPropertyNode_2_7F122D444BCC2FF30E4FDE98BAD5D523' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Vengeance_C, SMGraphK2Node_GraphPropertyNode_1_DE50DBCC4BC7E45077EE04B90ECE0987) == 0x000D48, "Member 'USMEvent_Medal_Vengeance_C::SMGraphK2Node_GraphPropertyNode_1_DE50DBCC4BC7E45077EE04B90ECE0987' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Vengeance_C, SMGraphK2Node_GraphPropertyNode_775CAE134B4F5026F98C1994A3DE6E8D) == 0x000D90, "Member 'USMEvent_Medal_Vengeance_C::SMGraphK2Node_GraphPropertyNode_775CAE134B4F5026F98C1994A3DE6E8D' has a wrong offset!");

}

