#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Gotcha

#include "Basic.hpp"


namespace SDK::Params
{

// Function SMEvent_Gotcha.SMEvent_Gotcha_C.ExecuteUbergraph_SMEvent_Gotcha
// 0x00D0 (0x00D0 - 0x0000)
struct SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_MatchEnd_Result*             K2Node_DynamicCast_AsPBConduit_Match_End_Result;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_MatchEnd_Result*             K2Node_DynamicCast_AsPBConduit_Match_End_Result_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_MatchEnd_Result*             K2Node_DynamicCast_AsPBConduit_Match_End_Result_2; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_MatchEnd_Result*             K2Node_DynamicCast_AsPBConduit_Match_End_Result_3; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_MatchEnd_Result*             K2Node_DynamicCast_AsPBConduit_Match_End_Result_4; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_TrophyUnlock*                K2Node_DynamicCast_AsPBConduit_Trophy_Unlock;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_TrophyUnlock*                K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_1;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0084(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_TrophyUnlock*                K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_2;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_MatchEnd_Result*             K2Node_DynamicCast_AsPBConduit_Match_End_Result_5; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_MatchEnd_Result*             K2Node_DynamicCast_AsPBConduit_Match_End_Result_6; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End_1;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha) == 0x000008, "Wrong alignment on SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha");
static_assert(sizeof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha) == 0x0000D0, "Wrong size on SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, EntryPoint) == 0x000000, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::EntryPoint' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBSMState_Event_End) == 0x000008, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBSMState_Event_End' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Match_End_Result) == 0x000018, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Match_End_Result' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Match_End_Result_1) == 0x000028, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Match_End_Result_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Match_End_Result_2) == 0x000038, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Match_End_Result_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Match_End_Result_3) == 0x000048, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Match_End_Result_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_4) == 0x000050, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Match_End_Result_4) == 0x000058, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Match_End_Result_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_5) == 0x000060, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Trophy_Unlock) == 0x000068, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Trophy_Unlock' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_6) == 0x000070, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_1) == 0x000078, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_7) == 0x000080, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, Temp_name_Variable) == 0x000084, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_2) == 0x000090, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_8) == 0x000098, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Match_End_Result_5) == 0x0000A0, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Match_End_Result_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_9) == 0x0000A8, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBConduit_Match_End_Result_6) == 0x0000B0, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBConduit_Match_End_Result_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_10) == 0x0000B8, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_AsPBSMState_Event_End_1) == 0x0000C0, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_AsPBSMState_Event_End_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha, K2Node_DynamicCast_bSuccess_11) == 0x0000C8, "Member 'SMEvent_Gotcha_C_ExecuteUbergraph_SMEvent_Gotcha::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");

}

