#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillByMissile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SMEvent_Kill_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_KillByMissile.SMEvent_KillByMissile_C
// 0x0800 (0x1170 - 0x0970)
class USMEvent_KillByMissile_C final : public USMEvent_Kill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SMEvent_KillByMissile_C;            // 0x0970(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_CD964D2B40D91DF19D8F54AC8DC91DA1; // 0x0978(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_60D7C5C946753FF35A2FE7BDFAF9A432; // 0x0B70(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_17F8CC224B047895314AA390F35DBE8B; // 0x0D50(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_77264C4046257FD99ADA0F8F0623E327; // 0x0F30(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_8CCDC241458BF0306E8568AA87A829CF; // 0x0F78(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_8988F78A4491FF98182A87AF968E137A; // 0x0FC0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_1E4A233D4230BAB53B19CFBCB771793F; // 0x1008(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_11597FA243ACC58D4EC81B95B4D6BEE0; // 0x1050(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_69FF6B0443EE6E0E5A734A8926CB4293; // 0x1098(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_30B6A32A4C2045CFD2F988BEFD5D529F; // 0x10E0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_B4362D20468FA144EEE82C8AE9C27564; // 0x1128(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_KillByMissile(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_33FDD8624AD23E5890C861A7D37FC2C5_2FE103EA43DDE28A684E2A835BFD898C();
	void SMGraphK2Node_GraphPropertyNode_7_8FBC1AC9AE62937ED288E1B431A37B3D_CB5D935C4E1690BBBC9B59B6941B0A59();
	void SMGraphK2Node_GraphPropertyNode_6_40A291E7A5009A35B29F31036F3FD958_85992FE0498FB77825FE86B64EC46DD7();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_1FF24BF643A80A17AE61C38AECD33287();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_C6A71F704E8BE590DE24AE8E8D197436();
	void SMGraphK2Node_GraphPropertyNode_5_F3AECDAD1CC2CD2A9CA4275ED273D038_82970E7F488B5D593ABC18BAF3EADED6();
	void SMGraphK2Node_GraphPropertyNode_2_0BDA2FC44C9469EBD7A6DF389CEB1AC1_9EB1F0864C7D66CC3B31F7BAD20F4C2A();
	void SMGraphK2Node_GraphPropertyNode_3_ACD0717E85580390B867738AAC76A6D4_BC6C672840B8D4DE8CD1528B07FDC5A1();
	void SMGraphK2Node_GraphPropertyNode_4_DFD6AFDC63F75AC1AB56484BC39D0F86_E5DDC6EA4E55F6F870A692822C99CF99();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_KillByMissile_C">();
	}
	static class USMEvent_KillByMissile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_KillByMissile_C>();
	}
};
static_assert(alignof(USMEvent_KillByMissile_C) == 0x000008, "Wrong alignment on USMEvent_KillByMissile_C");
static_assert(sizeof(USMEvent_KillByMissile_C) == 0x001170, "Wrong size on USMEvent_KillByMissile_C");
static_assert(offsetof(USMEvent_KillByMissile_C, UberGraphFrame_SMEvent_KillByMissile_C) == 0x000970, "Member 'USMEvent_KillByMissile_C::UberGraphFrame_SMEvent_KillByMissile_C' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_TransitionResultNode_CD964D2B40D91DF19D8F54AC8DC91DA1) == 0x000978, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_TransitionResultNode_CD964D2B40D91DF19D8F54AC8DC91DA1' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_StateEntryNode_60D7C5C946753FF35A2FE7BDFAF9A432) == 0x000B70, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_StateEntryNode_60D7C5C946753FF35A2FE7BDFAF9A432' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_ConduitResultNode_17F8CC224B047895314AA390F35DBE8B) == 0x000D50, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_ConduitResultNode_17F8CC224B047895314AA390F35DBE8B' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_GraphPropertyNode_7_77264C4046257FD99ADA0F8F0623E327) == 0x000F30, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_GraphPropertyNode_7_77264C4046257FD99ADA0F8F0623E327' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_GraphPropertyNode_6_8CCDC241458BF0306E8568AA87A829CF) == 0x000F78, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_GraphPropertyNode_6_8CCDC241458BF0306E8568AA87A829CF' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_GraphPropertyNode_5_8988F78A4491FF98182A87AF968E137A) == 0x000FC0, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_GraphPropertyNode_5_8988F78A4491FF98182A87AF968E137A' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_GraphPropertyNode_4_1E4A233D4230BAB53B19CFBCB771793F) == 0x001008, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_GraphPropertyNode_4_1E4A233D4230BAB53B19CFBCB771793F' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_GraphPropertyNode_3_11597FA243ACC58D4EC81B95B4D6BEE0) == 0x001050, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_GraphPropertyNode_3_11597FA243ACC58D4EC81B95B4D6BEE0' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_GraphPropertyNode_2_69FF6B0443EE6E0E5A734A8926CB4293) == 0x001098, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_GraphPropertyNode_2_69FF6B0443EE6E0E5A734A8926CB4293' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_GraphPropertyNode_1_30B6A32A4C2045CFD2F988BEFD5D529F) == 0x0010E0, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_GraphPropertyNode_1_30B6A32A4C2045CFD2F988BEFD5D529F' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMissile_C, SMGraphK2Node_GraphPropertyNode_B4362D20468FA144EEE82C8AE9C27564) == 0x001128, "Member 'USMEvent_KillByMissile_C::SMGraphK2Node_GraphPropertyNode_B4362D20468FA144EEE82C8AE9C27564' has a wrong offset!");

}

