#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Level50

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Level50.SMEvent_Level50_C
// 0x0DD0 (0x1478 - 0x06A8)
class USMEvent_Level50_C final : public UPBEvent_LoadPlayerData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_005F0AAC4C662A543479C0A00951C565; // 0x06B0(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_033A429D48C0DCE8193C248D95F65AB2; // 0x08A8(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_00CF8C5D46F61821862C3CBFC0EEE4C4; // 0x0AA0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_087760964C5EDA8C00235AB5C358C6C3; // 0x0C80(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_9C20EC524F92BD799C45D8AE598D6791; // 0x0E60(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_01E636694EF68D52E75E399657256422; // 0x1040(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_392C0D6F49DE15CC98D0978EFF0937ED; // 0x1088(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_0FD794784433A3B42230BD9DBACD655F; // 0x10D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_9FD3968C4A49334506240F88764BD220; // 0x1118(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_AFC5E92C4863AA18C07EACBFAE67AA41; // 0x1160(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_F02F30444EFFE874DB7C4EBCB7792D53; // 0x11A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_579852B14F6071B098B671A2BEFDF035; // 0x11F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_DF760E344237DA4431AB7B8F25FF3BDA; // 0x1238(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_062EE38C4C590E9FDC4297971EC2C2CE; // 0x1280(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_D64C15C4404F4AE07E3FF7802368FC41; // 0x12C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_75503CED415AC499BEA37EA596AC209B; // 0x1310(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_94A22061487EA084D02FCF81473072EF; // 0x1358(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_2C44C0D74B3AEC97D76890B23BF01CAC; // 0x13A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_38B04EA3434573DAD03E18AACD312D57; // 0x13E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8E1283B843EF2B8C2937A79BE205800E; // 0x1430(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Level50(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_6E5B5D804B1C549DA19367A5005F1373_2D3CCFB74D5FF1F2C781FF906A5E411F();
	void SMGraphK2Node_GraphPropertyNode_14_8FBC1AC9AE62937ED288E1B431A37B3D_01004EF74C6BECFCBCC18793F80BD5B7();
	void SMGraphK2Node_GraphPropertyNode_13_40A291E7A5009A35B29F31036F3FD958_3A9B606F44B8C67AC5ADB487ECD717B7();
	void SMGraphK2Node_GraphPropertyNode_0_7E261F3E5C0FA126924682D5024D57B6_755DBD6245A5D3DD0F1FD1AF4F849095();
	void SMGraphK2Node_GraphPropertyNode_12_9B2E76CB0D5642A91285ECD0AD22455D_DB472B484D4CF1887834A8B3DA079C94();
	void SMGraphK2Node_GraphPropertyNode_1_518353AF11A99FDFEEDB66B6418EA001_9ACEC7BC4AD69FFD2F379BA422382476();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_C693676E48B9645576E5A6AA2633EF5D();
	void SMGraphK2Node_GraphPropertyNode_11_1DBA4F3EBF49270A15FCABAE378D5A28_5EC6D3F949D03DCF7ADEFEA88544BF95();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_8B6C04684D475CBEB6A46BA02594AD70();
	void SMGraphK2Node_GraphPropertyNode_4_3DA64C0AB489BBF8EAE713CAEED73534_A446CEB64A0EFAA9E7D9819D71BD3748();
	void SMGraphK2Node_GraphPropertyNode_10_83FB9728653B5875C5D29938A1862987_BD51E6E4487DB49D2B957B99A603AB1D();
	void SMGraphK2Node_GraphPropertyNode_5_5DF5EB69FB5B1350C77BA421EBD2B8FA_2822E53A42EF877C14E7D69B7F301C9B();
	void SMGraphK2Node_GraphPropertyNode_6_924251CE29BC1D7EDCFAB4DB3C0223AE_07FA2BC8411E212DE084BAA3D5A1C087();
	void SMGraphK2Node_GraphPropertyNode_9_471AAF85555CF2679A4535DADFC63770_AEA0FCD549571CB9BB475C8AC45E4D64();
	void SMGraphK2Node_GraphPropertyNode_7_E0C31B330F532F42E5913DACC16F802B_4F2EBB0B4D22BE1E3F980A9837DAD43F();
	void SMGraphK2Node_GraphPropertyNode_8_A22120CDAC3ACF3D903EA80FE84B0006_D51A8682458B0AD4E7960C9CD64B49DB();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Level50_C">();
	}
	static class USMEvent_Level50_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Level50_C>();
	}
};
static_assert(alignof(USMEvent_Level50_C) == 0x000008, "Wrong alignment on USMEvent_Level50_C");
static_assert(sizeof(USMEvent_Level50_C) == 0x001478, "Wrong size on USMEvent_Level50_C");
static_assert(offsetof(USMEvent_Level50_C, UberGraphFrame) == 0x0006A8, "Member 'USMEvent_Level50_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_TransitionResultNode_1_005F0AAC4C662A543479C0A00951C565) == 0x0006B0, "Member 'USMEvent_Level50_C::SMGraphK2Node_TransitionResultNode_1_005F0AAC4C662A543479C0A00951C565' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_TransitionResultNode_033A429D48C0DCE8193C248D95F65AB2) == 0x0008A8, "Member 'USMEvent_Level50_C::SMGraphK2Node_TransitionResultNode_033A429D48C0DCE8193C248D95F65AB2' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_StateEntryNode_00CF8C5D46F61821862C3CBFC0EEE4C4) == 0x000AA0, "Member 'USMEvent_Level50_C::SMGraphK2Node_StateEntryNode_00CF8C5D46F61821862C3CBFC0EEE4C4' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_ConduitResultNode_1_087760964C5EDA8C00235AB5C358C6C3) == 0x000C80, "Member 'USMEvent_Level50_C::SMGraphK2Node_ConduitResultNode_1_087760964C5EDA8C00235AB5C358C6C3' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_ConduitResultNode_9C20EC524F92BD799C45D8AE598D6791) == 0x000E60, "Member 'USMEvent_Level50_C::SMGraphK2Node_ConduitResultNode_9C20EC524F92BD799C45D8AE598D6791' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_14_01E636694EF68D52E75E399657256422) == 0x001040, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_14_01E636694EF68D52E75E399657256422' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_13_392C0D6F49DE15CC98D0978EFF0937ED) == 0x001088, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_13_392C0D6F49DE15CC98D0978EFF0937ED' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_12_0FD794784433A3B42230BD9DBACD655F) == 0x0010D0, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_12_0FD794784433A3B42230BD9DBACD655F' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_11_9FD3968C4A49334506240F88764BD220) == 0x001118, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_11_9FD3968C4A49334506240F88764BD220' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_10_AFC5E92C4863AA18C07EACBFAE67AA41) == 0x001160, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_10_AFC5E92C4863AA18C07EACBFAE67AA41' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_9_F02F30444EFFE874DB7C4EBCB7792D53) == 0x0011A8, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_9_F02F30444EFFE874DB7C4EBCB7792D53' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_8_579852B14F6071B098B671A2BEFDF035) == 0x0011F0, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_8_579852B14F6071B098B671A2BEFDF035' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_7_DF760E344237DA4431AB7B8F25FF3BDA) == 0x001238, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_7_DF760E344237DA4431AB7B8F25FF3BDA' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_6_062EE38C4C590E9FDC4297971EC2C2CE) == 0x001280, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_6_062EE38C4C590E9FDC4297971EC2C2CE' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_5_D64C15C4404F4AE07E3FF7802368FC41) == 0x0012C8, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_5_D64C15C4404F4AE07E3FF7802368FC41' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_4_75503CED415AC499BEA37EA596AC209B) == 0x001310, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_4_75503CED415AC499BEA37EA596AC209B' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_3_94A22061487EA084D02FCF81473072EF) == 0x001358, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_3_94A22061487EA084D02FCF81473072EF' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_2_2C44C0D74B3AEC97D76890B23BF01CAC) == 0x0013A0, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_2_2C44C0D74B3AEC97D76890B23BF01CAC' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_1_38B04EA3434573DAD03E18AACD312D57) == 0x0013E8, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_1_38B04EA3434573DAD03E18AACD312D57' has a wrong offset!");
static_assert(offsetof(USMEvent_Level50_C, SMGraphK2Node_GraphPropertyNode_8E1283B843EF2B8C2937A79BE205800E) == 0x001430, "Member 'USMEvent_Level50_C::SMGraphK2Node_GraphPropertyNode_8E1283B843EF2B8C2937A79BE205800E' has a wrong offset!");

}

