#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Damage_AllCharacters

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Damage_AllCharacters.SMEvent_Damage_AllCharacters_C
// 0x0278 (0x0970 - 0x06F8)
class USMEvent_Damage_AllCharacters_C final : public UPBEvent_Hit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_4DE41F0F4CB0884EE45E7D96E31B1AAC; // 0x0700(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_8C1023094F62BB64546A3DB8CDC2F2B1; // 0x08E0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_E05449F941C936292094DF86A33663B9; // 0x0928(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Damage_AllCharacters(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_CDBA5FBD47A410B8F4EAA690EC20006B();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_A0366ABD4E56594F39424B81FDBFD8B5();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_9EF808FA4B2E7E1A11F578B66B06CF4C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Damage_AllCharacters_C">();
	}
	static class USMEvent_Damage_AllCharacters_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Damage_AllCharacters_C>();
	}
};
static_assert(alignof(USMEvent_Damage_AllCharacters_C) == 0x000008, "Wrong alignment on USMEvent_Damage_AllCharacters_C");
static_assert(sizeof(USMEvent_Damage_AllCharacters_C) == 0x000970, "Wrong size on USMEvent_Damage_AllCharacters_C");
static_assert(offsetof(USMEvent_Damage_AllCharacters_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Damage_AllCharacters_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AllCharacters_C, SMGraphK2Node_StateEntryNode_4DE41F0F4CB0884EE45E7D96E31B1AAC) == 0x000700, "Member 'USMEvent_Damage_AllCharacters_C::SMGraphK2Node_StateEntryNode_4DE41F0F4CB0884EE45E7D96E31B1AAC' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AllCharacters_C, SMGraphK2Node_GraphPropertyNode_1_8C1023094F62BB64546A3DB8CDC2F2B1) == 0x0008E0, "Member 'USMEvent_Damage_AllCharacters_C::SMGraphK2Node_GraphPropertyNode_1_8C1023094F62BB64546A3DB8CDC2F2B1' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AllCharacters_C, SMGraphK2Node_GraphPropertyNode_E05449F941C936292094DF86A33663B9) == 0x000928, "Member 'USMEvent_Damage_AllCharacters_C::SMGraphK2Node_GraphPropertyNode_E05449F941C936292094DF86A33663B9' has a wrong offset!");

}

