#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillByHGWithin50MAndHitOnHead

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_KillByHGWithin50MAndHitOnHead.SMEvent_KillByHGWithin50MAndHitOnHead_C
// 0x11A8 (0x18A0 - 0x06F8)
class USMEvent_KillByHGWithin50MAndHitOnHead_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_2_43120BFA4DC01B2DB42844AA185E4EA3; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_AEA24D704AAF375496DCC0AD73249451; // 0x08F8(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1EB2EB3F46557CE32CC008A2CE31C90A; // 0x0AF0(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_2F6C00264D9A9D43CF4BF3B69554FF52; // 0x0CE8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_2_D1B5A8D64B1F53D3EECFC4B0444C55B3; // 0x0EC8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_B6FAD6E24C83B5ED880CF587EA6CE06A; // 0x10A8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_B46D690A401994F24B7F94A6B32F057F; // 0x1288(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_C614C9924A70255DC0AEDE8D08BDDF45; // 0x1468(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_2740B0D943207F4FC265F0AB48E02525; // 0x14B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_137B3B204D9AAF90FE9AF8A84A6F4378; // 0x14F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_1AD857BF400B756BE778D8A711F2E706; // 0x1540(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_8332A61B49C725C1547314ADEC027BC4; // 0x1588(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_0A39F47349F6E970C00B109D19FD046A; // 0x15D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_9F13C34F42E8A2C7C56E888BF7E0CEFF; // 0x1618(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_4144B0E148A0EA8A598FCBB927060172; // 0x1660(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_2D2AAB8247F1F3F64718D1B16B6DCD09; // 0x16A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_AB8DEFD744F00BDF3FB8B486A3732B70; // 0x16F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_B8AA5CF442076F6FE5ED77885BE992C0; // 0x1738(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_3918BDCC400FAF49C3C536A8A87670F2; // 0x1780(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_1CA890B64D1DF5D929882F8BDE671D14; // 0x17C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_3B0E65BC4F2B64033B8668852CD6A941; // 0x1810(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4D97B0FF4437173788E0C3ABFDC6B9D8; // 0x1858(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_KillByHGWithin50MAndHitOnHead(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_1C07667948C4C1E0D4A06489CFA26909_52C8A32A40157AB1369C659D0145F9FD();
	void SMGraphK2Node_GraphPropertyNode_14_8FBC1AC9AE62937ED288E1B431A37B3D_B160EDF44D204745023E959FD309E003();
	void SMGraphK2Node_GraphPropertyNode_13_40A291E7A5009A35B29F31036F3FD958_CD755A3D43E52F5E7F45BBAFD210BA89();
	void SMGraphK2Node_GraphPropertyNode_12_3DA64C0AB489BBF8EAE713CAEED73534_3673F6FF4734DB3919189C850C698A2B();
	void SMGraphK2Node_GraphPropertyNode_11_518353AF11A99FDFEEDB66B6418EA001_9AB550BE4B90685CEDF77BBB32DE5C63();
	void SMGraphK2Node_GraphPropertyNode_10_25BB90918720EDB29C50585857259E67_D6B4964F4E362290BA2E9BB64AD13059();
	void SMGraphK2Node_GraphPropertyNode_9_890970B83463FD38474A4017AB6505B9_D1DB7D6C49BB3924EF081685E9F5E7A4();
	void SMGraphK2Node_GraphPropertyNode_0_F5981CACB7D9769440965527229065DD_4286BB6B4C7AA03DCA8E019655EE4F86();
	void SMGraphK2Node_GraphPropertyNode_1_DFC5DDF9620519B0185FE1F473B6BA24_AE3776F34E480AEF7C55A19BE0B0E181();
	void SMGraphK2Node_GraphPropertyNode_8_3826ADFE8B326640698CC908CCA3F28F_70CFFA0E407289754F441ABA5B8E1268();
	void SMGraphK2Node_GraphPropertyNode_2_1D5AE3AF69E079B559EF8AF2950B22F1_1C345D4C4683E2B7AE807295E884A323();
	void SMGraphK2Node_GraphPropertyNode_3_DFCF228DCE31F7B7DE4D5893884342DB_65D18C4E466CDF3D69F70597EF136640();
	void SMGraphK2Node_GraphPropertyNode_7_3DA64C0AB489BBF8EAE713CAEED73534_C4D226CE411BF9EDB1870498DF6BF529();
	void SMGraphK2Node_GraphPropertyNode_4_518353AF11A99FDFEEDB66B6418EA001_C27627994D07DB3C7D104982A3242F7F();
	void SMGraphK2Node_GraphPropertyNode_5_3DA64C0AB489BBF8EAE713CAEED73534_DE6057824650CD97A6688FA0461EC43C();
	void SMGraphK2Node_GraphPropertyNode_6_518353AF11A99FDFEEDB66B6418EA001_B12E8A8A4F1B6F4197D00DB241AB0FD8();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_KillByHGWithin50MAndHitOnHead_C">();
	}
	static class USMEvent_KillByHGWithin50MAndHitOnHead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_KillByHGWithin50MAndHitOnHead_C>();
	}
};
static_assert(alignof(USMEvent_KillByHGWithin50MAndHitOnHead_C) == 0x000008, "Wrong alignment on USMEvent_KillByHGWithin50MAndHitOnHead_C");
static_assert(sizeof(USMEvent_KillByHGWithin50MAndHitOnHead_C) == 0x0018A0, "Wrong size on USMEvent_KillByHGWithin50MAndHitOnHead_C");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_TransitionResultNode_2_43120BFA4DC01B2DB42844AA185E4EA3) == 0x000700, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_TransitionResultNode_2_43120BFA4DC01B2DB42844AA185E4EA3' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_TransitionResultNode_1_AEA24D704AAF375496DCC0AD73249451) == 0x0008F8, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_TransitionResultNode_1_AEA24D704AAF375496DCC0AD73249451' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_TransitionResultNode_1EB2EB3F46557CE32CC008A2CE31C90A) == 0x000AF0, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_TransitionResultNode_1EB2EB3F46557CE32CC008A2CE31C90A' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_StateEntryNode_2F6C00264D9A9D43CF4BF3B69554FF52) == 0x000CE8, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_StateEntryNode_2F6C00264D9A9D43CF4BF3B69554FF52' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_ConduitResultNode_2_D1B5A8D64B1F53D3EECFC4B0444C55B3) == 0x000EC8, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_ConduitResultNode_2_D1B5A8D64B1F53D3EECFC4B0444C55B3' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_ConduitResultNode_1_B6FAD6E24C83B5ED880CF587EA6CE06A) == 0x0010A8, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_ConduitResultNode_1_B6FAD6E24C83B5ED880CF587EA6CE06A' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_ConduitResultNode_B46D690A401994F24B7F94A6B32F057F) == 0x001288, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_ConduitResultNode_B46D690A401994F24B7F94A6B32F057F' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_14_C614C9924A70255DC0AEDE8D08BDDF45) == 0x001468, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_14_C614C9924A70255DC0AEDE8D08BDDF45' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_13_2740B0D943207F4FC265F0AB48E02525) == 0x0014B0, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_13_2740B0D943207F4FC265F0AB48E02525' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_12_137B3B204D9AAF90FE9AF8A84A6F4378) == 0x0014F8, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_12_137B3B204D9AAF90FE9AF8A84A6F4378' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_11_1AD857BF400B756BE778D8A711F2E706) == 0x001540, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_11_1AD857BF400B756BE778D8A711F2E706' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_10_8332A61B49C725C1547314ADEC027BC4) == 0x001588, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_10_8332A61B49C725C1547314ADEC027BC4' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_9_0A39F47349F6E970C00B109D19FD046A) == 0x0015D0, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_9_0A39F47349F6E970C00B109D19FD046A' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_8_9F13C34F42E8A2C7C56E888BF7E0CEFF) == 0x001618, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_8_9F13C34F42E8A2C7C56E888BF7E0CEFF' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_7_4144B0E148A0EA8A598FCBB927060172) == 0x001660, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_7_4144B0E148A0EA8A598FCBB927060172' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_6_2D2AAB8247F1F3F64718D1B16B6DCD09) == 0x0016A8, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_6_2D2AAB8247F1F3F64718D1B16B6DCD09' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_5_AB8DEFD744F00BDF3FB8B486A3732B70) == 0x0016F0, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_5_AB8DEFD744F00BDF3FB8B486A3732B70' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_4_B8AA5CF442076F6FE5ED77885BE992C0) == 0x001738, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_4_B8AA5CF442076F6FE5ED77885BE992C0' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_3_3918BDCC400FAF49C3C536A8A87670F2) == 0x001780, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_3_3918BDCC400FAF49C3C536A8A87670F2' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_2_1CA890B64D1DF5D929882F8BDE671D14) == 0x0017C8, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_2_1CA890B64D1DF5D929882F8BDE671D14' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_1_3B0E65BC4F2B64033B8668852CD6A941) == 0x001810, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_1_3B0E65BC4F2B64033B8668852CD6A941' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByHGWithin50MAndHitOnHead_C, SMGraphK2Node_GraphPropertyNode_4D97B0FF4437173788E0C3ABFDC6B9D8) == 0x001858, "Member 'USMEvent_KillByHGWithin50MAndHitOnHead_C::SMGraphK2Node_GraphPropertyNode_4D97B0FF4437173788E0C3ABFDC6B9D8' has a wrong offset!");

}

