#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_IDW

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_IDW.SMEvent_Kill_IDW_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_IDW_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_3D913EC14972960EFC58D6B2D6A7251D; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_680FF43942B268A9A40B949FBB85CF35; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_0000C85943EF9BB5923C7F93CBF63C0F; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_E6A1634241251E920E3EFD9DF11A7ECD; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_B600B2E2411B7221A3B25E9312AE37EE; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_F033D66B4D26BCA07B3C30BEE692749E; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_D4876C0E4AE5366C4B215B8525063A6C; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_D940844643A9281C38761A8D5E24E9D1; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_D77DC49447E7FB72ECB2BA98BD7D3C66; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_9228951B426A4BAA6DDF409B4E193495; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_B15AF6014D8508F02353419B2665168A; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_37F97AC24948A344ABB2F8B73E1B047B; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_54DB4EE24C7D4DE241F76E834F113A14; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1E0B1CFF41CE8070E87922ADF4D5B393; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_IDW(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_A1D6C38C46B89C6F30D3E9973DA52FB2();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_50AA92BE44FAD1DE3BEA5D81940FD456();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_1111868C406E9F2732DB8B9D15C8A16B();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_0AA0202F46C7028164AA1FA063CE75EF();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_EE72C9C7423C6295C57498A846864239();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_974950894EF0A7D281DBF1A41706AD5A();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_DF452B2A45A724033D3654A55977EC90();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_464252894DF2B0215C7D5492BE84909D();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_125653CE434E2D335DE3EEA335FF55DC();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_7D238EDF4CCD6A84AF849D98CEE37E3A();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_A4BFC5194713D5C3D79A95870EB7375F();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_71CBE8414018F8D645F70E8C8024883A();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_IDW_C">();
	}
	static class USMEvent_Kill_IDW_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_IDW_C>();
	}
};
static_assert(alignof(USMEvent_Kill_IDW_C) == 0x000008, "Wrong alignment on USMEvent_Kill_IDW_C");
static_assert(sizeof(USMEvent_Kill_IDW_C) == 0x000FD0, "Wrong size on USMEvent_Kill_IDW_C");
static_assert(offsetof(USMEvent_Kill_IDW_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_IDW_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_TransitionResultNode_3D913EC14972960EFC58D6B2D6A7251D) == 0x000700, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_TransitionResultNode_3D913EC14972960EFC58D6B2D6A7251D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_StateEntryNode_680FF43942B268A9A40B949FBB85CF35) == 0x0008F8, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_StateEntryNode_680FF43942B268A9A40B949FBB85CF35' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_ConduitResultNode_0000C85943EF9BB5923C7F93CBF63C0F) == 0x000AD8, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_ConduitResultNode_0000C85943EF9BB5923C7F93CBF63C0F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_10_E6A1634241251E920E3EFD9DF11A7ECD) == 0x000CB8, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_10_E6A1634241251E920E3EFD9DF11A7ECD' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_9_B600B2E2411B7221A3B25E9312AE37EE) == 0x000D00, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_9_B600B2E2411B7221A3B25E9312AE37EE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_8_F033D66B4D26BCA07B3C30BEE692749E) == 0x000D48, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_8_F033D66B4D26BCA07B3C30BEE692749E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_7_D4876C0E4AE5366C4B215B8525063A6C) == 0x000D90, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_7_D4876C0E4AE5366C4B215B8525063A6C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_6_D940844643A9281C38761A8D5E24E9D1) == 0x000DD8, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_6_D940844643A9281C38761A8D5E24E9D1' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_5_D77DC49447E7FB72ECB2BA98BD7D3C66) == 0x000E20, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_5_D77DC49447E7FB72ECB2BA98BD7D3C66' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_4_9228951B426A4BAA6DDF409B4E193495) == 0x000E68, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_4_9228951B426A4BAA6DDF409B4E193495' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_3_B15AF6014D8508F02353419B2665168A) == 0x000EB0, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_3_B15AF6014D8508F02353419B2665168A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_2_37F97AC24948A344ABB2F8B73E1B047B) == 0x000EF8, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_2_37F97AC24948A344ABB2F8B73E1B047B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_1_54DB4EE24C7D4DE241F76E834F113A14) == 0x000F40, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_1_54DB4EE24C7D4DE241F76E834F113A14' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_IDW_C, SMGraphK2Node_GraphPropertyNode_1E0B1CFF41CE8070E87922ADF4D5B393) == 0x000F88, "Member 'USMEvent_Kill_IDW_C::SMGraphK2Node_GraphPropertyNode_1E0B1CFF41CE8070E87922ADF4D5B393' has a wrong offset!");

}

