#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillByMeleeUsingSpiker

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_KillByMeleeUsingSpiker.SMEvent_KillByMeleeUsingSpiker_C
// 0x07B8 (0x0EB0 - 0x06F8)
class USMEvent_KillByMeleeUsingSpiker_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1F61915346C07232715D8C9735EE1FF0; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_A9B8CEE34F1AACF1815DEA8AAC5F516C; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_D3D1550647620E10DD65B087BA59A30D; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_F4BA50FC48278B31655C47A87BC21026; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_A93D08F247A9F616CEF568866884A5CE; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_C76CC9AF40D4833E67C187B33F4214C3; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_AFCAAD614B0BF967EAA2C08057BD10F7; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_D6E287E94980B1D41BAE33AF37FDE15D; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_F61611D744F4BFE3C2E07C9B1F53E3DD; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_FEB4932A4022AFD4FB24FAA67A52FCFB; // 0x0E68(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_KillByMeleeUsingSpiker(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_985C644C448B22901AFE63BB42526456_8E94450E4BC79E2E85CFD7AD7D220BD3();
	void SMGraphK2Node_GraphPropertyNode_6_3DA64C0AB489BBF8EAE713CAEED73534_626153174271A54CDFB5838F644F2D99();
	void SMGraphK2Node_GraphPropertyNode_5_518353AF11A99FDFEEDB66B6418EA001_5D8610614430D96369BC9DB0C1FAEC70();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_AF7F21D949656D80EB7488B46DC67E6C();
	void SMGraphK2Node_GraphPropertyNode_4_FD357E827C2CA7B0852D9AA1A0C7FD01_F8F0A680420C981F1DCADD9D8BCAC365();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_B76F4E344F1D283B060CE0AA06671261();
	void SMGraphK2Node_GraphPropertyNode_2_06D43A19CF95A5CD050B1A0A4B64B1F9_93D0137A4C898E343871FBB3CBB0155F();
	void SMGraphK2Node_GraphPropertyNode_3_FD651B701644522C694358AF07DEF14F_67F12B03433FF57D2E9081A781DD01E8();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_KillByMeleeUsingSpiker_C">();
	}
	static class USMEvent_KillByMeleeUsingSpiker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_KillByMeleeUsingSpiker_C>();
	}
};
static_assert(alignof(USMEvent_KillByMeleeUsingSpiker_C) == 0x000008, "Wrong alignment on USMEvent_KillByMeleeUsingSpiker_C");
static_assert(sizeof(USMEvent_KillByMeleeUsingSpiker_C) == 0x000EB0, "Wrong size on USMEvent_KillByMeleeUsingSpiker_C");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_KillByMeleeUsingSpiker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_TransitionResultNode_1F61915346C07232715D8C9735EE1FF0) == 0x000700, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_TransitionResultNode_1F61915346C07232715D8C9735EE1FF0' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_ConduitResultNode_A9B8CEE34F1AACF1815DEA8AAC5F516C) == 0x0008F8, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_ConduitResultNode_A9B8CEE34F1AACF1815DEA8AAC5F516C' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_StateEntryNode_D3D1550647620E10DD65B087BA59A30D) == 0x000AD8, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_StateEntryNode_D3D1550647620E10DD65B087BA59A30D' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_GraphPropertyNode_6_F4BA50FC48278B31655C47A87BC21026) == 0x000CB8, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_GraphPropertyNode_6_F4BA50FC48278B31655C47A87BC21026' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_GraphPropertyNode_5_A93D08F247A9F616CEF568866884A5CE) == 0x000D00, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_GraphPropertyNode_5_A93D08F247A9F616CEF568866884A5CE' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_GraphPropertyNode_4_C76CC9AF40D4833E67C187B33F4214C3) == 0x000D48, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_GraphPropertyNode_4_C76CC9AF40D4833E67C187B33F4214C3' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_GraphPropertyNode_3_AFCAAD614B0BF967EAA2C08057BD10F7) == 0x000D90, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_GraphPropertyNode_3_AFCAAD614B0BF967EAA2C08057BD10F7' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_GraphPropertyNode_2_D6E287E94980B1D41BAE33AF37FDE15D) == 0x000DD8, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_GraphPropertyNode_2_D6E287E94980B1D41BAE33AF37FDE15D' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_GraphPropertyNode_1_F61611D744F4BFE3C2E07C9B1F53E3DD) == 0x000E20, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_GraphPropertyNode_1_F61611D744F4BFE3C2E07C9B1F53E3DD' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeUsingSpiker_C, SMGraphK2Node_GraphPropertyNode_FEB4932A4022AFD4FB24FAA67A52FCFB) == 0x000E68, "Member 'USMEvent_KillByMeleeUsingSpiker_C::SMGraphK2Node_GraphPropertyNode_FEB4932A4022AFD4FB24FAA67A52FCFB' has a wrong offset!");

}

