#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Damage_CDP350

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Damage_CDP350.SMEvent_Damage_CDP350_C
// 0x0E60 (0x1558 - 0x06F8)
class USMEvent_Damage_CDP350_C final : public UPBEvent_Hit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_05363AE042118243CCBFC98EEBC4F02E; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_4360D6524EFE035A90F2E0B8F6CFE4A5; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_C663A7684289E02D623A119EE949C5F8; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_40550D424A0F819AF21378B10AC29FF7; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_C18812AD425BC48CB2C6E98C46D41D44; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_16_9310F6B741A9FDAD277430A957866E90; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_15_513D816E406CECA0B72487AF31A494C8; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_9133F1774A5F90FAEFD58FA5A11565CE; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_E63935074D97D12FC1CC5CA541EE4265; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_FC2BEB5D45A10DC2BD4B928BCAB34176; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_06E674204C629BB49F5522A0AC969958; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_FF99B99042921F8C5EEEF89489C864DB; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_FB459B00472F5D32A399DF891E407CAF; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_2D80D36C4DEE76CCA9BE89B68D0D658F; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_6F778E4244738BF1A3303FA85988C0E8; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_C8A80FEA405447E1F76D27B80A7A656E; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_C8C10A25498DF3EF8EA2C3BEA0A278D2; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_F1C5E29C4BFE2CF754DACE8A32771610; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_8132900A4694017F2581C6ADB0D1B259; // 0x1438(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_7CDBFCC543863960F39A3CB4A486BC0F; // 0x1480(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_FA2D0B274C3B7249C3601CAA8246F349; // 0x14C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_76E594EC4C2F263BB28178AB6E96C338; // 0x1510(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Damage_CDP350(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_886C4850412A60432E98BA97087019B3();
	void SMGraphK2Node_GraphPropertyNode_16_3DA64C0AB489BBF8EAE713CAEED73534_7531F4694E710F7C87F0209F476E60DB();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_0127DF534857BC7C69E750A2E296E347();
	void SMGraphK2Node_GraphPropertyNode_15_518353AF11A99FDFEEDB66B6418EA001_6018C09D4C7E34F5B288D58E24537948();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_3F1EBE0D42C48C49D1911F99A182BEE1();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_3758218E46FF63C94CA137A631F44546();
	void SMGraphK2Node_GraphPropertyNode_14_AC0B850875368C03D3659202C66244CC_B6087A9F49E8BD7A8FF5F9A57B927C22();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_276E9E2E4760D4F775A32B8C4BF6618B();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_16D8DEEE4BC4E255A1BCB2BF994806E6();
	void SMGraphK2Node_GraphPropertyNode_13_033BB48819393947FEB084A7CF4C0D58_0BBD9DBA49BB64EDA4F7D89977583507();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_841BD42344F9FBA6DD9F2DAD9FA12004();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_45FAC7AC401C390A3D8004AAD387D2CF();
	void SMGraphK2Node_GraphPropertyNode_12_7B1241F1B3164E6D5F4F996B354D6D3B_CF87B9684C97A4A0B1BF8696E1218A4E();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_2E1C052A41C7ED92161C77B122F939A5();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_470B63E64E06FFB8B9752497F40643DC();
	void SMGraphK2Node_GraphPropertyNode_11_6424367FC4B9B3C2EA7FFCDB60D88894_94E0F00A4A255E0AA36658B317585A0F();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_2350F8D24A154790A5FF188FF8094CBE();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_ABBC6C0F4C09498CE0A142B46FE91B94();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Damage_CDP350_C">();
	}
	static class USMEvent_Damage_CDP350_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Damage_CDP350_C>();
	}
};
static_assert(alignof(USMEvent_Damage_CDP350_C) == 0x000008, "Wrong alignment on USMEvent_Damage_CDP350_C");
static_assert(sizeof(USMEvent_Damage_CDP350_C) == 0x001558, "Wrong size on USMEvent_Damage_CDP350_C");
static_assert(offsetof(USMEvent_Damage_CDP350_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Damage_CDP350_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_TransitionResultNode_1_05363AE042118243CCBFC98EEBC4F02E) == 0x000700, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_TransitionResultNode_1_05363AE042118243CCBFC98EEBC4F02E' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_TransitionResultNode_4360D6524EFE035A90F2E0B8F6CFE4A5) == 0x0008F8, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_TransitionResultNode_4360D6524EFE035A90F2E0B8F6CFE4A5' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_ConduitResultNode_1_C663A7684289E02D623A119EE949C5F8) == 0x000AF0, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_ConduitResultNode_1_C663A7684289E02D623A119EE949C5F8' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_StateEntryNode_40550D424A0F819AF21378B10AC29FF7) == 0x000CD0, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_StateEntryNode_40550D424A0F819AF21378B10AC29FF7' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_ConduitResultNode_C18812AD425BC48CB2C6E98C46D41D44) == 0x000EB0, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_ConduitResultNode_C18812AD425BC48CB2C6E98C46D41D44' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_16_9310F6B741A9FDAD277430A957866E90) == 0x001090, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_16_9310F6B741A9FDAD277430A957866E90' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_15_513D816E406CECA0B72487AF31A494C8) == 0x0010D8, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_15_513D816E406CECA0B72487AF31A494C8' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_14_9133F1774A5F90FAEFD58FA5A11565CE) == 0x001120, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_14_9133F1774A5F90FAEFD58FA5A11565CE' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_13_E63935074D97D12FC1CC5CA541EE4265) == 0x001168, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_13_E63935074D97D12FC1CC5CA541EE4265' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_12_FC2BEB5D45A10DC2BD4B928BCAB34176) == 0x0011B0, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_12_FC2BEB5D45A10DC2BD4B928BCAB34176' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_11_06E674204C629BB49F5522A0AC969958) == 0x0011F8, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_11_06E674204C629BB49F5522A0AC969958' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_10_FF99B99042921F8C5EEEF89489C864DB) == 0x001240, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_10_FF99B99042921F8C5EEEF89489C864DB' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_9_FB459B00472F5D32A399DF891E407CAF) == 0x001288, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_9_FB459B00472F5D32A399DF891E407CAF' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_8_2D80D36C4DEE76CCA9BE89B68D0D658F) == 0x0012D0, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_8_2D80D36C4DEE76CCA9BE89B68D0D658F' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_7_6F778E4244738BF1A3303FA85988C0E8) == 0x001318, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_7_6F778E4244738BF1A3303FA85988C0E8' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_6_C8A80FEA405447E1F76D27B80A7A656E) == 0x001360, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_6_C8A80FEA405447E1F76D27B80A7A656E' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_5_C8C10A25498DF3EF8EA2C3BEA0A278D2) == 0x0013A8, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_5_C8C10A25498DF3EF8EA2C3BEA0A278D2' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_4_F1C5E29C4BFE2CF754DACE8A32771610) == 0x0013F0, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_4_F1C5E29C4BFE2CF754DACE8A32771610' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_3_8132900A4694017F2581C6ADB0D1B259) == 0x001438, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_3_8132900A4694017F2581C6ADB0D1B259' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_2_7CDBFCC543863960F39A3CB4A486BC0F) == 0x001480, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_2_7CDBFCC543863960F39A3CB4A486BC0F' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_1_FA2D0B274C3B7249C3601CAA8246F349) == 0x0014C8, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_1_FA2D0B274C3B7249C3601CAA8246F349' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_CDP350_C, SMGraphK2Node_GraphPropertyNode_76E594EC4C2F263BB28178AB6E96C338) == 0x001510, "Member 'USMEvent_Damage_CDP350_C::SMGraphK2Node_GraphPropertyNode_76E594EC4C2F263BB28178AB6E96C338' has a wrong offset!");

}

