#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_KillAssist

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_KillAssist.SMEvent_Medal_KillAssist_C
// 0x0278 (0x0928 - 0x06B0)
class USMEvent_Medal_KillAssist_C final : public UPBEvent_KillAssist
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_6BCDD78649F35F262920FC880939455C; // 0x06B8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_B82931D4420C62C082251AA58C3D1E20; // 0x0898(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8D23099542A914F28D21C0B9DFF2EA62; // 0x08E0(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_KillAssist(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_0A3552C340254C9AF9BE54B9B2DE736A();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_A97FF30843BB964D41ADE7AAE64BD621();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_F163AF1F4623E3C7E36207A717D2824A();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_KillAssist_C">();
	}
	static class USMEvent_Medal_KillAssist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_KillAssist_C>();
	}
};
static_assert(alignof(USMEvent_Medal_KillAssist_C) == 0x000008, "Wrong alignment on USMEvent_Medal_KillAssist_C");
static_assert(sizeof(USMEvent_Medal_KillAssist_C) == 0x000928, "Wrong size on USMEvent_Medal_KillAssist_C");
static_assert(offsetof(USMEvent_Medal_KillAssist_C, UberGraphFrame) == 0x0006B0, "Member 'USMEvent_Medal_KillAssist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillAssist_C, SMGraphK2Node_StateEntryNode_6BCDD78649F35F262920FC880939455C) == 0x0006B8, "Member 'USMEvent_Medal_KillAssist_C::SMGraphK2Node_StateEntryNode_6BCDD78649F35F262920FC880939455C' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillAssist_C, SMGraphK2Node_GraphPropertyNode_1_B82931D4420C62C082251AA58C3D1E20) == 0x000898, "Member 'USMEvent_Medal_KillAssist_C::SMGraphK2Node_GraphPropertyNode_1_B82931D4420C62C082251AA58C3D1E20' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillAssist_C, SMGraphK2Node_GraphPropertyNode_8D23099542A914F28D21C0B9DFF2EA62) == 0x0008E0, "Member 'USMEvent_Medal_KillAssist_C::SMGraphK2Node_GraphPropertyNode_8D23099542A914F28D21C0B9DFF2EA62' has a wrong offset!");

}

