#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvnet_WeaponMaster

#include "Basic.hpp"


namespace SDK::Params
{

// Function SMEvnet_WeaponMaster.SMEvnet_WeaponMaster_C.ExecuteUbergraph_SMEvnet_WeaponMaster
// 0x0088 (0x0088 - 0x0000)
struct SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_FinishedProgression*         K2Node_DynamicCast_AsPBConduit_Finished_Progression; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_TrophyUnlock*                K2Node_DynamicCast_AsPBConduit_Trophy_Unlock;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_FinishedProgression*         K2Node_DynamicCast_AsPBConduit_Finished_Progression_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_TrophyUnlock*                K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_1;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_FinishedProgression*         K2Node_DynamicCast_AsPBConduit_Finished_Progression_2; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_TrophyUnlock*                K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_2;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster) == 0x000008, "Wrong alignment on SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster");
static_assert(sizeof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster) == 0x000088, "Wrong size on SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, EntryPoint) == 0x000000, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_AsPBConduit_Finished_Progression) == 0x000008, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_AsPBConduit_Finished_Progression' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_AsPBConduit_Trophy_Unlock) == 0x000018, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_AsPBConduit_Trophy_Unlock' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_AsPBConduit_Finished_Progression_1) == 0x000028, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_AsPBConduit_Finished_Progression_1' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_1) == 0x000038, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_1' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_AsPBConduit_Finished_Progression_2) == 0x000048, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_AsPBConduit_Finished_Progression_2' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_bSuccess_4) == 0x000050, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_2) == 0x000058, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_AsPBConduit_Trophy_Unlock_2' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_bSuccess_5) == 0x000060, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_AsPBSMState_Event_End) == 0x000068, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_AsPBSMState_Event_End' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_bSuccess_6) == 0x000070, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_AsPBSMState_Event_End_1) == 0x000078, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_AsPBSMState_Event_End_1' has a wrong offset!");
static_assert(offsetof(SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster, K2Node_DynamicCast_bSuccess_7) == 0x000080, "Member 'SMEvnet_WeaponMaster_C_ExecuteUbergraph_SMEvnet_WeaponMaster::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");

}

