#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_All

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_All.SMEvent_Kill_All_C
// 0x0890 (0x0F88 - 0x06F8)
class USMEvent_Kill_All_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_EDA87B584459BB62531C5F95EC7BB495; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_44B8DF8E4EDDF6017583268DCEB4165F; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_8DA7B5A54168B10CAB436599CCD5919B; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_37149950483EA90A512D728CA130E049; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_F9788B5148CFF3B859573BB4FC970DEA; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_3B08CB5D46E70D4841932296A490527C; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_50120B164606F3CF722A16ADD9F20221; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_1FB38AE347EE1F52CB7A47B7CCB18356; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_FB6B79B84C5DD14599AD1FA611ABA422; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_F05653F0400F473944BA32A73555F896; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_90174FD643BC7AACAB35268D20BF5A5F; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_F1BDAC9D4062FC7B3A2FAE83165E73E5; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_D908D7294A5F36253B4D6EA2779F6E4A; // 0x0F40(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_All(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_E673615148EEA2AE9B8B91AD91C97A2C();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_9BA56B85425842099BBA92BB17CFBE0B();
	void SMGraphK2Node_GraphPropertyNode_9_B601E33420FD8DB89F45F490AC78A2A4_6B0B58E949ADD39C00DCD089624814A9();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_AA6F58CF432A51D1E90B059EFF0A773F();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_E1603AD84577BCD5CAD9F1A3C85C46B9();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_FC6A329F47493FADF4AB76866DDA0265();
	void SMGraphK2Node_GraphPropertyNode_8_A352FBB675815ECF469750B059BEAE93_AF91BE4947ED94F2CC637DA2EB7D99DD();
	void SMGraphK2Node_GraphPropertyNode_4_4499195241432879F5E6F782CA615D8D_757F55C84F9F391923AC16832BD3585F();
	void SMGraphK2Node_GraphPropertyNode_5_1FEC1C7B291E221A664CAF0FBCD134AE_4DB89E3B49539B2F9B3B9EBC1F804EA1();
	void SMGraphK2Node_GraphPropertyNode_6_472A91F7915F4E7D738E25518EFC60CA_B7686F694D6C67D0ADB758BE62EBA187();
	void SMGraphK2Node_GraphPropertyNode_7_758DD5C92F524B9AFF9BBD3458140C08_444854D541776A66D6739C9648CA0E61();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_All_C">();
	}
	static class USMEvent_Kill_All_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_All_C>();
	}
};
static_assert(alignof(USMEvent_Kill_All_C) == 0x000008, "Wrong alignment on USMEvent_Kill_All_C");
static_assert(sizeof(USMEvent_Kill_All_C) == 0x000F88, "Wrong size on USMEvent_Kill_All_C");
static_assert(offsetof(USMEvent_Kill_All_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_All_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_TransitionResultNode_EDA87B584459BB62531C5F95EC7BB495) == 0x000700, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_TransitionResultNode_EDA87B584459BB62531C5F95EC7BB495' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_ConduitResultNode_44B8DF8E4EDDF6017583268DCEB4165F) == 0x0008F8, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_ConduitResultNode_44B8DF8E4EDDF6017583268DCEB4165F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_StateEntryNode_8DA7B5A54168B10CAB436599CCD5919B) == 0x000AD8, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_StateEntryNode_8DA7B5A54168B10CAB436599CCD5919B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_9_37149950483EA90A512D728CA130E049) == 0x000CB8, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_9_37149950483EA90A512D728CA130E049' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_8_F9788B5148CFF3B859573BB4FC970DEA) == 0x000D00, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_8_F9788B5148CFF3B859573BB4FC970DEA' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_7_3B08CB5D46E70D4841932296A490527C) == 0x000D48, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_7_3B08CB5D46E70D4841932296A490527C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_6_50120B164606F3CF722A16ADD9F20221) == 0x000D90, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_6_50120B164606F3CF722A16ADD9F20221' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_5_1FB38AE347EE1F52CB7A47B7CCB18356) == 0x000DD8, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_5_1FB38AE347EE1F52CB7A47B7CCB18356' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_4_FB6B79B84C5DD14599AD1FA611ABA422) == 0x000E20, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_4_FB6B79B84C5DD14599AD1FA611ABA422' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_3_F05653F0400F473944BA32A73555F896) == 0x000E68, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_3_F05653F0400F473944BA32A73555F896' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_2_90174FD643BC7AACAB35268D20BF5A5F) == 0x000EB0, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_2_90174FD643BC7AACAB35268D20BF5A5F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_1_F1BDAC9D4062FC7B3A2FAE83165E73E5) == 0x000EF8, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_1_F1BDAC9D4062FC7B3A2FAE83165E73E5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_All_C, SMGraphK2Node_GraphPropertyNode_D908D7294A5F36253B4D6EA2779F6E4A) == 0x000F40, "Member 'USMEvent_Kill_All_C::SMGraphK2Node_GraphPropertyNode_D908D7294A5F36253B4D6EA2779F6E4A' has a wrong offset!");

}

