#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_BackStab

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_BackStab.SMEvent_Medal_BackStab_C
// 0x0CF8 (0x13F0 - 0x06F8)
class USMEvent_Medal_BackStab_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_8D98150144F90C2F923BD193F0FE224B; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_E11BF5A84E6333DCFC70D0B66291EFE1; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_412807DF44FE5E7414EE03A54D839DB8; // 0x0AF0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_94DE991449019EAB411E728D4A7B0A84; // 0x0CD0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_B378E74248E3672CF45D30BAAB5C3982; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_8D7FF9A24FE55C02ABC8AFAAFCB1E043; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_4D4083154B1DD2D814320B865AABBEB8; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_03EBB7C441142AE3126B38906424F8F5; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_FFEA9A064987C27566292082AC7D801C; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_98C3249043C31E87EB7F57B417EEE4FA; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_9CC550A9419C2AC7B8A82285BED66A05; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_2BED5B024EF071A686FE69AD3AE7B288; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_BC30A4894B0BB48B9D61E9922FA50614; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_2AA1FF594824C678114090B49DC069CF; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_5D7FD57E440C1F5370924C83F4571EF8; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_17D05C2C4700CF7E7181A7904F8ADC75; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_09C4BFB6499AABFA0CD4B3A64BF1C30D; // 0x13A8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_BackStab(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_58F8A82A483634B90F36ECA31C684304();
	void SMGraphK2Node_GraphPropertyNode_11_3DA64C0AB489BBF8EAE713CAEED73534_FAF5AD924CFEDB1DF1BA5CB6208BB5F9();
	void SMGraphK2Node_GraphPropertyNode_10_518353AF11A99FDFEEDB66B6418EA001_870B3D094DBD222A7DAB2ABDD4AD9A1B();
	void SMGraphK2Node_GraphPropertyNode_9_393D5B70F9C569A950787DCDD37CDAB1_AFECB2074EA4E255F1D34097609EE543();
	void SMGraphK2Node_GraphPropertyNode_8_7EF4DB02AE2AF379194452C547725AA0_3F4F3EA64B09E94CEDF96C90FF1CA0AC();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_1159341B4623C85803C2998D37C098D5();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_6D8008E645B42101B2FF508C1877897B();
	void SMGraphK2Node_GraphPropertyNode_7_1D5AE3AF69E079B559EF8AF2950B22F1_8E3511814C9FCBACDE2AC9A3943264F6();
	void SMGraphK2Node_GraphPropertyNode_2_DFCF228DCE31F7B7DE4D5893884342DB_DC2FC3DA4BF58EBD80D317888AACC3FE();
	void SMGraphK2Node_GraphPropertyNode_3_DFC5DDF9620519B0185FE1F473B6BA24_7709C3E3418EDE6D1A744CBEA2C41F48();
	void SMGraphK2Node_GraphPropertyNode_6_3DA64C0AB489BBF8EAE713CAEED73534_9430954043DF84CFBB0BA1A8EE22E2C6();
	void SMGraphK2Node_GraphPropertyNode_4_F5981CACB7D9769440965527229065DD_724A12034072E8E56543EAA98E9959AC();
	void SMGraphK2Node_GraphPropertyNode_5_518353AF11A99FDFEEDB66B6418EA001_4625FA2E481AF8194E3E04A84646FB68();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_BackStab_C">();
	}
	static class USMEvent_Medal_BackStab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_BackStab_C>();
	}
};
static_assert(alignof(USMEvent_Medal_BackStab_C) == 0x000008, "Wrong alignment on USMEvent_Medal_BackStab_C");
static_assert(sizeof(USMEvent_Medal_BackStab_C) == 0x0013F0, "Wrong size on USMEvent_Medal_BackStab_C");
static_assert(offsetof(USMEvent_Medal_BackStab_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_BackStab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_TransitionResultNode_1_8D98150144F90C2F923BD193F0FE224B) == 0x000700, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_TransitionResultNode_1_8D98150144F90C2F923BD193F0FE224B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_TransitionResultNode_E11BF5A84E6333DCFC70D0B66291EFE1) == 0x0008F8, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_TransitionResultNode_E11BF5A84E6333DCFC70D0B66291EFE1' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_ConduitResultNode_1_412807DF44FE5E7414EE03A54D839DB8) == 0x000AF0, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_ConduitResultNode_1_412807DF44FE5E7414EE03A54D839DB8' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_ConduitResultNode_94DE991449019EAB411E728D4A7B0A84) == 0x000CD0, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_ConduitResultNode_94DE991449019EAB411E728D4A7B0A84' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_StateEntryNode_B378E74248E3672CF45D30BAAB5C3982) == 0x000EB0, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_StateEntryNode_B378E74248E3672CF45D30BAAB5C3982' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_11_8D7FF9A24FE55C02ABC8AFAAFCB1E043) == 0x001090, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_11_8D7FF9A24FE55C02ABC8AFAAFCB1E043' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_10_4D4083154B1DD2D814320B865AABBEB8) == 0x0010D8, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_10_4D4083154B1DD2D814320B865AABBEB8' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_9_03EBB7C441142AE3126B38906424F8F5) == 0x001120, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_9_03EBB7C441142AE3126B38906424F8F5' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_8_FFEA9A064987C27566292082AC7D801C) == 0x001168, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_8_FFEA9A064987C27566292082AC7D801C' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_7_98C3249043C31E87EB7F57B417EEE4FA) == 0x0011B0, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_7_98C3249043C31E87EB7F57B417EEE4FA' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_6_9CC550A9419C2AC7B8A82285BED66A05) == 0x0011F8, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_6_9CC550A9419C2AC7B8A82285BED66A05' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_5_2BED5B024EF071A686FE69AD3AE7B288) == 0x001240, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_5_2BED5B024EF071A686FE69AD3AE7B288' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_4_BC30A4894B0BB48B9D61E9922FA50614) == 0x001288, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_4_BC30A4894B0BB48B9D61E9922FA50614' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_3_2AA1FF594824C678114090B49DC069CF) == 0x0012D0, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_3_2AA1FF594824C678114090B49DC069CF' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_2_5D7FD57E440C1F5370924C83F4571EF8) == 0x001318, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_2_5D7FD57E440C1F5370924C83F4571EF8' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_1_17D05C2C4700CF7E7181A7904F8ADC75) == 0x001360, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_1_17D05C2C4700CF7E7181A7904F8ADC75' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_BackStab_C, SMGraphK2Node_GraphPropertyNode_09C4BFB6499AABFA0CD4B3A64BF1C30D) == 0x0013A8, "Member 'USMEvent_Medal_BackStab_C::SMGraphK2Node_GraphPropertyNode_09C4BFB6499AABFA0CD4B3A64BF1C30D' has a wrong offset!");

}

