#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_CDP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_CDP.SMEvent_Kill_CDP_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_CDP_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_EC2886374933CC0492C635B98803B73C; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_A914730D44FBE2C03E0ECC823EF26BD5; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_02873C964DCC90D5DEA483A1631C965D; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_B224A7704EA754EFE9B44283F9645602; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_6B97966C4A9E9125EC8FF48203A327E5; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_7218521B4D269C395CAF29BCFABA6A57; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_579D904C48024CB05CA77FAB264206D9; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_49D6A2994D2AEBFBA80FDC9D6D50A1CE; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_4EEB39AB48505ADE1E2D41A20F3E61FC; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_29F36DDF402097352B04649938F6F2B1; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_64ABEF7D4D4C648EA94E5FA7D8A78312; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_9DB6FD2F46C9A5C1B6B235BF8D495EEF; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_CC24E6A24D671DECA461DC9BFF832B38; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_24B4FC5B42DC8307EB1FAB8141B2F77B; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_CDP(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_A675376049433A70969D5ABB3E0A87F3();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_418EAC454A03EBDE2AB108B1BBA2C8E3();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_792BEFB84FB42475BC099998E3738D48();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_8DB27F384765264D8706BE98DB2F59FD();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_7805D9C04CBA964503353293A3ECDB3E();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_5ECCECB34721003DF2A99F8594217D57();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_BB1D89D44AC78A30190BC4B32B92B31A();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_FDCA007B4D72DCFC58EC0BB7D41D22E9();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_844974E743D7D79E8C67BD8B67708D32();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_868011264D931F4B9949B589BA50744A();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_230C406F4D6EFFE3F6CAEFA022916093();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_B86EF9F5441DD036E6344C876F1DEAA5();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_CDP_C">();
	}
	static class USMEvent_Kill_CDP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_CDP_C>();
	}
};
static_assert(alignof(USMEvent_Kill_CDP_C) == 0x000008, "Wrong alignment on USMEvent_Kill_CDP_C");
static_assert(sizeof(USMEvent_Kill_CDP_C) == 0x000FD0, "Wrong size on USMEvent_Kill_CDP_C");
static_assert(offsetof(USMEvent_Kill_CDP_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_CDP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_TransitionResultNode_EC2886374933CC0492C635B98803B73C) == 0x000700, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_TransitionResultNode_EC2886374933CC0492C635B98803B73C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_StateEntryNode_A914730D44FBE2C03E0ECC823EF26BD5) == 0x0008F8, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_StateEntryNode_A914730D44FBE2C03E0ECC823EF26BD5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_ConduitResultNode_02873C964DCC90D5DEA483A1631C965D) == 0x000AD8, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_ConduitResultNode_02873C964DCC90D5DEA483A1631C965D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_10_B224A7704EA754EFE9B44283F9645602) == 0x000CB8, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_10_B224A7704EA754EFE9B44283F9645602' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_9_6B97966C4A9E9125EC8FF48203A327E5) == 0x000D00, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_9_6B97966C4A9E9125EC8FF48203A327E5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_8_7218521B4D269C395CAF29BCFABA6A57) == 0x000D48, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_8_7218521B4D269C395CAF29BCFABA6A57' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_7_579D904C48024CB05CA77FAB264206D9) == 0x000D90, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_7_579D904C48024CB05CA77FAB264206D9' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_6_49D6A2994D2AEBFBA80FDC9D6D50A1CE) == 0x000DD8, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_6_49D6A2994D2AEBFBA80FDC9D6D50A1CE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_5_4EEB39AB48505ADE1E2D41A20F3E61FC) == 0x000E20, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_5_4EEB39AB48505ADE1E2D41A20F3E61FC' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_4_29F36DDF402097352B04649938F6F2B1) == 0x000E68, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_4_29F36DDF402097352B04649938F6F2B1' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_3_64ABEF7D4D4C648EA94E5FA7D8A78312) == 0x000EB0, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_3_64ABEF7D4D4C648EA94E5FA7D8A78312' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_2_9DB6FD2F46C9A5C1B6B235BF8D495EEF) == 0x000EF8, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_2_9DB6FD2F46C9A5C1B6B235BF8D495EEF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_1_CC24E6A24D671DECA461DC9BFF832B38) == 0x000F40, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_1_CC24E6A24D671DECA461DC9BFF832B38' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CDP_C, SMGraphK2Node_GraphPropertyNode_24B4FC5B42DC8307EB1FAB8141B2F77B) == 0x000F88, "Member 'USMEvent_Kill_CDP_C::SMGraphK2Node_GraphPropertyNode_24B4FC5B42DC8307EB1FAB8141B2F77B' has a wrong offset!");

}

