#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_KillBack

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_KillBack.SMEvent_Medal_KillBack_C
// 0x0770 (0x0E68 - 0x06F8)
class USMEvent_Medal_KillBack_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_A1DDB1244B51B840D7D242AA1B5CD1AE; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_7C3D2FB244620236095B68974C863BC6; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_DE00A6554B4D28EE362F5CA3B45DBA99; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_7B9BA8084D5937C2981B40A8EBE5533D; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_47DE928546AF4D76FCF4EC9E3687E64C; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_7DA7AF134091FFB51350C2B3A40F4E1F; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_D99C7C8A49EFB7EF993A5B9AB173B287; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_B5C5728B4CF4014DA441008E1105EF1F; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_B0C22C324AE419CD3661A4A7905764A0; // 0x0E20(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_KillBack(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_E08247F64025E82632D2EA8A1847A020();
	void SMGraphK2Node_GraphPropertyNode_5_6B5BC2CDC1E6CF701E40E7CA672D0FCD_BA4E399748DA9639A8DCF6B3A86548EB();
	void SMGraphK2Node_GraphPropertyNode_4_7884C75B34E140B2DDBE56754DE64306_A4142C304AE2F6979BDF9099799F0C0D();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_EC0F16624D85371D11BF72B212E864E4();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_8B83E60B43854A564466EB8C8EB34DFE();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_FBB5509246E71DA46EA2519840CFCF5C();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_D9ACA8144EE51F19933B1C8BCDD4B5BF();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_KillBack_C">();
	}
	static class USMEvent_Medal_KillBack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_KillBack_C>();
	}
};
static_assert(alignof(USMEvent_Medal_KillBack_C) == 0x000008, "Wrong alignment on USMEvent_Medal_KillBack_C");
static_assert(sizeof(USMEvent_Medal_KillBack_C) == 0x000E68, "Wrong size on USMEvent_Medal_KillBack_C");
static_assert(offsetof(USMEvent_Medal_KillBack_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_KillBack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillBack_C, SMGraphK2Node_TransitionResultNode_A1DDB1244B51B840D7D242AA1B5CD1AE) == 0x000700, "Member 'USMEvent_Medal_KillBack_C::SMGraphK2Node_TransitionResultNode_A1DDB1244B51B840D7D242AA1B5CD1AE' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillBack_C, SMGraphK2Node_ConduitResultNode_7C3D2FB244620236095B68974C863BC6) == 0x0008F8, "Member 'USMEvent_Medal_KillBack_C::SMGraphK2Node_ConduitResultNode_7C3D2FB244620236095B68974C863BC6' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillBack_C, SMGraphK2Node_StateEntryNode_DE00A6554B4D28EE362F5CA3B45DBA99) == 0x000AD8, "Member 'USMEvent_Medal_KillBack_C::SMGraphK2Node_StateEntryNode_DE00A6554B4D28EE362F5CA3B45DBA99' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillBack_C, SMGraphK2Node_GraphPropertyNode_5_7B9BA8084D5937C2981B40A8EBE5533D) == 0x000CB8, "Member 'USMEvent_Medal_KillBack_C::SMGraphK2Node_GraphPropertyNode_5_7B9BA8084D5937C2981B40A8EBE5533D' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillBack_C, SMGraphK2Node_GraphPropertyNode_4_47DE928546AF4D76FCF4EC9E3687E64C) == 0x000D00, "Member 'USMEvent_Medal_KillBack_C::SMGraphK2Node_GraphPropertyNode_4_47DE928546AF4D76FCF4EC9E3687E64C' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillBack_C, SMGraphK2Node_GraphPropertyNode_3_7DA7AF134091FFB51350C2B3A40F4E1F) == 0x000D48, "Member 'USMEvent_Medal_KillBack_C::SMGraphK2Node_GraphPropertyNode_3_7DA7AF134091FFB51350C2B3A40F4E1F' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillBack_C, SMGraphK2Node_GraphPropertyNode_2_D99C7C8A49EFB7EF993A5B9AB173B287) == 0x000D90, "Member 'USMEvent_Medal_KillBack_C::SMGraphK2Node_GraphPropertyNode_2_D99C7C8A49EFB7EF993A5B9AB173B287' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillBack_C, SMGraphK2Node_GraphPropertyNode_1_B5C5728B4CF4014DA441008E1105EF1F) == 0x000DD8, "Member 'USMEvent_Medal_KillBack_C::SMGraphK2Node_GraphPropertyNode_1_B5C5728B4CF4014DA441008E1105EF1F' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_KillBack_C, SMGraphK2Node_GraphPropertyNode_B0C22C324AE419CD3661A4A7905764A0) == 0x000E20, "Member 'USMEvent_Medal_KillBack_C::SMGraphK2Node_GraphPropertyNode_B0C22C324AE419CD3661A4A7905764A0' has a wrong offset!");

}

