#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_AKM_50M

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_AKM_50M.SMEvent_Kill_AKM_50M_C
// 0x0DD0 (0x14C8 - 0x06F8)
class USMEvent_Kill_AKM_50M_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_C8CDCC1C42BDB1F03B67F5B21C9330A9; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_3EE4014148125E7B6D2E719EC80843E8; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_92DEDB264BAE872DA431EE867A6EA879; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_A8CA75734AB9CAD05206E3A8A9417BB6; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1384C09B41A86FFDC2DF4EA81F90DB02; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_1DF5546248D5B299755A189147E18B03; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_6B2C627442DF29B1D66565AAA6CE8213; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_3BB7C3D841A5B16D16E3FBB8A4541AF7; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_F9E7B3744CB5F8AC181C6985DE33964D; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_0C90F723405DB2EA876C22BE4C2911D7; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_C3C8C9104EC823376195F3A1DFEFF600; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_5B880F6246968EFEA1E07DADE39184D4; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_7D0CF02047A293C33306CBBD76484BDF; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_7DC461624CCE7989C1B96288CAB3F338; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_6BE0254E4902D752C0A875843636230E; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_387E19D9404129B71FD66CBA38F5F737; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_ED817B6542ECB4E5B0D3A5A4B91BAA09; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_CFCFFC95482FADE9CDAC9A9B138EBE1A; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_5D6C1A594B800A77782551BCCEF099E5; // 0x1438(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_FA783C5043F3289ED056BF80EED10276; // 0x1480(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_AKM_50M(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_78C97817445F16DE82793EB314D58999();
	void SMGraphK2Node_GraphPropertyNode_14_25BB90918720EDB29C50585857259E67_DC9B610A4C284E35ECD796ACC50FA08D();
	void SMGraphK2Node_GraphPropertyNode_13_890970B83463FD38474A4017AB6505B9_1AB35DA541B86167FEA67DB5A941ED4C();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_AAE1030448506F8DA1FF97A86910F059();
	void SMGraphK2Node_GraphPropertyNode_12_3DA64C0AB489BBF8EAE713CAEED73534_E811D2924D237E99B10D818C925F56A1();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_D0B3409348844EA1FFC6189F8D23680B();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_BBE7D6724B5B837DDB3C3C9697397894();
	void SMGraphK2Node_GraphPropertyNode_11_518353AF11A99FDFEEDB66B6418EA001_C2E88432426B5A25B4044FB40DF3F48D();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_B3662E514FDD15488C6EC3AC7E7CC2CA();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_D968962747F0B5ADEA4D7284F28E1805();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_C15E69A441D6EDAD8FF91C9A950ED187();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_DD6D94C44FFFB640CD00B6B7093560EF();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_6CBADFB147ECF4A2B6C777BA9327C0F7();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_B41D7D21409CD6D9092EB2B549F96CB7();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_BAABBC144524473A878C37824EA5B5F8();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_E9C879C949A2CE9BE8D641A7188FDF12();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_AKM_50M_C">();
	}
	static class USMEvent_Kill_AKM_50M_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_AKM_50M_C>();
	}
};
static_assert(alignof(USMEvent_Kill_AKM_50M_C) == 0x000008, "Wrong alignment on USMEvent_Kill_AKM_50M_C");
static_assert(sizeof(USMEvent_Kill_AKM_50M_C) == 0x0014C8, "Wrong size on USMEvent_Kill_AKM_50M_C");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_AKM_50M_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_TransitionResultNode_1_C8CDCC1C42BDB1F03B67F5B21C9330A9) == 0x000700, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_TransitionResultNode_1_C8CDCC1C42BDB1F03B67F5B21C9330A9' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_TransitionResultNode_3EE4014148125E7B6D2E719EC80843E8) == 0x0008F8, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_TransitionResultNode_3EE4014148125E7B6D2E719EC80843E8' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_ConduitResultNode_1_92DEDB264BAE872DA431EE867A6EA879) == 0x000AF0, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_ConduitResultNode_1_92DEDB264BAE872DA431EE867A6EA879' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_StateEntryNode_A8CA75734AB9CAD05206E3A8A9417BB6) == 0x000CD0, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_StateEntryNode_A8CA75734AB9CAD05206E3A8A9417BB6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_ConduitResultNode_1384C09B41A86FFDC2DF4EA81F90DB02) == 0x000EB0, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_ConduitResultNode_1384C09B41A86FFDC2DF4EA81F90DB02' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_14_1DF5546248D5B299755A189147E18B03) == 0x001090, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_14_1DF5546248D5B299755A189147E18B03' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_13_6B2C627442DF29B1D66565AAA6CE8213) == 0x0010D8, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_13_6B2C627442DF29B1D66565AAA6CE8213' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_12_3BB7C3D841A5B16D16E3FBB8A4541AF7) == 0x001120, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_12_3BB7C3D841A5B16D16E3FBB8A4541AF7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_11_F9E7B3744CB5F8AC181C6985DE33964D) == 0x001168, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_11_F9E7B3744CB5F8AC181C6985DE33964D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_10_0C90F723405DB2EA876C22BE4C2911D7) == 0x0011B0, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_10_0C90F723405DB2EA876C22BE4C2911D7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_9_C3C8C9104EC823376195F3A1DFEFF600) == 0x0011F8, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_9_C3C8C9104EC823376195F3A1DFEFF600' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_8_5B880F6246968EFEA1E07DADE39184D4) == 0x001240, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_8_5B880F6246968EFEA1E07DADE39184D4' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_7_7D0CF02047A293C33306CBBD76484BDF) == 0x001288, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_7_7D0CF02047A293C33306CBBD76484BDF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_6_7DC461624CCE7989C1B96288CAB3F338) == 0x0012D0, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_6_7DC461624CCE7989C1B96288CAB3F338' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_5_6BE0254E4902D752C0A875843636230E) == 0x001318, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_5_6BE0254E4902D752C0A875843636230E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_4_387E19D9404129B71FD66CBA38F5F737) == 0x001360, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_4_387E19D9404129B71FD66CBA38F5F737' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_3_ED817B6542ECB4E5B0D3A5A4B91BAA09) == 0x0013A8, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_3_ED817B6542ECB4E5B0D3A5A4B91BAA09' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_2_CFCFFC95482FADE9CDAC9A9B138EBE1A) == 0x0013F0, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_2_CFCFFC95482FADE9CDAC9A9B138EBE1A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_1_5D6C1A594B800A77782551BCCEF099E5) == 0x001438, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_1_5D6C1A594B800A77782551BCCEF099E5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_50M_C, SMGraphK2Node_GraphPropertyNode_FA783C5043F3289ED056BF80EED10276) == 0x001480, "Member 'USMEvent_Kill_AKM_50M_C::SMGraphK2Node_GraphPropertyNode_FA783C5043F3289ED056BF80EED10276' has a wrong offset!");

}

