#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_MOSIN_Iron

#include "Basic.hpp"


namespace SDK::Params
{

// Function SMEvent_Kill_MOSIN_Iron.SMEvent_Kill_MOSIN_Iron_C.ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron
// 0x0148 (0x0148 - 0x0000)
struct SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0044(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x005C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Equip*                       K2Node_DynamicCast_AsPBConduit_Equip;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x0074(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Equip*                       K2Node_DynamicCast_AsPBConduit_Equip_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Equip*                       K2Node_DynamicCast_AsPBConduit_Equip_2;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_5;                              // 0x009C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x00A4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Equip*                       K2Node_DynamicCast_AsPBConduit_Equip_3;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_7;                              // 0x00BC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Equip*                       K2Node_DynamicCast_AsPBConduit_Equip_4;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_2;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_3;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_4;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_5;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_6;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_7;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_8;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron) == 0x000008, "Wrong alignment on SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron");
static_assert(sizeof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron) == 0x000148, "Wrong size on SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, EntryPoint) == 0x000000, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::EntryPoint' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Weapon) == 0x000008, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Weapon' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, Temp_name_Variable) == 0x000014, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Weapon_1) == 0x000020, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Weapon_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, Temp_name_Variable_1) == 0x00002C, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBSMState_Event_End) == 0x000038, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBSMState_Event_End' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, Temp_name_Variable_2) == 0x000044, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBSMState_Event_End_1) == 0x000050, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBSMState_Event_End_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_3) == 0x000058, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, Temp_name_Variable_3) == 0x00005C, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Equip) == 0x000068, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Equip' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_4) == 0x000070, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, Temp_name_Variable_4) == 0x000074, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Equip_1) == 0x000080, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Equip_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_5) == 0x000088, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Equip_2) == 0x000090, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Equip_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_6) == 0x000098, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, Temp_name_Variable_5) == 0x00009C, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, Temp_name_Variable_6) == 0x0000A4, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Equip_3) == 0x0000B0, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Equip_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_7) == 0x0000B8, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, Temp_name_Variable_7) == 0x0000BC, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::Temp_name_Variable_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Equip_4) == 0x0000C8, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Equip_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_8) == 0x0000D0, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Weapon_2) == 0x0000D8, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Weapon_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_9) == 0x0000E0, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Weapon_3) == 0x0000E8, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Weapon_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_10) == 0x0000F0, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Weapon_4) == 0x0000F8, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Weapon_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_11) == 0x000100, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Weapon_5) == 0x000108, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Weapon_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_12) == 0x000110, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Weapon_6) == 0x000118, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Weapon_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_13) == 0x000120, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Weapon_7) == 0x000128, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Weapon_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_14) == 0x000130, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_AsPBConduit_Weapon_8) == 0x000138, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_AsPBConduit_Weapon_8' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron, K2Node_DynamicCast_bSuccess_15) == 0x000140, "Member 'SMEvent_Kill_MOSIN_Iron_C_ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");

}

