#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Mobility

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Mobility.SMEvent_Mobility_C
// 0x0278 (0x0928 - 0x06B0)
class USMEvent_Mobility_C final : public UPBEvent_ActiveMobilityModule
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_E0CA1B8041337F9E96D948BD2E593D5A; // 0x06B8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_90B02AC7401516A60F3047A8A162C017; // 0x0898(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6D81D2C04AF7039BB0CAD4BA0962F893; // 0x08E0(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Mobility(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_9AE5F3BB4EA912BC159324ABA1136982_098ACC1E476050EF0D93EF9AA8926F0C();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_990655D44CF91DCC8B0A63A5F8CD5118();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_ABB619CD45B90F6B78512D8F0E8F436D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Mobility_C">();
	}
	static class USMEvent_Mobility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Mobility_C>();
	}
};
static_assert(alignof(USMEvent_Mobility_C) == 0x000008, "Wrong alignment on USMEvent_Mobility_C");
static_assert(sizeof(USMEvent_Mobility_C) == 0x000928, "Wrong size on USMEvent_Mobility_C");
static_assert(offsetof(USMEvent_Mobility_C, UberGraphFrame) == 0x0006B0, "Member 'USMEvent_Mobility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Mobility_C, SMGraphK2Node_StateEntryNode_E0CA1B8041337F9E96D948BD2E593D5A) == 0x0006B8, "Member 'USMEvent_Mobility_C::SMGraphK2Node_StateEntryNode_E0CA1B8041337F9E96D948BD2E593D5A' has a wrong offset!");
static_assert(offsetof(USMEvent_Mobility_C, SMGraphK2Node_GraphPropertyNode_1_90B02AC7401516A60F3047A8A162C017) == 0x000898, "Member 'USMEvent_Mobility_C::SMGraphK2Node_GraphPropertyNode_1_90B02AC7401516A60F3047A8A162C017' has a wrong offset!");
static_assert(offsetof(USMEvent_Mobility_C, SMGraphK2Node_GraphPropertyNode_6D81D2C04AF7039BB0CAD4BA0962F893) == 0x0008E0, "Member 'USMEvent_Mobility_C::SMGraphK2Node_GraphPropertyNode_6D81D2C04AF7039BB0CAD4BA0962F893' has a wrong offset!");

}

