#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_SVD_Iron

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_SVD_Iron.SMEvent_Kill_SVD_Iron_C
// 0x0E60 (0x1558 - 0x06F8)
class USMEvent_Kill_SVD_Iron_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_533D875D40DD9E179429209E197E0624; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_2AB9C590472E75F76B43A888DCE9700E; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_08DE8AFE49EA85348BA72C9BE3CCAFD7; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_5863253B484F19977BF4998B677A7E6F; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_EE514FB44FB1B1D34E107CBB4B675149; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_16_B7110F6C46CFF4C2A888AE88B84C9086; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_15_0A1620A04679CE5FD669BD8C8CFE42DB; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_1F6D5E1546D807DC53E792A54A01715E; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_3A173AD1439445C23509B69B3B73E8FA; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_2562DDB04FB0456E755F47A477A0168D; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_892AE5B44EE3601F5BD47AAE8CA8B2B5; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_406225C94F2032F2A130399150B6F98C; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_04F395B3427DCA8F85D1CABE6FDE2FDB; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_3631B0BE4A941F26B7EE99A98AE88ACF; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_E282C4A44137107F21D943B19B5AC00D; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_A22DF43746F927530C0622B6EFF52C44; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_936D691F457C549D669D058E422AD85B; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_6858AD88465CE00761CAB3939301DC0B; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_A7B9EDC94D6DECD4468FAC94D8CDF5C6; // 0x1438(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_D4F97D324925FA1504DB21A1AC153A4C; // 0x1480(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_5E9F87274A34E8F566ABFE975A451259; // 0x14C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_FF4FEEA24B0ADEBDB721B9BA856CB691; // 0x1510(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_SVD_Iron(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_F4A208B14C7AF2294070189473295876();
	void SMGraphK2Node_GraphPropertyNode_16_B96563C66FA81E85DD2E43F5D4850051_F44B89894695F60555CA57BE5BFB487A();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_E7933F7F4AE993C163F7F8AEA84C107D();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_1740B9C64E48F53D00F111B891189137();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_83D62B08454ED27835218AB625BF4EF0();
	void SMGraphK2Node_GraphPropertyNode_15_74676800E2A3FE55DA51F3380EA14F8A_A9D6971C4011B17F58827FB266265CCF();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_CD911B294435388D8D8627A6E918D214();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_B166C6BA4BE5928239023586C71083A1();
	void SMGraphK2Node_GraphPropertyNode_14_3DA64C0AB489BBF8EAE713CAEED73534_C58F6BED44D975BA830A58BF7EFF29C0();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_DDFA87404FF1EB56A80AE19458419446();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_D5860A6546A2B979E18DF9A005B85F77();
	void SMGraphK2Node_GraphPropertyNode_13_518353AF11A99FDFEEDB66B6418EA001_0CE02E1C42B16D3AB2AD7DBAC8B8715E();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_1CE8EEAB41D638D6B5C64DB964E85A28();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_252E57404D10A647029E0DA562DF6FDC();
	void SMGraphK2Node_GraphPropertyNode_12_007D3153FF1A5D10F748FE4E382A1DA7_B08779164EA78806FCFEA88950BDB955();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_042FE81C443D9B337A816C8987C9DF09();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_E307F86D43FDFA23FCD7BD969FF4EADC();
	void SMGraphK2Node_GraphPropertyNode_11_4E0377A7C10D006F25AAEDD09CE6BC56_F9A44B704A8106BA1C2B5198183DDC00();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_SVD_Iron_C">();
	}
	static class USMEvent_Kill_SVD_Iron_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_SVD_Iron_C>();
	}
};
static_assert(alignof(USMEvent_Kill_SVD_Iron_C) == 0x000008, "Wrong alignment on USMEvent_Kill_SVD_Iron_C");
static_assert(sizeof(USMEvent_Kill_SVD_Iron_C) == 0x001558, "Wrong size on USMEvent_Kill_SVD_Iron_C");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_SVD_Iron_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_TransitionResultNode_1_533D875D40DD9E179429209E197E0624) == 0x000700, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_TransitionResultNode_1_533D875D40DD9E179429209E197E0624' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_TransitionResultNode_2AB9C590472E75F76B43A888DCE9700E) == 0x0008F8, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_TransitionResultNode_2AB9C590472E75F76B43A888DCE9700E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_ConduitResultNode_1_08DE8AFE49EA85348BA72C9BE3CCAFD7) == 0x000AF0, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_ConduitResultNode_1_08DE8AFE49EA85348BA72C9BE3CCAFD7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_StateEntryNode_5863253B484F19977BF4998B677A7E6F) == 0x000CD0, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_StateEntryNode_5863253B484F19977BF4998B677A7E6F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_ConduitResultNode_EE514FB44FB1B1D34E107CBB4B675149) == 0x000EB0, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_ConduitResultNode_EE514FB44FB1B1D34E107CBB4B675149' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_16_B7110F6C46CFF4C2A888AE88B84C9086) == 0x001090, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_16_B7110F6C46CFF4C2A888AE88B84C9086' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_15_0A1620A04679CE5FD669BD8C8CFE42DB) == 0x0010D8, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_15_0A1620A04679CE5FD669BD8C8CFE42DB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_14_1F6D5E1546D807DC53E792A54A01715E) == 0x001120, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_14_1F6D5E1546D807DC53E792A54A01715E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_13_3A173AD1439445C23509B69B3B73E8FA) == 0x001168, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_13_3A173AD1439445C23509B69B3B73E8FA' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_12_2562DDB04FB0456E755F47A477A0168D) == 0x0011B0, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_12_2562DDB04FB0456E755F47A477A0168D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_11_892AE5B44EE3601F5BD47AAE8CA8B2B5) == 0x0011F8, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_11_892AE5B44EE3601F5BD47AAE8CA8B2B5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_10_406225C94F2032F2A130399150B6F98C) == 0x001240, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_10_406225C94F2032F2A130399150B6F98C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_9_04F395B3427DCA8F85D1CABE6FDE2FDB) == 0x001288, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_9_04F395B3427DCA8F85D1CABE6FDE2FDB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_8_3631B0BE4A941F26B7EE99A98AE88ACF) == 0x0012D0, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_8_3631B0BE4A941F26B7EE99A98AE88ACF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_7_E282C4A44137107F21D943B19B5AC00D) == 0x001318, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_7_E282C4A44137107F21D943B19B5AC00D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_6_A22DF43746F927530C0622B6EFF52C44) == 0x001360, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_6_A22DF43746F927530C0622B6EFF52C44' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_5_936D691F457C549D669D058E422AD85B) == 0x0013A8, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_5_936D691F457C549D669D058E422AD85B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_4_6858AD88465CE00761CAB3939301DC0B) == 0x0013F0, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_4_6858AD88465CE00761CAB3939301DC0B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_3_A7B9EDC94D6DECD4468FAC94D8CDF5C6) == 0x001438, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_3_A7B9EDC94D6DECD4468FAC94D8CDF5C6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_2_D4F97D324925FA1504DB21A1AC153A4C) == 0x001480, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_2_D4F97D324925FA1504DB21A1AC153A4C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_1_5E9F87274A34E8F566ABFE975A451259) == 0x0014C8, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_1_5E9F87274A34E8F566ABFE975A451259' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SVD_Iron_C, SMGraphK2Node_GraphPropertyNode_FF4FEEA24B0ADEBDB721B9BA856CB691) == 0x001510, "Member 'USMEvent_Kill_SVD_Iron_C::SMGraphK2Node_GraphPropertyNode_FF4FEEA24B0ADEBDB721B9BA856CB691' has a wrong offset!");

}

