#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_PTRD

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_PTRD.SMEvent_Kill_PTRD_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_PTRD_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_9223D7B444CF6E94132B2D8763257EFB; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_FED02EAD4E1B7B1DD2EB28AA1B3BE970; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_8F35470740B90564D9DA79859309CDC7; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_03D018084F8075FB5EB33FBE0F576187; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_022249174AB8198AE34FEA888FE680E5; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_7B45AA204398A1A2CF3A74B55C792DA9; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_5FF28A864D40FE150EA1D6913BAE5B03; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_FE33822D479F4C4D8DD01B981B4268E1; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_F359D06341988D4E7C8C08B1668D6857; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_5AD2C92C471A40DA101E0B90EA0B6F16; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_356B52E44990F20D932122A911AFCD35; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_A1F7013141A799157A6AFE99B273233B; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_455A3AFE4D75AE0D8B4E1983DC78B575; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_CC260DD14FA7F72CC3A08497967B957E; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_PTRD(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_EA96AE5E4161B75A03684F97B3295D96();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_27101C4247AB5462C2235BAE1FABA6A7();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_7EF957964988E428E938009D25A6EA7D();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_48885C01421B7019524ABC8782781D0B();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_F502B4BE4C35E3CDA940AF9CD423D001();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_23B3ECBE486400BA389E28B8772AEAD4();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_4976B85548F367E53DC44388AE9511FF();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_55E55834497027A26C98109466C39C4E();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_1A26F0014EE4257C5BE905993C1F66FC();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_667DB3D14D0FDEB0336C43B5ED6A6D29();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_5D0B5BD7484D16090B693FB16B32411D();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_51A5F131459DBCEF83E83ABEB412EA76();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_PTRD_C">();
	}
	static class USMEvent_Kill_PTRD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_PTRD_C>();
	}
};
static_assert(alignof(USMEvent_Kill_PTRD_C) == 0x000008, "Wrong alignment on USMEvent_Kill_PTRD_C");
static_assert(sizeof(USMEvent_Kill_PTRD_C) == 0x000FD0, "Wrong size on USMEvent_Kill_PTRD_C");
static_assert(offsetof(USMEvent_Kill_PTRD_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_PTRD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_TransitionResultNode_9223D7B444CF6E94132B2D8763257EFB) == 0x000700, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_TransitionResultNode_9223D7B444CF6E94132B2D8763257EFB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_StateEntryNode_FED02EAD4E1B7B1DD2EB28AA1B3BE970) == 0x0008F8, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_StateEntryNode_FED02EAD4E1B7B1DD2EB28AA1B3BE970' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_ConduitResultNode_8F35470740B90564D9DA79859309CDC7) == 0x000AD8, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_ConduitResultNode_8F35470740B90564D9DA79859309CDC7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_10_03D018084F8075FB5EB33FBE0F576187) == 0x000CB8, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_10_03D018084F8075FB5EB33FBE0F576187' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_9_022249174AB8198AE34FEA888FE680E5) == 0x000D00, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_9_022249174AB8198AE34FEA888FE680E5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_8_7B45AA204398A1A2CF3A74B55C792DA9) == 0x000D48, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_8_7B45AA204398A1A2CF3A74B55C792DA9' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_7_5FF28A864D40FE150EA1D6913BAE5B03) == 0x000D90, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_7_5FF28A864D40FE150EA1D6913BAE5B03' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_6_FE33822D479F4C4D8DD01B981B4268E1) == 0x000DD8, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_6_FE33822D479F4C4D8DD01B981B4268E1' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_5_F359D06341988D4E7C8C08B1668D6857) == 0x000E20, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_5_F359D06341988D4E7C8C08B1668D6857' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_4_5AD2C92C471A40DA101E0B90EA0B6F16) == 0x000E68, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_4_5AD2C92C471A40DA101E0B90EA0B6F16' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_3_356B52E44990F20D932122A911AFCD35) == 0x000EB0, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_3_356B52E44990F20D932122A911AFCD35' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_2_A1F7013141A799157A6AFE99B273233B) == 0x000EF8, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_2_A1F7013141A799157A6AFE99B273233B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_1_455A3AFE4D75AE0D8B4E1983DC78B575) == 0x000F40, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_1_455A3AFE4D75AE0D8B4E1983DC78B575' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PTRD_C, SMGraphK2Node_GraphPropertyNode_CC260DD14FA7F72CC3A08497967B957E) == 0x000F88, "Member 'USMEvent_Kill_PTRD_C::SMGraphK2Node_GraphPropertyNode_CC260DD14FA7F72CC3A08497967B957E' has a wrong offset!");

}

