#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Headshot

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Headshot.SMEvent_Headshot_C
// 0x0D88 (0x1480 - 0x06F8)
class USMEvent_Headshot_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_A7F6E63A4DCA376FC30099A2DDF838DA; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_904F68924E7F045FC2F999B35DAA22D2; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_121776C14AA505A87703C583B11B8F54; // 0x0AF0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_BFC9AE80483A977E1770A4BA05043747; // 0x0CD0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_DC830C7A4739815CBC0C76A9A891ABA4; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_3CF400A746EE22CFFAFA2B857EF0BCFD; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_11FB14BD4C03C5BE3811FD8752BB679C; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_0D8794A040891B2D1A545C9DDC96F044; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_D56C067A4B86E1997210BE8DF65CBCA5; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_5A35FAB849B09D843BDF88B9481F741C; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_E1D94D904CC9B17A2318D583CF7ACAD8; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_748904F945C9EAB70B23B0BBDB599F8A; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_EB0883544D60321CC0716D841F6FE286; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_6D30DF374B8EB60217237CB326722E06; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_0C5367D046AF817ED87387A081A99D74; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_8D4DAD8347D9176C9A7DA39F240BEBCE; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_535BD5A1499DC49342867FAE4F7D2AA7; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_E164D2C249AD8A9A0734289C0722CC7C; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_D99A5348458AFAC56E0DA1AD799BD85C; // 0x1438(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Headshot(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_780F87CC4E0DD38FE8A3EF987202855D();
	void SMGraphK2Node_GraphPropertyNode_13_B601E33420FD8DB89F45F490AC78A2A4_32FEE9B346E048962B45AF8D4EE014E2();
	void SMGraphK2Node_GraphPropertyNode_12_A352FBB675815ECF469750B059BEAE93_35965E5F456FC7981174FF9D6FDD5766();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_7FEA365A48210CCEE8449B84DF2A8EE8();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_018DD5BD44969203E698FA8822C71C4B();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_534ABEC64B498034C64381BDFDB24297();
	void SMGraphK2Node_GraphPropertyNode_11_758DD5C92F524B9AFF9BBD3458140C08_50B165EB48086EBA1CB94186055E3C67();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_DA641A604045494550D8AA81208139B0();
	void SMGraphK2Node_GraphPropertyNode_4_3826ADFE8B326640698CC908CCA3F28F_07A017604EDDD1A1A98E5D8D096EF37B();
	void SMGraphK2Node_GraphPropertyNode_5_A73300A65B41FFE8DDE6DAE03912C867_30C2E7654190C151E6E477929C62E9BB();
	void SMGraphK2Node_GraphPropertyNode_10_472A91F7915F4E7D738E25518EFC60CA_1EFBFAE64D45674C5C6498A674F69597();
	void SMGraphK2Node_GraphPropertyNode_6_518353AF11A99FDFEEDB66B6418EA001_20C31AE54901F154DEB1C3962BEE22B8();
	void SMGraphK2Node_GraphPropertyNode_7_3DA64C0AB489BBF8EAE713CAEED73534_EFE70119403622082CFD3EAE146A5DDF();
	void SMGraphK2Node_GraphPropertyNode_8_4499195241432879F5E6F782CA615D8D_CE0246A446CC3BB929FB07890FFE3D7D();
	void SMGraphK2Node_GraphPropertyNode_9_1FEC1C7B291E221A664CAF0FBCD134AE_92D5D7D649C5F616F11B64AE319477FE();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Headshot_C">();
	}
	static class USMEvent_Headshot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Headshot_C>();
	}
};
static_assert(alignof(USMEvent_Headshot_C) == 0x000008, "Wrong alignment on USMEvent_Headshot_C");
static_assert(sizeof(USMEvent_Headshot_C) == 0x001480, "Wrong size on USMEvent_Headshot_C");
static_assert(offsetof(USMEvent_Headshot_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Headshot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_TransitionResultNode_1_A7F6E63A4DCA376FC30099A2DDF838DA) == 0x000700, "Member 'USMEvent_Headshot_C::SMGraphK2Node_TransitionResultNode_1_A7F6E63A4DCA376FC30099A2DDF838DA' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_TransitionResultNode_904F68924E7F045FC2F999B35DAA22D2) == 0x0008F8, "Member 'USMEvent_Headshot_C::SMGraphK2Node_TransitionResultNode_904F68924E7F045FC2F999B35DAA22D2' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_ConduitResultNode_1_121776C14AA505A87703C583B11B8F54) == 0x000AF0, "Member 'USMEvent_Headshot_C::SMGraphK2Node_ConduitResultNode_1_121776C14AA505A87703C583B11B8F54' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_ConduitResultNode_BFC9AE80483A977E1770A4BA05043747) == 0x000CD0, "Member 'USMEvent_Headshot_C::SMGraphK2Node_ConduitResultNode_BFC9AE80483A977E1770A4BA05043747' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_StateEntryNode_DC830C7A4739815CBC0C76A9A891ABA4) == 0x000EB0, "Member 'USMEvent_Headshot_C::SMGraphK2Node_StateEntryNode_DC830C7A4739815CBC0C76A9A891ABA4' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_13_3CF400A746EE22CFFAFA2B857EF0BCFD) == 0x001090, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_13_3CF400A746EE22CFFAFA2B857EF0BCFD' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_12_11FB14BD4C03C5BE3811FD8752BB679C) == 0x0010D8, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_12_11FB14BD4C03C5BE3811FD8752BB679C' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_11_0D8794A040891B2D1A545C9DDC96F044) == 0x001120, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_11_0D8794A040891B2D1A545C9DDC96F044' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_10_D56C067A4B86E1997210BE8DF65CBCA5) == 0x001168, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_10_D56C067A4B86E1997210BE8DF65CBCA5' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_9_5A35FAB849B09D843BDF88B9481F741C) == 0x0011B0, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_9_5A35FAB849B09D843BDF88B9481F741C' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_8_E1D94D904CC9B17A2318D583CF7ACAD8) == 0x0011F8, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_8_E1D94D904CC9B17A2318D583CF7ACAD8' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_7_748904F945C9EAB70B23B0BBDB599F8A) == 0x001240, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_7_748904F945C9EAB70B23B0BBDB599F8A' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_6_EB0883544D60321CC0716D841F6FE286) == 0x001288, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_6_EB0883544D60321CC0716D841F6FE286' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_5_6D30DF374B8EB60217237CB326722E06) == 0x0012D0, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_5_6D30DF374B8EB60217237CB326722E06' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_4_0C5367D046AF817ED87387A081A99D74) == 0x001318, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_4_0C5367D046AF817ED87387A081A99D74' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_3_8D4DAD8347D9176C9A7DA39F240BEBCE) == 0x001360, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_3_8D4DAD8347D9176C9A7DA39F240BEBCE' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_2_535BD5A1499DC49342867FAE4F7D2AA7) == 0x0013A8, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_2_535BD5A1499DC49342867FAE4F7D2AA7' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_1_E164D2C249AD8A9A0734289C0722CC7C) == 0x0013F0, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_1_E164D2C249AD8A9A0734289C0722CC7C' has a wrong offset!");
static_assert(offsetof(USMEvent_Headshot_C, SMGraphK2Node_GraphPropertyNode_D99A5348458AFAC56E0DA1AD799BD85C) == 0x001438, "Member 'USMEvent_Headshot_C::SMGraphK2Node_GraphPropertyNode_D99A5348458AFAC56E0DA1AD799BD85C' has a wrong offset!");

}

