#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Headshot

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function SMEvent_Headshot.SMEvent_Headshot_C.ExecuteUbergraph_SMEvent_Headshot
// 0x0118 (0x0118 - 0x0000)
struct SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Character*                   K2Node_DynamicCast_AsPBConduit_Character;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Character*                   K2Node_DynamicCast_AsPBConduit_Character_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0044(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Character*                   K2Node_DynamicCast_AsPBConduit_Character_2;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x005C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Character*                   K2Node_DynamicCast_AsPBConduit_Character_3;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBHitZone                                    Temp_byte_Variable;                                // 0x0071(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Character*                   K2Node_DynamicCast_AsPBConduit_Character_4;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBHitZone                                    Temp_byte_Variable_1;                              // 0x0081(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Character*                   K2Node_DynamicCast_AsPBConduit_Character_5;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Character*                   K2Node_DynamicCast_AsPBConduit_Character_6;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x00A4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Character*                   K2Node_DynamicCast_AsPBConduit_Character_7;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_5;                              // 0x00BC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_HitZone*                     K2Node_DynamicCast_AsPBConduit_Hit_Zone;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_HitZone*                     K2Node_DynamicCast_AsPBConduit_Hit_Zone_1;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_HitZone*                     K2Node_DynamicCast_AsPBConduit_Hit_Zone_2;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_HitZone*                     K2Node_DynamicCast_AsPBConduit_Hit_Zone_3;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End_1;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot) == 0x000008, "Wrong alignment on SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot");
static_assert(sizeof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot) == 0x000118, "Wrong size on SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, EntryPoint) == 0x000000, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::EntryPoint' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBSMState_Event_End) == 0x000008, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBSMState_Event_End' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Character) == 0x000018, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Character' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, Temp_name_Variable) == 0x000024, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, Temp_name_Variable_1) == 0x00002C, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Character_1) == 0x000038, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Character_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, Temp_name_Variable_2) == 0x000044, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Character_2) == 0x000050, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Character_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_3) == 0x000058, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, Temp_name_Variable_3) == 0x00005C, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Character_3) == 0x000068, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Character_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_4) == 0x000070, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, Temp_byte_Variable) == 0x000071, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Character_4) == 0x000078, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Character_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_5) == 0x000080, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, Temp_byte_Variable_1) == 0x000081, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Character_5) == 0x000088, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Character_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_6) == 0x000090, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Character_6) == 0x000098, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Character_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_7) == 0x0000A0, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, Temp_name_Variable_4) == 0x0000A4, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Character_7) == 0x0000B0, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Character_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_8) == 0x0000B8, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, Temp_name_Variable_5) == 0x0000BC, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Hit_Zone) == 0x0000C8, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Hit_Zone' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_9) == 0x0000D0, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Hit_Zone_1) == 0x0000D8, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Hit_Zone_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_10) == 0x0000E0, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Hit_Zone_2) == 0x0000E8, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Hit_Zone_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_11) == 0x0000F0, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBConduit_Hit_Zone_3) == 0x0000F8, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBConduit_Hit_Zone_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_12) == 0x000100, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_AsPBSMState_Event_End_1) == 0x000108, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_AsPBSMState_Event_End_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot, K2Node_DynamicCast_bSuccess_13) == 0x000110, "Member 'SMEvent_Headshot_C_ExecuteUbergraph_SMEvent_Headshot::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");

}

