#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_AR_50M

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_AR_50M.SMEvent_Kill_AR_50M_C
// 0x0DD0 (0x14C8 - 0x06F8)
class USMEvent_Kill_AR_50M_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_773F625C413B5BE195583BB7710CF99F; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DA6BE06E4E3EB4BC549782A36EBB530D; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_A61831CC4D439CF3DFE0B28DF3E3B136; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_A8CDF84842A5418D69EEAE96289EB4DD; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_BF7F4357442A3DE7EA4D5B9D4D08D0B9; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_3190AB1E4103B2114BE979864204C6EF; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_4E3EFD3F4CC74533B5DB7783894AC7F9; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_E7D94CAC4012C2047EB8DB9A48602501; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_088F50434E271CC81D827B8BD4F6CBE9; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_28FCF22B40E9D137B2205486820F71FF; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_34D1D5AF4C33168EA6CC398270CB4A0A; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_1E7CCB2C4FBFE7FB5357B0B0C0322834; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_28E87A9E42E7E9A23DA9CA96B5583F6B; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_C326AD144ED5C1BB74FA23B6A099B89F; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_2EBD4B39421E0913B3F1F595A2ED6909; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_A489AE764067F6A41BF2F1A8700C4CB2; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_378D79FE4EEEA9C41FC7F9AE84D674D1; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_5DD5CF95443F937384CBF699B2B1284D; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_BECA24C743052C6420049A95467B6D6C; // 0x1438(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6EEB450A469806CEC5FA278392BAE543; // 0x1480(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_AR_50M(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_63CE14044A3ED2943D458594D43E84CD();
	void SMGraphK2Node_GraphPropertyNode_14_3DA64C0AB489BBF8EAE713CAEED73534_1CB6C7E141985ABB3DED1EB215AC96DD();
	void SMGraphK2Node_GraphPropertyNode_13_518353AF11A99FDFEEDB66B6418EA001_5F73FAF04795757403E99B85A6F685D9();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_6E51556C4DD02AC0CF01E0B53AA5EB62();
	void SMGraphK2Node_GraphPropertyNode_12_25BB90918720EDB29C50585857259E67_58ACEB9A4F7258F24B0710A6035CFEB2();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_8859B82448ABDE4D5B990482CF14FFD1();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_761A76684AFB1DFC0790A38C91A63316();
	void SMGraphK2Node_GraphPropertyNode_11_890970B83463FD38474A4017AB6505B9_9335249849A348402F7C149F62A73037();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_484DB4494E8BB35F3E0F8C8EFF041F81();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_18F94E0F4D3495D8A3A4F99F7A231B0E();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_1E0265EC4BC8DB2CCD276EB9F7640A3C();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_F880358F406B054EA717CB84B5B2F3CD();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_6D19B70D4862A54643D4A2B3F029A31E();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_B08D223649A38D4833742C94DCB45D25();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_56F44037437B12B49C14AAA361DA8F91();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_B77028A44BB0ECB46622A6ACA20C1CA2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_AR_50M_C">();
	}
	static class USMEvent_Kill_AR_50M_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_AR_50M_C>();
	}
};
static_assert(alignof(USMEvent_Kill_AR_50M_C) == 0x000008, "Wrong alignment on USMEvent_Kill_AR_50M_C");
static_assert(sizeof(USMEvent_Kill_AR_50M_C) == 0x0014C8, "Wrong size on USMEvent_Kill_AR_50M_C");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_AR_50M_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_TransitionResultNode_1_773F625C413B5BE195583BB7710CF99F) == 0x000700, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_TransitionResultNode_1_773F625C413B5BE195583BB7710CF99F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_TransitionResultNode_DA6BE06E4E3EB4BC549782A36EBB530D) == 0x0008F8, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_TransitionResultNode_DA6BE06E4E3EB4BC549782A36EBB530D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_ConduitResultNode_1_A61831CC4D439CF3DFE0B28DF3E3B136) == 0x000AF0, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_ConduitResultNode_1_A61831CC4D439CF3DFE0B28DF3E3B136' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_StateEntryNode_A8CDF84842A5418D69EEAE96289EB4DD) == 0x000CD0, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_StateEntryNode_A8CDF84842A5418D69EEAE96289EB4DD' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_ConduitResultNode_BF7F4357442A3DE7EA4D5B9D4D08D0B9) == 0x000EB0, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_ConduitResultNode_BF7F4357442A3DE7EA4D5B9D4D08D0B9' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_14_3190AB1E4103B2114BE979864204C6EF) == 0x001090, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_14_3190AB1E4103B2114BE979864204C6EF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_13_4E3EFD3F4CC74533B5DB7783894AC7F9) == 0x0010D8, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_13_4E3EFD3F4CC74533B5DB7783894AC7F9' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_12_E7D94CAC4012C2047EB8DB9A48602501) == 0x001120, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_12_E7D94CAC4012C2047EB8DB9A48602501' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_11_088F50434E271CC81D827B8BD4F6CBE9) == 0x001168, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_11_088F50434E271CC81D827B8BD4F6CBE9' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_10_28FCF22B40E9D137B2205486820F71FF) == 0x0011B0, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_10_28FCF22B40E9D137B2205486820F71FF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_9_34D1D5AF4C33168EA6CC398270CB4A0A) == 0x0011F8, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_9_34D1D5AF4C33168EA6CC398270CB4A0A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_8_1E7CCB2C4FBFE7FB5357B0B0C0322834) == 0x001240, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_8_1E7CCB2C4FBFE7FB5357B0B0C0322834' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_7_28E87A9E42E7E9A23DA9CA96B5583F6B) == 0x001288, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_7_28E87A9E42E7E9A23DA9CA96B5583F6B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_6_C326AD144ED5C1BB74FA23B6A099B89F) == 0x0012D0, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_6_C326AD144ED5C1BB74FA23B6A099B89F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_5_2EBD4B39421E0913B3F1F595A2ED6909) == 0x001318, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_5_2EBD4B39421E0913B3F1F595A2ED6909' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_4_A489AE764067F6A41BF2F1A8700C4CB2) == 0x001360, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_4_A489AE764067F6A41BF2F1A8700C4CB2' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_3_378D79FE4EEEA9C41FC7F9AE84D674D1) == 0x0013A8, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_3_378D79FE4EEEA9C41FC7F9AE84D674D1' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_2_5DD5CF95443F937384CBF699B2B1284D) == 0x0013F0, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_2_5DD5CF95443F937384CBF699B2B1284D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_1_BECA24C743052C6420049A95467B6D6C) == 0x001438, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_1_BECA24C743052C6420049A95467B6D6C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_50M_C, SMGraphK2Node_GraphPropertyNode_6EEB450A469806CEC5FA278392BAE543) == 0x001480, "Member 'USMEvent_Kill_AR_50M_C::SMGraphK2Node_GraphPropertyNode_6EEB450A469806CEC5FA278392BAE543' has a wrong offset!");

}

