#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_AKMHeadShot

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_AKMHeadShot.SMEvent_Kill_AKMHeadShot_C
// 0x0DD0 (0x14C8 - 0x06F8)
class USMEvent_Kill_AKMHeadShot_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_71C8B47A493F38E5BBD665B354CBC8C6; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_CB0EFA0E4C222955FF0151B6FB82A649; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_EBCFD36D444C92F47E221DBE4D36848E; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_B9F4999C4A69D8C98178C5A8E88290E6; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_A2F5E44A4983772D6E9FB6877013D46F; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_EB4C669745B6EDDEE80B8E8F0843955C; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_3E0FF4E144F10C1281D11F9C434527A8; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_D2B011EE48776CE432D78DA6F8BB7D40; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_461AC98242C9A725A6912E9845E229D4; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_ACB024904DDC36DD23E6EF874CA9F2B3; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_7CE7DF5B435A6E1C6CF5339705BF244F; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_1E745DC543A529B0D8029195FA57C3FF; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_DD15829A455485E64E3DC483D3B8C17B; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_49A257AC435BBD4E3A9AEF9DFF066DA5; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_D133108945335AB59FE35487724808AB; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_92EB3C07416430ECEE875FA49A3575E2; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_A904AD4046C3EB4CBBF84098E7608989; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_C12C47BF4C315C06226E51B58336C9DD; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_64045DBC4C3702DA133EBCBC18382978; // 0x1438(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8957E9AA42C7607E4DE053A9E00716BC; // 0x1480(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_AKMHeadShot(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_01D6FEBA45EEDB791FFCD298D937B116();
	void SMGraphK2Node_GraphPropertyNode_14_A73300A65B41FFE8DDE6DAE03912C867_0B0D405149149ACBCB218F88B84ECF4E();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_EB12CD5648B5C54466359387BCCF2B20();
	void SMGraphK2Node_GraphPropertyNode_13_3826ADFE8B326640698CC908CCA3F28F_CBAD34694D18D1DC9BB9C59CCB6CE5DD();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_3F416DAA4842B88115C20AB2B74DD6D1();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_84C0C1C04232157B6A910FBDDA9604A5();
	void SMGraphK2Node_GraphPropertyNode_12_3DA64C0AB489BBF8EAE713CAEED73534_97D0D3034822FAD65D6DC6B21AD1CD99();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_D600B86F412C9583E7FEDE8C4DD1C485();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_7A2006DD4B7D4E1CDFB84CBEA9DC5048();
	void SMGraphK2Node_GraphPropertyNode_11_518353AF11A99FDFEEDB66B6418EA001_6D4134D54CABF8F67D17CF9B97CB9833();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_FC16EF0C47C5497A158EA28542A72D0E();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_AF3116424F5F4234A7B37A99701AB052();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_BB9C209A4022954C037D19AD4D4C0CC7();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_F70064E242CFCE2C12CD95975F46FDAA();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_47C02BEC4893D77590AF96B9731315DE();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_07DA32484F67AE55BCCC2FBD22F94B6E();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_AKMHeadShot_C">();
	}
	static class USMEvent_Kill_AKMHeadShot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_AKMHeadShot_C>();
	}
};
static_assert(alignof(USMEvent_Kill_AKMHeadShot_C) == 0x000008, "Wrong alignment on USMEvent_Kill_AKMHeadShot_C");
static_assert(sizeof(USMEvent_Kill_AKMHeadShot_C) == 0x0014C8, "Wrong size on USMEvent_Kill_AKMHeadShot_C");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_AKMHeadShot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_TransitionResultNode_1_71C8B47A493F38E5BBD665B354CBC8C6) == 0x000700, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_TransitionResultNode_1_71C8B47A493F38E5BBD665B354CBC8C6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_TransitionResultNode_CB0EFA0E4C222955FF0151B6FB82A649) == 0x0008F8, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_TransitionResultNode_CB0EFA0E4C222955FF0151B6FB82A649' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_ConduitResultNode_1_EBCFD36D444C92F47E221DBE4D36848E) == 0x000AF0, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_ConduitResultNode_1_EBCFD36D444C92F47E221DBE4D36848E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_StateEntryNode_B9F4999C4A69D8C98178C5A8E88290E6) == 0x000CD0, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_StateEntryNode_B9F4999C4A69D8C98178C5A8E88290E6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_ConduitResultNode_A2F5E44A4983772D6E9FB6877013D46F) == 0x000EB0, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_ConduitResultNode_A2F5E44A4983772D6E9FB6877013D46F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_14_EB4C669745B6EDDEE80B8E8F0843955C) == 0x001090, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_14_EB4C669745B6EDDEE80B8E8F0843955C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_13_3E0FF4E144F10C1281D11F9C434527A8) == 0x0010D8, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_13_3E0FF4E144F10C1281D11F9C434527A8' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_12_D2B011EE48776CE432D78DA6F8BB7D40) == 0x001120, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_12_D2B011EE48776CE432D78DA6F8BB7D40' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_11_461AC98242C9A725A6912E9845E229D4) == 0x001168, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_11_461AC98242C9A725A6912E9845E229D4' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_10_ACB024904DDC36DD23E6EF874CA9F2B3) == 0x0011B0, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_10_ACB024904DDC36DD23E6EF874CA9F2B3' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_9_7CE7DF5B435A6E1C6CF5339705BF244F) == 0x0011F8, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_9_7CE7DF5B435A6E1C6CF5339705BF244F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_8_1E745DC543A529B0D8029195FA57C3FF) == 0x001240, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_8_1E745DC543A529B0D8029195FA57C3FF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_7_DD15829A455485E64E3DC483D3B8C17B) == 0x001288, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_7_DD15829A455485E64E3DC483D3B8C17B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_6_49A257AC435BBD4E3A9AEF9DFF066DA5) == 0x0012D0, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_6_49A257AC435BBD4E3A9AEF9DFF066DA5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_5_D133108945335AB59FE35487724808AB) == 0x001318, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_5_D133108945335AB59FE35487724808AB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_4_92EB3C07416430ECEE875FA49A3575E2) == 0x001360, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_4_92EB3C07416430ECEE875FA49A3575E2' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_3_A904AD4046C3EB4CBBF84098E7608989) == 0x0013A8, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_3_A904AD4046C3EB4CBBF84098E7608989' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_2_C12C47BF4C315C06226E51B58336C9DD) == 0x0013F0, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_2_C12C47BF4C315C06226E51B58336C9DD' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_1_64045DBC4C3702DA133EBCBC18382978) == 0x001438, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_1_64045DBC4C3702DA133EBCBC18382978' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKMHeadShot_C, SMGraphK2Node_GraphPropertyNode_8957E9AA42C7607E4DE053A9E00716BC) == 0x001480, "Member 'USMEvent_Kill_AKMHeadShot_C::SMGraphK2Node_GraphPropertyNode_8957E9AA42C7607E4DE053A9E00716BC' has a wrong offset!");

}

