#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_AKM

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_AKM.SMEvent_Kill_AKM_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_AKM_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_858097E14C78056F48D19A9006D42CEE; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_610D54F54251F8DDEE50ED8C2BD28209; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_7D622C9549F1D7B56D50499BFE2411DF; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_9395EE964AD9FB92C5F978921853A5E4; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_4304D60D4B86C0650874E4BFE18A4539; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_C8EE58F846C1CFB18B0DB0BCC5AAAC37; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_A3F1C8AE408E84DB04EBDFAAC05ED9FE; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_2F03908C435383AE66567BBEBF9DA085; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_EDE612034DF7112966D601931147AF06; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_43B501C347756F11F12B808202F3EAEB; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_F27BFAEE469852133CBC44A84A148E2C; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_E1105BF64AD6AC82A8AEDBA4A71C7C4F; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_870D22594690B23FDFB880B3E5F94B2E; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7CB50B9543693DE5FD5A84BA7023976D; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_AKM(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_E1E0947C4FC69E0B224FD1B66A75DE59();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_5BBDFC71424EA8FF01D6C69576692A9F();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_823CCC95409172DDA201B8BCCA86107E();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_F5AC35274D805C140BFF90971ECFF53C();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_0F5420354862B406D00B42823BD2FE8F();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_487BE8584FC3DF06EB3F80897B0152B0();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_12172B3C407F8AC44707FE93BCAB0F89();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_6F20B4A64A719477115ED0A31580D6AD();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_C9AC878743BEB99BBAB565BD6FEFE57D();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_5E5621584B6142C3C9944797641C7625();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_B04C8CC64A1F8F7D9598DA8831CC1079();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_BAA4FD1F4A64F9FA3A0C0493D3A544A4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_AKM_C">();
	}
	static class USMEvent_Kill_AKM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_AKM_C>();
	}
};
static_assert(alignof(USMEvent_Kill_AKM_C) == 0x000008, "Wrong alignment on USMEvent_Kill_AKM_C");
static_assert(sizeof(USMEvent_Kill_AKM_C) == 0x000FD0, "Wrong size on USMEvent_Kill_AKM_C");
static_assert(offsetof(USMEvent_Kill_AKM_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_AKM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_TransitionResultNode_858097E14C78056F48D19A9006D42CEE) == 0x000700, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_TransitionResultNode_858097E14C78056F48D19A9006D42CEE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_StateEntryNode_610D54F54251F8DDEE50ED8C2BD28209) == 0x0008F8, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_StateEntryNode_610D54F54251F8DDEE50ED8C2BD28209' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_ConduitResultNode_7D622C9549F1D7B56D50499BFE2411DF) == 0x000AD8, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_ConduitResultNode_7D622C9549F1D7B56D50499BFE2411DF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_10_9395EE964AD9FB92C5F978921853A5E4) == 0x000CB8, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_10_9395EE964AD9FB92C5F978921853A5E4' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_9_4304D60D4B86C0650874E4BFE18A4539) == 0x000D00, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_9_4304D60D4B86C0650874E4BFE18A4539' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_8_C8EE58F846C1CFB18B0DB0BCC5AAAC37) == 0x000D48, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_8_C8EE58F846C1CFB18B0DB0BCC5AAAC37' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_7_A3F1C8AE408E84DB04EBDFAAC05ED9FE) == 0x000D90, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_7_A3F1C8AE408E84DB04EBDFAAC05ED9FE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_6_2F03908C435383AE66567BBEBF9DA085) == 0x000DD8, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_6_2F03908C435383AE66567BBEBF9DA085' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_5_EDE612034DF7112966D601931147AF06) == 0x000E20, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_5_EDE612034DF7112966D601931147AF06' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_4_43B501C347756F11F12B808202F3EAEB) == 0x000E68, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_4_43B501C347756F11F12B808202F3EAEB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_3_F27BFAEE469852133CBC44A84A148E2C) == 0x000EB0, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_3_F27BFAEE469852133CBC44A84A148E2C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_2_E1105BF64AD6AC82A8AEDBA4A71C7C4F) == 0x000EF8, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_2_E1105BF64AD6AC82A8AEDBA4A71C7C4F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_1_870D22594690B23FDFB880B3E5F94B2E) == 0x000F40, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_1_870D22594690B23FDFB880B3E5F94B2E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AKM_C, SMGraphK2Node_GraphPropertyNode_7CB50B9543693DE5FD5A84BA7023976D) == 0x000F88, "Member 'USMEvent_Kill_AKM_C::SMGraphK2Node_GraphPropertyNode_7CB50B9543693DE5FD5A84BA7023976D' has a wrong offset!");

}

