#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_OneShot

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_OneShot.SMEvent_Medal_OneShot_C
// 0x0CB0 (0x13A8 - 0x06F8)
class USMEvent_Medal_OneShot_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_5CF7386644293B12E019DCB8169AE237; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_717D8A1E42B0180EC390E0A4358E0EE3; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_7EC42C3B4EB3763BAFE0F0A9599E2634; // 0x0AF0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_03DBFD304C4E683F5FB09A879446FAA9; // 0x0CD0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_00E92E4242A655072148F88763F66C12; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_CC66D4194EFD9797B4D0C39C6B3E3CEB; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_7D16C3C145E6C352037ECE8D6045A0C7; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_FC8F2BC74BB96E8A85A8399EAE512BBE; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_748D03A34D402D71B274A68240485591; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_7ECB5CE349B7529375A16EBA5B91451A; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_3548396D4BDE689785514CAE2D20123A; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_4A322ADA4B7D8E49BDC3F2A0D456BF4A; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_54FE8FE24DA9AF994512819074CF322B; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_D1FF8B6845B2AD4EC7C94D96B89D8A84; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_630A18194164ADB707A253B2B594178C; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3C71BC524EA1EFB15666B68ED507F1C4; // 0x1360(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_OneShot(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_B396E03646B24F84C1A8CBB9D48E39FD();
	void SMGraphK2Node_GraphPropertyNode_10_871217E2C3AF8FEE096D72CA2CDD1771_17A588AA49845BF02183C69A709C9E94();
	void SMGraphK2Node_GraphPropertyNode_9_3DA64C0AB489BBF8EAE713CAEED73534_C77F2A1F4AA5EB9DEFA5DAA18F6C982F();
	void SMGraphK2Node_GraphPropertyNode_8_518353AF11A99FDFEEDB66B6418EA001_278BED994738962C666A7EA8FFC17F0B();
	void SMGraphK2Node_GraphPropertyNode_7_1D5AE3AF69E079B559EF8AF2950B22F1_9FFB696645A7D2C576E91C979B8BEA67();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_B6D3D23B40E8A32CDBDD7A8ACD201FED();
	void SMGraphK2Node_GraphPropertyNode_6_DFCF228DCE31F7B7DE4D5893884342DB_7993924A4E936D4AAB9221AFFEFD5D52();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_C16D96AE4EA74DFE5E35B892C162841A();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_A1188ABC4733E36CF9C21DB89A0E4B37();
	void SMGraphK2Node_GraphPropertyNode_5_DFC5DDF9620519B0185FE1F473B6BA24_4763AFBE43732AA6CEA9808989FABCF5();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_19C485CB4FF40243FEB31DAE79F450EF();
	void SMGraphK2Node_GraphPropertyNode_4_F5981CACB7D9769440965527229065DD_4F690E774FAE2F13CF40798618ADE9AE();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_OneShot_C">();
	}
	static class USMEvent_Medal_OneShot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_OneShot_C>();
	}
};
static_assert(alignof(USMEvent_Medal_OneShot_C) == 0x000008, "Wrong alignment on USMEvent_Medal_OneShot_C");
static_assert(sizeof(USMEvent_Medal_OneShot_C) == 0x0013A8, "Wrong size on USMEvent_Medal_OneShot_C");
static_assert(offsetof(USMEvent_Medal_OneShot_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_OneShot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_TransitionResultNode_1_5CF7386644293B12E019DCB8169AE237) == 0x000700, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_TransitionResultNode_1_5CF7386644293B12E019DCB8169AE237' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_TransitionResultNode_717D8A1E42B0180EC390E0A4358E0EE3) == 0x0008F8, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_TransitionResultNode_717D8A1E42B0180EC390E0A4358E0EE3' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_ConduitResultNode_1_7EC42C3B4EB3763BAFE0F0A9599E2634) == 0x000AF0, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_ConduitResultNode_1_7EC42C3B4EB3763BAFE0F0A9599E2634' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_ConduitResultNode_03DBFD304C4E683F5FB09A879446FAA9) == 0x000CD0, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_ConduitResultNode_03DBFD304C4E683F5FB09A879446FAA9' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_StateEntryNode_00E92E4242A655072148F88763F66C12) == 0x000EB0, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_StateEntryNode_00E92E4242A655072148F88763F66C12' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_10_CC66D4194EFD9797B4D0C39C6B3E3CEB) == 0x001090, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_10_CC66D4194EFD9797B4D0C39C6B3E3CEB' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_9_7D16C3C145E6C352037ECE8D6045A0C7) == 0x0010D8, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_9_7D16C3C145E6C352037ECE8D6045A0C7' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_8_FC8F2BC74BB96E8A85A8399EAE512BBE) == 0x001120, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_8_FC8F2BC74BB96E8A85A8399EAE512BBE' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_7_748D03A34D402D71B274A68240485591) == 0x001168, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_7_748D03A34D402D71B274A68240485591' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_6_7ECB5CE349B7529375A16EBA5B91451A) == 0x0011B0, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_6_7ECB5CE349B7529375A16EBA5B91451A' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_5_3548396D4BDE689785514CAE2D20123A) == 0x0011F8, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_5_3548396D4BDE689785514CAE2D20123A' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_4_4A322ADA4B7D8E49BDC3F2A0D456BF4A) == 0x001240, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_4_4A322ADA4B7D8E49BDC3F2A0D456BF4A' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_3_54FE8FE24DA9AF994512819074CF322B) == 0x001288, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_3_54FE8FE24DA9AF994512819074CF322B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_2_D1FF8B6845B2AD4EC7C94D96B89D8A84) == 0x0012D0, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_2_D1FF8B6845B2AD4EC7C94D96B89D8A84' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_1_630A18194164ADB707A253B2B594178C) == 0x001318, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_1_630A18194164ADB707A253B2B594178C' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_OneShot_C, SMGraphK2Node_GraphPropertyNode_3C71BC524EA1EFB15666B68ED507F1C4) == 0x001360, "Member 'USMEvent_Medal_OneShot_C::SMGraphK2Node_GraphPropertyNode_3C71BC524EA1EFB15666B68ED507F1C4' has a wrong offset!");

}

