#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_FirstPurgeVictory

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_FirstPurgeVictory.SMEvent_FirstPurgeVictory_C
// 0x0CB0 (0x1428 - 0x0778)
class USMEvent_FirstPurgeVictory_C final : public UPBEvent_MatchEnd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_F589893A4C31E6B17FAE6891A4CE75B7; // 0x0780(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_6ACDAA534288C31689BEA183C3F60C27; // 0x0978(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_9C77C5094C39929B638D0CB0A70037B8; // 0x0B70(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_6B539D0646F1AFFA8FA368B8E4BF8FA2; // 0x0D50(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_B0CEABB34A987FD4405E6789921AAC48; // 0x0F30(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_3E8937714E993012EFBBBABAE1780795; // 0x1110(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_8E8E65CE49D9B8103BD031967D469F1E; // 0x1158(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_F62CFE5C4D02E98199063295E5C2165D; // 0x11A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_BBDD48CC40E7664E98D0249E7854AE48; // 0x11E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_40377C5941DF11BD34284CBB76930195; // 0x1230(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_AFB590AB4D6D552734F07CB5243575F8; // 0x1278(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_40A1FC3E4D5B6BE98F9B469023A4E830; // 0x12C0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_39F378EB4DB7EF4575BAC196CF679304; // 0x1308(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_A259AE204BAC9D8E9CC563B2271D8D21; // 0x1350(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_7294D28444B02217165894BFC6AF31AA; // 0x1398(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_51F28DE0453D55EBF7071197922CEE1F; // 0x13E0(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_FirstPurgeVictory(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_AC9C746F4D8F5213523BB8B161668408_B5EBA1AD4D5FB0ED3D5156B3FCA31049();
	void SMGraphK2Node_GraphPropertyNode_10_3DA64C0AB489BBF8EAE713CAEED73534_D0C3A543462D80EB8CA89997269751C4();
	void SMGraphK2Node_GraphPropertyNode_9_518353AF11A99FDFEEDB66B6418EA001_03B0E4134C33E91FE9D3B2BB311B0DB4();
	void SMGraphK2Node_GraphPropertyNode_8_7E261F3E5C0FA126924682D5024D57B6_388926594850EC8B550595B468E9914D();
	void SMGraphK2Node_GraphPropertyNode_7_8FBC1AC9AE62937ED288E1B431A37B3D_E19E97BA4EC9CF2AD776FE8F6C556383();
	void SMGraphK2Node_GraphPropertyNode_0_9B726A79733F234A2592B22CBF705BAE_A8D5AAE44B4505CB2FF6398049AC1DF9();
	void SMGraphK2Node_GraphPropertyNode_6_40A291E7A5009A35B29F31036F3FD958_6AF475E043F97FBD8AFAAFB6410EACA7();
	void SMGraphK2Node_GraphPropertyNode_1_B580CFBBEE69D2AE9AD084C568474214_8163B7564F2D56A6F08A5C8D8F78E890();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_EB215BFF4D8602BC9593C8A686ADCFAD();
	void SMGraphK2Node_GraphPropertyNode_5_07CA978E0CC48D17FC9737FC6562B6D9_B9C431AD45602D628D2AAEBBAD8DB335();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_D73070C441AB012A752854BCC215E629();
	void SMGraphK2Node_GraphPropertyNode_4_C04E0C318D415947F3C0A291B4AF3A6D_3197A1B44C7E3298B2A490B42E6FA08C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_FirstPurgeVictory_C">();
	}
	static class USMEvent_FirstPurgeVictory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_FirstPurgeVictory_C>();
	}
};
static_assert(alignof(USMEvent_FirstPurgeVictory_C) == 0x000008, "Wrong alignment on USMEvent_FirstPurgeVictory_C");
static_assert(sizeof(USMEvent_FirstPurgeVictory_C) == 0x001428, "Wrong size on USMEvent_FirstPurgeVictory_C");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, UberGraphFrame) == 0x000778, "Member 'USMEvent_FirstPurgeVictory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_TransitionResultNode_1_F589893A4C31E6B17FAE6891A4CE75B7) == 0x000780, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_TransitionResultNode_1_F589893A4C31E6B17FAE6891A4CE75B7' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_TransitionResultNode_6ACDAA534288C31689BEA183C3F60C27) == 0x000978, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_TransitionResultNode_6ACDAA534288C31689BEA183C3F60C27' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_ConduitResultNode_1_9C77C5094C39929B638D0CB0A70037B8) == 0x000B70, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_ConduitResultNode_1_9C77C5094C39929B638D0CB0A70037B8' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_StateEntryNode_6B539D0646F1AFFA8FA368B8E4BF8FA2) == 0x000D50, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_StateEntryNode_6B539D0646F1AFFA8FA368B8E4BF8FA2' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_ConduitResultNode_B0CEABB34A987FD4405E6789921AAC48) == 0x000F30, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_ConduitResultNode_B0CEABB34A987FD4405E6789921AAC48' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_10_3E8937714E993012EFBBBABAE1780795) == 0x001110, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_10_3E8937714E993012EFBBBABAE1780795' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_9_8E8E65CE49D9B8103BD031967D469F1E) == 0x001158, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_9_8E8E65CE49D9B8103BD031967D469F1E' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_8_F62CFE5C4D02E98199063295E5C2165D) == 0x0011A0, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_8_F62CFE5C4D02E98199063295E5C2165D' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_7_BBDD48CC40E7664E98D0249E7854AE48) == 0x0011E8, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_7_BBDD48CC40E7664E98D0249E7854AE48' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_6_40377C5941DF11BD34284CBB76930195) == 0x001230, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_6_40377C5941DF11BD34284CBB76930195' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_5_AFB590AB4D6D552734F07CB5243575F8) == 0x001278, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_5_AFB590AB4D6D552734F07CB5243575F8' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_4_40A1FC3E4D5B6BE98F9B469023A4E830) == 0x0012C0, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_4_40A1FC3E4D5B6BE98F9B469023A4E830' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_3_39F378EB4DB7EF4575BAC196CF679304) == 0x001308, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_3_39F378EB4DB7EF4575BAC196CF679304' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_2_A259AE204BAC9D8E9CC563B2271D8D21) == 0x001350, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_2_A259AE204BAC9D8E9CC563B2271D8D21' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_1_7294D28444B02217165894BFC6AF31AA) == 0x001398, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_1_7294D28444B02217165894BFC6AF31AA' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstPurgeVictory_C, SMGraphK2Node_GraphPropertyNode_51F28DE0453D55EBF7071197922CEE1F) == 0x0013E0, "Member 'USMEvent_FirstPurgeVictory_C::SMGraphK2Node_GraphPropertyNode_51F28DE0453D55EBF7071197922CEE1F' has a wrong offset!");

}

