#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_FullLevelCharacter

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_FullLevelCharacter.SMEvent_FullLevelCharacter_C
// 0x0DD0 (0x1478 - 0x06A8)
class USMEvent_FullLevelCharacter_C final : public UPBEvent_LoadPlayerData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_E74C0AA44553B44F1A5B14A32AF9DE6D; // 0x06B0(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_2E6576E548D8ED103D32629F86E41B85; // 0x08A8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_42DF67F5445F31D014A364A544BC7140; // 0x0AA0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_5AD059F844B669F05FEA2F8CB4100E20; // 0x0C80(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_AAE693694CBA6C3DA3500092A19D557E; // 0x0E60(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_E3638F8D41F543C2AA2F6E878AC5F576; // 0x1040(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_9D9FB7224C92433FBCBD5A9B53E345D6; // 0x1088(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_8C4FACD2493AEB154CD6A5BD0AF63CAC; // 0x10D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_B5B6D7814C201CD0062A83BBEA7E716C; // 0x1118(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_4B18BF4D452818AB0DBA7D85519FD37A; // 0x1160(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_7B9A25264486751A715251B019EDA2F3; // 0x11A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_E4D108E84F4DA875998A3D8351772DF9; // 0x11F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_9B8AB2BD4081AE2C7D13B8A727FBB489; // 0x1238(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_EDF440194A1B6097885A32BA206C2B91; // 0x1280(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_0DB2E4744CD8ABF934831C88C0A1EBF1; // 0x12C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_ECBE01E942B7E971755584838E2DF1D7; // 0x1310(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_A2AA90EF4231219D77A389BE4BDEA01A; // 0x1358(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_A8E7BD1946EFAF96E42BC89B5C5665D2; // 0x13A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_04CEDF8E487CB923C6B1D5A8BA8FB4BE; // 0x13E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_A099D6694A4920D3869E5C822AE4C22C; // 0x1430(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_FullLevelCharacter(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_7E0D1DC4408008ED624047BED93D1109_3DA74462481ABA52074A36927234F5B7();
	void SMGraphK2Node_GraphPropertyNode_14_3DA64C0AB489BBF8EAE713CAEED73534_39DF0B0947EBB74F044156A3A07FEDE5();
	void SMGraphK2Node_GraphPropertyNode_13_518353AF11A99FDFEEDB66B6418EA001_38279B14406B0F33B6BE0D92CDBB100E();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_5485FCFC46D2781EF6A1CE8D33C45203();
	void SMGraphK2Node_GraphPropertyNode_12_7E261F3E5C0FA126924682D5024D57B6_80F4A4304AFBAC1A578CD5B522F9C737();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_C2357D744FB3D87C3AEFB0ACE6EDA811();
	void SMGraphK2Node_GraphPropertyNode_2_5DF5EB69FB5B1350C77BA421EBD2B8FA_21955DB84E36648C8CB9AAA4F151CB52();
	void SMGraphK2Node_GraphPropertyNode_11_8FBC1AC9AE62937ED288E1B431A37B3D_9800C71E433BF028405BDC9B77B78FF4();
	void SMGraphK2Node_GraphPropertyNode_3_924251CE29BC1D7EDCFAB4DB3C0223AE_A6E247AB45709812DD334781125AF958();
	void SMGraphK2Node_GraphPropertyNode_4_E0C31B330F532F42E5913DACC16F802B_C8864AA9426B084EF3A24A960A5FBCCD();
	void SMGraphK2Node_GraphPropertyNode_10_40A291E7A5009A35B29F31036F3FD958_2A2AE2D74E5663D18157A4A3F08F930A();
	void SMGraphK2Node_GraphPropertyNode_5_A22120CDAC3ACF3D903EA80FE84B0006_79921943461E437C0F4F6C9A5A3E262C();
	void SMGraphK2Node_GraphPropertyNode_6_471AAF85555CF2679A4535DADFC63770_7451ADF34559ADD4A0588EB52B77110C();
	void SMGraphK2Node_GraphPropertyNode_9_9B2E76CB0D5642A91285ECD0AD22455D_73C293E94D92EFE52B716889ED6FE159();
	void SMGraphK2Node_GraphPropertyNode_7_83FB9728653B5875C5D29938A1862987_CB293BEE4365D3A111448C9CA6D336D9();
	void SMGraphK2Node_GraphPropertyNode_8_1DBA4F3EBF49270A15FCABAE378D5A28_87A2446541DF01972819A685347E48EB();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_FullLevelCharacter_C">();
	}
	static class USMEvent_FullLevelCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_FullLevelCharacter_C>();
	}
};
static_assert(alignof(USMEvent_FullLevelCharacter_C) == 0x000008, "Wrong alignment on USMEvent_FullLevelCharacter_C");
static_assert(sizeof(USMEvent_FullLevelCharacter_C) == 0x001478, "Wrong size on USMEvent_FullLevelCharacter_C");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, UberGraphFrame) == 0x0006A8, "Member 'USMEvent_FullLevelCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_TransitionResultNode_1_E74C0AA44553B44F1A5B14A32AF9DE6D) == 0x0006B0, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_TransitionResultNode_1_E74C0AA44553B44F1A5B14A32AF9DE6D' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_TransitionResultNode_2E6576E548D8ED103D32629F86E41B85) == 0x0008A8, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_TransitionResultNode_2E6576E548D8ED103D32629F86E41B85' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_ConduitResultNode_1_42DF67F5445F31D014A364A544BC7140) == 0x000AA0, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_ConduitResultNode_1_42DF67F5445F31D014A364A544BC7140' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_StateEntryNode_5AD059F844B669F05FEA2F8CB4100E20) == 0x000C80, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_StateEntryNode_5AD059F844B669F05FEA2F8CB4100E20' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_ConduitResultNode_AAE693694CBA6C3DA3500092A19D557E) == 0x000E60, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_ConduitResultNode_AAE693694CBA6C3DA3500092A19D557E' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_14_E3638F8D41F543C2AA2F6E878AC5F576) == 0x001040, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_14_E3638F8D41F543C2AA2F6E878AC5F576' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_13_9D9FB7224C92433FBCBD5A9B53E345D6) == 0x001088, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_13_9D9FB7224C92433FBCBD5A9B53E345D6' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_12_8C4FACD2493AEB154CD6A5BD0AF63CAC) == 0x0010D0, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_12_8C4FACD2493AEB154CD6A5BD0AF63CAC' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_11_B5B6D7814C201CD0062A83BBEA7E716C) == 0x001118, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_11_B5B6D7814C201CD0062A83BBEA7E716C' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_10_4B18BF4D452818AB0DBA7D85519FD37A) == 0x001160, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_10_4B18BF4D452818AB0DBA7D85519FD37A' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_9_7B9A25264486751A715251B019EDA2F3) == 0x0011A8, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_9_7B9A25264486751A715251B019EDA2F3' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_8_E4D108E84F4DA875998A3D8351772DF9) == 0x0011F0, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_8_E4D108E84F4DA875998A3D8351772DF9' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_7_9B8AB2BD4081AE2C7D13B8A727FBB489) == 0x001238, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_7_9B8AB2BD4081AE2C7D13B8A727FBB489' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_6_EDF440194A1B6097885A32BA206C2B91) == 0x001280, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_6_EDF440194A1B6097885A32BA206C2B91' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_5_0DB2E4744CD8ABF934831C88C0A1EBF1) == 0x0012C8, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_5_0DB2E4744CD8ABF934831C88C0A1EBF1' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_4_ECBE01E942B7E971755584838E2DF1D7) == 0x001310, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_4_ECBE01E942B7E971755584838E2DF1D7' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_3_A2AA90EF4231219D77A389BE4BDEA01A) == 0x001358, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_3_A2AA90EF4231219D77A389BE4BDEA01A' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_2_A8E7BD1946EFAF96E42BC89B5C5665D2) == 0x0013A0, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_2_A8E7BD1946EFAF96E42BC89B5C5665D2' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_1_04CEDF8E487CB923C6B1D5A8BA8FB4BE) == 0x0013E8, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_1_04CEDF8E487CB923C6B1D5A8BA8FB4BE' has a wrong offset!");
static_assert(offsetof(USMEvent_FullLevelCharacter_C, SMGraphK2Node_GraphPropertyNode_A099D6694A4920D3869E5C822AE4C22C) == 0x001430, "Member 'USMEvent_FullLevelCharacter_C::SMGraphK2Node_GraphPropertyNode_A099D6694A4920D3869E5C822AE4C22C' has a wrong offset!");

}

