#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_FiveKillInOneRound

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_FiveKillInOneRound.SMEvent_FiveKillInOneRound_C
// 0x0770 (0x0E68 - 0x06F8)
class USMEvent_FiveKillInOneRound_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_CDC800254A08E7FC32D86DAB5F409110; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_6FE7040F4059F1E36BFB679850D921DD; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_55B4FAA64C95CC8A77753ABA9985A844; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_72EED7A948691982D97F288274AE2DD6; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_5F00790541B5DC02902180AF677927FD; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_7FBE96A94F732287058F7F818A6E3E03; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_56C5E1E148D7122200C684BCF32414D6; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_6E50C9AC4FB3FB3346B392B04714152E; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_00D8A2BC4DB22A3EEC6901A4E351F023; // 0x0E20(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_FiveKillInOneRound(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_EF925CEC41EBD08C4B1EA393521A71D9_096D38E949D95F7271A359B4975C0CAA();
	void SMGraphK2Node_GraphPropertyNode_5_8FBC1AC9AE62937ED288E1B431A37B3D_D6394113436A9B723ADB93B449E05BAF();
	void SMGraphK2Node_GraphPropertyNode_4_40A291E7A5009A35B29F31036F3FD958_8D1B51664323DD3DCE0D898A4E022AD3();
	void SMGraphK2Node_GraphPropertyNode_3_572C22F089455F870634233D9E5E5204_38BD76D449D435F48088C4AC57D4219E();
	void SMGraphK2Node_GraphPropertyNode_0_0113ABA7F31DE80A3380AA4065899485_570BC4744B2F23847AC0CDBB10600968();
	void SMGraphK2Node_GraphPropertyNode_1_518353AF11A99FDFEEDB66B6418EA001_1E20B8314A370DD429820C8774DE76F2();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_53D6468A4CCE1EEB2B79ED829C0EFDC5();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_FiveKillInOneRound_C">();
	}
	static class USMEvent_FiveKillInOneRound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_FiveKillInOneRound_C>();
	}
};
static_assert(alignof(USMEvent_FiveKillInOneRound_C) == 0x000008, "Wrong alignment on USMEvent_FiveKillInOneRound_C");
static_assert(sizeof(USMEvent_FiveKillInOneRound_C) == 0x000E68, "Wrong size on USMEvent_FiveKillInOneRound_C");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_FiveKillInOneRound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, SMGraphK2Node_TransitionResultNode_CDC800254A08E7FC32D86DAB5F409110) == 0x000700, "Member 'USMEvent_FiveKillInOneRound_C::SMGraphK2Node_TransitionResultNode_CDC800254A08E7FC32D86DAB5F409110' has a wrong offset!");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, SMGraphK2Node_StateEntryNode_6FE7040F4059F1E36BFB679850D921DD) == 0x0008F8, "Member 'USMEvent_FiveKillInOneRound_C::SMGraphK2Node_StateEntryNode_6FE7040F4059F1E36BFB679850D921DD' has a wrong offset!");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, SMGraphK2Node_ConduitResultNode_55B4FAA64C95CC8A77753ABA9985A844) == 0x000AD8, "Member 'USMEvent_FiveKillInOneRound_C::SMGraphK2Node_ConduitResultNode_55B4FAA64C95CC8A77753ABA9985A844' has a wrong offset!");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, SMGraphK2Node_GraphPropertyNode_5_72EED7A948691982D97F288274AE2DD6) == 0x000CB8, "Member 'USMEvent_FiveKillInOneRound_C::SMGraphK2Node_GraphPropertyNode_5_72EED7A948691982D97F288274AE2DD6' has a wrong offset!");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, SMGraphK2Node_GraphPropertyNode_4_5F00790541B5DC02902180AF677927FD) == 0x000D00, "Member 'USMEvent_FiveKillInOneRound_C::SMGraphK2Node_GraphPropertyNode_4_5F00790541B5DC02902180AF677927FD' has a wrong offset!");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, SMGraphK2Node_GraphPropertyNode_3_7FBE96A94F732287058F7F818A6E3E03) == 0x000D48, "Member 'USMEvent_FiveKillInOneRound_C::SMGraphK2Node_GraphPropertyNode_3_7FBE96A94F732287058F7F818A6E3E03' has a wrong offset!");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, SMGraphK2Node_GraphPropertyNode_2_56C5E1E148D7122200C684BCF32414D6) == 0x000D90, "Member 'USMEvent_FiveKillInOneRound_C::SMGraphK2Node_GraphPropertyNode_2_56C5E1E148D7122200C684BCF32414D6' has a wrong offset!");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, SMGraphK2Node_GraphPropertyNode_1_6E50C9AC4FB3FB3346B392B04714152E) == 0x000DD8, "Member 'USMEvent_FiveKillInOneRound_C::SMGraphK2Node_GraphPropertyNode_1_6E50C9AC4FB3FB3346B392B04714152E' has a wrong offset!");
static_assert(offsetof(USMEvent_FiveKillInOneRound_C, SMGraphK2Node_GraphPropertyNode_00D8A2BC4DB22A3EEC6901A4E351F023) == 0x000E20, "Member 'USMEvent_FiveKillInOneRound_C::SMGraphK2Node_GraphPropertyNode_00D8A2BC4DB22A3EEC6901A4E351F023' has a wrong offset!");

}

