#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_DoubleDown

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_DoubleDown.SMEvent_Medal_DoubleDown_C
// 0x0CF8 (0x13F0 - 0x06F8)
class USMEvent_Medal_DoubleDown_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_C75C4F524F6202D270366492D86BBAA4; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_5E319FF442204FBF76CA54829FC1A2F3; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_36B40E414B732B69E508448DFEDE9D13; // 0x0AF0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_A95DD2B4407FAB93D8E87691712EBFF8; // 0x0CD0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_D784DB574529AE5C491E849552C42C9E; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_DC9E5E334446DB6BAF9E869F3C9F036B; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_10AD14104489BAD722DD87B3F9A7F4CF; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_8DA3CF93417A5F00ABFA8697B77485C0; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_DB368E1B4159ED41C380199B9C3ED3B6; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_1E8DE91A42CF4DB19EC6778BF6877FD8; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_8576E0C84A6881F20D33D380D5443CBD; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_1A5F05944063AE57246A2180B94A3EB6; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_D936B6CD42050BF7ECAB7CAA59A6D6AF; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_0941FD384F33386D0DB028AB271FA4E1; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_275CEF9C43A3BB68BEAD38828E2AFCBC; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_C261612747FEAA101AF2A8957D4D412C; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_0D95E75647A4EE7F3F3EC6B9FBAC2B27; // 0x13A8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_DoubleDown(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_39E2A8D6435B7286C960F0B6E0E95E98();
	void SMGraphK2Node_GraphPropertyNode_11_1D5AE3AF69E079B559EF8AF2950B22F1_0ACDE6EC46C79E5ACA8F3493E14622E5();
	void SMGraphK2Node_GraphPropertyNode_10_3DA64C0AB489BBF8EAE713CAEED73534_DDA416CA44E2CE7F11F0C6AC222F7222();
	void SMGraphK2Node_GraphPropertyNode_9_518353AF11A99FDFEEDB66B6418EA001_138E1A274E8744ED4509D497AD19C8A6();
	void SMGraphK2Node_GraphPropertyNode_8_F5981CACB7D9769440965527229065DD_702964D5457A4565456BA0BD3B0C53E9();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_B38C8DAE45D0BDEFE87F92B2EE5CC913();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_028F4DB6495F80964BCF88B7F293D3C3();
	void SMGraphK2Node_GraphPropertyNode_7_DFC5DDF9620519B0185FE1F473B6BA24_98EA5F25401D235B5D78E884FCA54E66();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_5F3C9B8F47D736B93908A48812854D61();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_5CFE76984F24D7A836C9C8B6B9702104();
	void SMGraphK2Node_GraphPropertyNode_6_DFCF228DCE31F7B7DE4D5893884342DB_390C59CB445FB989F9E7D2BADC45BC5E();
	void SMGraphK2Node_GraphPropertyNode_4_45B0E59181DD8AE0D73A7A63BF827245_5E245D3A480CAF8C4CD1329C697ED097();
	void SMGraphK2Node_GraphPropertyNode_5_2A311C8A713F918A204014608D1EB855_0F1E4098405F10066F19ECB12C816C03();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_DoubleDown_C">();
	}
	static class USMEvent_Medal_DoubleDown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_DoubleDown_C>();
	}
};
static_assert(alignof(USMEvent_Medal_DoubleDown_C) == 0x000008, "Wrong alignment on USMEvent_Medal_DoubleDown_C");
static_assert(sizeof(USMEvent_Medal_DoubleDown_C) == 0x0013F0, "Wrong size on USMEvent_Medal_DoubleDown_C");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_DoubleDown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_TransitionResultNode_1_C75C4F524F6202D270366492D86BBAA4) == 0x000700, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_TransitionResultNode_1_C75C4F524F6202D270366492D86BBAA4' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_TransitionResultNode_5E319FF442204FBF76CA54829FC1A2F3) == 0x0008F8, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_TransitionResultNode_5E319FF442204FBF76CA54829FC1A2F3' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_ConduitResultNode_1_36B40E414B732B69E508448DFEDE9D13) == 0x000AF0, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_ConduitResultNode_1_36B40E414B732B69E508448DFEDE9D13' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_ConduitResultNode_A95DD2B4407FAB93D8E87691712EBFF8) == 0x000CD0, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_ConduitResultNode_A95DD2B4407FAB93D8E87691712EBFF8' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_StateEntryNode_D784DB574529AE5C491E849552C42C9E) == 0x000EB0, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_StateEntryNode_D784DB574529AE5C491E849552C42C9E' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_11_DC9E5E334446DB6BAF9E869F3C9F036B) == 0x001090, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_11_DC9E5E334446DB6BAF9E869F3C9F036B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_10_10AD14104489BAD722DD87B3F9A7F4CF) == 0x0010D8, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_10_10AD14104489BAD722DD87B3F9A7F4CF' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_9_8DA3CF93417A5F00ABFA8697B77485C0) == 0x001120, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_9_8DA3CF93417A5F00ABFA8697B77485C0' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_8_DB368E1B4159ED41C380199B9C3ED3B6) == 0x001168, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_8_DB368E1B4159ED41C380199B9C3ED3B6' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_7_1E8DE91A42CF4DB19EC6778BF6877FD8) == 0x0011B0, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_7_1E8DE91A42CF4DB19EC6778BF6877FD8' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_6_8576E0C84A6881F20D33D380D5443CBD) == 0x0011F8, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_6_8576E0C84A6881F20D33D380D5443CBD' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_5_1A5F05944063AE57246A2180B94A3EB6) == 0x001240, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_5_1A5F05944063AE57246A2180B94A3EB6' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_4_D936B6CD42050BF7ECAB7CAA59A6D6AF) == 0x001288, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_4_D936B6CD42050BF7ECAB7CAA59A6D6AF' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_3_0941FD384F33386D0DB028AB271FA4E1) == 0x0012D0, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_3_0941FD384F33386D0DB028AB271FA4E1' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_2_275CEF9C43A3BB68BEAD38828E2AFCBC) == 0x001318, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_2_275CEF9C43A3BB68BEAD38828E2AFCBC' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_1_C261612747FEAA101AF2A8957D4D412C) == 0x001360, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_1_C261612747FEAA101AF2A8957D4D412C' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_DoubleDown_C, SMGraphK2Node_GraphPropertyNode_0D95E75647A4EE7F3F3EC6B9FBAC2B27) == 0x0013A8, "Member 'USMEvent_Medal_DoubleDown_C::SMGraphK2Node_GraphPropertyNode_0D95E75647A4EE7F3F3EC6B9FBAC2B27' has a wrong offset!");

}

