#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_PSRC

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_PSRC.SMEvent_Kill_PSRC_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_PSRC_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_3D3CDCCE4DE99E21560D59B2819CD802; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_FC4205FA466E2F5F607B4696C16FA02B; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_7B7FC48145B89B2E36D8AE874B316055; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_B03429F44012D886FB3B85A6978B8E68; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_83DDEE214325F33F6196E288462E3C08; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_D0D0896B4F7243D133EA5481D73C58BC; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_A7CF7BA542048DEAE8279885526A68AA; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_9BB4C9AC48BEED1C2642D19B84A7F392; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_4C569E044CEEC9C888C99C8BB547296D; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_CE9C37B346DFC30B918BA28BAD7AD7FF; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_B0744FD84BDD5A92ACDBD8BDBC700D1D; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_9A550C6740F8672DE563109698A87F1A; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_CC077178458E79CF7FAB6E8BD7888AAC; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_A6AC2F0644C632F4E96C0099BA43AF49; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_PSRC(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_CB1EEDEF455FE35041026695233B0053();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_575CCD5540CABCC45C64DA87B34563BB();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_DC26CEC240FB876F75B69EBC304BB936();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_43A3384041EEC347C9676C86FD846412();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_9CCF813B419887A2541D28B9D59C1BA0();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_388D7EC54C715444CBBE0F9E39340011();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_0CC8AA414FE255FF0DF8A68460411EB2();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_59E4C1134E08293949C778B483A4E9B7();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_B921986B428E7317D9BFA19443FC511B();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_1BF182C3477403AD41A26CB7F16BB6F3();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_46E9239B4C00179BE4B4A1852F3F396E();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_95AD01824268C22A0D2C38BCF4187A76();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_PSRC_C">();
	}
	static class USMEvent_Kill_PSRC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_PSRC_C>();
	}
};
static_assert(alignof(USMEvent_Kill_PSRC_C) == 0x000008, "Wrong alignment on USMEvent_Kill_PSRC_C");
static_assert(sizeof(USMEvent_Kill_PSRC_C) == 0x000FD0, "Wrong size on USMEvent_Kill_PSRC_C");
static_assert(offsetof(USMEvent_Kill_PSRC_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_PSRC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_TransitionResultNode_3D3CDCCE4DE99E21560D59B2819CD802) == 0x000700, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_TransitionResultNode_3D3CDCCE4DE99E21560D59B2819CD802' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_StateEntryNode_FC4205FA466E2F5F607B4696C16FA02B) == 0x0008F8, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_StateEntryNode_FC4205FA466E2F5F607B4696C16FA02B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_ConduitResultNode_7B7FC48145B89B2E36D8AE874B316055) == 0x000AD8, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_ConduitResultNode_7B7FC48145B89B2E36D8AE874B316055' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_10_B03429F44012D886FB3B85A6978B8E68) == 0x000CB8, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_10_B03429F44012D886FB3B85A6978B8E68' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_9_83DDEE214325F33F6196E288462E3C08) == 0x000D00, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_9_83DDEE214325F33F6196E288462E3C08' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_8_D0D0896B4F7243D133EA5481D73C58BC) == 0x000D48, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_8_D0D0896B4F7243D133EA5481D73C58BC' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_7_A7CF7BA542048DEAE8279885526A68AA) == 0x000D90, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_7_A7CF7BA542048DEAE8279885526A68AA' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_6_9BB4C9AC48BEED1C2642D19B84A7F392) == 0x000DD8, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_6_9BB4C9AC48BEED1C2642D19B84A7F392' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_5_4C569E044CEEC9C888C99C8BB547296D) == 0x000E20, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_5_4C569E044CEEC9C888C99C8BB547296D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_4_CE9C37B346DFC30B918BA28BAD7AD7FF) == 0x000E68, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_4_CE9C37B346DFC30B918BA28BAD7AD7FF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_3_B0744FD84BDD5A92ACDBD8BDBC700D1D) == 0x000EB0, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_3_B0744FD84BDD5A92ACDBD8BDBC700D1D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_2_9A550C6740F8672DE563109698A87F1A) == 0x000EF8, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_2_9A550C6740F8672DE563109698A87F1A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_1_CC077178458E79CF7FAB6E8BD7888AAC) == 0x000F40, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_1_CC077178458E79CF7FAB6E8BD7888AAC' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_PSRC_C, SMGraphK2Node_GraphPropertyNode_A6AC2F0644C632F4E96C0099BA43AF49) == 0x000F88, "Member 'USMEvent_Kill_PSRC_C::SMGraphK2Node_GraphPropertyNode_A6AC2F0644C632F4E96C0099BA43AF49' has a wrong offset!");

}

