#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Capturing

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Capturing.SMEvent_Capturing_C
// 0x0278 (0x0980 - 0x0708)
class USMEvent_Capturing_C final : public UPBEvent_Capturing
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0708(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_150CC5CB48EDB18B7C9F758EBB38446B; // 0x0710(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_0559CBB0455C5F405ABD33BCBD3CC894; // 0x08F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_AB5FD0094502346E8C72CC80D9F2607B; // 0x0938(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Capturing(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_5C5F57944648BEC7FC563CB4FC5A937F();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_0E1993304237797BA8F757970FD70579();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_B900BBB14295176D8DF047A128C7F831();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Capturing_C">();
	}
	static class USMEvent_Capturing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Capturing_C>();
	}
};
static_assert(alignof(USMEvent_Capturing_C) == 0x000008, "Wrong alignment on USMEvent_Capturing_C");
static_assert(sizeof(USMEvent_Capturing_C) == 0x000980, "Wrong size on USMEvent_Capturing_C");
static_assert(offsetof(USMEvent_Capturing_C, UberGraphFrame) == 0x000708, "Member 'USMEvent_Capturing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Capturing_C, SMGraphK2Node_StateEntryNode_150CC5CB48EDB18B7C9F758EBB38446B) == 0x000710, "Member 'USMEvent_Capturing_C::SMGraphK2Node_StateEntryNode_150CC5CB48EDB18B7C9F758EBB38446B' has a wrong offset!");
static_assert(offsetof(USMEvent_Capturing_C, SMGraphK2Node_GraphPropertyNode_1_0559CBB0455C5F405ABD33BCBD3CC894) == 0x0008F0, "Member 'USMEvent_Capturing_C::SMGraphK2Node_GraphPropertyNode_1_0559CBB0455C5F405ABD33BCBD3CC894' has a wrong offset!");
static_assert(offsetof(USMEvent_Capturing_C, SMGraphK2Node_GraphPropertyNode_AB5FD0094502346E8C72CC80D9F2607B) == 0x000938, "Member 'USMEvent_Capturing_C::SMGraphK2Node_GraphPropertyNode_AB5FD0094502346E8C72CC80D9F2607B' has a wrong offset!");

}

