#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_DocFullLevel

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_DocFullLevel.SMEvent_DocFullLevel_C
// 0x0DD0 (0x1478 - 0x06A8)
class USMEvent_DocFullLevel_C final : public UPBEvent_LoadPlayerData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_48D5622F4A48F976AE2BAEA563D7D4CB; // 0x06B0(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_A3B9EC1646FF8019E5B3ECB04F8DB2F3; // 0x08A8(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_C0CBA4494C6A37B5C15B619411466DAE; // 0x0AA0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_157DD4AB49973850609348861D4AA3BF; // 0x0C80(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_7D64C05A4E880F5F684F678D02BA4A06; // 0x0E60(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_BD24C406463BAB17EC118DA3897F7287; // 0x1040(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_E4D6A2484E34684169BE7FB50B09AD36; // 0x1088(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_E74B8E8A4656CC02324A81A0BDA97A58; // 0x10D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_A9E87D00459EA3655AE329AAB1ED6AA8; // 0x1118(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_3EFDCE9F48E273918A2A10B4595E261A; // 0x1160(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_B42EE81C4BEE0F2B50EAB8A8091FF1ED; // 0x11A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_0ED64F174FE3C933539C3E810E91791D; // 0x11F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_7EA598C546CDF0F7AAD3E29A086741C1; // 0x1238(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_441C67A64AE848AB9C3649B8CC4C2B90; // 0x1280(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_1B11CEF7481BC4735E65E399378D99B5; // 0x12C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_D215894A4BCD8F64970AA2B6262D97A6; // 0x1310(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_6673B3BE48F3E431A40E9594FE6C3932; // 0x1358(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_7FA8BC5E4A0722747573C7A12000BB3E; // 0x13A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_F7F2D29A493106F5C3FD51A2354C51DF; // 0x13E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_F8CC397F4DAD2E3084DD8488CA6F7FD2; // 0x1430(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_DocFullLevel(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_303FE1DE48CE987BA2CE299E74A11204_1479E2C145193A0D05DC97A3974B3254();
	void SMGraphK2Node_GraphPropertyNode_14_8FBC1AC9AE62937ED288E1B431A37B3D_64DA053D4F7687741E0D3884B8742734();
	void SMGraphK2Node_GraphPropertyNode_13_40A291E7A5009A35B29F31036F3FD958_B97810FC46AEA6B8A23C89803E10BF02();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_935667E94FD7E950B13C22A2745818E3();
	void SMGraphK2Node_GraphPropertyNode_12_5DF5EB69FB5B1350C77BA421EBD2B8FA_EB06EF39487F9E0CC8D18988C572F44D();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_59083A334DB156E6B6C1EAAB7AFDB044();
	void SMGraphK2Node_GraphPropertyNode_2_7E261F3E5C0FA126924682D5024D57B6_75F05F9A447020FD793B15A475F9EDA0();
	void SMGraphK2Node_GraphPropertyNode_11_924251CE29BC1D7EDCFAB4DB3C0223AE_4C288C4A4F0E593AF226A690F2BF3F60();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_BC35F2C449681293D7A00A8C64111D29();
	void SMGraphK2Node_GraphPropertyNode_4_3DA64C0AB489BBF8EAE713CAEED73534_46DC20614D32EF85356745AD17B3CEEE();
	void SMGraphK2Node_GraphPropertyNode_10_E0C31B330F532F42E5913DACC16F802B_5B0C3DDB4BA3C58D83F596AF45338F07();
	void SMGraphK2Node_GraphPropertyNode_5_9B2E76CB0D5642A91285ECD0AD22455D_08DD1B1F4EA28F7EDD47768B4AA6EF53();
	void SMGraphK2Node_GraphPropertyNode_6_1DBA4F3EBF49270A15FCABAE378D5A28_EC8994E247BECFFC9680F08F575E425F();
	void SMGraphK2Node_GraphPropertyNode_9_A22120CDAC3ACF3D903EA80FE84B0006_4050DE0843589D93A4AC93A56EFA8F7B();
	void SMGraphK2Node_GraphPropertyNode_7_83FB9728653B5875C5D29938A1862987_B5B1AE9A49375A3C2A0EBBAAFEEDACFA();
	void SMGraphK2Node_GraphPropertyNode_8_471AAF85555CF2679A4535DADFC63770_CCB539B7418D7DCAE2533E9E1516A9BB();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_DocFullLevel_C">();
	}
	static class USMEvent_DocFullLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_DocFullLevel_C>();
	}
};
static_assert(alignof(USMEvent_DocFullLevel_C) == 0x000008, "Wrong alignment on USMEvent_DocFullLevel_C");
static_assert(sizeof(USMEvent_DocFullLevel_C) == 0x001478, "Wrong size on USMEvent_DocFullLevel_C");
static_assert(offsetof(USMEvent_DocFullLevel_C, UberGraphFrame) == 0x0006A8, "Member 'USMEvent_DocFullLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_TransitionResultNode_1_48D5622F4A48F976AE2BAEA563D7D4CB) == 0x0006B0, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_TransitionResultNode_1_48D5622F4A48F976AE2BAEA563D7D4CB' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_TransitionResultNode_A3B9EC1646FF8019E5B3ECB04F8DB2F3) == 0x0008A8, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_TransitionResultNode_A3B9EC1646FF8019E5B3ECB04F8DB2F3' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_StateEntryNode_C0CBA4494C6A37B5C15B619411466DAE) == 0x000AA0, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_StateEntryNode_C0CBA4494C6A37B5C15B619411466DAE' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_ConduitResultNode_1_157DD4AB49973850609348861D4AA3BF) == 0x000C80, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_ConduitResultNode_1_157DD4AB49973850609348861D4AA3BF' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_ConduitResultNode_7D64C05A4E880F5F684F678D02BA4A06) == 0x000E60, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_ConduitResultNode_7D64C05A4E880F5F684F678D02BA4A06' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_14_BD24C406463BAB17EC118DA3897F7287) == 0x001040, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_14_BD24C406463BAB17EC118DA3897F7287' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_13_E4D6A2484E34684169BE7FB50B09AD36) == 0x001088, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_13_E4D6A2484E34684169BE7FB50B09AD36' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_12_E74B8E8A4656CC02324A81A0BDA97A58) == 0x0010D0, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_12_E74B8E8A4656CC02324A81A0BDA97A58' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_11_A9E87D00459EA3655AE329AAB1ED6AA8) == 0x001118, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_11_A9E87D00459EA3655AE329AAB1ED6AA8' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_10_3EFDCE9F48E273918A2A10B4595E261A) == 0x001160, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_10_3EFDCE9F48E273918A2A10B4595E261A' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_9_B42EE81C4BEE0F2B50EAB8A8091FF1ED) == 0x0011A8, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_9_B42EE81C4BEE0F2B50EAB8A8091FF1ED' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_8_0ED64F174FE3C933539C3E810E91791D) == 0x0011F0, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_8_0ED64F174FE3C933539C3E810E91791D' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_7_7EA598C546CDF0F7AAD3E29A086741C1) == 0x001238, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_7_7EA598C546CDF0F7AAD3E29A086741C1' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_6_441C67A64AE848AB9C3649B8CC4C2B90) == 0x001280, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_6_441C67A64AE848AB9C3649B8CC4C2B90' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_5_1B11CEF7481BC4735E65E399378D99B5) == 0x0012C8, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_5_1B11CEF7481BC4735E65E399378D99B5' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_4_D215894A4BCD8F64970AA2B6262D97A6) == 0x001310, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_4_D215894A4BCD8F64970AA2B6262D97A6' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_3_6673B3BE48F3E431A40E9594FE6C3932) == 0x001358, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_3_6673B3BE48F3E431A40E9594FE6C3932' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_2_7FA8BC5E4A0722747573C7A12000BB3E) == 0x0013A0, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_2_7FA8BC5E4A0722747573C7A12000BB3E' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_1_F7F2D29A493106F5C3FD51A2354C51DF) == 0x0013E8, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_1_F7F2D29A493106F5C3FD51A2354C51DF' has a wrong offset!");
static_assert(offsetof(USMEvent_DocFullLevel_C, SMGraphK2Node_GraphPropertyNode_F8CC397F4DAD2E3084DD8488CA6F7FD2) == 0x001430, "Member 'USMEvent_DocFullLevel_C::SMGraphK2Node_GraphPropertyNode_F8CC397F4DAD2E3084DD8488CA6F7FD2' has a wrong offset!");

}

