#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_MOSIN_Iron

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_MOSIN_Iron.SMEvent_Kill_MOSIN_Iron_C
// 0x0E18 (0x1510 - 0x06F8)
class USMEvent_Kill_MOSIN_Iron_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_88E064794D6DFDF9E249068965A2576A; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_265C0E9F4DD5159ABCF5B58AD4280917; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_FDAD59F5465A91595C6502B1EF260C90; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_055AEB1B44821BF85B923E8A3FAD80F2; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_EC8AE368497A5A9008002E8F2BA46038; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_15_B94E7CE94756CAE385C25B9513AA285D; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_30A3855A44BB8B51A7E2A59A62D06ADC; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_41FFB93141F942076F2D94BADC1B10D0; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_E502CB3541B52E328365F5AA1C550E56; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_1924A7B64071D0267909A6BAA08D4C1F; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_1B0BEBBB43FD51027C5EDD99B3750F4D; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_51223960417EC31898AEC29C501BBD08; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_4CCA53C34D4112657308ADB82C29CE65; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_0C8BCE7F4282DE3B87F67AA0848C6160; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_D44A5EBE49920E3050F394A99CEC5266; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_D24C7C2F41160B766A6373B0891871F6; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_89B294A14750E9140D0FC28E7A53BED4; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_E2678C594E33E4A5C0D885B5BDCF6FFB; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_82BC21144C3180D63D3718B8AA4A36CF; // 0x1438(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_64E525664312E6F820088AAD01AEB9CE; // 0x1480(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_415EC5E9434DD7C70AB61388DD59F9C5; // 0x14C8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_MOSIN_Iron(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_22D750674890513C207453831D63BC78();
	void SMGraphK2Node_GraphPropertyNode_15_74676800E2A3FE55DA51F3380EA14F8A_324F15F543FCBB71F9FE47AF00C37B7D();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_7A6481F44943D0292784A5B0B41D9125();
	void SMGraphK2Node_GraphPropertyNode_14_3DA64C0AB489BBF8EAE713CAEED73534_593A099B4B79606037CA9895104D4329();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_F47FFD1445B99A42FB7C7FABB170C16E();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_032683FF43A266F429D20E9C2D09BC1F();
	void SMGraphK2Node_GraphPropertyNode_13_518353AF11A99FDFEEDB66B6418EA001_E5E5CDCB4BD4F4D3F70B6A98D4C06A61();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_4EA5E3CC44703421C9564A8BE808EB55();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_B102F5A6484678F5A44698A33581BB2C();
	void SMGraphK2Node_GraphPropertyNode_12_007D3153FF1A5D10F748FE4E382A1DA7_87C29F564B4042CC7CCDF79155FD163D();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_16681ADA448065E24FDD12874F95E783();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_689A85834C288C27A8F15085CAC9521D();
	void SMGraphK2Node_GraphPropertyNode_11_4E0377A7C10D006F25AAEDD09CE6BC56_41835D3C41E7EB16F759C29FD837E98D();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_93B3216C457C326A8B336F9EAE36DECE();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_FF622EBD404D5DE23F24CA975B926BB2();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_B682A3544D5B5225660F838190EF7AA4();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_0A5EB47F4D357B09DDE04F99953AA307();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_MOSIN_Iron_C">();
	}
	static class USMEvent_Kill_MOSIN_Iron_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_MOSIN_Iron_C>();
	}
};
static_assert(alignof(USMEvent_Kill_MOSIN_Iron_C) == 0x000008, "Wrong alignment on USMEvent_Kill_MOSIN_Iron_C");
static_assert(sizeof(USMEvent_Kill_MOSIN_Iron_C) == 0x001510, "Wrong size on USMEvent_Kill_MOSIN_Iron_C");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_MOSIN_Iron_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_TransitionResultNode_1_88E064794D6DFDF9E249068965A2576A) == 0x000700, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_TransitionResultNode_1_88E064794D6DFDF9E249068965A2576A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_TransitionResultNode_265C0E9F4DD5159ABCF5B58AD4280917) == 0x0008F8, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_TransitionResultNode_265C0E9F4DD5159ABCF5B58AD4280917' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_ConduitResultNode_1_FDAD59F5465A91595C6502B1EF260C90) == 0x000AF0, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_ConduitResultNode_1_FDAD59F5465A91595C6502B1EF260C90' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_StateEntryNode_055AEB1B44821BF85B923E8A3FAD80F2) == 0x000CD0, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_StateEntryNode_055AEB1B44821BF85B923E8A3FAD80F2' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_ConduitResultNode_EC8AE368497A5A9008002E8F2BA46038) == 0x000EB0, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_ConduitResultNode_EC8AE368497A5A9008002E8F2BA46038' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_15_B94E7CE94756CAE385C25B9513AA285D) == 0x001090, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_15_B94E7CE94756CAE385C25B9513AA285D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_14_30A3855A44BB8B51A7E2A59A62D06ADC) == 0x0010D8, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_14_30A3855A44BB8B51A7E2A59A62D06ADC' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_13_41FFB93141F942076F2D94BADC1B10D0) == 0x001120, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_13_41FFB93141F942076F2D94BADC1B10D0' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_12_E502CB3541B52E328365F5AA1C550E56) == 0x001168, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_12_E502CB3541B52E328365F5AA1C550E56' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_11_1924A7B64071D0267909A6BAA08D4C1F) == 0x0011B0, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_11_1924A7B64071D0267909A6BAA08D4C1F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_10_1B0BEBBB43FD51027C5EDD99B3750F4D) == 0x0011F8, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_10_1B0BEBBB43FD51027C5EDD99B3750F4D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_9_51223960417EC31898AEC29C501BBD08) == 0x001240, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_9_51223960417EC31898AEC29C501BBD08' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_8_4CCA53C34D4112657308ADB82C29CE65) == 0x001288, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_8_4CCA53C34D4112657308ADB82C29CE65' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_7_0C8BCE7F4282DE3B87F67AA0848C6160) == 0x0012D0, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_7_0C8BCE7F4282DE3B87F67AA0848C6160' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_6_D44A5EBE49920E3050F394A99CEC5266) == 0x001318, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_6_D44A5EBE49920E3050F394A99CEC5266' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_5_D24C7C2F41160B766A6373B0891871F6) == 0x001360, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_5_D24C7C2F41160B766A6373B0891871F6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_4_89B294A14750E9140D0FC28E7A53BED4) == 0x0013A8, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_4_89B294A14750E9140D0FC28E7A53BED4' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_3_E2678C594E33E4A5C0D885B5BDCF6FFB) == 0x0013F0, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_3_E2678C594E33E4A5C0D885B5BDCF6FFB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_2_82BC21144C3180D63D3718B8AA4A36CF) == 0x001438, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_2_82BC21144C3180D63D3718B8AA4A36CF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_1_64E525664312E6F820088AAD01AEB9CE) == 0x001480, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_1_64E525664312E6F820088AAD01AEB9CE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_Iron_C, SMGraphK2Node_GraphPropertyNode_415EC5E9434DD7C70AB61388DD59F9C5) == 0x0014C8, "Member 'USMEvent_Kill_MOSIN_Iron_C::SMGraphK2Node_GraphPropertyNode_415EC5E9434DD7C70AB61388DD59F9C5' has a wrong offset!");

}

