#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_GameWin

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_GameWin.SMEvent_GameWin_C
// 0x0728 (0x0DE0 - 0x06B8)
class USMEvent_GameWin_C final : public UPBEvent_GameEnd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_F070A71D4281FA8493843D9FA830999E; // 0x06C0(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_8F49E1D94CF16154787096BE02FF950A; // 0x08B8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_6E6D91C94E6282C7A74028A0328A4101; // 0x0A98(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_FD7B6B814E5D3AA5E44A6AAB206D2686; // 0x0C78(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_5D6E13554BE85B6B37735BAE6C339F1F; // 0x0CC0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_AF8B2FFB4D0572D2F79D1E907564DA05; // 0x0D08(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_80AD2B7448039BE42489A582112CDB9C; // 0x0D50(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_64BE4E6A4F34CA1AF1BAF9AE3887B8AE; // 0x0D98(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_GameWin(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_2BE2B3A0441589142EB50EA1F4AB4721();
	void SMGraphK2Node_GraphPropertyNode_4_37430E3BBE049930F467616E9AE2642A_3910056945D3CF5D9D2353AF83126304();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_06F2319E4C9BD8D64F2C85B4AEC182E6();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_C199A3F94390BCB8D9FB849AE45B6D93();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_B48F6CD24315A23DE083FD969ECBC7B4();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_31B0C7D049FE640F2A8DABB055869FDA();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_GameWin_C">();
	}
	static class USMEvent_GameWin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_GameWin_C>();
	}
};
static_assert(alignof(USMEvent_GameWin_C) == 0x000008, "Wrong alignment on USMEvent_GameWin_C");
static_assert(sizeof(USMEvent_GameWin_C) == 0x000DE0, "Wrong size on USMEvent_GameWin_C");
static_assert(offsetof(USMEvent_GameWin_C, UberGraphFrame) == 0x0006B8, "Member 'USMEvent_GameWin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_GameWin_C, SMGraphK2Node_TransitionResultNode_F070A71D4281FA8493843D9FA830999E) == 0x0006C0, "Member 'USMEvent_GameWin_C::SMGraphK2Node_TransitionResultNode_F070A71D4281FA8493843D9FA830999E' has a wrong offset!");
static_assert(offsetof(USMEvent_GameWin_C, SMGraphK2Node_ConduitResultNode_8F49E1D94CF16154787096BE02FF950A) == 0x0008B8, "Member 'USMEvent_GameWin_C::SMGraphK2Node_ConduitResultNode_8F49E1D94CF16154787096BE02FF950A' has a wrong offset!");
static_assert(offsetof(USMEvent_GameWin_C, SMGraphK2Node_StateEntryNode_6E6D91C94E6282C7A74028A0328A4101) == 0x000A98, "Member 'USMEvent_GameWin_C::SMGraphK2Node_StateEntryNode_6E6D91C94E6282C7A74028A0328A4101' has a wrong offset!");
static_assert(offsetof(USMEvent_GameWin_C, SMGraphK2Node_GraphPropertyNode_4_FD7B6B814E5D3AA5E44A6AAB206D2686) == 0x000C78, "Member 'USMEvent_GameWin_C::SMGraphK2Node_GraphPropertyNode_4_FD7B6B814E5D3AA5E44A6AAB206D2686' has a wrong offset!");
static_assert(offsetof(USMEvent_GameWin_C, SMGraphK2Node_GraphPropertyNode_3_5D6E13554BE85B6B37735BAE6C339F1F) == 0x000CC0, "Member 'USMEvent_GameWin_C::SMGraphK2Node_GraphPropertyNode_3_5D6E13554BE85B6B37735BAE6C339F1F' has a wrong offset!");
static_assert(offsetof(USMEvent_GameWin_C, SMGraphK2Node_GraphPropertyNode_2_AF8B2FFB4D0572D2F79D1E907564DA05) == 0x000D08, "Member 'USMEvent_GameWin_C::SMGraphK2Node_GraphPropertyNode_2_AF8B2FFB4D0572D2F79D1E907564DA05' has a wrong offset!");
static_assert(offsetof(USMEvent_GameWin_C, SMGraphK2Node_GraphPropertyNode_1_80AD2B7448039BE42489A582112CDB9C) == 0x000D50, "Member 'USMEvent_GameWin_C::SMGraphK2Node_GraphPropertyNode_1_80AD2B7448039BE42489A582112CDB9C' has a wrong offset!");
static_assert(offsetof(USMEvent_GameWin_C, SMGraphK2Node_GraphPropertyNode_64BE4E6A4F34CA1AF1BAF9AE3887B8AE) == 0x000D98, "Member 'USMEvent_GameWin_C::SMGraphK2Node_GraphPropertyNode_64BE4E6A4F34CA1AF1BAF9AE3887B8AE' has a wrong offset!");

}

