#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_TwentyKillInOneRush

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_TwentyKillInOneRush.SMEvent_TwentyKillInOneRush_C
// 0x0CB0 (0x1428 - 0x0778)
class USMEvent_TwentyKillInOneRush_C final : public UPBEvent_MatchEnd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_5A4ED69447555F703A79F88852D4CA1A; // 0x0780(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_EFBF2AFC41D933355C3E3F96FC3117BC; // 0x0978(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_9158D1D341FE395F509FDFB39DCE3A89; // 0x0B70(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_9B09B5E442C01BD71D4E5E840533B16C; // 0x0D50(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_A306D1474F7301CA45E44699096E6A20; // 0x0F30(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_B319684B4C7EABBD55719AA7306945E7; // 0x1110(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_D828626740DF8256161749841A13881D; // 0x1158(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_0309F84C4CB4BAEBEEA0F5A9F5E04F89; // 0x11A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_11C893CF4B93A3CF2AABCC82B2CE1C1E; // 0x11E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_587E9EE34F9D5E7D2C043E8381B037EE; // 0x1230(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_67748B074D209D30E7314FA16C264E3B; // 0x1278(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_94305ECF4389E29BC98B35BB60DF16D5; // 0x12C0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_2A7ACB2C45BD15C2686BA58CF5133306; // 0x1308(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_00309DAC4EFB5932BF016E9340CE1BC5; // 0x1350(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_CF3313EA48B95F5FE763D0BEC17EDFC6; // 0x1398(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_CE9C61404232B28AB8E8838052511A58; // 0x13E0(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_TwentyKillInOneRush(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_152EDFB141A9A6A469AED28D12B85901_3575DED5474CD726B04A3AAAB17F4393();
	void SMGraphK2Node_GraphPropertyNode_10_3DA64C0AB489BBF8EAE713CAEED73534_979D9A7E4272913A96BAE9B6624C387F();
	void SMGraphK2Node_GraphPropertyNode_9_518353AF11A99FDFEEDB66B6418EA001_FF6C92C8410F806C0350A2A4D5B97FC2();
	void SMGraphK2Node_GraphPropertyNode_8_7E261F3E5C0FA126924682D5024D57B6_13FCE05E47EFB8AABE23D3A791D29BEA();
	void SMGraphK2Node_GraphPropertyNode_7_8FBC1AC9AE62937ED288E1B431A37B3D_C2197B3743A340280EF25FA89C0272F1();
	void SMGraphK2Node_GraphPropertyNode_0_9B726A79733F234A2592B22CBF705BAE_173F44C740A36E65442B659A77C05BB9();
	void SMGraphK2Node_GraphPropertyNode_6_40A291E7A5009A35B29F31036F3FD958_C61EEACE4CACB7750D202AA74EDDF9BE();
	void SMGraphK2Node_GraphPropertyNode_1_B580CFBBEE69D2AE9AD084C568474214_61B83B98442C99B7B1B9248DEF933FF0();
	void SMGraphK2Node_GraphPropertyNode_2_C04E0C318D415947F3C0A291B4AF3A6D_23157C0247057793BA01C989D6F611C8();
	void SMGraphK2Node_GraphPropertyNode_5_07CA978E0CC48D17FC9737FC6562B6D9_2DD42D1D4A160C2DD72DDF8531039624();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_1C7F4F6543B54EDEA9F2D2886F6F2A65();
	void SMGraphK2Node_GraphPropertyNode_4_3DA64C0AB489BBF8EAE713CAEED73534_9C67C157481462719FF23999F333C4EB();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_TwentyKillInOneRush_C">();
	}
	static class USMEvent_TwentyKillInOneRush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_TwentyKillInOneRush_C>();
	}
};
static_assert(alignof(USMEvent_TwentyKillInOneRush_C) == 0x000008, "Wrong alignment on USMEvent_TwentyKillInOneRush_C");
static_assert(sizeof(USMEvent_TwentyKillInOneRush_C) == 0x001428, "Wrong size on USMEvent_TwentyKillInOneRush_C");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, UberGraphFrame) == 0x000778, "Member 'USMEvent_TwentyKillInOneRush_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_TransitionResultNode_1_5A4ED69447555F703A79F88852D4CA1A) == 0x000780, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_TransitionResultNode_1_5A4ED69447555F703A79F88852D4CA1A' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_TransitionResultNode_EFBF2AFC41D933355C3E3F96FC3117BC) == 0x000978, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_TransitionResultNode_EFBF2AFC41D933355C3E3F96FC3117BC' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_ConduitResultNode_1_9158D1D341FE395F509FDFB39DCE3A89) == 0x000B70, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_ConduitResultNode_1_9158D1D341FE395F509FDFB39DCE3A89' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_StateEntryNode_9B09B5E442C01BD71D4E5E840533B16C) == 0x000D50, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_StateEntryNode_9B09B5E442C01BD71D4E5E840533B16C' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_ConduitResultNode_A306D1474F7301CA45E44699096E6A20) == 0x000F30, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_ConduitResultNode_A306D1474F7301CA45E44699096E6A20' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_10_B319684B4C7EABBD55719AA7306945E7) == 0x001110, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_10_B319684B4C7EABBD55719AA7306945E7' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_9_D828626740DF8256161749841A13881D) == 0x001158, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_9_D828626740DF8256161749841A13881D' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_8_0309F84C4CB4BAEBEEA0F5A9F5E04F89) == 0x0011A0, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_8_0309F84C4CB4BAEBEEA0F5A9F5E04F89' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_7_11C893CF4B93A3CF2AABCC82B2CE1C1E) == 0x0011E8, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_7_11C893CF4B93A3CF2AABCC82B2CE1C1E' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_6_587E9EE34F9D5E7D2C043E8381B037EE) == 0x001230, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_6_587E9EE34F9D5E7D2C043E8381B037EE' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_5_67748B074D209D30E7314FA16C264E3B) == 0x001278, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_5_67748B074D209D30E7314FA16C264E3B' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_4_94305ECF4389E29BC98B35BB60DF16D5) == 0x0012C0, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_4_94305ECF4389E29BC98B35BB60DF16D5' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_3_2A7ACB2C45BD15C2686BA58CF5133306) == 0x001308, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_3_2A7ACB2C45BD15C2686BA58CF5133306' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_2_00309DAC4EFB5932BF016E9340CE1BC5) == 0x001350, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_2_00309DAC4EFB5932BF016E9340CE1BC5' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_1_CF3313EA48B95F5FE763D0BEC17EDFC6) == 0x001398, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_1_CF3313EA48B95F5FE763D0BEC17EDFC6' has a wrong offset!");
static_assert(offsetof(USMEvent_TwentyKillInOneRush_C, SMGraphK2Node_GraphPropertyNode_CE9C61404232B28AB8E8838052511A58) == 0x0013E0, "Member 'USMEvent_TwentyKillInOneRush_C::SMGraphK2Node_GraphPropertyNode_CE9C61404232B28AB8E8838052511A58' has a wrong offset!");

}

