#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Level10

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Level10.SMEvent_Level10_C
// 0x0DD0 (0x1478 - 0x06A8)
class USMEvent_Level10_C final : public UPBEvent_LoadPlayerData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_BE2836F44B9E29A6690F0E89CE5ECE67; // 0x06B0(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_4B99949742AF5B6953C40F9EB8E1E94B; // 0x08A8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_4A21AE50413F9C3DC9D9EE9178146E14; // 0x0AA0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_1083ED454CEDDC5DB1356CB56CA2C528; // 0x0C80(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_9945583B459B88192821FB803E7A6AFF; // 0x0E60(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_17352E27442182049124E2B936402639; // 0x1040(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_F9AE8FC648DCD04C7238D98371F22048; // 0x1088(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_B06EDF31406AF0A8F40A7982E6A34711; // 0x10D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_D9FC723E44E80786DFA4938E4AD23AF2; // 0x1118(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_EFB554E346FA0C49A2235F8B69F4B7FC; // 0x1160(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_2B8055CF47A0E5457B4D34B9F7602F9F; // 0x11A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_4D4EF96F47C560EFD4A0FFBC9D575F16; // 0x11F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_0FF3E98E4343D035560F87B746E2BD34; // 0x1238(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_34A142EA45EAB15F2DEA058BAE9EDCFA; // 0x1280(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_94B57A62483F3BD6A45ABC94C5DD7633; // 0x12C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_2F13EEF247609086DF23C4875C11E4FC; // 0x1310(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_0860821E4C86AC5E73408D91D199BA40; // 0x1358(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_73AFE05946353527E8168397322481D7; // 0x13A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_8FD6DEF7475BF8027418868B9B750D17; // 0x13E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2C3C843B437D10F09080F4A0EBDF0575; // 0x1430(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Level10(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_08F3FE744A9575200436A29D111F1B52_9E860AA9479350F6EEB83CA67C5DF582();
	void SMGraphK2Node_GraphPropertyNode_14_3DA64C0AB489BBF8EAE713CAEED73534_7D48A222443951A8D36CB6B327B10A6C();
	void SMGraphK2Node_GraphPropertyNode_13_518353AF11A99FDFEEDB66B6418EA001_342D6AE5463D1A4B87AE52B5D7B1CF02();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_DD9F3DA042E4CDD81CE225B1B3DEF309();
	void SMGraphK2Node_GraphPropertyNode_12_7E261F3E5C0FA126924682D5024D57B6_DB15971648FBCD913D02B9918CE74677();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_A966C9CC49020D437CD99BAD138C3284();
	void SMGraphK2Node_GraphPropertyNode_2_5DF5EB69FB5B1350C77BA421EBD2B8FA_543483554BF3C4C7F104829CB4FCD9D6();
	void SMGraphK2Node_GraphPropertyNode_11_8FBC1AC9AE62937ED288E1B431A37B3D_8A22AA42403DD2468E2DBD82F02954BD();
	void SMGraphK2Node_GraphPropertyNode_3_924251CE29BC1D7EDCFAB4DB3C0223AE_911031824DA4EF8A9D828BA78F9A711F();
	void SMGraphK2Node_GraphPropertyNode_4_E0C31B330F532F42E5913DACC16F802B_35BDF72C43B5D65DEC7A7BBD81FD3A87();
	void SMGraphK2Node_GraphPropertyNode_10_40A291E7A5009A35B29F31036F3FD958_8360C0FB45916D4882F48BBDD933B71B();
	void SMGraphK2Node_GraphPropertyNode_5_A22120CDAC3ACF3D903EA80FE84B0006_D8D4B92C44C82C937D8AE4A82198BA67();
	void SMGraphK2Node_GraphPropertyNode_6_471AAF85555CF2679A4535DADFC63770_7A81622B461C36CE12C1C688F0486C62();
	void SMGraphK2Node_GraphPropertyNode_9_9B2E76CB0D5642A91285ECD0AD22455D_DA902FC547664FBB7E9CCC84A8C0BA9D();
	void SMGraphK2Node_GraphPropertyNode_7_83FB9728653B5875C5D29938A1862987_DD1941674D7091E2447C5E91DBAFD56E();
	void SMGraphK2Node_GraphPropertyNode_8_1DBA4F3EBF49270A15FCABAE378D5A28_6B6E18D1409E90175B73ACA5A972864D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Level10_C">();
	}
	static class USMEvent_Level10_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Level10_C>();
	}
};
static_assert(alignof(USMEvent_Level10_C) == 0x000008, "Wrong alignment on USMEvent_Level10_C");
static_assert(sizeof(USMEvent_Level10_C) == 0x001478, "Wrong size on USMEvent_Level10_C");
static_assert(offsetof(USMEvent_Level10_C, UberGraphFrame) == 0x0006A8, "Member 'USMEvent_Level10_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_TransitionResultNode_1_BE2836F44B9E29A6690F0E89CE5ECE67) == 0x0006B0, "Member 'USMEvent_Level10_C::SMGraphK2Node_TransitionResultNode_1_BE2836F44B9E29A6690F0E89CE5ECE67' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_TransitionResultNode_4B99949742AF5B6953C40F9EB8E1E94B) == 0x0008A8, "Member 'USMEvent_Level10_C::SMGraphK2Node_TransitionResultNode_4B99949742AF5B6953C40F9EB8E1E94B' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_ConduitResultNode_1_4A21AE50413F9C3DC9D9EE9178146E14) == 0x000AA0, "Member 'USMEvent_Level10_C::SMGraphK2Node_ConduitResultNode_1_4A21AE50413F9C3DC9D9EE9178146E14' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_StateEntryNode_1083ED454CEDDC5DB1356CB56CA2C528) == 0x000C80, "Member 'USMEvent_Level10_C::SMGraphK2Node_StateEntryNode_1083ED454CEDDC5DB1356CB56CA2C528' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_ConduitResultNode_9945583B459B88192821FB803E7A6AFF) == 0x000E60, "Member 'USMEvent_Level10_C::SMGraphK2Node_ConduitResultNode_9945583B459B88192821FB803E7A6AFF' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_14_17352E27442182049124E2B936402639) == 0x001040, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_14_17352E27442182049124E2B936402639' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_13_F9AE8FC648DCD04C7238D98371F22048) == 0x001088, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_13_F9AE8FC648DCD04C7238D98371F22048' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_12_B06EDF31406AF0A8F40A7982E6A34711) == 0x0010D0, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_12_B06EDF31406AF0A8F40A7982E6A34711' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_11_D9FC723E44E80786DFA4938E4AD23AF2) == 0x001118, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_11_D9FC723E44E80786DFA4938E4AD23AF2' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_10_EFB554E346FA0C49A2235F8B69F4B7FC) == 0x001160, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_10_EFB554E346FA0C49A2235F8B69F4B7FC' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_9_2B8055CF47A0E5457B4D34B9F7602F9F) == 0x0011A8, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_9_2B8055CF47A0E5457B4D34B9F7602F9F' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_8_4D4EF96F47C560EFD4A0FFBC9D575F16) == 0x0011F0, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_8_4D4EF96F47C560EFD4A0FFBC9D575F16' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_7_0FF3E98E4343D035560F87B746E2BD34) == 0x001238, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_7_0FF3E98E4343D035560F87B746E2BD34' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_6_34A142EA45EAB15F2DEA058BAE9EDCFA) == 0x001280, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_6_34A142EA45EAB15F2DEA058BAE9EDCFA' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_5_94B57A62483F3BD6A45ABC94C5DD7633) == 0x0012C8, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_5_94B57A62483F3BD6A45ABC94C5DD7633' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_4_2F13EEF247609086DF23C4875C11E4FC) == 0x001310, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_4_2F13EEF247609086DF23C4875C11E4FC' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_3_0860821E4C86AC5E73408D91D199BA40) == 0x001358, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_3_0860821E4C86AC5E73408D91D199BA40' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_2_73AFE05946353527E8168397322481D7) == 0x0013A0, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_2_73AFE05946353527E8168397322481D7' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_1_8FD6DEF7475BF8027418868B9B750D17) == 0x0013E8, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_1_8FD6DEF7475BF8027418868B9B750D17' has a wrong offset!");
static_assert(offsetof(USMEvent_Level10_C, SMGraphK2Node_GraphPropertyNode_2C3C843B437D10F09080F4A0EBDF0575) == 0x001430, "Member 'USMEvent_Level10_C::SMGraphK2Node_GraphPropertyNode_2C3C843B437D10F09080F4A0EBDF0575' has a wrong offset!");

}

