#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_SG

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_SG.SMEvent_Kill_SG_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_SG_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_2211ADBB4DBE4EFC77E217B8005C8445; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_B9A0F2644BD5EB33D834FDB0D1C192ED; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_DF8228F8458EF68CC10B6ABCEB2D5016; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_C7BE1E7045E7231C9912919158341931; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_2770BBDF4A25218CEFEED79F080AEC3F; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_24731813470DFA4C89AD6F894E8964CC; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_14CE36684737285F956E38A86256E4AD; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_6B6B96CF4A3FC6D6933C798F707345F6; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_073D918E44D83441F37E76A162FD0E57; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_9C5CE8214987D7CF3F652198C0378B02; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_2396D88D44547AF707D65F899EA53313; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_FB7FFB814D66BA983AADD5B20C86B7A6; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_C8361E8E405A9518F426569E90A7A3F1; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_09595C064EBE254F44951F8940B11C7D; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_SG(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_C458F51E44AF19671B5130A63735EFFF();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_2D0541FF43EC714A2903BEBCBC4ECBDC();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_1234004C41405DAA5693B38B016D2301();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_C88EB78D44A01B5EF54B0C805A97F7C3();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_AC7F18F645B2FCA7006BF08492D09EBD();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_8C7983974D349D5C2B0D119B8DAA4C39();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_8554986E40D13190AFEBAEB697CB7524();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_B9109930400D1A3DA2C8F58DE940D0EE();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_BF57F6704C13857E76CE0B9ECC2B89C8();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_0D171D5542C657F6952C3E9382899237();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_382AE9C14FF668C656FD13990849ABEE();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_6FD77DEF4108C9E5C7BCE2A410188C6C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_SG_C">();
	}
	static class USMEvent_Kill_SG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_SG_C>();
	}
};
static_assert(alignof(USMEvent_Kill_SG_C) == 0x000008, "Wrong alignment on USMEvent_Kill_SG_C");
static_assert(sizeof(USMEvent_Kill_SG_C) == 0x000FD0, "Wrong size on USMEvent_Kill_SG_C");
static_assert(offsetof(USMEvent_Kill_SG_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_SG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_TransitionResultNode_2211ADBB4DBE4EFC77E217B8005C8445) == 0x000700, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_TransitionResultNode_2211ADBB4DBE4EFC77E217B8005C8445' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_StateEntryNode_B9A0F2644BD5EB33D834FDB0D1C192ED) == 0x0008F8, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_StateEntryNode_B9A0F2644BD5EB33D834FDB0D1C192ED' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_ConduitResultNode_DF8228F8458EF68CC10B6ABCEB2D5016) == 0x000AD8, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_ConduitResultNode_DF8228F8458EF68CC10B6ABCEB2D5016' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_10_C7BE1E7045E7231C9912919158341931) == 0x000CB8, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_10_C7BE1E7045E7231C9912919158341931' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_9_2770BBDF4A25218CEFEED79F080AEC3F) == 0x000D00, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_9_2770BBDF4A25218CEFEED79F080AEC3F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_8_24731813470DFA4C89AD6F894E8964CC) == 0x000D48, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_8_24731813470DFA4C89AD6F894E8964CC' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_7_14CE36684737285F956E38A86256E4AD) == 0x000D90, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_7_14CE36684737285F956E38A86256E4AD' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_6_6B6B96CF4A3FC6D6933C798F707345F6) == 0x000DD8, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_6_6B6B96CF4A3FC6D6933C798F707345F6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_5_073D918E44D83441F37E76A162FD0E57) == 0x000E20, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_5_073D918E44D83441F37E76A162FD0E57' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_4_9C5CE8214987D7CF3F652198C0378B02) == 0x000E68, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_4_9C5CE8214987D7CF3F652198C0378B02' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_3_2396D88D44547AF707D65F899EA53313) == 0x000EB0, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_3_2396D88D44547AF707D65F899EA53313' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_2_FB7FFB814D66BA983AADD5B20C86B7A6) == 0x000EF8, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_2_FB7FFB814D66BA983AADD5B20C86B7A6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_1_C8361E8E405A9518F426569E90A7A3F1) == 0x000F40, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_1_C8361E8E405A9518F426569E90A7A3F1' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SG_C, SMGraphK2Node_GraphPropertyNode_09595C064EBE254F44951F8940B11C7D) == 0x000F88, "Member 'USMEvent_Kill_SG_C::SMGraphK2Node_GraphPropertyNode_09595C064EBE254F44951F8940B11C7D' has a wrong offset!");

}

