#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillByMeleeInMovement

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_KillByMeleeInMovement.SMEvent_KillByMeleeInMovement_C
// 0x0CF8 (0x13F0 - 0x06F8)
class USMEvent_KillByMeleeInMovement_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_B2BB10804959276418B01B9FBF878AE5; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_28529C3741BF383961E90F8486AA3556; // 0x08F8(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_EF48F65A4494F80A06A5FAA9FA87C895; // 0x0AF0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_130060394ED3C8EF81BC91B896A4E7C8; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_C504100B46520B7D5CE6B3999AB31C41; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_0AC410E94E4CC043F7C168BED2439014; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_5E17E42A4F2F53504C7AFAA793DEDF96; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_4EC2CCFE4337FB4685571D86F480548E; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_713EA26B448E6B6D856A04AB6096919C; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_ACDE797D4079BFC00F8E998F98CDA02B; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_B28243584EDC7A64E966B2BC0377A47D; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_3C26A72645601F354AAF509C6EC77EF4; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_E6255F25403050D42FCEAFB4AA7E0DED; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_7AD2437A48BADDFC0F1A21B04C53744B; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_1C06946A4F3479E8A7159BA7EFFA588D; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_95318B6F4541CC0C41D9B7B925339C39; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_79E81A4E49846484E674FFA6AE17CF59; // 0x13A8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_KillByMeleeInMovement(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_2F99579D45F96B8D2EC79F9CBBB0ACEC_3059E24F4E31566C294AE5BB3D15BC53();
	void SMGraphK2Node_GraphPropertyNode_11_8FBC1AC9AE62937ED288E1B431A37B3D_C9B6A7F640CB820CF9B6029D32AE03A4();
	void SMGraphK2Node_GraphPropertyNode_10_40A291E7A5009A35B29F31036F3FD958_D2DB75E441F1DA2C680829978C40DDB0();
	void SMGraphK2Node_GraphPropertyNode_9_FD357E827C2CA7B0852D9AA1A0C7FD01_48A4522944AB0CD4CF2DBE93653B63C7();
	void SMGraphK2Node_GraphPropertyNode_8_3DA64C0AB489BBF8EAE713CAEED73534_AB2777834DB85D13CB58B09085EE71C9();
	void SMGraphK2Node_GraphPropertyNode_0_E32345717CF9508F1744CF31B687903A_B15436D8431114238789F0A4D4C6B7FE();
	void SMGraphK2Node_GraphPropertyNode_1_3D5BF42FB56867E72BC02A39E4E0902B_68B2E06840E56695E5C7CCA86517C1A6();
	void SMGraphK2Node_GraphPropertyNode_7_518353AF11A99FDFEEDB66B6418EA001_FD7D49BB4D4BDA1AE7C991B01CA98919();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_C777653841A0E7577F4F44BC3EA1B3ED();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_DF89B6D54021C4DD7195168CBBABCC11();
	void SMGraphK2Node_GraphPropertyNode_6_FD651B701644522C694358AF07DEF14F_57894F864552D55BB8CAF8B4FB5D4E1C();
	void SMGraphK2Node_GraphPropertyNode_4_D3A2D4BF9BD5B04E49F3401FD9A01159_2A296F61409F06C520B5B9B264780641();
	void SMGraphK2Node_GraphPropertyNode_5_06D43A19CF95A5CD050B1A0A4B64B1F9_D981CBBA4DC0C4E6732ED4BFBDEC5101();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_KillByMeleeInMovement_C">();
	}
	static class USMEvent_KillByMeleeInMovement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_KillByMeleeInMovement_C>();
	}
};
static_assert(alignof(USMEvent_KillByMeleeInMovement_C) == 0x000008, "Wrong alignment on USMEvent_KillByMeleeInMovement_C");
static_assert(sizeof(USMEvent_KillByMeleeInMovement_C) == 0x0013F0, "Wrong size on USMEvent_KillByMeleeInMovement_C");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_KillByMeleeInMovement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_TransitionResultNode_1_B2BB10804959276418B01B9FBF878AE5) == 0x000700, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_TransitionResultNode_1_B2BB10804959276418B01B9FBF878AE5' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_TransitionResultNode_28529C3741BF383961E90F8486AA3556) == 0x0008F8, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_TransitionResultNode_28529C3741BF383961E90F8486AA3556' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_StateEntryNode_EF48F65A4494F80A06A5FAA9FA87C895) == 0x000AF0, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_StateEntryNode_EF48F65A4494F80A06A5FAA9FA87C895' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_ConduitResultNode_1_130060394ED3C8EF81BC91B896A4E7C8) == 0x000CD0, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_ConduitResultNode_1_130060394ED3C8EF81BC91B896A4E7C8' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_ConduitResultNode_C504100B46520B7D5CE6B3999AB31C41) == 0x000EB0, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_ConduitResultNode_C504100B46520B7D5CE6B3999AB31C41' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_11_0AC410E94E4CC043F7C168BED2439014) == 0x001090, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_11_0AC410E94E4CC043F7C168BED2439014' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_10_5E17E42A4F2F53504C7AFAA793DEDF96) == 0x0010D8, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_10_5E17E42A4F2F53504C7AFAA793DEDF96' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_9_4EC2CCFE4337FB4685571D86F480548E) == 0x001120, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_9_4EC2CCFE4337FB4685571D86F480548E' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_8_713EA26B448E6B6D856A04AB6096919C) == 0x001168, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_8_713EA26B448E6B6D856A04AB6096919C' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_7_ACDE797D4079BFC00F8E998F98CDA02B) == 0x0011B0, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_7_ACDE797D4079BFC00F8E998F98CDA02B' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_6_B28243584EDC7A64E966B2BC0377A47D) == 0x0011F8, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_6_B28243584EDC7A64E966B2BC0377A47D' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_5_3C26A72645601F354AAF509C6EC77EF4) == 0x001240, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_5_3C26A72645601F354AAF509C6EC77EF4' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_4_E6255F25403050D42FCEAFB4AA7E0DED) == 0x001288, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_4_E6255F25403050D42FCEAFB4AA7E0DED' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_3_7AD2437A48BADDFC0F1A21B04C53744B) == 0x0012D0, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_3_7AD2437A48BADDFC0F1A21B04C53744B' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_2_1C06946A4F3479E8A7159BA7EFFA588D) == 0x001318, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_2_1C06946A4F3479E8A7159BA7EFFA588D' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_1_95318B6F4541CC0C41D9B7B925339C39) == 0x001360, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_1_95318B6F4541CC0C41D9B7B925339C39' has a wrong offset!");
static_assert(offsetof(USMEvent_KillByMeleeInMovement_C, SMGraphK2Node_GraphPropertyNode_79E81A4E49846484E674FFA6AE17CF59) == 0x0013A8, "Member 'USMEvent_KillByMeleeInMovement_C::SMGraphK2Node_GraphPropertyNode_79E81A4E49846484E674FFA6AE17CF59' has a wrong offset!");

}

