#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillEnemyImplused

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_KillEnemyImplused.SMEvent_KillEnemyImplused_C
// 0x0770 (0x0E68 - 0x06F8)
class USMEvent_KillEnemyImplused_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_A5BF19224878CA47BFD07BB681315A4C; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_797F62C44964EF34F85620AAB9D72851; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_D3BB678F48F50255620BE58E941A7020; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_5EEF68014E5F0EFDCD456EA1FF8FEE27; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_C99C7E3C4F35D291893D07A9BF9C1DF7; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_DE4E5B584F34DE5E944EDC978449BA2E; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_61E1C59B4C01E04246669E83F1EE386B; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_6448F8004403D4CC20B66A8BFDC8C748; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8CB525FD44AF575070A6B39188F9CD59; // 0x0E20(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_KillEnemyImplused(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_22CBD31E443A2EE93D38BAB469072CD7_56868B3A48EBC6CCCAC789B77F92422C();
	void SMGraphK2Node_GraphPropertyNode_5_8FBC1AC9AE62937ED288E1B431A37B3D_5EE6F8A64EBC2461399B948A40476D8A();
	void SMGraphK2Node_GraphPropertyNode_4_40A291E7A5009A35B29F31036F3FD958_6D01F57744D4C75659A5E5935C5FF98A();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_7C194DD947C4F254B2289393270C482E();
	void SMGraphK2Node_GraphPropertyNode_0_3633016EF7680B140042853F39CBA7C8_488139B74FBB0075CC5D49A57BDF40F2();
	void SMGraphK2Node_GraphPropertyNode_1_0757BA2326295F2E7F856B980D12AA3D_B998CF1D4481F429BA7BCC929F926E2E();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_F0CBF8B345899842B45D61A936C430BF();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_KillEnemyImplused_C">();
	}
	static class USMEvent_KillEnemyImplused_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_KillEnemyImplused_C>();
	}
};
static_assert(alignof(USMEvent_KillEnemyImplused_C) == 0x000008, "Wrong alignment on USMEvent_KillEnemyImplused_C");
static_assert(sizeof(USMEvent_KillEnemyImplused_C) == 0x000E68, "Wrong size on USMEvent_KillEnemyImplused_C");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_KillEnemyImplused_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, SMGraphK2Node_TransitionResultNode_A5BF19224878CA47BFD07BB681315A4C) == 0x000700, "Member 'USMEvent_KillEnemyImplused_C::SMGraphK2Node_TransitionResultNode_A5BF19224878CA47BFD07BB681315A4C' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, SMGraphK2Node_StateEntryNode_797F62C44964EF34F85620AAB9D72851) == 0x0008F8, "Member 'USMEvent_KillEnemyImplused_C::SMGraphK2Node_StateEntryNode_797F62C44964EF34F85620AAB9D72851' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, SMGraphK2Node_ConduitResultNode_D3BB678F48F50255620BE58E941A7020) == 0x000AD8, "Member 'USMEvent_KillEnemyImplused_C::SMGraphK2Node_ConduitResultNode_D3BB678F48F50255620BE58E941A7020' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, SMGraphK2Node_GraphPropertyNode_5_5EEF68014E5F0EFDCD456EA1FF8FEE27) == 0x000CB8, "Member 'USMEvent_KillEnemyImplused_C::SMGraphK2Node_GraphPropertyNode_5_5EEF68014E5F0EFDCD456EA1FF8FEE27' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, SMGraphK2Node_GraphPropertyNode_4_C99C7E3C4F35D291893D07A9BF9C1DF7) == 0x000D00, "Member 'USMEvent_KillEnemyImplused_C::SMGraphK2Node_GraphPropertyNode_4_C99C7E3C4F35D291893D07A9BF9C1DF7' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, SMGraphK2Node_GraphPropertyNode_3_DE4E5B584F34DE5E944EDC978449BA2E) == 0x000D48, "Member 'USMEvent_KillEnemyImplused_C::SMGraphK2Node_GraphPropertyNode_3_DE4E5B584F34DE5E944EDC978449BA2E' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, SMGraphK2Node_GraphPropertyNode_2_61E1C59B4C01E04246669E83F1EE386B) == 0x000D90, "Member 'USMEvent_KillEnemyImplused_C::SMGraphK2Node_GraphPropertyNode_2_61E1C59B4C01E04246669E83F1EE386B' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, SMGraphK2Node_GraphPropertyNode_1_6448F8004403D4CC20B66A8BFDC8C748) == 0x000DD8, "Member 'USMEvent_KillEnemyImplused_C::SMGraphK2Node_GraphPropertyNode_1_6448F8004403D4CC20B66A8BFDC8C748' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEnemyImplused_C, SMGraphK2Node_GraphPropertyNode_8CB525FD44AF575070A6B39188F9CD59) == 0x000E20, "Member 'USMEvent_KillEnemyImplused_C::SMGraphK2Node_GraphPropertyNode_8CB525FD44AF575070A6B39188F9CD59' has a wrong offset!");

}

