#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_EMPControll

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_EMPControll.SMEvent_Medal_EMPControll_C
// 0x0770 (0x0E68 - 0x06F8)
class USMEvent_Medal_EMPControll_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_86B5940D4574D5D4028675BC867C2649; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_CC13D6FF4CA9C5C0345844A81602F934; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_E47A60734579EF3068B5A5B6222800C5; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_1F5BE7614B608E5C6C6E9F8E73661F7E; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_AC3A54EF40E35DB3CE9BA4B6F1C8C36E; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_C1805ED24029DE147163708AC6CD7C01; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_E79821B14AC5A4F1F6E72CBA704863C5; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_5DAE6A5847E0C32DAB5F74A9BA0C1536; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_A1285BAC4C4A8A64F0DDA888891FD7CC; // 0x0E20(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_EMPControll(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_CED8721A4C125FBB7C14D488691CA69B();
	void SMGraphK2Node_GraphPropertyNode_5_D9CFEDB523581B15DAC934241AECB687_B73053EF493CF558CA55DCAB088F93E6();
	void SMGraphK2Node_GraphPropertyNode_4_58CDA98FBB02B19119316CA1EF2B4BE8_5413724243D8B918F0746D8263BDBA91();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_047EBFFA44DBF2BB41BA9FA308E90359();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_4CBF8BA2460D8439A9C1D7B012ACBD82();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_E9E0F79A4AC8A49A19D22F8B6CFE0C17();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_55A0B961437251983694778CDD5C69D4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_EMPControll_C">();
	}
	static class USMEvent_Medal_EMPControll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_EMPControll_C>();
	}
};
static_assert(alignof(USMEvent_Medal_EMPControll_C) == 0x000008, "Wrong alignment on USMEvent_Medal_EMPControll_C");
static_assert(sizeof(USMEvent_Medal_EMPControll_C) == 0x000E68, "Wrong size on USMEvent_Medal_EMPControll_C");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_EMPControll_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, SMGraphK2Node_TransitionResultNode_86B5940D4574D5D4028675BC867C2649) == 0x000700, "Member 'USMEvent_Medal_EMPControll_C::SMGraphK2Node_TransitionResultNode_86B5940D4574D5D4028675BC867C2649' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, SMGraphK2Node_ConduitResultNode_CC13D6FF4CA9C5C0345844A81602F934) == 0x0008F8, "Member 'USMEvent_Medal_EMPControll_C::SMGraphK2Node_ConduitResultNode_CC13D6FF4CA9C5C0345844A81602F934' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, SMGraphK2Node_StateEntryNode_E47A60734579EF3068B5A5B6222800C5) == 0x000AD8, "Member 'USMEvent_Medal_EMPControll_C::SMGraphK2Node_StateEntryNode_E47A60734579EF3068B5A5B6222800C5' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, SMGraphK2Node_GraphPropertyNode_5_1F5BE7614B608E5C6C6E9F8E73661F7E) == 0x000CB8, "Member 'USMEvent_Medal_EMPControll_C::SMGraphK2Node_GraphPropertyNode_5_1F5BE7614B608E5C6C6E9F8E73661F7E' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, SMGraphK2Node_GraphPropertyNode_4_AC3A54EF40E35DB3CE9BA4B6F1C8C36E) == 0x000D00, "Member 'USMEvent_Medal_EMPControll_C::SMGraphK2Node_GraphPropertyNode_4_AC3A54EF40E35DB3CE9BA4B6F1C8C36E' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, SMGraphK2Node_GraphPropertyNode_3_C1805ED24029DE147163708AC6CD7C01) == 0x000D48, "Member 'USMEvent_Medal_EMPControll_C::SMGraphK2Node_GraphPropertyNode_3_C1805ED24029DE147163708AC6CD7C01' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, SMGraphK2Node_GraphPropertyNode_2_E79821B14AC5A4F1F6E72CBA704863C5) == 0x000D90, "Member 'USMEvent_Medal_EMPControll_C::SMGraphK2Node_GraphPropertyNode_2_E79821B14AC5A4F1F6E72CBA704863C5' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, SMGraphK2Node_GraphPropertyNode_1_5DAE6A5847E0C32DAB5F74A9BA0C1536) == 0x000DD8, "Member 'USMEvent_Medal_EMPControll_C::SMGraphK2Node_GraphPropertyNode_1_5DAE6A5847E0C32DAB5F74A9BA0C1536' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_EMPControll_C, SMGraphK2Node_GraphPropertyNode_A1285BAC4C4A8A64F0DDA888891FD7CC) == 0x000E20, "Member 'USMEvent_Medal_EMPControll_C::SMGraphK2Node_GraphPropertyNode_A1285BAC4C4A8A64F0DDA888891FD7CC' has a wrong offset!");

}

