#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_FirstVictory

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_FirstVictory.SMEvent_FirstVictory_C
// 0x0CB0 (0x1428 - 0x0778)
class USMEvent_FirstVictory_C final : public UPBEvent_MatchEnd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_7CC02D2D4AC388BBF41D1EB404D825B1; // 0x0780(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_D944484A4F424D64E61993B92A9EB78F; // 0x0978(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_977834D749631AC6D5AF3D88805FA4F2; // 0x0B70(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_46D84DF64776DD129A8F3696DD1849D7; // 0x0D50(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_5B69ECC84E0F4824A6A85AB8B82E6C57; // 0x0F30(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_7226DC9D47F686D0687B9C988D6D7AB4; // 0x1110(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_EB0245F446878AD63D7D818174331DCB; // 0x1158(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_E22A51394D36CAEC950CB79A2AD2C257; // 0x11A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_10DAFB054599526136F4AF87ADC7438B; // 0x11E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_FAC6B9D74413E1284863B1AA55C0DB86; // 0x1230(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_9A55F7524A18A9B596613AA994278BD4; // 0x1278(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_CD1EBADF42605453C6D0798B062E10C7; // 0x12C0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_03242CC4493C5ABCC483F3ABAEF066DE; // 0x1308(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_B7D06BC5462C5BF1A13862A62BBF1D0F; // 0x1350(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_8F29B82747719EDCE58F9CB61C8CF5AB; // 0x1398(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_D65D02564589DDAAEB9E2B9B4C5689F4; // 0x13E0(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_FirstVictory(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_840641D547210E97269CAAA37D2120E6_D9CA3B1043904FA2545CC1BC60867D38();
	void SMGraphK2Node_GraphPropertyNode_10_3DA64C0AB489BBF8EAE713CAEED73534_896E4674402BE6EDE0BCAB94DC355D75();
	void SMGraphK2Node_GraphPropertyNode_9_518353AF11A99FDFEEDB66B6418EA001_1FD5992742CC398CF890EEA7C9235C79();
	void SMGraphK2Node_GraphPropertyNode_8_7E261F3E5C0FA126924682D5024D57B6_F755CF0543F3C04C85F65BBA9554FC8B();
	void SMGraphK2Node_GraphPropertyNode_7_8FBC1AC9AE62937ED288E1B431A37B3D_B4F61FA3492DD8E5D081A49389CB60F9();
	void SMGraphK2Node_GraphPropertyNode_0_9B726A79733F234A2592B22CBF705BAE_2B632C1A42A0055E899D849A6B232A00();
	void SMGraphK2Node_GraphPropertyNode_6_40A291E7A5009A35B29F31036F3FD958_4A77AED84841D578C496058C4533EB38();
	void SMGraphK2Node_GraphPropertyNode_1_B580CFBBEE69D2AE9AD084C568474214_916C559A401D4F6FD48571905BB76C66();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_0EDD0E48477703E5342386999BF68E1E();
	void SMGraphK2Node_GraphPropertyNode_5_07CA978E0CC48D17FC9737FC6562B6D9_D32F0AFE4DBBF99A7314999E2ED8A982();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_CD94E88D4C9F6215F398FD8328A70686();
	void SMGraphK2Node_GraphPropertyNode_4_C04E0C318D415947F3C0A291B4AF3A6D_89F9152B412687F26DCA53BD86089ACF();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_FirstVictory_C">();
	}
	static class USMEvent_FirstVictory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_FirstVictory_C>();
	}
};
static_assert(alignof(USMEvent_FirstVictory_C) == 0x000008, "Wrong alignment on USMEvent_FirstVictory_C");
static_assert(sizeof(USMEvent_FirstVictory_C) == 0x001428, "Wrong size on USMEvent_FirstVictory_C");
static_assert(offsetof(USMEvent_FirstVictory_C, UberGraphFrame) == 0x000778, "Member 'USMEvent_FirstVictory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_TransitionResultNode_1_7CC02D2D4AC388BBF41D1EB404D825B1) == 0x000780, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_TransitionResultNode_1_7CC02D2D4AC388BBF41D1EB404D825B1' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_TransitionResultNode_D944484A4F424D64E61993B92A9EB78F) == 0x000978, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_TransitionResultNode_D944484A4F424D64E61993B92A9EB78F' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_ConduitResultNode_1_977834D749631AC6D5AF3D88805FA4F2) == 0x000B70, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_ConduitResultNode_1_977834D749631AC6D5AF3D88805FA4F2' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_StateEntryNode_46D84DF64776DD129A8F3696DD1849D7) == 0x000D50, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_StateEntryNode_46D84DF64776DD129A8F3696DD1849D7' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_ConduitResultNode_5B69ECC84E0F4824A6A85AB8B82E6C57) == 0x000F30, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_ConduitResultNode_5B69ECC84E0F4824A6A85AB8B82E6C57' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_10_7226DC9D47F686D0687B9C988D6D7AB4) == 0x001110, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_10_7226DC9D47F686D0687B9C988D6D7AB4' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_9_EB0245F446878AD63D7D818174331DCB) == 0x001158, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_9_EB0245F446878AD63D7D818174331DCB' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_8_E22A51394D36CAEC950CB79A2AD2C257) == 0x0011A0, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_8_E22A51394D36CAEC950CB79A2AD2C257' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_7_10DAFB054599526136F4AF87ADC7438B) == 0x0011E8, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_7_10DAFB054599526136F4AF87ADC7438B' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_6_FAC6B9D74413E1284863B1AA55C0DB86) == 0x001230, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_6_FAC6B9D74413E1284863B1AA55C0DB86' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_5_9A55F7524A18A9B596613AA994278BD4) == 0x001278, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_5_9A55F7524A18A9B596613AA994278BD4' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_4_CD1EBADF42605453C6D0798B062E10C7) == 0x0012C0, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_4_CD1EBADF42605453C6D0798B062E10C7' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_3_03242CC4493C5ABCC483F3ABAEF066DE) == 0x001308, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_3_03242CC4493C5ABCC483F3ABAEF066DE' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_2_B7D06BC5462C5BF1A13862A62BBF1D0F) == 0x001350, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_2_B7D06BC5462C5BF1A13862A62BBF1D0F' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_1_8F29B82747719EDCE58F9CB61C8CF5AB) == 0x001398, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_1_8F29B82747719EDCE58F9CB61C8CF5AB' has a wrong offset!");
static_assert(offsetof(USMEvent_FirstVictory_C, SMGraphK2Node_GraphPropertyNode_D65D02564589DDAAEB9E2B9B4C5689F4) == 0x0013E0, "Member 'USMEvent_FirstVictory_C::SMGraphK2Node_GraphPropertyNode_D65D02564589DDAAEB9E2B9B4C5689F4' has a wrong offset!");

}

