#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_CARKIT

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_CARKIT.SMEvent_Kill_CARKIT_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_CARKIT_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_D51FA659401CB4FD801D2E8A047D937D; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_4E56F2DE45D2B290137F0481C17F9736; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_CB4A179F4BCA485C4CBF599D9B873C47; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_1060FCDE4B96A3E1B1D523AB3BB11E1D; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_9D65CDA544750847E41BAB942DCD889C; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_AC8CBBCD4C1D4254A2C124898F3549A2; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_DFD4D95142DBAD6D3063A3858720089B; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_CA867E714E532FE7D565F0B04178D53C; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_06EE2C724F097A562C5B90A279121A16; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_0847923D49078B6071B588BF2D7F698B; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_97162AFD48D99969363E258F85D03E76; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_73FD13FE4FEEA01E624F4C8598ED915F; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_2D8DF2244EA1A853966CCEB62EA94154; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_F646A7054AB6751ED0AB3F84AAFB40EF; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_CARKIT(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_CC86BC9F4B259CA1494442820D48DEA1();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_C36AA5F84624C80A49D3188F4D2BEB2D();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_8178DC0E41CE6024551B21A7AE0ECF9C();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_E1A559894B5EA219D885AB974F418BDD();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_D142931D434B24748E7CA88CBCE743E4();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_A57D82004420A691E6E2E3B477C73788();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_234CBA8543AE88541D3259AA4A79EF85();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_7095411E48F3822C65094299D1C77CC9();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_252171FD48699836090C5DB16E69DAAA();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_9E90D1C94788BD8B821A729332C5BFB8();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_39D75BD64754CB920BAB07816C8ED07E();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_07425F0B49396F71F44CC188E3BC43E0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_CARKIT_C">();
	}
	static class USMEvent_Kill_CARKIT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_CARKIT_C>();
	}
};
static_assert(alignof(USMEvent_Kill_CARKIT_C) == 0x000008, "Wrong alignment on USMEvent_Kill_CARKIT_C");
static_assert(sizeof(USMEvent_Kill_CARKIT_C) == 0x000FD0, "Wrong size on USMEvent_Kill_CARKIT_C");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_CARKIT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_TransitionResultNode_D51FA659401CB4FD801D2E8A047D937D) == 0x000700, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_TransitionResultNode_D51FA659401CB4FD801D2E8A047D937D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_StateEntryNode_4E56F2DE45D2B290137F0481C17F9736) == 0x0008F8, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_StateEntryNode_4E56F2DE45D2B290137F0481C17F9736' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_ConduitResultNode_CB4A179F4BCA485C4CBF599D9B873C47) == 0x000AD8, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_ConduitResultNode_CB4A179F4BCA485C4CBF599D9B873C47' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_10_1060FCDE4B96A3E1B1D523AB3BB11E1D) == 0x000CB8, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_10_1060FCDE4B96A3E1B1D523AB3BB11E1D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_9_9D65CDA544750847E41BAB942DCD889C) == 0x000D00, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_9_9D65CDA544750847E41BAB942DCD889C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_8_AC8CBBCD4C1D4254A2C124898F3549A2) == 0x000D48, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_8_AC8CBBCD4C1D4254A2C124898F3549A2' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_7_DFD4D95142DBAD6D3063A3858720089B) == 0x000D90, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_7_DFD4D95142DBAD6D3063A3858720089B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_6_CA867E714E532FE7D565F0B04178D53C) == 0x000DD8, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_6_CA867E714E532FE7D565F0B04178D53C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_5_06EE2C724F097A562C5B90A279121A16) == 0x000E20, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_5_06EE2C724F097A562C5B90A279121A16' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_4_0847923D49078B6071B588BF2D7F698B) == 0x000E68, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_4_0847923D49078B6071B588BF2D7F698B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_3_97162AFD48D99969363E258F85D03E76) == 0x000EB0, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_3_97162AFD48D99969363E258F85D03E76' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_2_73FD13FE4FEEA01E624F4C8598ED915F) == 0x000EF8, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_2_73FD13FE4FEEA01E624F4C8598ED915F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_1_2D8DF2244EA1A853966CCEB62EA94154) == 0x000F40, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_1_2D8DF2244EA1A853966CCEB62EA94154' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_CARKIT_C, SMGraphK2Node_GraphPropertyNode_F646A7054AB6751ED0AB3F84AAFB40EF) == 0x000F88, "Member 'USMEvent_Kill_CARKIT_C::SMGraphK2Node_GraphPropertyNode_F646A7054AB6751ED0AB3F84AAFB40EF' has a wrong offset!");

}

