#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_SurgeOn

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_SurgeOn.SMEvent_Medal_SurgeOn_C
// 0x0800 (0x0EF8 - 0x06F8)
class USMEvent_Medal_SurgeOn_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_4AC2E0884D33CE9AD430EABA1A08617B; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_E6C5AE344A9DB4FDA177FA85060C3280; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_6BB6D4574D43B0EFA297EBAC8CE1F637; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_4E90DEB24DA14BB0D966D7A25D9D9D47; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_C87040E74503F733D33BDAA9B54F446D; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_662A3FFE4BFEA151688626B2239AF256; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_EABE3C564207FB9947A9748B4B02FC15; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_F03ED11A4999E51509F278A5A2E0BA52; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_3CE0A9EF4B5D4040B5224FB69B5806A0; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_FB5B65944D99539259E24FA89B49ECBD; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_08F9C15D42B6AAD1760624A473BBE48A; // 0x0EB0(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_SurgeOn(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_BF38E3EB4CFAE908AC073A90A2378FEC();
	void SMGraphK2Node_GraphPropertyNode_7_1D5AE3AF69E079B559EF8AF2950B22F1_3A0D7E14446909110E67A1AF28EBE9C0();
	void SMGraphK2Node_GraphPropertyNode_6_3DA64C0AB489BBF8EAE713CAEED73534_0F7CB108498F95DAE2F19DB4D87862B2();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_5FB4D89B4F5FA7D61A1A16855BFCBBEC();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_6ED870AC4A45A7FCD72660B157FA09CF();
	void SMGraphK2Node_GraphPropertyNode_5_518353AF11A99FDFEEDB66B6418EA001_E375A656442720457D403894020BC9B3();
	void SMGraphK2Node_GraphPropertyNode_2_DFCF228DCE31F7B7DE4D5893884342DB_DA067B2F49A765A33EC292A6B76D2B4A();
	void SMGraphK2Node_GraphPropertyNode_3_DFC5DDF9620519B0185FE1F473B6BA24_DD8A6C8A474437BD9EEB04B3765AD25A();
	void SMGraphK2Node_GraphPropertyNode_4_F5981CACB7D9769440965527229065DD_8F343DDB4740C6D9686291BB826B3E50();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_SurgeOn_C">();
	}
	static class USMEvent_Medal_SurgeOn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_SurgeOn_C>();
	}
};
static_assert(alignof(USMEvent_Medal_SurgeOn_C) == 0x000008, "Wrong alignment on USMEvent_Medal_SurgeOn_C");
static_assert(sizeof(USMEvent_Medal_SurgeOn_C) == 0x000EF8, "Wrong size on USMEvent_Medal_SurgeOn_C");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_SurgeOn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_TransitionResultNode_4AC2E0884D33CE9AD430EABA1A08617B) == 0x000700, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_TransitionResultNode_4AC2E0884D33CE9AD430EABA1A08617B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_ConduitResultNode_E6C5AE344A9DB4FDA177FA85060C3280) == 0x0008F8, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_ConduitResultNode_E6C5AE344A9DB4FDA177FA85060C3280' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_StateEntryNode_6BB6D4574D43B0EFA297EBAC8CE1F637) == 0x000AD8, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_StateEntryNode_6BB6D4574D43B0EFA297EBAC8CE1F637' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_GraphPropertyNode_7_4E90DEB24DA14BB0D966D7A25D9D9D47) == 0x000CB8, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_GraphPropertyNode_7_4E90DEB24DA14BB0D966D7A25D9D9D47' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_GraphPropertyNode_6_C87040E74503F733D33BDAA9B54F446D) == 0x000D00, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_GraphPropertyNode_6_C87040E74503F733D33BDAA9B54F446D' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_GraphPropertyNode_5_662A3FFE4BFEA151688626B2239AF256) == 0x000D48, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_GraphPropertyNode_5_662A3FFE4BFEA151688626B2239AF256' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_GraphPropertyNode_4_EABE3C564207FB9947A9748B4B02FC15) == 0x000D90, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_GraphPropertyNode_4_EABE3C564207FB9947A9748B4B02FC15' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_GraphPropertyNode_3_F03ED11A4999E51509F278A5A2E0BA52) == 0x000DD8, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_GraphPropertyNode_3_F03ED11A4999E51509F278A5A2E0BA52' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_GraphPropertyNode_2_3CE0A9EF4B5D4040B5224FB69B5806A0) == 0x000E20, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_GraphPropertyNode_2_3CE0A9EF4B5D4040B5224FB69B5806A0' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_GraphPropertyNode_1_FB5B65944D99539259E24FA89B49ECBD) == 0x000E68, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_GraphPropertyNode_1_FB5B65944D99539259E24FA89B49ECBD' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_SurgeOn_C, SMGraphK2Node_GraphPropertyNode_08F9C15D42B6AAD1760624A473BBE48A) == 0x000EB0, "Member 'USMEvent_Medal_SurgeOn_C::SMGraphK2Node_GraphPropertyNode_08F9C15D42B6AAD1760624A473BBE48A' has a wrong offset!");

}

