#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_TP82

#include "Basic.hpp"


namespace SDK::Params
{

// Function SMEvent_Kill_TP82.SMEvent_Kill_TP82_C.ExecuteUbergraph_SMEvent_Kill_TP82
// 0x00F0 (0x00F0 - 0x0000)
struct SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_2;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_3;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x0064(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_5;                              // 0x007C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_6;                              // 0x0094(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_4;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_5;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_6;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_7;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_8;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82) == 0x000008, "Wrong alignment on SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82");
static_assert(sizeof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82) == 0x0000F0, "Wrong size on SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, EntryPoint) == 0x000000, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::EntryPoint' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, Temp_name_Variable) == 0x000004, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, Temp_name_Variable_1) == 0x00000C, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBConduit_Weapon) == 0x000018, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBConduit_Weapon' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, Temp_name_Variable_2) == 0x000024, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, Temp_name_Variable_3) == 0x00002C, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBConduit_Weapon_1) == 0x000038, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBConduit_Weapon_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBConduit_Weapon_2) == 0x000048, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBConduit_Weapon_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBConduit_Weapon_3) == 0x000058, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBConduit_Weapon_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_3) == 0x000060, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, Temp_name_Variable_4) == 0x000064, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBSMState_Event_End) == 0x000070, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBSMState_Event_End' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_4) == 0x000078, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, Temp_name_Variable_5) == 0x00007C, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBSMState_Event_End_1) == 0x000088, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBSMState_Event_End_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_5) == 0x000090, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, Temp_name_Variable_6) == 0x000094, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBConduit_Weapon_4) == 0x0000A0, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBConduit_Weapon_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_6) == 0x0000A8, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBConduit_Weapon_5) == 0x0000B0, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBConduit_Weapon_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_7) == 0x0000B8, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBConduit_Weapon_6) == 0x0000C0, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBConduit_Weapon_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_8) == 0x0000C8, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBConduit_Weapon_7) == 0x0000D0, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBConduit_Weapon_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_9) == 0x0000D8, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_AsPBConduit_Weapon_8) == 0x0000E0, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_AsPBConduit_Weapon_8' has a wrong offset!");
static_assert(offsetof(SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82, K2Node_DynamicCast_bSuccess_10) == 0x0000E8, "Member 'SMEvent_Kill_TP82_C_ExecuteUbergraph_SMEvent_Kill_TP82::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");

}

