#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_AllGun

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_AllGun.SMEvent_AllGun_C
// 0x0770 (0x0E18 - 0x06A8)
class USMEvent_AllGun_C final : public UPBEvent_LoadAssets
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_65C8935340E75F47B15CDDB9B1DFD952; // 0x06B0(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_A98D880B492AA030D43AA79276431F28; // 0x08A8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_83E10D4249720CE72495E8ACA3109187; // 0x0A88(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_DC35EDB04B31122157BA858CC021911F; // 0x0C68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_F7193C484A68A505EB0584B5DB7FAFB5; // 0x0CB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_5C6C64BC408B66F54A984E89B2AA1F08; // 0x0CF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_BAFE616049B0D6AB2BD51DAB5254AB5A; // 0x0D40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_E4239A854DE94B786A37D8B7C0A50609; // 0x0D88(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_A2D5FAFC42123B022FF360BE6624BA19; // 0x0DD0(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_AllGun(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_BE06090C482FB9B373E1D0A082419263_9D8A37574348B1084095E981C85A89F0();
	void SMGraphK2Node_GraphPropertyNode_5_8FBC1AC9AE62937ED288E1B431A37B3D_5A6B0A824AAE4D57CCD77EAAC79E7396();
	void SMGraphK2Node_GraphPropertyNode_4_40A291E7A5009A35B29F31036F3FD958_2797989F401EBA50E36B30AFD8B6D8A3();
	void SMGraphK2Node_GraphPropertyNode_3_BB8B4CD60274F297FE162631C46C714C_6511520D492832657FFCCE84D37DBDC9();
	void SMGraphK2Node_GraphPropertyNode_0_E4A11EAE1CE622EBCF7BD3E5FD313807_18C1D65B43FB4A45FAE9EC9EE0E2850C();
	void SMGraphK2Node_GraphPropertyNode_1_518353AF11A99FDFEEDB66B6418EA001_ED4288204AF05FC11EEE43986C13C54D();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_64279D584E2BF4B93F5E4AA5EBB3F3AF();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_AllGun_C">();
	}
	static class USMEvent_AllGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_AllGun_C>();
	}
};
static_assert(alignof(USMEvent_AllGun_C) == 0x000008, "Wrong alignment on USMEvent_AllGun_C");
static_assert(sizeof(USMEvent_AllGun_C) == 0x000E18, "Wrong size on USMEvent_AllGun_C");
static_assert(offsetof(USMEvent_AllGun_C, UberGraphFrame) == 0x0006A8, "Member 'USMEvent_AllGun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_AllGun_C, SMGraphK2Node_TransitionResultNode_65C8935340E75F47B15CDDB9B1DFD952) == 0x0006B0, "Member 'USMEvent_AllGun_C::SMGraphK2Node_TransitionResultNode_65C8935340E75F47B15CDDB9B1DFD952' has a wrong offset!");
static_assert(offsetof(USMEvent_AllGun_C, SMGraphK2Node_StateEntryNode_A98D880B492AA030D43AA79276431F28) == 0x0008A8, "Member 'USMEvent_AllGun_C::SMGraphK2Node_StateEntryNode_A98D880B492AA030D43AA79276431F28' has a wrong offset!");
static_assert(offsetof(USMEvent_AllGun_C, SMGraphK2Node_ConduitResultNode_83E10D4249720CE72495E8ACA3109187) == 0x000A88, "Member 'USMEvent_AllGun_C::SMGraphK2Node_ConduitResultNode_83E10D4249720CE72495E8ACA3109187' has a wrong offset!");
static_assert(offsetof(USMEvent_AllGun_C, SMGraphK2Node_GraphPropertyNode_5_DC35EDB04B31122157BA858CC021911F) == 0x000C68, "Member 'USMEvent_AllGun_C::SMGraphK2Node_GraphPropertyNode_5_DC35EDB04B31122157BA858CC021911F' has a wrong offset!");
static_assert(offsetof(USMEvent_AllGun_C, SMGraphK2Node_GraphPropertyNode_4_F7193C484A68A505EB0584B5DB7FAFB5) == 0x000CB0, "Member 'USMEvent_AllGun_C::SMGraphK2Node_GraphPropertyNode_4_F7193C484A68A505EB0584B5DB7FAFB5' has a wrong offset!");
static_assert(offsetof(USMEvent_AllGun_C, SMGraphK2Node_GraphPropertyNode_3_5C6C64BC408B66F54A984E89B2AA1F08) == 0x000CF8, "Member 'USMEvent_AllGun_C::SMGraphK2Node_GraphPropertyNode_3_5C6C64BC408B66F54A984E89B2AA1F08' has a wrong offset!");
static_assert(offsetof(USMEvent_AllGun_C, SMGraphK2Node_GraphPropertyNode_2_BAFE616049B0D6AB2BD51DAB5254AB5A) == 0x000D40, "Member 'USMEvent_AllGun_C::SMGraphK2Node_GraphPropertyNode_2_BAFE616049B0D6AB2BD51DAB5254AB5A' has a wrong offset!");
static_assert(offsetof(USMEvent_AllGun_C, SMGraphK2Node_GraphPropertyNode_1_E4239A854DE94B786A37D8B7C0A50609) == 0x000D88, "Member 'USMEvent_AllGun_C::SMGraphK2Node_GraphPropertyNode_1_E4239A854DE94B786A37D8B7C0A50609' has a wrong offset!");
static_assert(offsetof(USMEvent_AllGun_C, SMGraphK2Node_GraphPropertyNode_A2D5FAFC42123B022FF360BE6624BA19) == 0x000DD0, "Member 'USMEvent_AllGun_C::SMGraphK2Node_GraphPropertyNode_A2D5FAFC42123B022FF360BE6624BA19' has a wrong offset!");

}

