#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_APS

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_APS.SMEvent_Kill_APS_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_APS_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_B80B5E99459022B3AF6B6A881CB20963; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_11D943C9482E8F8B045F13A833485486; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_B9B90CF6412020383B86759DA7C31CF8; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_BC4A5E124D4D5F588B440BB67AC0644F; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_9EE20C404E4F80C079BEFDB31357BCAB; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_D72A5B53497EEF89E4DCAB926BB9E922; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_C0C091B54E3D8AA661E9B993C3339B57; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_BB9559B14061AF2A61F92BA48648813B; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_FDCFDD35407646DEB3B6DE9231A68426; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_B6277F5A42D8425D98431FA57A5CA020; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_B1124A8F45781779C4D5BD9390C240F7; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_0A080DCD42E110940AC2A1BB06102C8E; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_0161A44244CD2896EDCC42B8CB2C0BC1; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_AB94B29644E018F4D53E04A1363305A5; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_APS(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_8E2412F641DF57230B088DA58E4078F7();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_0D62AD4749071248842CDFA9FFD32837();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_4D86A72543E0616F2BD76AA3C930A555();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_7494AEB7422DED1836DF06B8BAEBA2BE();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_2CC603914542D3E652EC0180B0C14015();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_31FB06EF45510D65F59415B60B1973A7();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_5B1DBBA5487F091EF7DFB0B810753951();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_553EB92B44351A17B2904BBD794925E6();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_66C1CF7C4A72A4020CAA1BA4BF58E893();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_F1D5118047A2E51CF923418D1C3EB600();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_A62E7CF74005978C31427C92A38AEE7E();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_369B02C841A2EABAF567939E97F57BDB();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_APS_C">();
	}
	static class USMEvent_Kill_APS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_APS_C>();
	}
};
static_assert(alignof(USMEvent_Kill_APS_C) == 0x000008, "Wrong alignment on USMEvent_Kill_APS_C");
static_assert(sizeof(USMEvent_Kill_APS_C) == 0x000FD0, "Wrong size on USMEvent_Kill_APS_C");
static_assert(offsetof(USMEvent_Kill_APS_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_APS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_TransitionResultNode_B80B5E99459022B3AF6B6A881CB20963) == 0x000700, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_TransitionResultNode_B80B5E99459022B3AF6B6A881CB20963' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_StateEntryNode_11D943C9482E8F8B045F13A833485486) == 0x0008F8, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_StateEntryNode_11D943C9482E8F8B045F13A833485486' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_ConduitResultNode_B9B90CF6412020383B86759DA7C31CF8) == 0x000AD8, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_ConduitResultNode_B9B90CF6412020383B86759DA7C31CF8' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_10_BC4A5E124D4D5F588B440BB67AC0644F) == 0x000CB8, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_10_BC4A5E124D4D5F588B440BB67AC0644F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_9_9EE20C404E4F80C079BEFDB31357BCAB) == 0x000D00, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_9_9EE20C404E4F80C079BEFDB31357BCAB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_8_D72A5B53497EEF89E4DCAB926BB9E922) == 0x000D48, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_8_D72A5B53497EEF89E4DCAB926BB9E922' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_7_C0C091B54E3D8AA661E9B993C3339B57) == 0x000D90, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_7_C0C091B54E3D8AA661E9B993C3339B57' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_6_BB9559B14061AF2A61F92BA48648813B) == 0x000DD8, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_6_BB9559B14061AF2A61F92BA48648813B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_5_FDCFDD35407646DEB3B6DE9231A68426) == 0x000E20, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_5_FDCFDD35407646DEB3B6DE9231A68426' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_4_B6277F5A42D8425D98431FA57A5CA020) == 0x000E68, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_4_B6277F5A42D8425D98431FA57A5CA020' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_3_B1124A8F45781779C4D5BD9390C240F7) == 0x000EB0, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_3_B1124A8F45781779C4D5BD9390C240F7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_2_0A080DCD42E110940AC2A1BB06102C8E) == 0x000EF8, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_2_0A080DCD42E110940AC2A1BB06102C8E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_1_0161A44244CD2896EDCC42B8CB2C0BC1) == 0x000F40, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_1_0161A44244CD2896EDCC42B8CB2C0BC1' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_APS_C, SMGraphK2Node_GraphPropertyNode_AB94B29644E018F4D53E04A1363305A5) == 0x000F88, "Member 'USMEvent_Kill_APS_C::SMGraphK2Node_GraphPropertyNode_AB94B29644E018F4D53E04A1363305A5' has a wrong offset!");

}

