#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_DMR

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_DMR.SMEvent_Kill_DMR_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_DMR_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_49F95A7C41D1C930299A159E34A2E3FD; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_331DA1DF4CA90F59DCEDC1B33319BE98; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_20E4E3D64DF26AA6E4B695A3F9A08914; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_6611625B412636C3BBC46E9FDC5640FA; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_DEE614BF4BA1993A944F7E842E764719; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_E0C2278F4C2495B6AC9F70A772AB6966; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_3F520B9B4FF3BD43CEB8B392E978B302; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_5622EBEF43BB8B7CCD61C094932B8534; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_32BD425347085A901DA512A147E52A7C; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_075872D4424C947615CE0584CE0DD074; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_E0DF13C14CE5477807B50D90D5D4D201; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_5754D1DE4C35D845F58E418D666561EE; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_8695C8D54B79B6EF220E6298E0547ADA; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2936EFF946F26CB833C7D39ABBE3EEA1; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_DMR(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_4D7180B343140C0FE995D5B9BD8292FB();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_027F5BE041361AE2BF2E2785EA895004();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_47620DC24E55426AE9D99BB8C9A75617();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_18B238564C61D40C2B3EAF89380C95C4();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_D07953D34F06CC3AE1D3CFBE2DC19702();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_0039C7AA436AE9EB72D643BAF55517C1();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_EB66593144F2AC1DC44EF7833AACC2EE();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_84D85884467BA36D1E47CEA9AEE4B449();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_1B68AECD48D11C07A6D26F8C9BB56F5C();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_40DA07684F4F180B00D63FA97AD742C4();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_26A253CC48AD3403196C34B9659E2E7B();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_F3B51877464C6144A996C59F22F52ACA();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_DMR_C">();
	}
	static class USMEvent_Kill_DMR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_DMR_C>();
	}
};
static_assert(alignof(USMEvent_Kill_DMR_C) == 0x000008, "Wrong alignment on USMEvent_Kill_DMR_C");
static_assert(sizeof(USMEvent_Kill_DMR_C) == 0x000FD0, "Wrong size on USMEvent_Kill_DMR_C");
static_assert(offsetof(USMEvent_Kill_DMR_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_DMR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_TransitionResultNode_49F95A7C41D1C930299A159E34A2E3FD) == 0x000700, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_TransitionResultNode_49F95A7C41D1C930299A159E34A2E3FD' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_StateEntryNode_331DA1DF4CA90F59DCEDC1B33319BE98) == 0x0008F8, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_StateEntryNode_331DA1DF4CA90F59DCEDC1B33319BE98' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_ConduitResultNode_20E4E3D64DF26AA6E4B695A3F9A08914) == 0x000AD8, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_ConduitResultNode_20E4E3D64DF26AA6E4B695A3F9A08914' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_10_6611625B412636C3BBC46E9FDC5640FA) == 0x000CB8, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_10_6611625B412636C3BBC46E9FDC5640FA' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_9_DEE614BF4BA1993A944F7E842E764719) == 0x000D00, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_9_DEE614BF4BA1993A944F7E842E764719' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_8_E0C2278F4C2495B6AC9F70A772AB6966) == 0x000D48, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_8_E0C2278F4C2495B6AC9F70A772AB6966' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_7_3F520B9B4FF3BD43CEB8B392E978B302) == 0x000D90, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_7_3F520B9B4FF3BD43CEB8B392E978B302' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_6_5622EBEF43BB8B7CCD61C094932B8534) == 0x000DD8, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_6_5622EBEF43BB8B7CCD61C094932B8534' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_5_32BD425347085A901DA512A147E52A7C) == 0x000E20, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_5_32BD425347085A901DA512A147E52A7C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_4_075872D4424C947615CE0584CE0DD074) == 0x000E68, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_4_075872D4424C947615CE0584CE0DD074' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_3_E0DF13C14CE5477807B50D90D5D4D201) == 0x000EB0, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_3_E0DF13C14CE5477807B50D90D5D4D201' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_2_5754D1DE4C35D845F58E418D666561EE) == 0x000EF8, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_2_5754D1DE4C35D845F58E418D666561EE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_1_8695C8D54B79B6EF220E6298E0547ADA) == 0x000F40, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_1_8695C8D54B79B6EF220E6298E0547ADA' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_DMR_C, SMGraphK2Node_GraphPropertyNode_2936EFF946F26CB833C7D39ABBE3EEA1) == 0x000F88, "Member 'USMEvent_Kill_DMR_C::SMGraphK2Node_GraphPropertyNode_2936EFF946F26CB833C7D39ABBE3EEA1' has a wrong offset!");

}

