#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_MG

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_MG.SMEvent_Kill_MG_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_MG_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_882607E24D7A5738A02A6DB01B0589AD; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_28DF83D74B1F53F751C0F2AF2D63894A; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_305AFC9F43124CFE3C6893A45D700C5B; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_AFED32FE4559FD3286FBF6B08BA7FD3A; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_84D4E2EF44731F3A96A598900E021609; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_5DD43C9A42314DA3A61098A641123B16; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_F99B981E4EEDA6BA3B0F239D27C292FF; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_221FEFD2454675BE5F58F29C27EEED3F; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_66B4F5CC443022B367EA87BF5F08BDD7; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_CCB73D4A4AAA70E8D3C072AB9B16BC3A; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_A23A3CEB40AF71CC6467F6ABDBEB249D; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_7A1E2B8A41301E849B43CD9525DAF990; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_EF73FBDC4BB598650445C991999CE352; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3F255B2C47FA62443A6C67A9B5380BA9; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_MG(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_1CC1D0CA47B6BF46FFFFC0AD034450EA();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_37B82786408B512AB696E68192317740();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_9295D6734F41B3B6AF25399B1B56CA62();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_B89EC274473A26A1A56CF6A6687BCA77();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_4B13B0074FA5631B590C1AB97616CFA9();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_9481C6AA447111BB5FBFC5900AF32F59();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_02E59A5A4FDED0A56C372EBADEDC1E31();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_65E697B042D75B72BD7432BD3AFF6D86();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_EF55CDD4489701E32E566D9B29C1ACDA();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_CB8C1CCD421E929C21CBB2B9FF8CD8F8();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_5013597D43A77E1E4D19559776E3DC0A();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_C6FBB57344DCA1E8150E77B11C967F0C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_MG_C">();
	}
	static class USMEvent_Kill_MG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_MG_C>();
	}
};
static_assert(alignof(USMEvent_Kill_MG_C) == 0x000008, "Wrong alignment on USMEvent_Kill_MG_C");
static_assert(sizeof(USMEvent_Kill_MG_C) == 0x000FD0, "Wrong size on USMEvent_Kill_MG_C");
static_assert(offsetof(USMEvent_Kill_MG_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_MG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_TransitionResultNode_882607E24D7A5738A02A6DB01B0589AD) == 0x000700, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_TransitionResultNode_882607E24D7A5738A02A6DB01B0589AD' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_StateEntryNode_28DF83D74B1F53F751C0F2AF2D63894A) == 0x0008F8, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_StateEntryNode_28DF83D74B1F53F751C0F2AF2D63894A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_ConduitResultNode_305AFC9F43124CFE3C6893A45D700C5B) == 0x000AD8, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_ConduitResultNode_305AFC9F43124CFE3C6893A45D700C5B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_10_AFED32FE4559FD3286FBF6B08BA7FD3A) == 0x000CB8, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_10_AFED32FE4559FD3286FBF6B08BA7FD3A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_9_84D4E2EF44731F3A96A598900E021609) == 0x000D00, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_9_84D4E2EF44731F3A96A598900E021609' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_8_5DD43C9A42314DA3A61098A641123B16) == 0x000D48, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_8_5DD43C9A42314DA3A61098A641123B16' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_7_F99B981E4EEDA6BA3B0F239D27C292FF) == 0x000D90, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_7_F99B981E4EEDA6BA3B0F239D27C292FF' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_6_221FEFD2454675BE5F58F29C27EEED3F) == 0x000DD8, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_6_221FEFD2454675BE5F58F29C27EEED3F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_5_66B4F5CC443022B367EA87BF5F08BDD7) == 0x000E20, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_5_66B4F5CC443022B367EA87BF5F08BDD7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_4_CCB73D4A4AAA70E8D3C072AB9B16BC3A) == 0x000E68, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_4_CCB73D4A4AAA70E8D3C072AB9B16BC3A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_3_A23A3CEB40AF71CC6467F6ABDBEB249D) == 0x000EB0, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_3_A23A3CEB40AF71CC6467F6ABDBEB249D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_2_7A1E2B8A41301E849B43CD9525DAF990) == 0x000EF8, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_2_7A1E2B8A41301E849B43CD9525DAF990' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_1_EF73FBDC4BB598650445C991999CE352) == 0x000F40, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_1_EF73FBDC4BB598650445C991999CE352' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MG_C, SMGraphK2Node_GraphPropertyNode_3F255B2C47FA62443A6C67A9B5380BA9) == 0x000F88, "Member 'USMEvent_Kill_MG_C::SMGraphK2Node_GraphPropertyNode_3F255B2C47FA62443A6C67A9B5380BA9' has a wrong offset!");

}

