#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillEmemyEffectedByEMP

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_KillEmemyEffectedByEMP.SMEvent_KillEmemyEffectedByEMP_C
// 0x0770 (0x0E68 - 0x06F8)
class USMEvent_KillEmemyEffectedByEMP_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_E6DA62B34B810748645E99AE8F256EA2; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_4A689A7445C82B8F6F5323AAAECD05EF; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_7CC291FF4FBAE99C4C7865BA5FD4ADFB; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_7D24A7134522DFF0D8AE95B8CE1FA357; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_D02DEB734907C8D2650179B0854DB903; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_8E0FBE414CBFBAE8DC7C92B27CF020A6; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_AA5A0D5E407B4C1C0A139C96B5F50906; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_B5A5DA4C4B64872CC30237BEF1E8CDED; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_D2A7818A4C5CF0B68F5F3EA269FE1565; // 0x0E20(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_KillEmemyEffectedByEMP(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_2A68124F4C33E8645D6FDAA22E71BFE9_AFA42D1B4AE1C4C8AD577EBEA89BD041();
	void SMGraphK2Node_GraphPropertyNode_5_8FBC1AC9AE62937ED288E1B431A37B3D_9D9E3E3647726974C8DEA3AAD2E19CB6();
	void SMGraphK2Node_GraphPropertyNode_4_40A291E7A5009A35B29F31036F3FD958_8E379B14446C63A00B4B8C8AD4D07048();
	void SMGraphK2Node_GraphPropertyNode_3_D9CFEDB523581B15DAC934241AECB687_4D38CB3F423C06FF816DADB92564BE88();
	void SMGraphK2Node_GraphPropertyNode_0_3DA64C0AB489BBF8EAE713CAEED73534_0AA9D46F490D4668158D4F8E9F482A1A();
	void SMGraphK2Node_GraphPropertyNode_1_518353AF11A99FDFEEDB66B6418EA001_12FB740E482F16747B1A25A250029827();
	void SMGraphK2Node_GraphPropertyNode_2_58CDA98FBB02B19119316CA1EF2B4BE8_1E444AA54A7B4B357A20D6820E9F7512();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_KillEmemyEffectedByEMP_C">();
	}
	static class USMEvent_KillEmemyEffectedByEMP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_KillEmemyEffectedByEMP_C>();
	}
};
static_assert(alignof(USMEvent_KillEmemyEffectedByEMP_C) == 0x000008, "Wrong alignment on USMEvent_KillEmemyEffectedByEMP_C");
static_assert(sizeof(USMEvent_KillEmemyEffectedByEMP_C) == 0x000E68, "Wrong size on USMEvent_KillEmemyEffectedByEMP_C");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_KillEmemyEffectedByEMP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, SMGraphK2Node_TransitionResultNode_E6DA62B34B810748645E99AE8F256EA2) == 0x000700, "Member 'USMEvent_KillEmemyEffectedByEMP_C::SMGraphK2Node_TransitionResultNode_E6DA62B34B810748645E99AE8F256EA2' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, SMGraphK2Node_StateEntryNode_4A689A7445C82B8F6F5323AAAECD05EF) == 0x0008F8, "Member 'USMEvent_KillEmemyEffectedByEMP_C::SMGraphK2Node_StateEntryNode_4A689A7445C82B8F6F5323AAAECD05EF' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, SMGraphK2Node_ConduitResultNode_7CC291FF4FBAE99C4C7865BA5FD4ADFB) == 0x000AD8, "Member 'USMEvent_KillEmemyEffectedByEMP_C::SMGraphK2Node_ConduitResultNode_7CC291FF4FBAE99C4C7865BA5FD4ADFB' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, SMGraphK2Node_GraphPropertyNode_5_7D24A7134522DFF0D8AE95B8CE1FA357) == 0x000CB8, "Member 'USMEvent_KillEmemyEffectedByEMP_C::SMGraphK2Node_GraphPropertyNode_5_7D24A7134522DFF0D8AE95B8CE1FA357' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, SMGraphK2Node_GraphPropertyNode_4_D02DEB734907C8D2650179B0854DB903) == 0x000D00, "Member 'USMEvent_KillEmemyEffectedByEMP_C::SMGraphK2Node_GraphPropertyNode_4_D02DEB734907C8D2650179B0854DB903' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, SMGraphK2Node_GraphPropertyNode_3_8E0FBE414CBFBAE8DC7C92B27CF020A6) == 0x000D48, "Member 'USMEvent_KillEmemyEffectedByEMP_C::SMGraphK2Node_GraphPropertyNode_3_8E0FBE414CBFBAE8DC7C92B27CF020A6' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, SMGraphK2Node_GraphPropertyNode_2_AA5A0D5E407B4C1C0A139C96B5F50906) == 0x000D90, "Member 'USMEvent_KillEmemyEffectedByEMP_C::SMGraphK2Node_GraphPropertyNode_2_AA5A0D5E407B4C1C0A139C96B5F50906' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, SMGraphK2Node_GraphPropertyNode_1_B5A5DA4C4B64872CC30237BEF1E8CDED) == 0x000DD8, "Member 'USMEvent_KillEmemyEffectedByEMP_C::SMGraphK2Node_GraphPropertyNode_1_B5A5DA4C4B64872CC30237BEF1E8CDED' has a wrong offset!");
static_assert(offsetof(USMEvent_KillEmemyEffectedByEMP_C, SMGraphK2Node_GraphPropertyNode_D2A7818A4C5CF0B68F5F3EA269FE1565) == 0x000E20, "Member 'USMEvent_KillEmemyEffectedByEMP_C::SMGraphK2Node_GraphPropertyNode_D2A7818A4C5CF0B68F5F3EA269FE1565' has a wrong offset!");

}

