#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_Dominating

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_Dominating.SMEvent_Medal_Dominating_C
// 0x07B8 (0x0EB0 - 0x06F8)
class USMEvent_Medal_Dominating_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_07D91603417B32266E4D3C846536D10A; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_F5174CCA4723ED7F016369AD96BEDADC; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_1A7F90424FBA991ED6E804B2BF00F552; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_1D583F66407D9FA4B6BC6B907D680FC7; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_5D1D39C5498A8AD8B8FA57B1E3ED6F2D; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_18FDC2B24BE827F7D4CACB99797AC73A; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_427422314AF0BBFB2722DEB8F18B0F0B; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_48AABAEF40730B3732DFF6BB2BF9B11B; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_E31DC9864A8531EDE520A3AAAD42F376; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11C5AAC440B58AFDEE228F81CE12C867; // 0x0E68(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_Dominating(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_C76A8776469253AD6D89D5AAD3F0F302();
	void SMGraphK2Node_GraphPropertyNode_6_6497D36F5330B6C40EBBCAE693280A75_B51CAC0C49687516C8B029A9945A2924();
	void SMGraphK2Node_GraphPropertyNode_5_CAE53E2F4A2A8DA7F8759484AC97F154_04B1973041D272DFE8E18DA4DFCD98F7();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_69CDC7564AB671408F6756A72C77C0F4();
	void SMGraphK2Node_GraphPropertyNode_4_A86399258EA2362991746F4D867C76C6_0ED5559641659E4F0F7807AD34BDCF7E();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_D66421A04D26BA6C954D53B8ACF19CE5();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_EC36C6DC429DBFD7CB010CB8AF5E807A();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_A777B6FB4352A33FD5EE3EA16AF78E41();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_Dominating_C">();
	}
	static class USMEvent_Medal_Dominating_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_Dominating_C>();
	}
};
static_assert(alignof(USMEvent_Medal_Dominating_C) == 0x000008, "Wrong alignment on USMEvent_Medal_Dominating_C");
static_assert(sizeof(USMEvent_Medal_Dominating_C) == 0x000EB0, "Wrong size on USMEvent_Medal_Dominating_C");
static_assert(offsetof(USMEvent_Medal_Dominating_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_Dominating_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_TransitionResultNode_07D91603417B32266E4D3C846536D10A) == 0x000700, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_TransitionResultNode_07D91603417B32266E4D3C846536D10A' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_ConduitResultNode_F5174CCA4723ED7F016369AD96BEDADC) == 0x0008F8, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_ConduitResultNode_F5174CCA4723ED7F016369AD96BEDADC' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_StateEntryNode_1A7F90424FBA991ED6E804B2BF00F552) == 0x000AD8, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_StateEntryNode_1A7F90424FBA991ED6E804B2BF00F552' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_GraphPropertyNode_6_1D583F66407D9FA4B6BC6B907D680FC7) == 0x000CB8, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_GraphPropertyNode_6_1D583F66407D9FA4B6BC6B907D680FC7' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_GraphPropertyNode_5_5D1D39C5498A8AD8B8FA57B1E3ED6F2D) == 0x000D00, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_GraphPropertyNode_5_5D1D39C5498A8AD8B8FA57B1E3ED6F2D' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_GraphPropertyNode_4_18FDC2B24BE827F7D4CACB99797AC73A) == 0x000D48, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_GraphPropertyNode_4_18FDC2B24BE827F7D4CACB99797AC73A' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_GraphPropertyNode_3_427422314AF0BBFB2722DEB8F18B0F0B) == 0x000D90, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_GraphPropertyNode_3_427422314AF0BBFB2722DEB8F18B0F0B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_GraphPropertyNode_2_48AABAEF40730B3732DFF6BB2BF9B11B) == 0x000DD8, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_GraphPropertyNode_2_48AABAEF40730B3732DFF6BB2BF9B11B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_GraphPropertyNode_1_E31DC9864A8531EDE520A3AAAD42F376) == 0x000E20, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_GraphPropertyNode_1_E31DC9864A8531EDE520A3AAAD42F376' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Dominating_C, SMGraphK2Node_GraphPropertyNode_11C5AAC440B58AFDEE228F81CE12C867) == 0x000E68, "Member 'USMEvent_Medal_Dominating_C::SMGraphK2Node_GraphPropertyNode_11C5AAC440B58AFDEE228F81CE12C867' has a wrong offset!");

}

