#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_Terminator

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_Terminator.SMEvent_Medal_Terminator_C
// 0x07B8 (0x0EB0 - 0x06F8)
class USMEvent_Medal_Terminator_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_A6C2F932425EFC5DD213F6A5CBF6DCF9; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_AB3EFEF74F44169B775A768A0738AC4D; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_BA2A30354C943A19E9C227B1F4DDDBF3; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_C69082E54B617FADF228C98D46BC1CA9; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_FD7D9D6E4E3343C234D8B493D8A00411; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_A46F996049F606D3408B2CA88E15D8C6; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_7D1795A144D08B6B6EAADD9A7C5C8AA8; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_29882522433DF53769879A9C5266B9B5; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_D4C44BB24D992FDE937EC1A7C381D0E0; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_B71779354F6478CB0AA9628BFA9DC1EC; // 0x0E68(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_Terminator(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_E24D914E48EC44E0C1FE869A2625C067();
	void SMGraphK2Node_GraphPropertyNode_6_6497D36F5330B6C40EBBCAE693280A75_F854C6824ECEC1B6837D9089C743590C();
	void SMGraphK2Node_GraphPropertyNode_5_CAE53E2F4A2A8DA7F8759484AC97F154_2E92D33A4F2BF2835CDE7286E66F08AA();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_7F82BE0F4ED044844C8BF79BE6BB9904();
	void SMGraphK2Node_GraphPropertyNode_4_A86399258EA2362991746F4D867C76C6_E30513FC451770726018ED90E06069A4();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_472873484C71DB7623EA92A9AFA4EC3E();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_D54B08004DF1998366E65FB99273296C();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_F8B06ACC42D52651890BF7A9C3F2EBCD();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_Terminator_C">();
	}
	static class USMEvent_Medal_Terminator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_Terminator_C>();
	}
};
static_assert(alignof(USMEvent_Medal_Terminator_C) == 0x000008, "Wrong alignment on USMEvent_Medal_Terminator_C");
static_assert(sizeof(USMEvent_Medal_Terminator_C) == 0x000EB0, "Wrong size on USMEvent_Medal_Terminator_C");
static_assert(offsetof(USMEvent_Medal_Terminator_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_Terminator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_TransitionResultNode_A6C2F932425EFC5DD213F6A5CBF6DCF9) == 0x000700, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_TransitionResultNode_A6C2F932425EFC5DD213F6A5CBF6DCF9' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_ConduitResultNode_AB3EFEF74F44169B775A768A0738AC4D) == 0x0008F8, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_ConduitResultNode_AB3EFEF74F44169B775A768A0738AC4D' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_StateEntryNode_BA2A30354C943A19E9C227B1F4DDDBF3) == 0x000AD8, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_StateEntryNode_BA2A30354C943A19E9C227B1F4DDDBF3' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_GraphPropertyNode_6_C69082E54B617FADF228C98D46BC1CA9) == 0x000CB8, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_GraphPropertyNode_6_C69082E54B617FADF228C98D46BC1CA9' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_GraphPropertyNode_5_FD7D9D6E4E3343C234D8B493D8A00411) == 0x000D00, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_GraphPropertyNode_5_FD7D9D6E4E3343C234D8B493D8A00411' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_GraphPropertyNode_4_A46F996049F606D3408B2CA88E15D8C6) == 0x000D48, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_GraphPropertyNode_4_A46F996049F606D3408B2CA88E15D8C6' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_GraphPropertyNode_3_7D1795A144D08B6B6EAADD9A7C5C8AA8) == 0x000D90, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_GraphPropertyNode_3_7D1795A144D08B6B6EAADD9A7C5C8AA8' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_GraphPropertyNode_2_29882522433DF53769879A9C5266B9B5) == 0x000DD8, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_GraphPropertyNode_2_29882522433DF53769879A9C5266B9B5' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_GraphPropertyNode_1_D4C44BB24D992FDE937EC1A7C381D0E0) == 0x000E20, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_GraphPropertyNode_1_D4C44BB24D992FDE937EC1A7C381D0E0' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Terminator_C, SMGraphK2Node_GraphPropertyNode_B71779354F6478CB0AA9628BFA9DC1EC) == 0x000E68, "Member 'USMEvent_Medal_Terminator_C::SMGraphK2Node_GraphPropertyNode_B71779354F6478CB0AA9628BFA9DC1EC' has a wrong offset!");

}

