#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_YangFullLevel

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_YangFullLevel.SMEvent_YangFullLevel_C
// 0x0DD0 (0x1478 - 0x06A8)
class USMEvent_YangFullLevel_C final : public UPBEvent_LoadPlayerData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_C76BF00A44BD72B0D1CFEBB785FBF51F; // 0x06B0(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_A3E971EA47B5484F6E2065A1AC60D1F9; // 0x08A8(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_0926385F4954985D732E37AEF204DA6D; // 0x0AA0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_053FBADC457D1122389784AF377B25ED; // 0x0C80(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_928A9B0F487C5E986016259F37C1F372; // 0x0E60(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_53B479684AE1373E8E0778AD656B7987; // 0x1040(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_8192A7C34C09AD29B2BC5B928712AD14; // 0x1088(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_8469D9074C875B9AE3D25BBF45E5970F; // 0x10D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_47D05A374A0FB50416B1C0B3CB7F79E0; // 0x1118(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_8619A3BD4CABA6C89DB6D185204B5CBD; // 0x1160(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_C12803CE407BC4C2ABDB1C83D946B063; // 0x11A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_FB4825A346740DFB8CDFFDBA06BE7958; // 0x11F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_6EE68D7D495AC0D59BCAC2A4F35B0466; // 0x1238(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_A245306541705A68ADD7EE954906AA6D; // 0x1280(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_04B2662D44EB536A618AC087EE9BFB95; // 0x12C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_5390D8D647A878CAC5B94BB2842628E2; // 0x1310(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_C00AC684492CBFFDAE70B193DBA7460D; // 0x1358(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_3BD635184330DA544476B28B152EB8F1; // 0x13A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_7B8EF95644E40C537429C6B255158B87; // 0x13E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9AB0CFC44ACFB36E924A44A7B3568781; // 0x1430(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_YangFullLevel(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_F523AA4D4EF2D4976256D79BFDA97D7F_CE37CD5F4490602CB186B09DA748F1B5();
	void SMGraphK2Node_GraphPropertyNode_14_8FBC1AC9AE62937ED288E1B431A37B3D_50E8A9884E90E392976654AFE687635A();
	void SMGraphK2Node_GraphPropertyNode_13_40A291E7A5009A35B29F31036F3FD958_73A7DDE5420D8E56DBF574831742A074();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_C79199154831EFD41F1C46B6CC9514C3();
	void SMGraphK2Node_GraphPropertyNode_12_9B2E76CB0D5642A91285ECD0AD22455D_E7F5989E4BAE524B346C65854B3AF818();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_56D6372F450489701A5E8DB197BA77CD();
	void SMGraphK2Node_GraphPropertyNode_2_7E261F3E5C0FA126924682D5024D57B6_7B444D6F4D365D021337648898980FC7();
	void SMGraphK2Node_GraphPropertyNode_11_1DBA4F3EBF49270A15FCABAE378D5A28_E9DFE2614F73117B324BF9888761A4D2();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_F73A403942D6C52A6CE947B0DC1B46F6();
	void SMGraphK2Node_GraphPropertyNode_4_3DA64C0AB489BBF8EAE713CAEED73534_0267ADCD45065A3191A0629CFE60344F();
	void SMGraphK2Node_GraphPropertyNode_10_83FB9728653B5875C5D29938A1862987_55494D04495562C266D7AC8CFBCB6731();
	void SMGraphK2Node_GraphPropertyNode_5_5DF5EB69FB5B1350C77BA421EBD2B8FA_488BB8AC4D20CF6D0208D3BE4849C767();
	void SMGraphK2Node_GraphPropertyNode_6_924251CE29BC1D7EDCFAB4DB3C0223AE_E3604FBC4DB0E0BD3311A28D110F3A19();
	void SMGraphK2Node_GraphPropertyNode_9_471AAF85555CF2679A4535DADFC63770_529A69214268E318FFC5C0B473393609();
	void SMGraphK2Node_GraphPropertyNode_7_E0C31B330F532F42E5913DACC16F802B_596437FD4C10D197CA2059BA520DCF02();
	void SMGraphK2Node_GraphPropertyNode_8_A22120CDAC3ACF3D903EA80FE84B0006_A911E35E42D9C8BD65BBACA99FAE2CF7();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_YangFullLevel_C">();
	}
	static class USMEvent_YangFullLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_YangFullLevel_C>();
	}
};
static_assert(alignof(USMEvent_YangFullLevel_C) == 0x000008, "Wrong alignment on USMEvent_YangFullLevel_C");
static_assert(sizeof(USMEvent_YangFullLevel_C) == 0x001478, "Wrong size on USMEvent_YangFullLevel_C");
static_assert(offsetof(USMEvent_YangFullLevel_C, UberGraphFrame) == 0x0006A8, "Member 'USMEvent_YangFullLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_TransitionResultNode_1_C76BF00A44BD72B0D1CFEBB785FBF51F) == 0x0006B0, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_TransitionResultNode_1_C76BF00A44BD72B0D1CFEBB785FBF51F' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_TransitionResultNode_A3E971EA47B5484F6E2065A1AC60D1F9) == 0x0008A8, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_TransitionResultNode_A3E971EA47B5484F6E2065A1AC60D1F9' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_StateEntryNode_0926385F4954985D732E37AEF204DA6D) == 0x000AA0, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_StateEntryNode_0926385F4954985D732E37AEF204DA6D' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_ConduitResultNode_1_053FBADC457D1122389784AF377B25ED) == 0x000C80, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_ConduitResultNode_1_053FBADC457D1122389784AF377B25ED' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_ConduitResultNode_928A9B0F487C5E986016259F37C1F372) == 0x000E60, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_ConduitResultNode_928A9B0F487C5E986016259F37C1F372' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_14_53B479684AE1373E8E0778AD656B7987) == 0x001040, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_14_53B479684AE1373E8E0778AD656B7987' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_13_8192A7C34C09AD29B2BC5B928712AD14) == 0x001088, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_13_8192A7C34C09AD29B2BC5B928712AD14' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_12_8469D9074C875B9AE3D25BBF45E5970F) == 0x0010D0, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_12_8469D9074C875B9AE3D25BBF45E5970F' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_11_47D05A374A0FB50416B1C0B3CB7F79E0) == 0x001118, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_11_47D05A374A0FB50416B1C0B3CB7F79E0' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_10_8619A3BD4CABA6C89DB6D185204B5CBD) == 0x001160, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_10_8619A3BD4CABA6C89DB6D185204B5CBD' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_9_C12803CE407BC4C2ABDB1C83D946B063) == 0x0011A8, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_9_C12803CE407BC4C2ABDB1C83D946B063' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_8_FB4825A346740DFB8CDFFDBA06BE7958) == 0x0011F0, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_8_FB4825A346740DFB8CDFFDBA06BE7958' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_7_6EE68D7D495AC0D59BCAC2A4F35B0466) == 0x001238, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_7_6EE68D7D495AC0D59BCAC2A4F35B0466' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_6_A245306541705A68ADD7EE954906AA6D) == 0x001280, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_6_A245306541705A68ADD7EE954906AA6D' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_5_04B2662D44EB536A618AC087EE9BFB95) == 0x0012C8, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_5_04B2662D44EB536A618AC087EE9BFB95' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_4_5390D8D647A878CAC5B94BB2842628E2) == 0x001310, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_4_5390D8D647A878CAC5B94BB2842628E2' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_3_C00AC684492CBFFDAE70B193DBA7460D) == 0x001358, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_3_C00AC684492CBFFDAE70B193DBA7460D' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_2_3BD635184330DA544476B28B152EB8F1) == 0x0013A0, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_2_3BD635184330DA544476B28B152EB8F1' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_1_7B8EF95644E40C537429C6B255158B87) == 0x0013E8, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_1_7B8EF95644E40C537429C6B255158B87' has a wrong offset!");
static_assert(offsetof(USMEvent_YangFullLevel_C, SMGraphK2Node_GraphPropertyNode_9AB0CFC44ACFB36E924A44A7B3568781) == 0x001430, "Member 'USMEvent_YangFullLevel_C::SMGraphK2Node_GraphPropertyNode_9AB0CFC44ACFB36E924A44A7B3568781' has a wrong offset!");

}

