#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_SAIGA

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_SAIGA.SMEvent_Kill_SAIGA_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_SAIGA_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_D2EF66D949BA792A68BE779CA56E50F7; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_E31E5B654DC36CB05E92178FF31F7510; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_2160A4F94ABEDDAC3743C2855BF46CD2; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_3F0B22114B292E048CAE008688E50435; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_A06C1A5E4864D674F9856399CB3F69A5; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_2A04B89C47EC5568FEB1CAA83F7ABF28; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_15656BFA430122EDB040639EA8B69E23; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_E8837F954F4BC4C1E530659432FB5834; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_061727ED4C004B6CB749C391AC72C2DA; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_295B6DCC408F3807410F8BB88A289D37; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_8B44D24E48E9921AB10AB8A37ACE7862; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_97F4F7CD43194064F9E8288C7D05EF7F; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_036B2DAA45F6BEE6CF3CC287A2A8F55E; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4521A56845DE1FD21458A6AEF6D65732; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_SAIGA(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_C8DF5E684E7FCEDDE0C9A081BF5CEE41();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_38677E1A463BAC5F5CBF9CB6DCBE3EFF();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_8BE5DB55474E1C32023C109E52F6F9D5();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_7A24FAAF461F39E4805308AFC902B024();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_006E4AF643DE284B4FA3089E43A6B01E();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_29D690624258E0F1B2519582750B3523();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_82B1B1CB495D2A206F0052B5AAE31D4F();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_CFE0FB464CF69BB1CC20DB8A977E5B43();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_F1428FC243E8932A30B754850DA4FE44();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_D5C6E4A54AEB3C6A168BB6BE10ED350B();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_F4F0A24F49694A97382722BF86C0A8C5();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_8BF11E69457BC5EB8601DDB52AADFC27();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_SAIGA_C">();
	}
	static class USMEvent_Kill_SAIGA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_SAIGA_C>();
	}
};
static_assert(alignof(USMEvent_Kill_SAIGA_C) == 0x000008, "Wrong alignment on USMEvent_Kill_SAIGA_C");
static_assert(sizeof(USMEvent_Kill_SAIGA_C) == 0x000FD0, "Wrong size on USMEvent_Kill_SAIGA_C");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_SAIGA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_TransitionResultNode_D2EF66D949BA792A68BE779CA56E50F7) == 0x000700, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_TransitionResultNode_D2EF66D949BA792A68BE779CA56E50F7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_StateEntryNode_E31E5B654DC36CB05E92178FF31F7510) == 0x0008F8, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_StateEntryNode_E31E5B654DC36CB05E92178FF31F7510' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_ConduitResultNode_2160A4F94ABEDDAC3743C2855BF46CD2) == 0x000AD8, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_ConduitResultNode_2160A4F94ABEDDAC3743C2855BF46CD2' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_10_3F0B22114B292E048CAE008688E50435) == 0x000CB8, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_10_3F0B22114B292E048CAE008688E50435' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_9_A06C1A5E4864D674F9856399CB3F69A5) == 0x000D00, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_9_A06C1A5E4864D674F9856399CB3F69A5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_8_2A04B89C47EC5568FEB1CAA83F7ABF28) == 0x000D48, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_8_2A04B89C47EC5568FEB1CAA83F7ABF28' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_7_15656BFA430122EDB040639EA8B69E23) == 0x000D90, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_7_15656BFA430122EDB040639EA8B69E23' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_6_E8837F954F4BC4C1E530659432FB5834) == 0x000DD8, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_6_E8837F954F4BC4C1E530659432FB5834' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_5_061727ED4C004B6CB749C391AC72C2DA) == 0x000E20, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_5_061727ED4C004B6CB749C391AC72C2DA' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_4_295B6DCC408F3807410F8BB88A289D37) == 0x000E68, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_4_295B6DCC408F3807410F8BB88A289D37' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_3_8B44D24E48E9921AB10AB8A37ACE7862) == 0x000EB0, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_3_8B44D24E48E9921AB10AB8A37ACE7862' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_2_97F4F7CD43194064F9E8288C7D05EF7F) == 0x000EF8, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_2_97F4F7CD43194064F9E8288C7D05EF7F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_1_036B2DAA45F6BEE6CF3CC287A2A8F55E) == 0x000F40, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_1_036B2DAA45F6BEE6CF3CC287A2A8F55E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SAIGA_C, SMGraphK2Node_GraphPropertyNode_4521A56845DE1FD21458A6AEF6D65732) == 0x000F88, "Member 'USMEvent_Kill_SAIGA_C::SMGraphK2Node_GraphPropertyNode_4521A56845DE1FD21458A6AEF6D65732' has a wrong offset!");

}

