#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_MOSIN

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_MOSIN.SMEvent_Kill_MOSIN_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_MOSIN_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_CE824CF049B676A17202809917628AF5; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_631C52454325C15A07F0D1B78F596545; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_3A2F28A147B5C2A523CF06A9E4770826; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_59E6FC534739A48226E5CBAF7E805877; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_7AFDD17D43606CBF12464DAC736AAA0C; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_9BAD9CF24E4EAEEF3D0C6AA75D1530F1; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_BD087CDB42AED1A87D773C8B76DA83FE; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_138519E94B36EF16DE0971A767437D45; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_0EEB6CB841D9DC6F591A8CA9E4CED00D; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_CE8F0D414E2A17111C008A94CD77C1B5; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_6ECA1AAF4C9D7CE6620E9CB21D2A5ABE; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_28621214477F97CAFE61008F960C8880; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_63337A784A216837C0F4E2819B37B12F; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_93E4EC8943FF9B51844103AEDFBD8B25; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_MOSIN(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_28FFC4B84671F974D755ACA2B85DBB62();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_A815AC4141569B26F08339AC82A2E56B();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_C8C0A0F141324F75E851D4B1415C11CF();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_85299D714440F2A519A842A5E3B81604();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_3AF97AC3405E218BC17E2791FF8F8055();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_C278D7364AE7DFEAF09ECB92D1A5BA68();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_98DBC12A4667E13107E3559C9B95F126();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_FFC5A50C4BDFDE3399A65E821E00F2B7();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_93E6131E445CD6ADD4413F8BFE406C46();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_EE3E7E564F042DC223DBF0A5E895BADA();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_1E79AA9C4804CF73C1D90E98EED3F1D7();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_53B461B149DA33C5BD7C1BB0A6E1AF9A();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_MOSIN_C">();
	}
	static class USMEvent_Kill_MOSIN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_MOSIN_C>();
	}
};
static_assert(alignof(USMEvent_Kill_MOSIN_C) == 0x000008, "Wrong alignment on USMEvent_Kill_MOSIN_C");
static_assert(sizeof(USMEvent_Kill_MOSIN_C) == 0x000FD0, "Wrong size on USMEvent_Kill_MOSIN_C");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_MOSIN_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_TransitionResultNode_CE824CF049B676A17202809917628AF5) == 0x000700, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_TransitionResultNode_CE824CF049B676A17202809917628AF5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_StateEntryNode_631C52454325C15A07F0D1B78F596545) == 0x0008F8, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_StateEntryNode_631C52454325C15A07F0D1B78F596545' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_ConduitResultNode_3A2F28A147B5C2A523CF06A9E4770826) == 0x000AD8, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_ConduitResultNode_3A2F28A147B5C2A523CF06A9E4770826' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_10_59E6FC534739A48226E5CBAF7E805877) == 0x000CB8, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_10_59E6FC534739A48226E5CBAF7E805877' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_9_7AFDD17D43606CBF12464DAC736AAA0C) == 0x000D00, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_9_7AFDD17D43606CBF12464DAC736AAA0C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_8_9BAD9CF24E4EAEEF3D0C6AA75D1530F1) == 0x000D48, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_8_9BAD9CF24E4EAEEF3D0C6AA75D1530F1' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_7_BD087CDB42AED1A87D773C8B76DA83FE) == 0x000D90, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_7_BD087CDB42AED1A87D773C8B76DA83FE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_6_138519E94B36EF16DE0971A767437D45) == 0x000DD8, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_6_138519E94B36EF16DE0971A767437D45' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_5_0EEB6CB841D9DC6F591A8CA9E4CED00D) == 0x000E20, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_5_0EEB6CB841D9DC6F591A8CA9E4CED00D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_4_CE8F0D414E2A17111C008A94CD77C1B5) == 0x000E68, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_4_CE8F0D414E2A17111C008A94CD77C1B5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_3_6ECA1AAF4C9D7CE6620E9CB21D2A5ABE) == 0x000EB0, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_3_6ECA1AAF4C9D7CE6620E9CB21D2A5ABE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_2_28621214477F97CAFE61008F960C8880) == 0x000EF8, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_2_28621214477F97CAFE61008F960C8880' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_1_63337A784A216837C0F4E2819B37B12F) == 0x000F40, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_1_63337A784A216837C0F4E2819B37B12F' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_MOSIN_C, SMGraphK2Node_GraphPropertyNode_93E4EC8943FF9B51844103AEDFBD8B25) == 0x000F88, "Member 'USMEvent_Kill_MOSIN_C::SMGraphK2Node_GraphPropertyNode_93E4EC8943FF9B51844103AEDFBD8B25' has a wrong offset!");

}

