#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Gotcha

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Gotcha.SMEvent_Gotcha_C
// 0x0CF8 (0x1470 - 0x0778)
class USMEvent_Gotcha_C final : public UPBEvent_MatchEnd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_EFDD25BA44C13F00708D2A90A6094221; // 0x0780(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_08317DDB4F03277CB207F49D25398300; // 0x0978(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_A4675D7241FDF1D9F09A7183D9E9FB74; // 0x0B70(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_95B7FCEF4798D35BF8D3F8812EF6C03A; // 0x0D50(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_EF56CE524DD7012011B15EA4DDBCFE10; // 0x0F30(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_F6EFA17444CCA9D6D0611881088A1ACE; // 0x1110(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_455885664F030CCB18F7D7A0BCAF0222; // 0x1158(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_6F6F34DA415DFB9668E4BD9C0057D101; // 0x11A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_84FED67E4452965C1BCB5C8C15FF9A7B; // 0x11E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_9E7C12C146F7CC5EE950BE933EF8245A; // 0x1230(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_EC60A51A4CB6E49711694FA98ED905A2; // 0x1278(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_D244BA5043D7461A16867AADD683C281; // 0x12C0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_341661C6448C390300FA9D951EEDA8EA; // 0x1308(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_BF69F63247B5B25D5D6FAFB135764C8B; // 0x1350(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_F3231D454DB7DE8EF4350FBF14D0ECEB; // 0x1398(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_90C175B24A0DE5BAFAABF5850560033A; // 0x13E0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_A874DB174DE1FF0C678ED2989716291C; // 0x1428(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Gotcha(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_BD4AB47840AE6725AB2379AAF74CF273_B827F30647DFD84DDEEAFE9689688F44();
	void SMGraphK2Node_GraphPropertyNode_11_3DA64C0AB489BBF8EAE713CAEED73534_344C0B3843AD1905CCB835AC1B61E15D();
	void SMGraphK2Node_GraphPropertyNode_10_518353AF11A99FDFEEDB66B6418EA001_3389E087444E5AAE3551BDB03CCA28C6();
	void SMGraphK2Node_GraphPropertyNode_9_7E261F3E5C0FA126924682D5024D57B6_7C5DA7BF4A576B233F0395924EC0D2E3();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_FEF652294C1CB1203E309A8E7EE0F91D();
	void SMGraphK2Node_GraphPropertyNode_8_9B636A5D1C4163D7B741F98AC72F48E7_90ABB44C4F81FC7A09047EAE3CA1F57F();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_7A4875454B0CBBCBF63BE18EF1EED840();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_B9E644314608D73CDE19A9AA02C4760A();
	void SMGraphK2Node_GraphPropertyNode_7_07CA978E0CC48D17FC9737FC6562B6D9_F57ECB8D4059621A87D1CAB31B8D8243();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_BA1D6A024170E16628AE6B8202045B3D();
	void SMGraphK2Node_GraphPropertyNode_4_9B726A79733F234A2592B22CBF705BAE_068E140349314A2E38AA09A5EE91CBCD();
	void SMGraphK2Node_GraphPropertyNode_6_C04E0C318D415947F3C0A291B4AF3A6D_D2B114F145466B6BE7BF499BE09E72BB();
	void SMGraphK2Node_GraphPropertyNode_5_B580CFBBEE69D2AE9AD084C568474214_FC40AE764958E745287C14B76A27B916();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Gotcha_C">();
	}
	static class USMEvent_Gotcha_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Gotcha_C>();
	}
};
static_assert(alignof(USMEvent_Gotcha_C) == 0x000008, "Wrong alignment on USMEvent_Gotcha_C");
static_assert(sizeof(USMEvent_Gotcha_C) == 0x001470, "Wrong size on USMEvent_Gotcha_C");
static_assert(offsetof(USMEvent_Gotcha_C, UberGraphFrame) == 0x000778, "Member 'USMEvent_Gotcha_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_TransitionResultNode_1_EFDD25BA44C13F00708D2A90A6094221) == 0x000780, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_TransitionResultNode_1_EFDD25BA44C13F00708D2A90A6094221' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_TransitionResultNode_08317DDB4F03277CB207F49D25398300) == 0x000978, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_TransitionResultNode_08317DDB4F03277CB207F49D25398300' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_ConduitResultNode_1_A4675D7241FDF1D9F09A7183D9E9FB74) == 0x000B70, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_ConduitResultNode_1_A4675D7241FDF1D9F09A7183D9E9FB74' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_ConduitResultNode_95B7FCEF4798D35BF8D3F8812EF6C03A) == 0x000D50, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_ConduitResultNode_95B7FCEF4798D35BF8D3F8812EF6C03A' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_StateEntryNode_EF56CE524DD7012011B15EA4DDBCFE10) == 0x000F30, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_StateEntryNode_EF56CE524DD7012011B15EA4DDBCFE10' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_11_F6EFA17444CCA9D6D0611881088A1ACE) == 0x001110, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_11_F6EFA17444CCA9D6D0611881088A1ACE' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_10_455885664F030CCB18F7D7A0BCAF0222) == 0x001158, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_10_455885664F030CCB18F7D7A0BCAF0222' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_9_6F6F34DA415DFB9668E4BD9C0057D101) == 0x0011A0, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_9_6F6F34DA415DFB9668E4BD9C0057D101' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_8_84FED67E4452965C1BCB5C8C15FF9A7B) == 0x0011E8, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_8_84FED67E4452965C1BCB5C8C15FF9A7B' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_7_9E7C12C146F7CC5EE950BE933EF8245A) == 0x001230, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_7_9E7C12C146F7CC5EE950BE933EF8245A' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_6_EC60A51A4CB6E49711694FA98ED905A2) == 0x001278, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_6_EC60A51A4CB6E49711694FA98ED905A2' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_5_D244BA5043D7461A16867AADD683C281) == 0x0012C0, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_5_D244BA5043D7461A16867AADD683C281' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_4_341661C6448C390300FA9D951EEDA8EA) == 0x001308, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_4_341661C6448C390300FA9D951EEDA8EA' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_3_BF69F63247B5B25D5D6FAFB135764C8B) == 0x001350, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_3_BF69F63247B5B25D5D6FAFB135764C8B' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_2_F3231D454DB7DE8EF4350FBF14D0ECEB) == 0x001398, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_2_F3231D454DB7DE8EF4350FBF14D0ECEB' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_1_90C175B24A0DE5BAFAABF5850560033A) == 0x0013E0, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_1_90C175B24A0DE5BAFAABF5850560033A' has a wrong offset!");
static_assert(offsetof(USMEvent_Gotcha_C, SMGraphK2Node_GraphPropertyNode_A874DB174DE1FF0C678ED2989716291C) == 0x001428, "Member 'USMEvent_Gotcha_C::SMGraphK2Node_GraphPropertyNode_A874DB174DE1FF0C678ED2989716291C' has a wrong offset!");

}

