#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillWithFlag

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_KillWithFlag.SMEvent_KillWithFlag_C
// 0x0728 (0x0E20 - 0x06F8)
class USMEvent_KillWithFlag_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_9ED15A9142B2DFDD1F792B801B92A9DC; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_E1A2854D4AED8E2D0E7627BDCAA7DF95; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_02C391574B8CE0A991C4F89ED1148E30; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_3DC4A86F4D8425C942F42694C2CB42F2; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_01277E4540C186D70806B4990312F069; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_145FE8A1491440841695FA9160725FC2; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_1925B43F44BA03B4A6AB8A9F7414A6A6; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5793320449EE48690BE36A8F9E93761F; // 0x0DD8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_KillWithFlag(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_9301F9DA41344C28AA46DBB71AFF1ABE_1EDA648A4FCF6EF1DAD6419B65D7ADEA();
	void SMGraphK2Node_GraphPropertyNode_4_8FBC1AC9AE62937ED288E1B431A37B3D_8251484C4FE346682760498FD89DF1E8();
	void SMGraphK2Node_GraphPropertyNode_3_40A291E7A5009A35B29F31036F3FD958_9933A95D4D79F99DF222B49163BA5154();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_D943752E4A52D3D7482461AA8830D7C7();
	void SMGraphK2Node_GraphPropertyNode_0_3AF7095505214BB5447796B63169B0F6_5481251C4847E1139603728FB00F798F();
	void SMGraphK2Node_GraphPropertyNode_1_518353AF11A99FDFEEDB66B6418EA001_CBE6C81C424A4B3953717896D8B97FA8();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_KillWithFlag_C">();
	}
	static class USMEvent_KillWithFlag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_KillWithFlag_C>();
	}
};
static_assert(alignof(USMEvent_KillWithFlag_C) == 0x000008, "Wrong alignment on USMEvent_KillWithFlag_C");
static_assert(sizeof(USMEvent_KillWithFlag_C) == 0x000E20, "Wrong size on USMEvent_KillWithFlag_C");
static_assert(offsetof(USMEvent_KillWithFlag_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_KillWithFlag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_KillWithFlag_C, SMGraphK2Node_TransitionResultNode_9ED15A9142B2DFDD1F792B801B92A9DC) == 0x000700, "Member 'USMEvent_KillWithFlag_C::SMGraphK2Node_TransitionResultNode_9ED15A9142B2DFDD1F792B801B92A9DC' has a wrong offset!");
static_assert(offsetof(USMEvent_KillWithFlag_C, SMGraphK2Node_StateEntryNode_E1A2854D4AED8E2D0E7627BDCAA7DF95) == 0x0008F8, "Member 'USMEvent_KillWithFlag_C::SMGraphK2Node_StateEntryNode_E1A2854D4AED8E2D0E7627BDCAA7DF95' has a wrong offset!");
static_assert(offsetof(USMEvent_KillWithFlag_C, SMGraphK2Node_ConduitResultNode_02C391574B8CE0A991C4F89ED1148E30) == 0x000AD8, "Member 'USMEvent_KillWithFlag_C::SMGraphK2Node_ConduitResultNode_02C391574B8CE0A991C4F89ED1148E30' has a wrong offset!");
static_assert(offsetof(USMEvent_KillWithFlag_C, SMGraphK2Node_GraphPropertyNode_4_3DC4A86F4D8425C942F42694C2CB42F2) == 0x000CB8, "Member 'USMEvent_KillWithFlag_C::SMGraphK2Node_GraphPropertyNode_4_3DC4A86F4D8425C942F42694C2CB42F2' has a wrong offset!");
static_assert(offsetof(USMEvent_KillWithFlag_C, SMGraphK2Node_GraphPropertyNode_3_01277E4540C186D70806B4990312F069) == 0x000D00, "Member 'USMEvent_KillWithFlag_C::SMGraphK2Node_GraphPropertyNode_3_01277E4540C186D70806B4990312F069' has a wrong offset!");
static_assert(offsetof(USMEvent_KillWithFlag_C, SMGraphK2Node_GraphPropertyNode_2_145FE8A1491440841695FA9160725FC2) == 0x000D48, "Member 'USMEvent_KillWithFlag_C::SMGraphK2Node_GraphPropertyNode_2_145FE8A1491440841695FA9160725FC2' has a wrong offset!");
static_assert(offsetof(USMEvent_KillWithFlag_C, SMGraphK2Node_GraphPropertyNode_1_1925B43F44BA03B4A6AB8A9F7414A6A6) == 0x000D90, "Member 'USMEvent_KillWithFlag_C::SMGraphK2Node_GraphPropertyNode_1_1925B43F44BA03B4A6AB8A9F7414A6A6' has a wrong offset!");
static_assert(offsetof(USMEvent_KillWithFlag_C, SMGraphK2Node_GraphPropertyNode_5793320449EE48690BE36A8F9E93761F) == 0x000DD8, "Member 'USMEvent_KillWithFlag_C::SMGraphK2Node_GraphPropertyNode_5793320449EE48690BE36A8F9E93761F' has a wrong offset!");

}

