#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Damage_PEACE

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Damage_PEACE.SMEvent_Damage_PEACE_C
// 0x0CB0 (0x13A8 - 0x06F8)
class USMEvent_Damage_PEACE_C final : public UPBEvent_Hit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_57FFEAC74304CA6C26C2608DEB2504A6; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_2E58EF274ACAA7763F7FE2AAAA2E9DE8; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_8B0F83CA47F75D8BF839939338241512; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_2ED9174A4BAE2B9837B774A9BD3827EA; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_0E92131343E3FA6D9CA89081AB72050C; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_4C9F01D84D7AFE0EAE2186A92B23F9C0; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_0541DD1C4A369E23C0DE4CAD93E63191; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_0EF198CB4C11C27F41FF8BA008F87B17; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_1ED74508465A69A98EDFE7A73447B1E1; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_0B80EEB74A94069102EEF7B16E80E6E2; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_122BFCB4491821AEFC0F09858860734E; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_2F94D1704AE7A195E3BE81A7B0B326F3; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_A21BB85B4F755E4330D3448BF3BA5567; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_E2FDD78542DF7DE8FE8133B2934F89F9; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_AC7DB02C4526F0637DC82EA438F8BD29; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_93282A4C46407495A87847AD31413BC4; // 0x1360(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Damage_PEACE(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_D39739DA45C11A4B4A2D839DEDDAB7BB();
	void SMGraphK2Node_GraphPropertyNode_10_4499195241432879F5E6F782CA615D8D_839FE0814EF28B85E06DE9BC9E89D3B7();
	void SMGraphK2Node_GraphPropertyNode_9_3DA64C0AB489BBF8EAE713CAEED73534_A50892834FA1C5247296669FC2B529EB();
	void SMGraphK2Node_GraphPropertyNode_8_518353AF11A99FDFEEDB66B6418EA001_A0BE93EF4CD8AF91F91DBF963BF4208D();
	void SMGraphK2Node_GraphPropertyNode_7_8FBC1AC9AE62937ED288E1B431A37B3D_3E8691D648711DAC60BEA4BCEFF055FD();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_08FB0B0146F492317DF7C1BB6D392618();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_78675C3D4A998E1348AA24B8FEC60869();
	void SMGraphK2Node_GraphPropertyNode_6_40A291E7A5009A35B29F31036F3FD958_99F3C85E413B1382520E939871E59E51();
	void SMGraphK2Node_GraphPropertyNode_2_6424367FC4B9B3C2EA7FFCDB60D88894_7A0A0DAA4D3234F611D3D6897153B34E();
	void SMGraphK2Node_GraphPropertyNode_3_7B1241F1B3164E6D5F4F996B354D6D3B_08891464477245FB221C3DAEFA9131E3();
	void SMGraphK2Node_GraphPropertyNode_5_AC0B850875368C03D3659202C66244CC_ABAA9CFF4D01A5264D973FB2DA3CCBE7();
	void SMGraphK2Node_GraphPropertyNode_4_033BB48819393947FEB084A7CF4C0D58_32C60726481CF83AAC13E38D2105C700();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Damage_PEACE_C">();
	}
	static class USMEvent_Damage_PEACE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Damage_PEACE_C>();
	}
};
static_assert(alignof(USMEvent_Damage_PEACE_C) == 0x000008, "Wrong alignment on USMEvent_Damage_PEACE_C");
static_assert(sizeof(USMEvent_Damage_PEACE_C) == 0x0013A8, "Wrong size on USMEvent_Damage_PEACE_C");
static_assert(offsetof(USMEvent_Damage_PEACE_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Damage_PEACE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_TransitionResultNode_1_57FFEAC74304CA6C26C2608DEB2504A6) == 0x000700, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_TransitionResultNode_1_57FFEAC74304CA6C26C2608DEB2504A6' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_TransitionResultNode_2E58EF274ACAA7763F7FE2AAAA2E9DE8) == 0x0008F8, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_TransitionResultNode_2E58EF274ACAA7763F7FE2AAAA2E9DE8' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_ConduitResultNode_1_8B0F83CA47F75D8BF839939338241512) == 0x000AF0, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_ConduitResultNode_1_8B0F83CA47F75D8BF839939338241512' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_StateEntryNode_2ED9174A4BAE2B9837B774A9BD3827EA) == 0x000CD0, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_StateEntryNode_2ED9174A4BAE2B9837B774A9BD3827EA' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_ConduitResultNode_0E92131343E3FA6D9CA89081AB72050C) == 0x000EB0, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_ConduitResultNode_0E92131343E3FA6D9CA89081AB72050C' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_10_4C9F01D84D7AFE0EAE2186A92B23F9C0) == 0x001090, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_10_4C9F01D84D7AFE0EAE2186A92B23F9C0' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_9_0541DD1C4A369E23C0DE4CAD93E63191) == 0x0010D8, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_9_0541DD1C4A369E23C0DE4CAD93E63191' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_8_0EF198CB4C11C27F41FF8BA008F87B17) == 0x001120, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_8_0EF198CB4C11C27F41FF8BA008F87B17' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_7_1ED74508465A69A98EDFE7A73447B1E1) == 0x001168, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_7_1ED74508465A69A98EDFE7A73447B1E1' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_6_0B80EEB74A94069102EEF7B16E80E6E2) == 0x0011B0, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_6_0B80EEB74A94069102EEF7B16E80E6E2' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_5_122BFCB4491821AEFC0F09858860734E) == 0x0011F8, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_5_122BFCB4491821AEFC0F09858860734E' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_4_2F94D1704AE7A195E3BE81A7B0B326F3) == 0x001240, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_4_2F94D1704AE7A195E3BE81A7B0B326F3' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_3_A21BB85B4F755E4330D3448BF3BA5567) == 0x001288, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_3_A21BB85B4F755E4330D3448BF3BA5567' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_2_E2FDD78542DF7DE8FE8133B2934F89F9) == 0x0012D0, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_2_E2FDD78542DF7DE8FE8133B2934F89F9' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_1_AC7DB02C4526F0637DC82EA438F8BD29) == 0x001318, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_1_AC7DB02C4526F0637DC82EA438F8BD29' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_PEACE_C, SMGraphK2Node_GraphPropertyNode_93282A4C46407495A87847AD31413BC4) == 0x001360, "Member 'USMEvent_Damage_PEACE_C::SMGraphK2Node_GraphPropertyNode_93282A4C46407495A87847AD31413BC4' has a wrong offset!");

}

