#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_RecycleFlag

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_RecycleFlag.SMEvent_RecycleFlag_C
// 0x0278 (0x0940 - 0x06C8)
class USMEvent_RecycleFlag_C final : public UPBEvent_RecycleFlag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_0EF0522345925150554D27B6E67376CE; // 0x06D0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_777922E748C466C1636B55BD8F5950B5; // 0x08B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_AA65429341FF7C1D35E3C3B054C7B620; // 0x08F8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_RecycleFlag(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_30A6F50D4904B69920A00AB7CC76D1A4();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_1B79B10E4ACEA87E74D1FDA8DBBFACEC();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_342E8188425F1A17675A1CAF2847466F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_RecycleFlag_C">();
	}
	static class USMEvent_RecycleFlag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_RecycleFlag_C>();
	}
};
static_assert(alignof(USMEvent_RecycleFlag_C) == 0x000008, "Wrong alignment on USMEvent_RecycleFlag_C");
static_assert(sizeof(USMEvent_RecycleFlag_C) == 0x000940, "Wrong size on USMEvent_RecycleFlag_C");
static_assert(offsetof(USMEvent_RecycleFlag_C, UberGraphFrame) == 0x0006C8, "Member 'USMEvent_RecycleFlag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_RecycleFlag_C, SMGraphK2Node_StateEntryNode_0EF0522345925150554D27B6E67376CE) == 0x0006D0, "Member 'USMEvent_RecycleFlag_C::SMGraphK2Node_StateEntryNode_0EF0522345925150554D27B6E67376CE' has a wrong offset!");
static_assert(offsetof(USMEvent_RecycleFlag_C, SMGraphK2Node_GraphPropertyNode_1_777922E748C466C1636B55BD8F5950B5) == 0x0008B0, "Member 'USMEvent_RecycleFlag_C::SMGraphK2Node_GraphPropertyNode_1_777922E748C466C1636B55BD8F5950B5' has a wrong offset!");
static_assert(offsetof(USMEvent_RecycleFlag_C, SMGraphK2Node_GraphPropertyNode_AA65429341FF7C1D35E3C3B054C7B620) == 0x0008F8, "Member 'USMEvent_RecycleFlag_C::SMGraphK2Node_GraphPropertyNode_AA65429341FF7C1D35E3C3B054C7B620' has a wrong offset!");

}

