#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Damage_FORT

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Damage_FORT.SMEvent_Damage_FORT_C
// 0x0CB0 (0x13A8 - 0x06F8)
class USMEvent_Damage_FORT_C final : public UPBEvent_Hit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_299ADD604FD28F74EBEF07A82E555766; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_A97AB30148D113F8D74DC0928D067186; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_DD458C974FC6EF1A7ABAEC8E021B4E5E; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_A4018D1B46582460F072A4A600775EDE; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_386242E7466CEA1B10C4AA916B207FC9; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_5D395DEB40FF150B393B40B18ED9EB85; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_A87B87644BCEC3E4525BC6A5BA55A5CD; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_6DDC1D24421E17A9075225B8484C4C90; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_C90EE34945BDA7A32B7D04B1B8135F35; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_64EC976E4A8C6461FD26F5AC84B6A82E; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_7317157C47716BF5107FBEAC844732CC; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_3D2360234DDF55332685798AE2C8EEFF; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_D3F90FF7481911ED943FA29E4EBF5584; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_F993EF484E3DCE10859245A751779D24; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_D857175E403D44501DDE32B2D31A0A50; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_07B84559466B77FE78A2709C60E32BD1; // 0x1360(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Damage_FORT(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_8C36504F4A5B6E2E406755A067891C81();
	void SMGraphK2Node_GraphPropertyNode_10_4499195241432879F5E6F782CA615D8D_9A0FEDAF49291760F39E18BC6F872D7E();
	void SMGraphK2Node_GraphPropertyNode_9_3DA64C0AB489BBF8EAE713CAEED73534_7B7515974FA7BC41FBFF868F024FCF1E();
	void SMGraphK2Node_GraphPropertyNode_8_518353AF11A99FDFEEDB66B6418EA001_C6D22A734D879E294025ACA610138535();
	void SMGraphK2Node_GraphPropertyNode_7_8FBC1AC9AE62937ED288E1B431A37B3D_6FFB04D84437C6B76B334B91FE6A920E();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_E28ADC4B4AFFDC6CBB713CB31718DADB();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_290F5C094DE823F1D492E08673E43122();
	void SMGraphK2Node_GraphPropertyNode_6_40A291E7A5009A35B29F31036F3FD958_5B756D364A36D5A8DEAB469CCF32200F();
	void SMGraphK2Node_GraphPropertyNode_2_6424367FC4B9B3C2EA7FFCDB60D88894_1C14197B46F74BC740D58FB103556C89();
	void SMGraphK2Node_GraphPropertyNode_3_7B1241F1B3164E6D5F4F996B354D6D3B_E3386E5E45A61A789DE5A8AA93C1317A();
	void SMGraphK2Node_GraphPropertyNode_5_AC0B850875368C03D3659202C66244CC_4900C0A840C0A7FA1D26F48D3D38A148();
	void SMGraphK2Node_GraphPropertyNode_4_033BB48819393947FEB084A7CF4C0D58_A580B895400E1046D8F42B82DCF524CD();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Damage_FORT_C">();
	}
	static class USMEvent_Damage_FORT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Damage_FORT_C>();
	}
};
static_assert(alignof(USMEvent_Damage_FORT_C) == 0x000008, "Wrong alignment on USMEvent_Damage_FORT_C");
static_assert(sizeof(USMEvent_Damage_FORT_C) == 0x0013A8, "Wrong size on USMEvent_Damage_FORT_C");
static_assert(offsetof(USMEvent_Damage_FORT_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Damage_FORT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_TransitionResultNode_1_299ADD604FD28F74EBEF07A82E555766) == 0x000700, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_TransitionResultNode_1_299ADD604FD28F74EBEF07A82E555766' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_TransitionResultNode_A97AB30148D113F8D74DC0928D067186) == 0x0008F8, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_TransitionResultNode_A97AB30148D113F8D74DC0928D067186' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_ConduitResultNode_1_DD458C974FC6EF1A7ABAEC8E021B4E5E) == 0x000AF0, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_ConduitResultNode_1_DD458C974FC6EF1A7ABAEC8E021B4E5E' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_StateEntryNode_A4018D1B46582460F072A4A600775EDE) == 0x000CD0, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_StateEntryNode_A4018D1B46582460F072A4A600775EDE' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_ConduitResultNode_386242E7466CEA1B10C4AA916B207FC9) == 0x000EB0, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_ConduitResultNode_386242E7466CEA1B10C4AA916B207FC9' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_10_5D395DEB40FF150B393B40B18ED9EB85) == 0x001090, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_10_5D395DEB40FF150B393B40B18ED9EB85' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_9_A87B87644BCEC3E4525BC6A5BA55A5CD) == 0x0010D8, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_9_A87B87644BCEC3E4525BC6A5BA55A5CD' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_8_6DDC1D24421E17A9075225B8484C4C90) == 0x001120, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_8_6DDC1D24421E17A9075225B8484C4C90' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_7_C90EE34945BDA7A32B7D04B1B8135F35) == 0x001168, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_7_C90EE34945BDA7A32B7D04B1B8135F35' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_6_64EC976E4A8C6461FD26F5AC84B6A82E) == 0x0011B0, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_6_64EC976E4A8C6461FD26F5AC84B6A82E' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_5_7317157C47716BF5107FBEAC844732CC) == 0x0011F8, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_5_7317157C47716BF5107FBEAC844732CC' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_4_3D2360234DDF55332685798AE2C8EEFF) == 0x001240, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_4_3D2360234DDF55332685798AE2C8EEFF' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_3_D3F90FF7481911ED943FA29E4EBF5584) == 0x001288, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_3_D3F90FF7481911ED943FA29E4EBF5584' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_2_F993EF484E3DCE10859245A751779D24) == 0x0012D0, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_2_F993EF484E3DCE10859245A751779D24' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_1_D857175E403D44501DDE32B2D31A0A50) == 0x001318, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_1_D857175E403D44501DDE32B2D31A0A50' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_FORT_C, SMGraphK2Node_GraphPropertyNode_07B84559466B77FE78A2709C60E32BD1) == 0x001360, "Member 'USMEvent_Damage_FORT_C::SMGraphK2Node_GraphPropertyNode_07B84559466B77FE78A2709C60E32BD1' has a wrong offset!");

}

