#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_RPK

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_RPK.SMEvent_Kill_RPK_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_RPK_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_14A44731492D45706E543C95C5B34B05; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_B90E489B44D780476A0D6290B1E90EF5; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_06825DB04E5389B030E01DB1757F3773; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_6E74347A4D0D2544BA3929BAC7B60CE3; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_F30D16FE47E895A6AD9FA9A9804FA431; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_4A37FEE64807869F41AF7E84EA55CDAE; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_650A1CF34FA57C898A1257AB9FFF8466; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_814D240941B8B34585B3E389AFDFBCB7; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_B3025D0E4F0F8415A9BEA0861CE3F299; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_B13F2E3F42E8DE9615DA13B38ADF03C6; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_53C34E9B4DDC56AB83C3189E1674FBB7; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_DDCDC5054DF53E390F457BBD4E290B77; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_9B2E3BF042052177CA8833A474D94B6C; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_22AD644C4EBC59F31BE5578B5F75CB89; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_RPK(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_9853E45D4F229DDC5DE92A9ADDB17F26();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_0E38049A444820C4E0C4EFAFF031A80A();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_F7C4F5E3415DD0308CDC8E9DA1C06DE4();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_1E2FC62A46777D8FACA286BA86AAD675();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_6D9158A14F4AF7049475888E639241D9();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_D1846EBF47D9850306E950A20625EF8D();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_F1075B2D471B1E7E53A885971F70B558();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_942A89AB4FC138E16B3989B991730612();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_7E9820D9422F00E62396A88D477828BE();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_461CCDBD4054CF6A935010A2B95D631F();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_C829174344CCC379EB281BA708D93626();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_2457A9F9406120B6F86EBCBEB0C438D2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_RPK_C">();
	}
	static class USMEvent_Kill_RPK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_RPK_C>();
	}
};
static_assert(alignof(USMEvent_Kill_RPK_C) == 0x000008, "Wrong alignment on USMEvent_Kill_RPK_C");
static_assert(sizeof(USMEvent_Kill_RPK_C) == 0x000FD0, "Wrong size on USMEvent_Kill_RPK_C");
static_assert(offsetof(USMEvent_Kill_RPK_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_RPK_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_TransitionResultNode_14A44731492D45706E543C95C5B34B05) == 0x000700, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_TransitionResultNode_14A44731492D45706E543C95C5B34B05' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_StateEntryNode_B90E489B44D780476A0D6290B1E90EF5) == 0x0008F8, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_StateEntryNode_B90E489B44D780476A0D6290B1E90EF5' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_ConduitResultNode_06825DB04E5389B030E01DB1757F3773) == 0x000AD8, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_ConduitResultNode_06825DB04E5389B030E01DB1757F3773' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_10_6E74347A4D0D2544BA3929BAC7B60CE3) == 0x000CB8, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_10_6E74347A4D0D2544BA3929BAC7B60CE3' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_9_F30D16FE47E895A6AD9FA9A9804FA431) == 0x000D00, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_9_F30D16FE47E895A6AD9FA9A9804FA431' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_8_4A37FEE64807869F41AF7E84EA55CDAE) == 0x000D48, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_8_4A37FEE64807869F41AF7E84EA55CDAE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_7_650A1CF34FA57C898A1257AB9FFF8466) == 0x000D90, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_7_650A1CF34FA57C898A1257AB9FFF8466' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_6_814D240941B8B34585B3E389AFDFBCB7) == 0x000DD8, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_6_814D240941B8B34585B3E389AFDFBCB7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_5_B3025D0E4F0F8415A9BEA0861CE3F299) == 0x000E20, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_5_B3025D0E4F0F8415A9BEA0861CE3F299' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_4_B13F2E3F42E8DE9615DA13B38ADF03C6) == 0x000E68, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_4_B13F2E3F42E8DE9615DA13B38ADF03C6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_3_53C34E9B4DDC56AB83C3189E1674FBB7) == 0x000EB0, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_3_53C34E9B4DDC56AB83C3189E1674FBB7' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_2_DDCDC5054DF53E390F457BBD4E290B77) == 0x000EF8, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_2_DDCDC5054DF53E390F457BBD4E290B77' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_1_9B2E3BF042052177CA8833A474D94B6C) == 0x000F40, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_1_9B2E3BF042052177CA8833A474D94B6C' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_RPK_C, SMGraphK2Node_GraphPropertyNode_22AD644C4EBC59F31BE5578B5F75CB89) == 0x000F88, "Member 'USMEvent_Kill_RPK_C::SMGraphK2Node_GraphPropertyNode_22AD644C4EBC59F31BE5578B5F75CB89' has a wrong offset!");

}

