#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Damage_HE150

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Damage_HE150.SMEvent_Damage_HE150_C
// 0x0CB0 (0x13A8 - 0x06F8)
class USMEvent_Damage_HE150_C final : public UPBEvent_Hit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_89AD4D0C4F37648C92B4CAA64FBD33C1; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_A5553DB445C76B5EB53B8394175FDB3F; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_330C9716477CC215391072BFAD98F674; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_07CC73C4434DAB80BB0983A341B8B2D9; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_E4B7AB4347081EFAFABF52B393CE5730; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_91EB80EE45ED03F6A07B2A8F6AB66D31; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_B3A24FCC4508BE0D4513799CEB8409E3; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_756609CF4E764C367BC1DB90797CA54B; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_1E24479C4D634A5BF9F39A8756F668FC; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_CA713666483AD454BB4DAA88FF916A38; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_8D2D6D3443FFA39313EFF9BE7C73630A; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_457F488A4E118F36D0A153BE6BCB4BE9; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_CC63FC534AF88380FE2D3C94861FFE93; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_819DF03E4A3236CFE0A1679DFDBB12E0; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_EB0330514B87B8E598F607914F7B7217; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_BCE27A3D4063E1120C848193E596C432; // 0x1360(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Damage_HE150(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_F1BE29474352CBC546FC93929A4EAF6F();
	void SMGraphK2Node_GraphPropertyNode_10_3DA64C0AB489BBF8EAE713CAEED73534_4D8CED3647A79AF7539BE6A70003AE09();
	void SMGraphK2Node_GraphPropertyNode_9_518353AF11A99FDFEEDB66B6418EA001_891D52E44C0C8CD9F84A9B945781D307();
	void SMGraphK2Node_GraphPropertyNode_8_AC0B850875368C03D3659202C66244CC_18DB68764FB75EAE3571069C3231AFFA();
	void SMGraphK2Node_GraphPropertyNode_7_033BB48819393947FEB084A7CF4C0D58_ED8476B6437D12D01C0767A767C62F53();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_C6F1B8EB408F75ADD2BCA2B558A8CD4D();
	void SMGraphK2Node_GraphPropertyNode_6_7B1241F1B3164E6D5F4F996B354D6D3B_3747A12C4506C61CA46F36A0705F4618();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_610F7F47445D6E6C80716BBB204387A1();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_EA52E52045DE034B0FBCFFA1199E099C();
	void SMGraphK2Node_GraphPropertyNode_5_6424367FC4B9B3C2EA7FFCDB60D88894_A650CA0E4AA960DE1ECF21BDA9B442D4();
	void SMGraphK2Node_GraphPropertyNode_3_40A291E7A5009A35B29F31036F3FD958_A169AF1947D4D8D0D3A2A2B558CCCAF1();
	void SMGraphK2Node_GraphPropertyNode_4_8FBC1AC9AE62937ED288E1B431A37B3D_B3DFB8C94C61661AD873149D805AEC38();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Damage_HE150_C">();
	}
	static class USMEvent_Damage_HE150_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Damage_HE150_C>();
	}
};
static_assert(alignof(USMEvent_Damage_HE150_C) == 0x000008, "Wrong alignment on USMEvent_Damage_HE150_C");
static_assert(sizeof(USMEvent_Damage_HE150_C) == 0x0013A8, "Wrong size on USMEvent_Damage_HE150_C");
static_assert(offsetof(USMEvent_Damage_HE150_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Damage_HE150_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_TransitionResultNode_1_89AD4D0C4F37648C92B4CAA64FBD33C1) == 0x000700, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_TransitionResultNode_1_89AD4D0C4F37648C92B4CAA64FBD33C1' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_TransitionResultNode_A5553DB445C76B5EB53B8394175FDB3F) == 0x0008F8, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_TransitionResultNode_A5553DB445C76B5EB53B8394175FDB3F' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_ConduitResultNode_1_330C9716477CC215391072BFAD98F674) == 0x000AF0, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_ConduitResultNode_1_330C9716477CC215391072BFAD98F674' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_StateEntryNode_07CC73C4434DAB80BB0983A341B8B2D9) == 0x000CD0, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_StateEntryNode_07CC73C4434DAB80BB0983A341B8B2D9' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_ConduitResultNode_E4B7AB4347081EFAFABF52B393CE5730) == 0x000EB0, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_ConduitResultNode_E4B7AB4347081EFAFABF52B393CE5730' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_10_91EB80EE45ED03F6A07B2A8F6AB66D31) == 0x001090, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_10_91EB80EE45ED03F6A07B2A8F6AB66D31' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_9_B3A24FCC4508BE0D4513799CEB8409E3) == 0x0010D8, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_9_B3A24FCC4508BE0D4513799CEB8409E3' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_8_756609CF4E764C367BC1DB90797CA54B) == 0x001120, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_8_756609CF4E764C367BC1DB90797CA54B' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_7_1E24479C4D634A5BF9F39A8756F668FC) == 0x001168, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_7_1E24479C4D634A5BF9F39A8756F668FC' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_6_CA713666483AD454BB4DAA88FF916A38) == 0x0011B0, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_6_CA713666483AD454BB4DAA88FF916A38' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_5_8D2D6D3443FFA39313EFF9BE7C73630A) == 0x0011F8, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_5_8D2D6D3443FFA39313EFF9BE7C73630A' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_4_457F488A4E118F36D0A153BE6BCB4BE9) == 0x001240, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_4_457F488A4E118F36D0A153BE6BCB4BE9' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_3_CC63FC534AF88380FE2D3C94861FFE93) == 0x001288, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_3_CC63FC534AF88380FE2D3C94861FFE93' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_2_819DF03E4A3236CFE0A1679DFDBB12E0) == 0x0012D0, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_2_819DF03E4A3236CFE0A1679DFDBB12E0' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_1_EB0330514B87B8E598F607914F7B7217) == 0x001318, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_1_EB0330514B87B8E598F607914F7B7217' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_HE150_C, SMGraphK2Node_GraphPropertyNode_BCE27A3D4063E1120C848193E596C432) == 0x001360, "Member 'USMEvent_Damage_HE150_C::SMGraphK2Node_GraphPropertyNode_BCE27A3D4063E1120C848193E596C432' has a wrong offset!");

}

