#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_Sweeper

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_Sweeper.SMEvent_Medal_Sweeper_C
// 0x0770 (0x0E68 - 0x06F8)
class USMEvent_Medal_Sweeper_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_32795D9843988E98F965F2B504186E51; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_2795144542BA5D9FE375ADBF7113807D; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_8FF6568645F40FC0CA81588C12F855EC; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_D7F36BCF48708796CE1BDCBCB875C166; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_BCC0576F46DEE2CA3C162D96A35980F4; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_48004DA343FE87FDD5FB7DA9A8B0A60C; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_727181F542F9DA4C67207EBCAF815224; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_1345A776454E8FD64F0333B978F7762B; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_C6CDCF7D4E529882E02E3FA3B0A467E4; // 0x0E20(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_Sweeper(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_18B8F92A4A113F9C715090BE233894AF();
	void SMGraphK2Node_GraphPropertyNode_5_03CFC2CB7ABB3C53EA5417338E508B22_DA990F8845593A63CC2FDEB9B200CBE5();
	void SMGraphK2Node_GraphPropertyNode_4_983B302A14AFC0B1F81911AA7E482BFD_D88F5C654CBC84C44306D98D5A470E19();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_902ACD5546041D10F36A3B994D7DB02E();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_2432094C4DB39BDD2222858B5544BDBA();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_DF67BE954970407DD55307A131ED3D36();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_22C1B74F471CA59490576DA5B63C4DE6();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_Sweeper_C">();
	}
	static class USMEvent_Medal_Sweeper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_Sweeper_C>();
	}
};
static_assert(alignof(USMEvent_Medal_Sweeper_C) == 0x000008, "Wrong alignment on USMEvent_Medal_Sweeper_C");
static_assert(sizeof(USMEvent_Medal_Sweeper_C) == 0x000E68, "Wrong size on USMEvent_Medal_Sweeper_C");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_Sweeper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, SMGraphK2Node_TransitionResultNode_32795D9843988E98F965F2B504186E51) == 0x000700, "Member 'USMEvent_Medal_Sweeper_C::SMGraphK2Node_TransitionResultNode_32795D9843988E98F965F2B504186E51' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, SMGraphK2Node_ConduitResultNode_2795144542BA5D9FE375ADBF7113807D) == 0x0008F8, "Member 'USMEvent_Medal_Sweeper_C::SMGraphK2Node_ConduitResultNode_2795144542BA5D9FE375ADBF7113807D' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, SMGraphK2Node_StateEntryNode_8FF6568645F40FC0CA81588C12F855EC) == 0x000AD8, "Member 'USMEvent_Medal_Sweeper_C::SMGraphK2Node_StateEntryNode_8FF6568645F40FC0CA81588C12F855EC' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, SMGraphK2Node_GraphPropertyNode_5_D7F36BCF48708796CE1BDCBCB875C166) == 0x000CB8, "Member 'USMEvent_Medal_Sweeper_C::SMGraphK2Node_GraphPropertyNode_5_D7F36BCF48708796CE1BDCBCB875C166' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, SMGraphK2Node_GraphPropertyNode_4_BCC0576F46DEE2CA3C162D96A35980F4) == 0x000D00, "Member 'USMEvent_Medal_Sweeper_C::SMGraphK2Node_GraphPropertyNode_4_BCC0576F46DEE2CA3C162D96A35980F4' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, SMGraphK2Node_GraphPropertyNode_3_48004DA343FE87FDD5FB7DA9A8B0A60C) == 0x000D48, "Member 'USMEvent_Medal_Sweeper_C::SMGraphK2Node_GraphPropertyNode_3_48004DA343FE87FDD5FB7DA9A8B0A60C' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, SMGraphK2Node_GraphPropertyNode_2_727181F542F9DA4C67207EBCAF815224) == 0x000D90, "Member 'USMEvent_Medal_Sweeper_C::SMGraphK2Node_GraphPropertyNode_2_727181F542F9DA4C67207EBCAF815224' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, SMGraphK2Node_GraphPropertyNode_1_1345A776454E8FD64F0333B978F7762B) == 0x000DD8, "Member 'USMEvent_Medal_Sweeper_C::SMGraphK2Node_GraphPropertyNode_1_1345A776454E8FD64F0333B978F7762B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_Sweeper_C, SMGraphK2Node_GraphPropertyNode_C6CDCF7D4E529882E02E3FA3B0A467E4) == 0x000E20, "Member 'USMEvent_Medal_Sweeper_C::SMGraphK2Node_GraphPropertyNode_C6CDCF7D4E529882E02E3FA3B0A467E4' has a wrong offset!");

}

