#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillByLastBullet

#include "Basic.hpp"


namespace SDK::Params
{

// Function SMEvent_KillByLastBullet.SMEvent_KillByLastBullet_C.ExecuteUbergraph_SMEvent_KillByLastBullet
// 0x0048 (0x0048 - 0x0000)
struct SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Kill_LastBullet*             K2Node_DynamicCast_AsPBConduit_Kill_Last_Bullet;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Kill_LastBullet*             K2Node_DynamicCast_AsPBConduit_Kill_Last_Bullet_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet) == 0x000008, "Wrong alignment on SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet");
static_assert(sizeof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet) == 0x000048, "Wrong size on SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet");
static_assert(offsetof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet, EntryPoint) == 0x000000, "Member 'SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet::EntryPoint' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet, K2Node_DynamicCast_AsPBSMState_Event_End) == 0x000008, "Member 'SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet::K2Node_DynamicCast_AsPBSMState_Event_End' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet, K2Node_DynamicCast_AsPBConduit_Kill_Last_Bullet) == 0x000018, "Member 'SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet::K2Node_DynamicCast_AsPBConduit_Kill_Last_Bullet' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet, K2Node_DynamicCast_AsPBSMState_Event_End_1) == 0x000028, "Member 'SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet::K2Node_DynamicCast_AsPBSMState_Event_End_1' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet, K2Node_DynamicCast_AsPBConduit_Kill_Last_Bullet_1) == 0x000038, "Member 'SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet::K2Node_DynamicCast_AsPBConduit_Kill_Last_Bullet_1' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'SMEvent_KillByLastBullet_C_ExecuteUbergraph_SMEvent_KillByLastBullet::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

