#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_SecondHand

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_SecondHand.SMEvent_SecondHand_C
// 0x06E0 (0x0DD8 - 0x06F8)
class USMEvent_SecondHand_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_110FCD134DB6CAB4B28D1595B53A4CA6; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_CD956F1F464D2EDF1D17DA9C58E11D55; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_3A5ED02A40A14A8D4D650DAFE35E02F2; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_91AE5B974FBEB4E0FAD96493BECF1EC5; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_D53C57BC465F5C55DA0BE48F7668C26A; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_6D88E79C43A91938AFC00F95BD992B21; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6582515A43B760F2FF7767986E4B04CA; // 0x0D90(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_SecondHand(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_E57303CD4BFA9459B9BC09BE7897C725_4724BBEA415944DF373B93AE9A187405();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_C764954E4AC5A64C83AE1483FF23FD32();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_728F10C84A779214E4DBF6AB0C561F44();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_FEF38E8E488AF2229D6735AE9D5BFEF4();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_9E79FBC54035A27DD1355983E83F33E0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_SecondHand_C">();
	}
	static class USMEvent_SecondHand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_SecondHand_C>();
	}
};
static_assert(alignof(USMEvent_SecondHand_C) == 0x000008, "Wrong alignment on USMEvent_SecondHand_C");
static_assert(sizeof(USMEvent_SecondHand_C) == 0x000DD8, "Wrong size on USMEvent_SecondHand_C");
static_assert(offsetof(USMEvent_SecondHand_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_SecondHand_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_SecondHand_C, SMGraphK2Node_TransitionResultNode_110FCD134DB6CAB4B28D1595B53A4CA6) == 0x000700, "Member 'USMEvent_SecondHand_C::SMGraphK2Node_TransitionResultNode_110FCD134DB6CAB4B28D1595B53A4CA6' has a wrong offset!");
static_assert(offsetof(USMEvent_SecondHand_C, SMGraphK2Node_ConduitResultNode_CD956F1F464D2EDF1D17DA9C58E11D55) == 0x0008F8, "Member 'USMEvent_SecondHand_C::SMGraphK2Node_ConduitResultNode_CD956F1F464D2EDF1D17DA9C58E11D55' has a wrong offset!");
static_assert(offsetof(USMEvent_SecondHand_C, SMGraphK2Node_StateEntryNode_3A5ED02A40A14A8D4D650DAFE35E02F2) == 0x000AD8, "Member 'USMEvent_SecondHand_C::SMGraphK2Node_StateEntryNode_3A5ED02A40A14A8D4D650DAFE35E02F2' has a wrong offset!");
static_assert(offsetof(USMEvent_SecondHand_C, SMGraphK2Node_GraphPropertyNode_3_91AE5B974FBEB4E0FAD96493BECF1EC5) == 0x000CB8, "Member 'USMEvent_SecondHand_C::SMGraphK2Node_GraphPropertyNode_3_91AE5B974FBEB4E0FAD96493BECF1EC5' has a wrong offset!");
static_assert(offsetof(USMEvent_SecondHand_C, SMGraphK2Node_GraphPropertyNode_2_D53C57BC465F5C55DA0BE48F7668C26A) == 0x000D00, "Member 'USMEvent_SecondHand_C::SMGraphK2Node_GraphPropertyNode_2_D53C57BC465F5C55DA0BE48F7668C26A' has a wrong offset!");
static_assert(offsetof(USMEvent_SecondHand_C, SMGraphK2Node_GraphPropertyNode_1_6D88E79C43A91938AFC00F95BD992B21) == 0x000D48, "Member 'USMEvent_SecondHand_C::SMGraphK2Node_GraphPropertyNode_1_6D88E79C43A91938AFC00F95BD992B21' has a wrong offset!");
static_assert(offsetof(USMEvent_SecondHand_C, SMGraphK2Node_GraphPropertyNode_6582515A43B760F2FF7767986E4B04CA) == 0x000D90, "Member 'USMEvent_SecondHand_C::SMGraphK2Node_GraphPropertyNode_6582515A43B760F2FF7767986E4B04CA' has a wrong offset!");

}

