#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Revive

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Revive.SMEvent_Revive_C
// 0x0278 (0x0930 - 0x06B8)
class USMEvent_Revive_C final : public UPBEvent_Revive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_074071D64186E1C4116E3981AE337D63; // 0x06C0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_FC31C51444795EEEC73DA9BB58A5F993; // 0x08A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_592EBE084E200FA2D6C224996C39C321; // 0x08E8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Revive(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_4AAD09C7446F50570A610EAF7D899D23();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_05EA6E73491E5D4C6F3BF2989C13C8B0();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_D2BA046248B6850ABA092EB5C329A7C4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Revive_C">();
	}
	static class USMEvent_Revive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Revive_C>();
	}
};
static_assert(alignof(USMEvent_Revive_C) == 0x000008, "Wrong alignment on USMEvent_Revive_C");
static_assert(sizeof(USMEvent_Revive_C) == 0x000930, "Wrong size on USMEvent_Revive_C");
static_assert(offsetof(USMEvent_Revive_C, UberGraphFrame) == 0x0006B8, "Member 'USMEvent_Revive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Revive_C, SMGraphK2Node_StateEntryNode_074071D64186E1C4116E3981AE337D63) == 0x0006C0, "Member 'USMEvent_Revive_C::SMGraphK2Node_StateEntryNode_074071D64186E1C4116E3981AE337D63' has a wrong offset!");
static_assert(offsetof(USMEvent_Revive_C, SMGraphK2Node_GraphPropertyNode_1_FC31C51444795EEEC73DA9BB58A5F993) == 0x0008A0, "Member 'USMEvent_Revive_C::SMGraphK2Node_GraphPropertyNode_1_FC31C51444795EEEC73DA9BB58A5F993' has a wrong offset!");
static_assert(offsetof(USMEvent_Revive_C, SMGraphK2Node_GraphPropertyNode_592EBE084E200FA2D6C224996C39C321) == 0x0008E8, "Member 'USMEvent_Revive_C::SMGraphK2Node_GraphPropertyNode_592EBE084E200FA2D6C224996C39C321' has a wrong offset!");

}

