#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_GotchaFinally

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_GotchaFinally.SMEvent_Medal_GotchaFinally_C
// 0x0EA8 (0x15A0 - 0x06F8)
class USMEvent_Medal_GotchaFinally_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_D63BBE2D4F83EA3934BB34B0EC4C88AC; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_9A1AF0124CF0CC70CD618797062580E3; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_4F58F4AE4E47E8BBF3478B8B6B012B0C; // 0x0AF0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_901E6EF1423E82ECF46BBCB8E6E5C060; // 0x0CD0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_68139174477FEE222FD63F90D24B697F; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_17_25CC03F540D1B2E9458BA4B5BA048804; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_16_9F38E8624E4FC0DB1D952C8954B830F3; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_15_FD51D8A643767DC57B1579B3BF22C6CC; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_1E5991564E56E7396F1121B30176EB5E; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_0E7B5A06402960F0F2BB7ABAAAC380B3; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_AE791CE2414C97E9B7C9D8A48D7DAE62; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_9493A78C45812E6343D196A007BFB7D7; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_4ADB9FDE449E4386013D57B49823AF86; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_70C1F58645ACC1CCA119A5813B898E08; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_E02F2024448AEEC2BC2305973F2522D9; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_4CC59F384F7138CBA7C67B8A1569DA18; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_B90436E3417554616B53B6AC23B45700; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_B2963501443483DE43BFBF8A35AB64DE; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_E75DF09E4CA113A88E266EA5D3A458B6; // 0x1438(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_56A7F9634E293DAD90A09BA2C7DC1553; // 0x1480(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_667C651E406B6EA8A7D69ABB4AB3479C; // 0x14C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_7877B2F84C4D03CC8463F895716A10A0; // 0x1510(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_ED506E304D332D8C30FDC19F4E3F2D17; // 0x1558(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_GotchaFinally(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_310A365C411F73AA4A3DACB7F22CA49D();
	void SMGraphK2Node_GraphPropertyNode_17_FBB2582631D9F451B9F00C8CFECB03B2_3AEC12A84BDF9FF2E2B6C5A42D683AA3();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_0EAC473641013024F2828EA26EBE60E7();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_FDD964F744B609B62EDD60901B1075E7();
	void SMGraphK2Node_GraphPropertyNode_16_3DA64C0AB489BBF8EAE713CAEED73534_1DD070C14F8A48EAEB2E9D96E8587D09();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_8DCF64694833B2E4CFD01CA20F7FF1D6();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_13CED3614D3AB9C43A17A2B075E80D2F();
	void SMGraphK2Node_GraphPropertyNode_15_518353AF11A99FDFEEDB66B6418EA001_9FD3D784466304573BC6769900B8DE24();
	void SMGraphK2Node_GraphPropertyNode_4_158EB7426D38824C71849EADC29278EE_6AC2B4954B4A063813D41C932A9D7A70();
	void SMGraphK2Node_GraphPropertyNode_5_26817F361455A01AED5BD4AF21717845_C29BC7D045E7C2E8293C9CBAA7543E58();
	void SMGraphK2Node_GraphPropertyNode_14_7AD3CF39C9AA9015C5123007C7BBF2B2_FC9C66DB476491C8E46936B56C28EC17();
	void SMGraphK2Node_GraphPropertyNode_6_688A1B9F7EEE66A4E03650D79D394438_FFB074354A0676676CF755AFF99CB764();
	void SMGraphK2Node_GraphPropertyNode_7_EE0959FD05723B388AAD98E93F3F2EED_0F1125B84BAEC2B53AB1C491AE267B3A();
	void SMGraphK2Node_GraphPropertyNode_13_FC603DA4FCC1E7834B05C158CDAF5B89_282665C5427D535441AC00AB2B98B5F4();
	void SMGraphK2Node_GraphPropertyNode_8_F3898F399CFA20301B4D37407424096A_EC2A479741DC8DA8C56C2F994E944D02();
	void SMGraphK2Node_GraphPropertyNode_9_F36616EC9B5D10F8B9D42B9E588A07A1_5D7EC78E4D4374B0AEE3779E328C5F12();
	void SMGraphK2Node_GraphPropertyNode_12_B29B24976CDB222BEA6E3422853EF47D_D3BFEAB248B9F2D725EF66BA10687720();
	void SMGraphK2Node_GraphPropertyNode_10_A48AEF7985EA3C088BD44F71E207198E_F369A2584AABF32D94ABB18BABFA2057();
	void SMGraphK2Node_GraphPropertyNode_11_A1A7E4B71F15E9A621F7B1D5A2F7F2FF_7F1E0205478D0F839D18EBB23C25242A();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_GotchaFinally_C">();
	}
	static class USMEvent_Medal_GotchaFinally_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_GotchaFinally_C>();
	}
};
static_assert(alignof(USMEvent_Medal_GotchaFinally_C) == 0x000008, "Wrong alignment on USMEvent_Medal_GotchaFinally_C");
static_assert(sizeof(USMEvent_Medal_GotchaFinally_C) == 0x0015A0, "Wrong size on USMEvent_Medal_GotchaFinally_C");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_GotchaFinally_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_TransitionResultNode_1_D63BBE2D4F83EA3934BB34B0EC4C88AC) == 0x000700, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_TransitionResultNode_1_D63BBE2D4F83EA3934BB34B0EC4C88AC' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_TransitionResultNode_9A1AF0124CF0CC70CD618797062580E3) == 0x0008F8, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_TransitionResultNode_9A1AF0124CF0CC70CD618797062580E3' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_ConduitResultNode_1_4F58F4AE4E47E8BBF3478B8B6B012B0C) == 0x000AF0, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_ConduitResultNode_1_4F58F4AE4E47E8BBF3478B8B6B012B0C' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_ConduitResultNode_901E6EF1423E82ECF46BBCB8E6E5C060) == 0x000CD0, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_ConduitResultNode_901E6EF1423E82ECF46BBCB8E6E5C060' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_StateEntryNode_68139174477FEE222FD63F90D24B697F) == 0x000EB0, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_StateEntryNode_68139174477FEE222FD63F90D24B697F' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_17_25CC03F540D1B2E9458BA4B5BA048804) == 0x001090, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_17_25CC03F540D1B2E9458BA4B5BA048804' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_16_9F38E8624E4FC0DB1D952C8954B830F3) == 0x0010D8, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_16_9F38E8624E4FC0DB1D952C8954B830F3' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_15_FD51D8A643767DC57B1579B3BF22C6CC) == 0x001120, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_15_FD51D8A643767DC57B1579B3BF22C6CC' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_14_1E5991564E56E7396F1121B30176EB5E) == 0x001168, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_14_1E5991564E56E7396F1121B30176EB5E' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_13_0E7B5A06402960F0F2BB7ABAAAC380B3) == 0x0011B0, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_13_0E7B5A06402960F0F2BB7ABAAAC380B3' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_12_AE791CE2414C97E9B7C9D8A48D7DAE62) == 0x0011F8, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_12_AE791CE2414C97E9B7C9D8A48D7DAE62' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_11_9493A78C45812E6343D196A007BFB7D7) == 0x001240, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_11_9493A78C45812E6343D196A007BFB7D7' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_10_4ADB9FDE449E4386013D57B49823AF86) == 0x001288, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_10_4ADB9FDE449E4386013D57B49823AF86' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_9_70C1F58645ACC1CCA119A5813B898E08) == 0x0012D0, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_9_70C1F58645ACC1CCA119A5813B898E08' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_8_E02F2024448AEEC2BC2305973F2522D9) == 0x001318, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_8_E02F2024448AEEC2BC2305973F2522D9' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_7_4CC59F384F7138CBA7C67B8A1569DA18) == 0x001360, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_7_4CC59F384F7138CBA7C67B8A1569DA18' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_6_B90436E3417554616B53B6AC23B45700) == 0x0013A8, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_6_B90436E3417554616B53B6AC23B45700' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_5_B2963501443483DE43BFBF8A35AB64DE) == 0x0013F0, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_5_B2963501443483DE43BFBF8A35AB64DE' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_4_E75DF09E4CA113A88E266EA5D3A458B6) == 0x001438, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_4_E75DF09E4CA113A88E266EA5D3A458B6' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_3_56A7F9634E293DAD90A09BA2C7DC1553) == 0x001480, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_3_56A7F9634E293DAD90A09BA2C7DC1553' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_2_667C651E406B6EA8A7D69ABB4AB3479C) == 0x0014C8, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_2_667C651E406B6EA8A7D69ABB4AB3479C' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_1_7877B2F84C4D03CC8463F895716A10A0) == 0x001510, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_1_7877B2F84C4D03CC8463F895716A10A0' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_GotchaFinally_C, SMGraphK2Node_GraphPropertyNode_ED506E304D332D8C30FDC19F4E3F2D17) == 0x001558, "Member 'USMEvent_Medal_GotchaFinally_C::SMGraphK2Node_GraphPropertyNode_ED506E304D332D8C30FDC19F4E3F2D17' has a wrong offset!");

}

