#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_KillByMissile

#include "Basic.hpp"


namespace SDK::Params
{

// Function SMEvent_KillByMissile.SMEvent_KillByMissile_C.ExecuteUbergraph_SMEvent_KillByMissile
// 0x0098 (0x0098 - 0x0000)
struct SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_DamageCauser*                K2Node_DynamicCast_AsPBConduit_Damage_Causer;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_DamageCauser*                K2Node_DynamicCast_AsPBConduit_Damage_Causer_1;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_DamageCauser*                K2Node_DynamicCast_AsPBConduit_Damage_Causer_2;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0044(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x005C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_DamageCauser*                K2Node_DynamicCast_AsPBConduit_Damage_Causer_3;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_DamageCauser*                K2Node_DynamicCast_AsPBConduit_Damage_Causer_4;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_DamageCauser*                K2Node_DynamicCast_AsPBConduit_Damage_Causer_5;    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile) == 0x000008, "Wrong alignment on SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile");
static_assert(sizeof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile) == 0x000098, "Wrong size on SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, EntryPoint) == 0x000000, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::EntryPoint' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_AsPBConduit_Damage_Causer) == 0x000008, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_AsPBConduit_Damage_Causer' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_AsPBConduit_Damage_Causer_1) == 0x000018, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_AsPBConduit_Damage_Causer_1' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_AsPBConduit_Damage_Causer_2) == 0x000028, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_AsPBConduit_Damage_Causer_2' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_AsPBSMState_Event_End) == 0x000038, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_AsPBSMState_Event_End' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, Temp_name_Variable) == 0x000044, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_AsPBSMState_Event_End_1) == 0x000050, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_AsPBSMState_Event_End_1' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_bSuccess_4) == 0x000058, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, Temp_name_Variable_1) == 0x00005C, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_AsPBConduit_Damage_Causer_3) == 0x000068, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_AsPBConduit_Damage_Causer_3' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_bSuccess_5) == 0x000070, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_AsPBConduit_Damage_Causer_4) == 0x000078, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_AsPBConduit_Damage_Causer_4' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_bSuccess_6) == 0x000080, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_AsPBConduit_Damage_Causer_5) == 0x000088, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_AsPBConduit_Damage_Causer_5' has a wrong offset!");
static_assert(offsetof(SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile, K2Node_DynamicCast_bSuccess_7) == 0x000090, "Member 'SMEvent_KillByMissile_C_ExecuteUbergraph_SMEvent_KillByMissile::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");

}

