#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_AR_HEADSHOT

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_AR_HEADSHOT.SMEvent_Kill_AR_HEADSHOT_C
// 0x0D88 (0x1480 - 0x06F8)
class USMEvent_Kill_AR_HEADSHOT_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_C24CFA3441F95C8F63FDA08DAF5E53BD; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_EB07CDD94572DC8116CC95ADF1753BA2; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_9BB51A8946CB36E33362C1834991B1E0; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_8B29E4774164C559027C6C9E93563F97; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_46D25F9D48285046F3BF37A3042C2D49; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_A83432494416863BB8342981C3B383C6; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_FA7DE81F447B35E8B8DF92BA7A54C7AE; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_4B4670AA43F987FBBB561D945AE47252; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_736FD9E9405888ECF5944EB9DDCDED66; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_F2CCBF8D41E7F0CEBB768791ADB3FC2A; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_C1E678AD4F44247E7F892994EB326D37; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_29ABD7C94004EA610BF6D6A1B5A9669B; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_A3D42D53407E4E021BEA119303BE2EE6; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_3592637C40DAAE49B1229E9F498DADA6; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_F31ECF9E4F9DFD340B2AE4AEFE1D9FA3; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_90419D284EE26A12AD457DA2A1DF3559; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_BB30B7584B43AAF8E2ECA0A53F269600; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_DDF41A6C4EDE89BE7DD629875551D35B; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_39BD3C8C4BD08E8439C2C58D5423C1F6; // 0x1438(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_AR_HEADSHOT(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_74B514D6464C61D5FF55B3B0BD0D3699();
	void SMGraphK2Node_GraphPropertyNode_13_3DA64C0AB489BBF8EAE713CAEED73534_500B38654217E748B767CFAD872E2A31();
	void SMGraphK2Node_GraphPropertyNode_12_518353AF11A99FDFEEDB66B6418EA001_C766CBBD4C7BBF1B130297B46400AC20();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_E3CB1EE74888A20D7E7D42BD929139D4();
	void SMGraphK2Node_GraphPropertyNode_11_3826ADFE8B326640698CC908CCA3F28F_3FA7A394498661E9A86EBAB256904292();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_4CC5FA754BAEDB51CBB912965D990B0D();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_02A48A3D4325F0F522A50291E3B2F6D5();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_4C0CA46A4A827F51FD5A01B8FC4D6EE3();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_E90003A94090603C28A3B6973709B845();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_86F58651457DB265B924619175347A3C();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_EBE8349F49E7A28D7A49D8A310EF9D98();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_6F6CCF6948268F13E69F76842A7E172F();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_B87E5B5349230982C3267897A1D6186B();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_E12F717345C5DBF7AC1011947BC83FBC();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_FC8ECF8D4E5093B3FDA0AFB3BBAF368E();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_AR_HEADSHOT_C">();
	}
	static class USMEvent_Kill_AR_HEADSHOT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_AR_HEADSHOT_C>();
	}
};
static_assert(alignof(USMEvent_Kill_AR_HEADSHOT_C) == 0x000008, "Wrong alignment on USMEvent_Kill_AR_HEADSHOT_C");
static_assert(sizeof(USMEvent_Kill_AR_HEADSHOT_C) == 0x001480, "Wrong size on USMEvent_Kill_AR_HEADSHOT_C");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_AR_HEADSHOT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_TransitionResultNode_1_C24CFA3441F95C8F63FDA08DAF5E53BD) == 0x000700, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_TransitionResultNode_1_C24CFA3441F95C8F63FDA08DAF5E53BD' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_TransitionResultNode_EB07CDD94572DC8116CC95ADF1753BA2) == 0x0008F8, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_TransitionResultNode_EB07CDD94572DC8116CC95ADF1753BA2' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_ConduitResultNode_1_9BB51A8946CB36E33362C1834991B1E0) == 0x000AF0, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_ConduitResultNode_1_9BB51A8946CB36E33362C1834991B1E0' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_StateEntryNode_8B29E4774164C559027C6C9E93563F97) == 0x000CD0, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_StateEntryNode_8B29E4774164C559027C6C9E93563F97' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_ConduitResultNode_46D25F9D48285046F3BF37A3042C2D49) == 0x000EB0, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_ConduitResultNode_46D25F9D48285046F3BF37A3042C2D49' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_13_A83432494416863BB8342981C3B383C6) == 0x001090, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_13_A83432494416863BB8342981C3B383C6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_12_FA7DE81F447B35E8B8DF92BA7A54C7AE) == 0x0010D8, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_12_FA7DE81F447B35E8B8DF92BA7A54C7AE' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_11_4B4670AA43F987FBBB561D945AE47252) == 0x001120, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_11_4B4670AA43F987FBBB561D945AE47252' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_10_736FD9E9405888ECF5944EB9DDCDED66) == 0x001168, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_10_736FD9E9405888ECF5944EB9DDCDED66' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_9_F2CCBF8D41E7F0CEBB768791ADB3FC2A) == 0x0011B0, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_9_F2CCBF8D41E7F0CEBB768791ADB3FC2A' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_8_C1E678AD4F44247E7F892994EB326D37) == 0x0011F8, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_8_C1E678AD4F44247E7F892994EB326D37' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_7_29ABD7C94004EA610BF6D6A1B5A9669B) == 0x001240, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_7_29ABD7C94004EA610BF6D6A1B5A9669B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_6_A3D42D53407E4E021BEA119303BE2EE6) == 0x001288, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_6_A3D42D53407E4E021BEA119303BE2EE6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_5_3592637C40DAAE49B1229E9F498DADA6) == 0x0012D0, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_5_3592637C40DAAE49B1229E9F498DADA6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_4_F31ECF9E4F9DFD340B2AE4AEFE1D9FA3) == 0x001318, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_4_F31ECF9E4F9DFD340B2AE4AEFE1D9FA3' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_3_90419D284EE26A12AD457DA2A1DF3559) == 0x001360, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_3_90419D284EE26A12AD457DA2A1DF3559' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_2_BB30B7584B43AAF8E2ECA0A53F269600) == 0x0013A8, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_2_BB30B7584B43AAF8E2ECA0A53F269600' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_1_DDF41A6C4EDE89BE7DD629875551D35B) == 0x0013F0, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_1_DDF41A6C4EDE89BE7DD629875551D35B' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_AR_HEADSHOT_C, SMGraphK2Node_GraphPropertyNode_39BD3C8C4BD08E8439C2C58D5423C1F6) == 0x001438, "Member 'USMEvent_Kill_AR_HEADSHOT_C::SMGraphK2Node_GraphPropertyNode_39BD3C8C4BD08E8439C2C58D5423C1F6' has a wrong offset!");

}

