#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_VisionMark

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_VisionMark.SMEvent_VisionMark_C
// 0x0278 (0x0920 - 0x06A8)
class USMEvent_VisionMark_C final : public UPBEvent_VisionMark
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_63AF3D3D47D4D40E71430FAF834D8743; // 0x06B0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_1E64F94149AC9065AB769EA416B6691C; // 0x0890(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_76358C3B401F2BE9562D17BAEB4BBD5B; // 0x08D8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_VisionMark(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_7CA8CD97490B96BC6B8A7B9A7B700A2E();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_FC8B3A1F45A68CA80F7095B8F0B3E3FD();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_6501F19C483605DAACAE5F8E20F444F0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_VisionMark_C">();
	}
	static class USMEvent_VisionMark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_VisionMark_C>();
	}
};
static_assert(alignof(USMEvent_VisionMark_C) == 0x000008, "Wrong alignment on USMEvent_VisionMark_C");
static_assert(sizeof(USMEvent_VisionMark_C) == 0x000920, "Wrong size on USMEvent_VisionMark_C");
static_assert(offsetof(USMEvent_VisionMark_C, UberGraphFrame) == 0x0006A8, "Member 'USMEvent_VisionMark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_VisionMark_C, SMGraphK2Node_StateEntryNode_63AF3D3D47D4D40E71430FAF834D8743) == 0x0006B0, "Member 'USMEvent_VisionMark_C::SMGraphK2Node_StateEntryNode_63AF3D3D47D4D40E71430FAF834D8743' has a wrong offset!");
static_assert(offsetof(USMEvent_VisionMark_C, SMGraphK2Node_GraphPropertyNode_1_1E64F94149AC9065AB769EA416B6691C) == 0x000890, "Member 'USMEvent_VisionMark_C::SMGraphK2Node_GraphPropertyNode_1_1E64F94149AC9065AB769EA416B6691C' has a wrong offset!");
static_assert(offsetof(USMEvent_VisionMark_C, SMGraphK2Node_GraphPropertyNode_76358C3B401F2BE9562D17BAEB4BBD5B) == 0x0008D8, "Member 'USMEvent_VisionMark_C::SMGraphK2Node_GraphPropertyNode_76358C3B401F2BE9562D17BAEB4BBD5B' has a wrong offset!");

}

