#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_HeadShot

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_HeadShot.SMEvent_Medal_HeadShot_C
// 0x0CB0 (0x13A8 - 0x06F8)
class USMEvent_Medal_HeadShot_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_7D305BA64B14F20B353068A2ECA80D7F; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_5E9C6C66435BEB9B2B741297018FB022; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_CE33CFF4435F28EAA26B6C9BB315836D; // 0x0AF0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1B4D91604D4411D8F218D49903C156E8; // 0x0CD0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_9FBDEE68451506394EA3DEB9FBD01D3B; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_4A4E7567405C5D1CDB39EDB2E9664A0D; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_AB5BB7234A4D238E7952B699842DD928; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_3EE24CCE4AD0D591687CF08F64BA0FF6; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_D1231846415A91B89A8873AADC60F003; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_6DC8A2654FDF21415E899F9FF520B8CD; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_F6D3AD254CA46E7A71FBEB9299B4DBD4; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_81EA617D485E20540739AC8772C47423; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_D6AF362249995D2CC258DDB244100B1F; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_C9CC44C2466E7558182158A734D991BC; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_F612DDBE4F31DBE564EB88A0ECDB57EA; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3019A1B842CB05603CA15F91762741F9; // 0x1360(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_HeadShot(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_81FA555A402512A946E60DBF5E40C6F9();
	void SMGraphK2Node_GraphPropertyNode_10_518353AF11A99FDFEEDB66B6418EA001_EB78110746091CA163F7B699DBCF4267();
	void SMGraphK2Node_GraphPropertyNode_9_3DA64C0AB489BBF8EAE713CAEED73534_16520F614249AD3158FF7CA52EA58DF2();
	void SMGraphK2Node_GraphPropertyNode_8_3826ADFE8B326640698CC908CCA3F28F_309E77E6499909FD8882F38FEE297441();
	void SMGraphK2Node_GraphPropertyNode_7_1D5AE3AF69E079B559EF8AF2950B22F1_28A0446540FFDBE39A3D91A84A951FE8();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_F9E5116146CB9F639550FA8708281966();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_EDB8B6A94AE015317357C8AADEEAA399();
	void SMGraphK2Node_GraphPropertyNode_6_DFCF228DCE31F7B7DE4D5893884342DB_0A6D77854724B15593DCB6AC7C270A34();
	void SMGraphK2Node_GraphPropertyNode_2_518353AF11A99FDFEEDB66B6418EA001_7199E68B46471C40621D9FAE0CAF45C6();
	void SMGraphK2Node_GraphPropertyNode_3_3DA64C0AB489BBF8EAE713CAEED73534_451445164A2A25C7D83EACAB310960AD();
	void SMGraphK2Node_GraphPropertyNode_5_DFC5DDF9620519B0185FE1F473B6BA24_2156372544E6C10B4255E69ED483211F();
	void SMGraphK2Node_GraphPropertyNode_4_F5981CACB7D9769440965527229065DD_F6016CC24F4D05B81383358AC5F11BA2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_HeadShot_C">();
	}
	static class USMEvent_Medal_HeadShot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_HeadShot_C>();
	}
};
static_assert(alignof(USMEvent_Medal_HeadShot_C) == 0x000008, "Wrong alignment on USMEvent_Medal_HeadShot_C");
static_assert(sizeof(USMEvent_Medal_HeadShot_C) == 0x0013A8, "Wrong size on USMEvent_Medal_HeadShot_C");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_HeadShot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_TransitionResultNode_1_7D305BA64B14F20B353068A2ECA80D7F) == 0x000700, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_TransitionResultNode_1_7D305BA64B14F20B353068A2ECA80D7F' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_TransitionResultNode_5E9C6C66435BEB9B2B741297018FB022) == 0x0008F8, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_TransitionResultNode_5E9C6C66435BEB9B2B741297018FB022' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_ConduitResultNode_1_CE33CFF4435F28EAA26B6C9BB315836D) == 0x000AF0, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_ConduitResultNode_1_CE33CFF4435F28EAA26B6C9BB315836D' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_ConduitResultNode_1B4D91604D4411D8F218D49903C156E8) == 0x000CD0, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_ConduitResultNode_1B4D91604D4411D8F218D49903C156E8' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_StateEntryNode_9FBDEE68451506394EA3DEB9FBD01D3B) == 0x000EB0, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_StateEntryNode_9FBDEE68451506394EA3DEB9FBD01D3B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_10_4A4E7567405C5D1CDB39EDB2E9664A0D) == 0x001090, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_10_4A4E7567405C5D1CDB39EDB2E9664A0D' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_9_AB5BB7234A4D238E7952B699842DD928) == 0x0010D8, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_9_AB5BB7234A4D238E7952B699842DD928' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_8_3EE24CCE4AD0D591687CF08F64BA0FF6) == 0x001120, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_8_3EE24CCE4AD0D591687CF08F64BA0FF6' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_7_D1231846415A91B89A8873AADC60F003) == 0x001168, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_7_D1231846415A91B89A8873AADC60F003' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_6_6DC8A2654FDF21415E899F9FF520B8CD) == 0x0011B0, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_6_6DC8A2654FDF21415E899F9FF520B8CD' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_5_F6D3AD254CA46E7A71FBEB9299B4DBD4) == 0x0011F8, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_5_F6D3AD254CA46E7A71FBEB9299B4DBD4' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_4_81EA617D485E20540739AC8772C47423) == 0x001240, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_4_81EA617D485E20540739AC8772C47423' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_3_D6AF362249995D2CC258DDB244100B1F) == 0x001288, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_3_D6AF362249995D2CC258DDB244100B1F' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_2_C9CC44C2466E7558182158A734D991BC) == 0x0012D0, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_2_C9CC44C2466E7558182158A734D991BC' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_1_F612DDBE4F31DBE564EB88A0ECDB57EA) == 0x001318, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_1_F612DDBE4F31DBE564EB88A0ECDB57EA' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_HeadShot_C, SMGraphK2Node_GraphPropertyNode_3019A1B842CB05603CA15F91762741F9) == 0x001360, "Member 'USMEvent_Medal_HeadShot_C::SMGraphK2Node_GraphPropertyNode_3019A1B842CB05603CA15F91762741F9' has a wrong offset!");

}

