#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_ComeBack

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_ComeBack.SMEvent_Medal_ComeBack_C
// 0x07B8 (0x0EB0 - 0x06F8)
class USMEvent_Medal_ComeBack_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_55A2650B40B8BCBA59DBE0AC6334BA32; // 0x0700(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_296EE42047F5F969C8FAB09D2128E86B; // 0x08F8(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_995277D54BD79401F4C5ECA71445E7FE; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_18C122C14E9E0F48542925B97579A39B; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_7D0B78084045DF9548AD468825155856; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_1F1B1DDA4C950720019066A18D4A8EF8; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_A87909E44EA2B4D7B43F67850B8D42C7; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_7B8F88954540138AAA70E59F881CDA43; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_70CFAEFE469BAB45D743A4B214D3E371; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_63DF0AA74F3035102BBF538F2FA9C560; // 0x0E68(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_ComeBack(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_E21DBF504DA3885FD1C87FB4F9A74EBB();
	void SMGraphK2Node_GraphPropertyNode_6_4065F438748B818B40B2AA2D3A375FDA_0ED016C54AA86C8CEB000385AB0E139D();
	void SMGraphK2Node_GraphPropertyNode_5_E9AC7F8F09A650190EB1FDFFD01738CD_B0F2AC93443124A57CE53AB861575192();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_227A863845F96C7A988A5C844A5388D6();
	void SMGraphK2Node_GraphPropertyNode_4_96465899278CCB6CF46F6372904286C2_4191A6D14D5E446FA2BE4286680AC9C3();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_5225AFA6440EAF4FB3CB18BFB21DC24E();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_4F9FC7A742305DA41A4D8B87D2D57D2E();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_A3B1183043AEADB5F157C381F9706A22();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_ComeBack_C">();
	}
	static class USMEvent_Medal_ComeBack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_ComeBack_C>();
	}
};
static_assert(alignof(USMEvent_Medal_ComeBack_C) == 0x000008, "Wrong alignment on USMEvent_Medal_ComeBack_C");
static_assert(sizeof(USMEvent_Medal_ComeBack_C) == 0x000EB0, "Wrong size on USMEvent_Medal_ComeBack_C");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Medal_ComeBack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_TransitionResultNode_55A2650B40B8BCBA59DBE0AC6334BA32) == 0x000700, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_TransitionResultNode_55A2650B40B8BCBA59DBE0AC6334BA32' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_ConduitResultNode_296EE42047F5F969C8FAB09D2128E86B) == 0x0008F8, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_ConduitResultNode_296EE42047F5F969C8FAB09D2128E86B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_StateEntryNode_995277D54BD79401F4C5ECA71445E7FE) == 0x000AD8, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_StateEntryNode_995277D54BD79401F4C5ECA71445E7FE' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_GraphPropertyNode_6_18C122C14E9E0F48542925B97579A39B) == 0x000CB8, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_GraphPropertyNode_6_18C122C14E9E0F48542925B97579A39B' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_GraphPropertyNode_5_7D0B78084045DF9548AD468825155856) == 0x000D00, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_GraphPropertyNode_5_7D0B78084045DF9548AD468825155856' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_GraphPropertyNode_4_1F1B1DDA4C950720019066A18D4A8EF8) == 0x000D48, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_GraphPropertyNode_4_1F1B1DDA4C950720019066A18D4A8EF8' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_GraphPropertyNode_3_A87909E44EA2B4D7B43F67850B8D42C7) == 0x000D90, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_GraphPropertyNode_3_A87909E44EA2B4D7B43F67850B8D42C7' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_GraphPropertyNode_2_7B8F88954540138AAA70E59F881CDA43) == 0x000DD8, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_GraphPropertyNode_2_7B8F88954540138AAA70E59F881CDA43' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_GraphPropertyNode_1_70CFAEFE469BAB45D743A4B214D3E371) == 0x000E20, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_GraphPropertyNode_1_70CFAEFE469BAB45D743A4B214D3E371' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_ComeBack_C, SMGraphK2Node_GraphPropertyNode_63DF0AA74F3035102BBF538F2FA9C560) == 0x000E68, "Member 'USMEvent_Medal_ComeBack_C::SMGraphK2Node_GraphPropertyNode_63DF0AA74F3035102BBF538F2FA9C560' has a wrong offset!");

}

