#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Damage_AKM750

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Damage_AKM750.SMEvent_Damage_AKM750_C
// 0x0E60 (0x1558 - 0x06F8)
class USMEvent_Damage_AKM750_C final : public UPBEvent_Hit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_659962374AFD2F2F8BE4B7ADFCFA48DA; // 0x0700(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_5373DA1648379CB9D2D9EC8291796825; // 0x08F8(0x01F8)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_99A2E5D34D9E656F7D306BBCB9610355; // 0x0AF0(0x01E0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_E256FE144EB4AF72A45155B1B447763C; // 0x0CD0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_44A582224BDAD76EBC267A97BCB6AB56; // 0x0EB0(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_16_FA346C6A415516A10C25C7B55D787E90; // 0x1090(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_15_431D706743DCE2E78B5656B844306D02; // 0x10D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_559436EC46C4718E988C309BB166AFBB; // 0x1120(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_59D31607402E81E4BE8A44895EB4E223; // 0x1168(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_A8FF9D7E4AB1E3DA6793159BD80C1D2D; // 0x11B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_EFAD65004E2B18576E2445A3D9D9DC90; // 0x11F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_A6DF17264021B6CF46FE8EA4DD68A1DD; // 0x1240(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_52AB6A354F00A980D88A0190EC1543B0; // 0x1288(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_FBB86A174F642A9FB1FEE1832B957014; // 0x12D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_E1CF7DA746169D23DCEB41905B51B1D1; // 0x1318(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_EA134E10440534579B1651B7FD429578; // 0x1360(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_AFFAD3A449F0B6A413902E9639D2319F; // 0x13A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_257BF2564884A49B278BCD80B0DD6A0B; // 0x13F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_6FCE5FEA4729A19CF5DF4181434B4530; // 0x1438(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_72D72F0048805FAFF041D280907FCAEB; // 0x1480(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_EC83DC8B470A526E8965BE99D446BB01; // 0x14C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2B8B742E429C4A0D44EC3FB9F706D99A; // 0x1510(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Damage_AKM750(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_5E26519D46C579643BDF4D99C09778FB();
	void SMGraphK2Node_GraphPropertyNode_16_3DA64C0AB489BBF8EAE713CAEED73534_50CFDB72471A56473E01638E9DF7750C();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_73685255406808E6FF8D07984FDA580F();
	void SMGraphK2Node_GraphPropertyNode_15_518353AF11A99FDFEEDB66B6418EA001_9B49F4F9447ACAC3223C0FAD7309ADA1();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_4A50D7B44D77FC069393FB8AAFC4D48B();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_EC4A75FD4CA740537FC05E9106312B70();
	void SMGraphK2Node_GraphPropertyNode_14_AC0B850875368C03D3659202C66244CC_F1FEB8644C3A420E69C862A88C4F8D9B();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_42544BF64F3D1689F969199C9725627D();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_9951FB2D41AC427AD6A03FB382B7E1F9();
	void SMGraphK2Node_GraphPropertyNode_13_033BB48819393947FEB084A7CF4C0D58_B9D862784E6E0C00F493C694B0C62A37();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_B4525CEC4A978BF910C31C94C78A4EA7();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_B404276540A258C8BB71639929C81DEF();
	void SMGraphK2Node_GraphPropertyNode_12_7B1241F1B3164E6D5F4F996B354D6D3B_5B24023B4D3CE4BFDF916883FD88822A();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_A99BF4984B5B18818423C9B39BE3B6A0();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_A63591CF4260FF78CC45A5A82AA70393();
	void SMGraphK2Node_GraphPropertyNode_11_6424367FC4B9B3C2EA7FFCDB60D88894_2D0F8A854933AD8A5A26489E49940775();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_60051DD64D463D9448BD389EE2AC45AB();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_E65827C24790924DF16C9CB3CB0426DA();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Damage_AKM750_C">();
	}
	static class USMEvent_Damage_AKM750_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Damage_AKM750_C>();
	}
};
static_assert(alignof(USMEvent_Damage_AKM750_C) == 0x000008, "Wrong alignment on USMEvent_Damage_AKM750_C");
static_assert(sizeof(USMEvent_Damage_AKM750_C) == 0x001558, "Wrong size on USMEvent_Damage_AKM750_C");
static_assert(offsetof(USMEvent_Damage_AKM750_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Damage_AKM750_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_TransitionResultNode_1_659962374AFD2F2F8BE4B7ADFCFA48DA) == 0x000700, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_TransitionResultNode_1_659962374AFD2F2F8BE4B7ADFCFA48DA' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_TransitionResultNode_5373DA1648379CB9D2D9EC8291796825) == 0x0008F8, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_TransitionResultNode_5373DA1648379CB9D2D9EC8291796825' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_ConduitResultNode_1_99A2E5D34D9E656F7D306BBCB9610355) == 0x000AF0, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_ConduitResultNode_1_99A2E5D34D9E656F7D306BBCB9610355' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_StateEntryNode_E256FE144EB4AF72A45155B1B447763C) == 0x000CD0, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_StateEntryNode_E256FE144EB4AF72A45155B1B447763C' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_ConduitResultNode_44A582224BDAD76EBC267A97BCB6AB56) == 0x000EB0, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_ConduitResultNode_44A582224BDAD76EBC267A97BCB6AB56' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_16_FA346C6A415516A10C25C7B55D787E90) == 0x001090, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_16_FA346C6A415516A10C25C7B55D787E90' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_15_431D706743DCE2E78B5656B844306D02) == 0x0010D8, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_15_431D706743DCE2E78B5656B844306D02' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_14_559436EC46C4718E988C309BB166AFBB) == 0x001120, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_14_559436EC46C4718E988C309BB166AFBB' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_13_59D31607402E81E4BE8A44895EB4E223) == 0x001168, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_13_59D31607402E81E4BE8A44895EB4E223' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_12_A8FF9D7E4AB1E3DA6793159BD80C1D2D) == 0x0011B0, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_12_A8FF9D7E4AB1E3DA6793159BD80C1D2D' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_11_EFAD65004E2B18576E2445A3D9D9DC90) == 0x0011F8, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_11_EFAD65004E2B18576E2445A3D9D9DC90' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_10_A6DF17264021B6CF46FE8EA4DD68A1DD) == 0x001240, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_10_A6DF17264021B6CF46FE8EA4DD68A1DD' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_9_52AB6A354F00A980D88A0190EC1543B0) == 0x001288, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_9_52AB6A354F00A980D88A0190EC1543B0' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_8_FBB86A174F642A9FB1FEE1832B957014) == 0x0012D0, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_8_FBB86A174F642A9FB1FEE1832B957014' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_7_E1CF7DA746169D23DCEB41905B51B1D1) == 0x001318, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_7_E1CF7DA746169D23DCEB41905B51B1D1' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_6_EA134E10440534579B1651B7FD429578) == 0x001360, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_6_EA134E10440534579B1651B7FD429578' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_5_AFFAD3A449F0B6A413902E9639D2319F) == 0x0013A8, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_5_AFFAD3A449F0B6A413902E9639D2319F' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_4_257BF2564884A49B278BCD80B0DD6A0B) == 0x0013F0, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_4_257BF2564884A49B278BCD80B0DD6A0B' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_3_6FCE5FEA4729A19CF5DF4181434B4530) == 0x001438, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_3_6FCE5FEA4729A19CF5DF4181434B4530' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_2_72D72F0048805FAFF041D280907FCAEB) == 0x001480, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_2_72D72F0048805FAFF041D280907FCAEB' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_1_EC83DC8B470A526E8965BE99D446BB01) == 0x0014C8, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_1_EC83DC8B470A526E8965BE99D446BB01' has a wrong offset!");
static_assert(offsetof(USMEvent_Damage_AKM750_C, SMGraphK2Node_GraphPropertyNode_2B8B742E429C4A0D44EC3FB9F706D99A) == 0x001510, "Member 'USMEvent_Damage_AKM750_C::SMGraphK2Node_GraphPropertyNode_2B8B742E429C4A0D44EC3FB9F706D99A' has a wrong offset!");

}

