#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_HE

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_HE.SMEvent_Kill_HE_C
// 0x0728 (0x0E20 - 0x06F8)
class USMEvent_Kill_HE_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_006D9C434BFBE7477D4649A5ECC9908D; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_F40A53074AA93564AB975689226D63C3; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_73C74672462B9313E689CF8C69B1FDD6; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_B55EEF7B4F0AB155B0E2BEA424FF0BCB; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_0AAC672241D3DA1946A9D092D5FB8D29; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_73CCFB45422FC3297A823F8EBD960B40; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_1D0C0C154408C1F19AABCDBBC15037B1; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_31860DFC4D5801497164C7A41737EC3F; // 0x0DD8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_HE(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_9B94B14C45CCCE955F7F0097C6DBDE3D();
	void SMGraphK2Node_GraphPropertyNode_4_8FBC1AC9AE62937ED288E1B431A37B3D_B67609E949544879912C6B95C9EF37BC();
	void SMGraphK2Node_GraphPropertyNode_3_40A291E7A5009A35B29F31036F3FD958_DA4F1E6545672D5F7BCE27B4FC732AA1();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_121EDF724A01D1765788A0AE127373B4();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_4038CC764373D3EA36C69990791804E3();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_B46E54CF4228A0780211EDAC3A425CA4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_HE_C">();
	}
	static class USMEvent_Kill_HE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_HE_C>();
	}
};
static_assert(alignof(USMEvent_Kill_HE_C) == 0x000008, "Wrong alignment on USMEvent_Kill_HE_C");
static_assert(sizeof(USMEvent_Kill_HE_C) == 0x000E20, "Wrong size on USMEvent_Kill_HE_C");
static_assert(offsetof(USMEvent_Kill_HE_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_HE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_HE_C, SMGraphK2Node_TransitionResultNode_006D9C434BFBE7477D4649A5ECC9908D) == 0x000700, "Member 'USMEvent_Kill_HE_C::SMGraphK2Node_TransitionResultNode_006D9C434BFBE7477D4649A5ECC9908D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_HE_C, SMGraphK2Node_StateEntryNode_F40A53074AA93564AB975689226D63C3) == 0x0008F8, "Member 'USMEvent_Kill_HE_C::SMGraphK2Node_StateEntryNode_F40A53074AA93564AB975689226D63C3' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_HE_C, SMGraphK2Node_ConduitResultNode_73C74672462B9313E689CF8C69B1FDD6) == 0x000AD8, "Member 'USMEvent_Kill_HE_C::SMGraphK2Node_ConduitResultNode_73C74672462B9313E689CF8C69B1FDD6' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_HE_C, SMGraphK2Node_GraphPropertyNode_4_B55EEF7B4F0AB155B0E2BEA424FF0BCB) == 0x000CB8, "Member 'USMEvent_Kill_HE_C::SMGraphK2Node_GraphPropertyNode_4_B55EEF7B4F0AB155B0E2BEA424FF0BCB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_HE_C, SMGraphK2Node_GraphPropertyNode_3_0AAC672241D3DA1946A9D092D5FB8D29) == 0x000D00, "Member 'USMEvent_Kill_HE_C::SMGraphK2Node_GraphPropertyNode_3_0AAC672241D3DA1946A9D092D5FB8D29' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_HE_C, SMGraphK2Node_GraphPropertyNode_2_73CCFB45422FC3297A823F8EBD960B40) == 0x000D48, "Member 'USMEvent_Kill_HE_C::SMGraphK2Node_GraphPropertyNode_2_73CCFB45422FC3297A823F8EBD960B40' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_HE_C, SMGraphK2Node_GraphPropertyNode_1_1D0C0C154408C1F19AABCDBBC15037B1) == 0x000D90, "Member 'USMEvent_Kill_HE_C::SMGraphK2Node_GraphPropertyNode_1_1D0C0C154408C1F19AABCDBBC15037B1' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_HE_C, SMGraphK2Node_GraphPropertyNode_31860DFC4D5801497164C7A41737EC3F) == 0x000DD8, "Member 'USMEvent_Kill_HE_C::SMGraphK2Node_GraphPropertyNode_31860DFC4D5801497164C7A41737EC3F' has a wrong offset!");

}

