#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Kill_SMG

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Kill_SMG.SMEvent_Kill_SMG_C
// 0x08D8 (0x0FD0 - 0x06F8)
class USMEvent_Kill_SMG_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_117A7EE848095AD0CAD746B8C1145654; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_67E2BEE148E46B82D3DCE3BC0F1B5216; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_513F0B57415A10738423C9A359FC1103; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_5AA9610845DC96CA17F118AB26A54A73; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_1C8BD8F34B0F1929E5E056B31D98E138; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_747CFF3741870100C458B597452995D0; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_09E266B449C0C9A081A1BDA23F9215AB; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_6168DCE5422C65B7DC56B69C83BD7B66; // 0x0DD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_499B83F245C33504A7BFDDB9A1715615; // 0x0E20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_C926E7894A3A3E8DE32C39A536BF9B6E; // 0x0E68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_2A77448C4185580C7821078457E92C30; // 0x0EB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_3D0EE9EE4F4152338A4366AC0422EA7D; // 0x0EF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_D78AAD4B4918B62EAAD805A58EA38361; // 0x0F40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6ED75C9840625443AB9689923C85C759; // 0x0F88(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Kill_SMG(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_4B88515443F5ED1050DFF99747C87BFC_BEF7291F40EE888C860802BF89F92D4F();
	void SMGraphK2Node_GraphPropertyNode_0_518353AF11A99FDFEEDB66B6418EA001_3502A6C14419817DFC60809E91F85CB7();
	void SMGraphK2Node_GraphPropertyNode_10_8FBC1AC9AE62937ED288E1B431A37B3D_B69787C84D905AD1B39D2B9AE56052D3();
	void SMGraphK2Node_GraphPropertyNode_1_3DA64C0AB489BBF8EAE713CAEED73534_7848DC4C43A908744B994A86AC692F83();
	void SMGraphK2Node_GraphPropertyNode_2_B8B4B8C16514646E1F625E7548EBB0C6_400D9DE74634BC36ED60F98655BE471C();
	void SMGraphK2Node_GraphPropertyNode_9_40A291E7A5009A35B29F31036F3FD958_B1AA66864EAF45FC8EE37EA96EAA5B5E();
	void SMGraphK2Node_GraphPropertyNode_3_B9A9B69140BC7138FA5F9E081E69DE7F_E53F7E634827CE109DF4B094B52F9EFF();
	void SMGraphK2Node_GraphPropertyNode_4_E255BCB15F59A079A40B1BE41B35A10A_B8793D174E0C0DE000296E95135163FC();
	void SMGraphK2Node_GraphPropertyNode_5_1DE93A68710D4D71835ED2DD778753A5_9594FDDA4A8AFB982B279F95F4D0FC11();
	void SMGraphK2Node_GraphPropertyNode_8_BD2D0F21178DD978090FF19236099312_B46D3DB547C75B6B98B285B0FFD7AE9F();
	void SMGraphK2Node_GraphPropertyNode_6_2BCB83590D8789B29FAB18D81D9CA39F_FD24BE1142CE97A2A2A99886DD0657AE();
	void SMGraphK2Node_GraphPropertyNode_7_2B1FD6E8A8858F373F6506FD6D91047D_9B7A6CF54D7746AA95A915A28F7BD433();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Kill_SMG_C">();
	}
	static class USMEvent_Kill_SMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Kill_SMG_C>();
	}
};
static_assert(alignof(USMEvent_Kill_SMG_C) == 0x000008, "Wrong alignment on USMEvent_Kill_SMG_C");
static_assert(sizeof(USMEvent_Kill_SMG_C) == 0x000FD0, "Wrong size on USMEvent_Kill_SMG_C");
static_assert(offsetof(USMEvent_Kill_SMG_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_Kill_SMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_TransitionResultNode_117A7EE848095AD0CAD746B8C1145654) == 0x000700, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_TransitionResultNode_117A7EE848095AD0CAD746B8C1145654' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_StateEntryNode_67E2BEE148E46B82D3DCE3BC0F1B5216) == 0x0008F8, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_StateEntryNode_67E2BEE148E46B82D3DCE3BC0F1B5216' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_ConduitResultNode_513F0B57415A10738423C9A359FC1103) == 0x000AD8, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_ConduitResultNode_513F0B57415A10738423C9A359FC1103' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_10_5AA9610845DC96CA17F118AB26A54A73) == 0x000CB8, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_10_5AA9610845DC96CA17F118AB26A54A73' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_9_1C8BD8F34B0F1929E5E056B31D98E138) == 0x000D00, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_9_1C8BD8F34B0F1929E5E056B31D98E138' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_8_747CFF3741870100C458B597452995D0) == 0x000D48, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_8_747CFF3741870100C458B597452995D0' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_7_09E266B449C0C9A081A1BDA23F9215AB) == 0x000D90, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_7_09E266B449C0C9A081A1BDA23F9215AB' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_6_6168DCE5422C65B7DC56B69C83BD7B66) == 0x000DD8, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_6_6168DCE5422C65B7DC56B69C83BD7B66' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_5_499B83F245C33504A7BFDDB9A1715615) == 0x000E20, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_5_499B83F245C33504A7BFDDB9A1715615' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_4_C926E7894A3A3E8DE32C39A536BF9B6E) == 0x000E68, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_4_C926E7894A3A3E8DE32C39A536BF9B6E' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_3_2A77448C4185580C7821078457E92C30) == 0x000EB0, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_3_2A77448C4185580C7821078457E92C30' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_2_3D0EE9EE4F4152338A4366AC0422EA7D) == 0x000EF8, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_2_3D0EE9EE4F4152338A4366AC0422EA7D' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_1_D78AAD4B4918B62EAAD805A58EA38361) == 0x000F40, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_1_D78AAD4B4918B62EAAD805A58EA38361' has a wrong offset!");
static_assert(offsetof(USMEvent_Kill_SMG_C, SMGraphK2Node_GraphPropertyNode_6ED75C9840625443AB9689923C85C759) == 0x000F88, "Member 'USMEvent_Kill_SMG_C::SMGraphK2Node_GraphPropertyNode_6ED75C9840625443AB9689923C85C759' has a wrong offset!");

}

