#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Damage_CDP350

#include "Basic.hpp"


namespace SDK::Params
{

// Function SMEvent_Damage_CDP350.SMEvent_Damage_CDP350_C.ExecuteUbergraph_SMEvent_Damage_CDP350
// 0x0150 (0x0150 - 0x0000)
struct SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSMState_EventEnd*                    K2Node_DynamicCast_AsPBSMState_Event_End_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_CumulativeDamage*            K2Node_DynamicCast_AsPBConduit_Cumulative_Damage;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x004C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0054(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_CumulativeDamage*            K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x006C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_CumulativeDamage*            K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_2; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_CumulativeDamage*            K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_3; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x00A4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_CumulativeDamage*            K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_4; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_5;                              // 0x00BC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x00C4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_CumulativeDamage*            K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_5; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_2;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_3;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_4;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_5;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_6;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_7;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBConduit_Weapon*                      K2Node_DynamicCast_AsPBConduit_Weapon_8;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350) == 0x000008, "Wrong alignment on SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350");
static_assert(sizeof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350) == 0x000150, "Wrong size on SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, EntryPoint) == 0x000000, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::EntryPoint' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Weapon) == 0x000008, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Weapon' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBSMState_Event_End) == 0x000018, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBSMState_Event_End' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBSMState_Event_End_1) == 0x000028, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBSMState_Event_End_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, Temp_name_Variable) == 0x000034, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Cumulative_Damage) == 0x000040, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Cumulative_Damage' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_3) == 0x000048, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, Temp_name_Variable_1) == 0x00004C, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, Temp_name_Variable_2) == 0x000054, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_1) == 0x000060, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_4) == 0x000068, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, Temp_name_Variable_3) == 0x00006C, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_2) == 0x000078, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_5) == 0x000080, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_3) == 0x000088, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_6) == 0x000090, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Weapon_1) == 0x000098, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Weapon_1' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_7) == 0x0000A0, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, Temp_name_Variable_4) == 0x0000A4, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_4) == 0x0000B0, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_8) == 0x0000B8, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, Temp_name_Variable_5) == 0x0000BC, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, Temp_name_Variable_6) == 0x0000C4, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_5) == 0x0000D0, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Cumulative_Damage_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_9) == 0x0000D8, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Weapon_2) == 0x0000E0, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Weapon_2' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_10) == 0x0000E8, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Weapon_3) == 0x0000F0, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Weapon_3' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_11) == 0x0000F8, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Weapon_4) == 0x000100, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Weapon_4' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_12) == 0x000108, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Weapon_5) == 0x000110, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Weapon_5' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_13) == 0x000118, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Weapon_6) == 0x000120, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Weapon_6' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_14) == 0x000128, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Weapon_7) == 0x000130, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Weapon_7' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_15) == 0x000138, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_AsPBConduit_Weapon_8) == 0x000140, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_AsPBConduit_Weapon_8' has a wrong offset!");
static_assert(offsetof(SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350, K2Node_DynamicCast_bSuccess_16) == 0x000148, "Member 'SMEvent_Damage_CDP350_C_ExecuteUbergraph_SMEvent_Damage_CDP350::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");

}

