#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_ByTwoWeaponTypesInOneLife

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_ByTwoWeaponTypesInOneLife.SMEvent_ByTwoWeaponTypesInOneLife_C
// 0x0728 (0x0E20 - 0x06F8)
class USMEvent_ByTwoWeaponTypesInOneLife_C final : public UPBEvent_Kill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_BC340A97413642F675CA8EBFF8BF02C3; // 0x0700(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_94F0A51B440C51814323838449AB2C55; // 0x08F8(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_DFC386DD4D8ED930DE4DDA8373C55694; // 0x0AD8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_AB0B2A594877106ABDC5498D068BA54E; // 0x0CB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_E10B655A4172106D5B271AB739CF6FF7; // 0x0D00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_2E3F8E8A421AC248C93DA8AC94FC1093; // 0x0D48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_1759FD974FB7BED2E0925FB5DA502308; // 0x0D90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2AEF49BC497FE22343B414A9E333793F; // 0x0DD8(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_ByTwoWeaponTypesInOneLife(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_End_08ACAD314170F403C8059A90752F650D_9D88896E47A98DC65BC4E4889EF3C43A();
	void SMGraphK2Node_GraphPropertyNode_4_8FBC1AC9AE62937ED288E1B431A37B3D_B18FF0FC4C37F882E18FC3B42D591590();
	void SMGraphK2Node_GraphPropertyNode_3_40A291E7A5009A35B29F31036F3FD958_4F4CDE294AF52B83F3E2698A02D3EB33();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_1AE477074284BCD8B32140A755CFABF3();
	void SMGraphK2Node_GraphPropertyNode_0_DCDC2CE0146CE82F4F42BD4D82F115C7_08009ADB4BA714D483E7FCA34E6DEB4D();
	void SMGraphK2Node_GraphPropertyNode_1_518353AF11A99FDFEEDB66B6418EA001_B2807ADF49BAF6C86DF007A8066040F9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_ByTwoWeaponTypesInOneLife_C">();
	}
	static class USMEvent_ByTwoWeaponTypesInOneLife_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_ByTwoWeaponTypesInOneLife_C>();
	}
};
static_assert(alignof(USMEvent_ByTwoWeaponTypesInOneLife_C) == 0x000008, "Wrong alignment on USMEvent_ByTwoWeaponTypesInOneLife_C");
static_assert(sizeof(USMEvent_ByTwoWeaponTypesInOneLife_C) == 0x000E20, "Wrong size on USMEvent_ByTwoWeaponTypesInOneLife_C");
static_assert(offsetof(USMEvent_ByTwoWeaponTypesInOneLife_C, UberGraphFrame) == 0x0006F8, "Member 'USMEvent_ByTwoWeaponTypesInOneLife_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_ByTwoWeaponTypesInOneLife_C, SMGraphK2Node_TransitionResultNode_BC340A97413642F675CA8EBFF8BF02C3) == 0x000700, "Member 'USMEvent_ByTwoWeaponTypesInOneLife_C::SMGraphK2Node_TransitionResultNode_BC340A97413642F675CA8EBFF8BF02C3' has a wrong offset!");
static_assert(offsetof(USMEvent_ByTwoWeaponTypesInOneLife_C, SMGraphK2Node_StateEntryNode_94F0A51B440C51814323838449AB2C55) == 0x0008F8, "Member 'USMEvent_ByTwoWeaponTypesInOneLife_C::SMGraphK2Node_StateEntryNode_94F0A51B440C51814323838449AB2C55' has a wrong offset!");
static_assert(offsetof(USMEvent_ByTwoWeaponTypesInOneLife_C, SMGraphK2Node_ConduitResultNode_DFC386DD4D8ED930DE4DDA8373C55694) == 0x000AD8, "Member 'USMEvent_ByTwoWeaponTypesInOneLife_C::SMGraphK2Node_ConduitResultNode_DFC386DD4D8ED930DE4DDA8373C55694' has a wrong offset!");
static_assert(offsetof(USMEvent_ByTwoWeaponTypesInOneLife_C, SMGraphK2Node_GraphPropertyNode_4_AB0B2A594877106ABDC5498D068BA54E) == 0x000CB8, "Member 'USMEvent_ByTwoWeaponTypesInOneLife_C::SMGraphK2Node_GraphPropertyNode_4_AB0B2A594877106ABDC5498D068BA54E' has a wrong offset!");
static_assert(offsetof(USMEvent_ByTwoWeaponTypesInOneLife_C, SMGraphK2Node_GraphPropertyNode_3_E10B655A4172106D5B271AB739CF6FF7) == 0x000D00, "Member 'USMEvent_ByTwoWeaponTypesInOneLife_C::SMGraphK2Node_GraphPropertyNode_3_E10B655A4172106D5B271AB739CF6FF7' has a wrong offset!");
static_assert(offsetof(USMEvent_ByTwoWeaponTypesInOneLife_C, SMGraphK2Node_GraphPropertyNode_2_2E3F8E8A421AC248C93DA8AC94FC1093) == 0x000D48, "Member 'USMEvent_ByTwoWeaponTypesInOneLife_C::SMGraphK2Node_GraphPropertyNode_2_2E3F8E8A421AC248C93DA8AC94FC1093' has a wrong offset!");
static_assert(offsetof(USMEvent_ByTwoWeaponTypesInOneLife_C, SMGraphK2Node_GraphPropertyNode_1_1759FD974FB7BED2E0925FB5DA502308) == 0x000D90, "Member 'USMEvent_ByTwoWeaponTypesInOneLife_C::SMGraphK2Node_GraphPropertyNode_1_1759FD974FB7BED2E0925FB5DA502308' has a wrong offset!");
static_assert(offsetof(USMEvent_ByTwoWeaponTypesInOneLife_C, SMGraphK2Node_GraphPropertyNode_2AEF49BC497FE22343B414A9E333793F) == 0x000DD8, "Member 'USMEvent_ByTwoWeaponTypesInOneLife_C::SMGraphK2Node_GraphPropertyNode_2AEF49BC497FE22343B414A9E333793F' has a wrong offset!");

}

