#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Medal_MarkAssist

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Medal_MarkAssist.SMEvent_Medal_MarkAssist_C
// 0x0278 (0x0928 - 0x06B0)
class USMEvent_Medal_MarkAssist_C final : public UPBEvent_MarkAssist
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_026022C84EDCBFD3BA513FA5ED5BE1FD; // 0x06B8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_3B0580504479D86E064457B7B645EA15; // 0x0898(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_314CB5AC46E94D850B6E08AF66EFA5EA; // 0x08E0(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Medal_MarkAssist(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_5222B08444F1565F989109BB9C7F4F2A();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_7D38A9864A9CCC7121FCE4B5806C98FA();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_7404FEA745ABD64895BB85B183EE9E76();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Medal_MarkAssist_C">();
	}
	static class USMEvent_Medal_MarkAssist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Medal_MarkAssist_C>();
	}
};
static_assert(alignof(USMEvent_Medal_MarkAssist_C) == 0x000008, "Wrong alignment on USMEvent_Medal_MarkAssist_C");
static_assert(sizeof(USMEvent_Medal_MarkAssist_C) == 0x000928, "Wrong size on USMEvent_Medal_MarkAssist_C");
static_assert(offsetof(USMEvent_Medal_MarkAssist_C, UberGraphFrame) == 0x0006B0, "Member 'USMEvent_Medal_MarkAssist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_MarkAssist_C, SMGraphK2Node_StateEntryNode_026022C84EDCBFD3BA513FA5ED5BE1FD) == 0x0006B8, "Member 'USMEvent_Medal_MarkAssist_C::SMGraphK2Node_StateEntryNode_026022C84EDCBFD3BA513FA5ED5BE1FD' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_MarkAssist_C, SMGraphK2Node_GraphPropertyNode_1_3B0580504479D86E064457B7B645EA15) == 0x000898, "Member 'USMEvent_Medal_MarkAssist_C::SMGraphK2Node_GraphPropertyNode_1_3B0580504479D86E064457B7B645EA15' has a wrong offset!");
static_assert(offsetof(USMEvent_Medal_MarkAssist_C, SMGraphK2Node_GraphPropertyNode_314CB5AC46E94D850B6E08AF66EFA5EA) == 0x0008E0, "Member 'USMEvent_Medal_MarkAssist_C::SMGraphK2Node_GraphPropertyNode_314CB5AC46E94D850B6E08AF66EFA5EA' has a wrong offset!");

}

