#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Captured

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Captured.SMEvent_Captured_C
// 0x0278 (0x0928 - 0x06B0)
class USMEvent_Captured_C final : public UPBEvent_Captured
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               SMGraphK2Node_StateEntryNode_0FAB4EF14D10110F50575D8DB5FCB465; // 0x06B8(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_6F0523AB41B2EB253BB7F080300ED314; // 0x0898(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_B145159348F2D68DAB2D2989B2F76844; // 0x08E0(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Captured(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_EventEnd_Trigger_0B9D2FE54F5B66559FE16C965C2BB560_46E076AD44C33F044EEB6583EF551BC5();
	void SMGraphK2Node_GraphPropertyNode_1_8FBC1AC9AE62937ED288E1B431A37B3D_FED2A44F4243D984E6071B89A238A7E3();
	void SMGraphK2Node_GraphPropertyNode_0_40A291E7A5009A35B29F31036F3FD958_DF42A4F647301B90C8A761AF9E3D407E();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Captured_C">();
	}
	static class USMEvent_Captured_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Captured_C>();
	}
};
static_assert(alignof(USMEvent_Captured_C) == 0x000008, "Wrong alignment on USMEvent_Captured_C");
static_assert(sizeof(USMEvent_Captured_C) == 0x000928, "Wrong size on USMEvent_Captured_C");
static_assert(offsetof(USMEvent_Captured_C, UberGraphFrame) == 0x0006B0, "Member 'USMEvent_Captured_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Captured_C, SMGraphK2Node_StateEntryNode_0FAB4EF14D10110F50575D8DB5FCB465) == 0x0006B8, "Member 'USMEvent_Captured_C::SMGraphK2Node_StateEntryNode_0FAB4EF14D10110F50575D8DB5FCB465' has a wrong offset!");
static_assert(offsetof(USMEvent_Captured_C, SMGraphK2Node_GraphPropertyNode_1_6F0523AB41B2EB253BB7F080300ED314) == 0x000898, "Member 'USMEvent_Captured_C::SMGraphK2Node_GraphPropertyNode_1_6F0523AB41B2EB253BB7F080300ED314' has a wrong offset!");
static_assert(offsetof(USMEvent_Captured_C, SMGraphK2Node_GraphPropertyNode_B145159348F2D68DAB2D2989B2F76844) == 0x0008E0, "Member 'USMEvent_Captured_C::SMGraphK2Node_GraphPropertyNode_B145159348F2D68DAB2D2989B2F76844' has a wrong offset!");

}

