#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMEvent_Level42

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SMEvent_Level42.SMEvent_Level42_C
// 0x0DD0 (0x1478 - 0x06A8)
class USMEvent_Level42_C final : public UPBEvent_LoadPlayerData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_BDE812CC4480B700A7A7D29E7574D8F3; // 0x06B0(0x01F8)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_BDA981684B276EC423784ABB3BD69094; // 0x08A8(0x01F8)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_86C436654B56DBBE4B20BEB341CDE107; // 0x0AA0(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_1_9A47E8E34AA197D539856887BAA58A7B; // 0x0C80(0x01E0)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_189A5EBD4CA391B4B30B588A57ACA788; // 0x0E60(0x01E0)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_14_D454C1E34AC84B86ABA5C081248B81AD; // 0x1040(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_13_DB9FCE1043CD77015EE3ED9C5F6D21FC; // 0x1088(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_12_514ED3264AEA1BB89A4BE7B5875AE8D1; // 0x10D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_11_C71229E445A0CCBB453CF2ABDCDAE36A; // 0x1118(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_10_3C8BB760475ECD7F9D03CD9D8E0AF911; // 0x1160(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_9_DECB51844915B392DBB23A9E1C90B032; // 0x11A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_8_9775521A4EFECE3CFAE3DCA522C0D40C; // 0x11F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_7_BC1917AA4CC77AEAC5F2F7BC90D99E47; // 0x1238(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_6_4118019F4A1FAB518B508D9B681A302A; // 0x1280(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_5_623CCFEF417D93E026F8F58BCE71982E; // 0x12C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_4_BED77D284EED97A2A7665FB435196FD5; // 0x1310(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_3_EC58B1A94E40F7AD957A5CA4C9FF8F10; // 0x1358(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_2_44EC855948CAEAB2990E15B4ABDDD11B; // 0x13A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_1_95D99BC348680E8BD59465921C501477; // 0x13E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_89DA8E7C4F1D717072EBA4BE5E8682D8; // 0x1430(0x0048)()

public:
	void ExecuteUbergraph_SMEvent_Level42(int32 EntryPoint);
	void SMGraphK2Node_StateEntryNode_0_State_5302503B4443C37DF2239CB8DBEE6173_C25F4C6749DDDA248DDEB89DAB361188();
	void SMGraphK2Node_GraphPropertyNode_14_8FBC1AC9AE62937ED288E1B431A37B3D_36A53D6E4044689C9A566EB5CE0D98D3();
	void SMGraphK2Node_GraphPropertyNode_13_40A291E7A5009A35B29F31036F3FD958_DE2FA6AE44D7314BED158CBA1C0ED872();
	void SMGraphK2Node_GraphPropertyNode_0_7E261F3E5C0FA126924682D5024D57B6_E553170B4DB7E6D3B903E6B2FE358D02();
	void SMGraphK2Node_GraphPropertyNode_12_9B2E76CB0D5642A91285ECD0AD22455D_D03CDC6442A84AF7CBDFB08DCD87D1AA();
	void SMGraphK2Node_GraphPropertyNode_1_518353AF11A99FDFEEDB66B6418EA001_C638C2634F3A8DD933B068B89351468A();
	void SMGraphK2Node_GraphPropertyNode_2_3DA64C0AB489BBF8EAE713CAEED73534_3B5946424E5315AC8857EFA1CA7B91A7();
	void SMGraphK2Node_GraphPropertyNode_11_1DBA4F3EBF49270A15FCABAE378D5A28_3A0F47D14A8EA59A0EEC69AA81360EBE();
	void SMGraphK2Node_GraphPropertyNode_3_518353AF11A99FDFEEDB66B6418EA001_3358211040AA19714C0FCD9CB64026C7();
	void SMGraphK2Node_GraphPropertyNode_4_3DA64C0AB489BBF8EAE713CAEED73534_21034BC44BC87E0C48B09BBE00AE0B7E();
	void SMGraphK2Node_GraphPropertyNode_10_83FB9728653B5875C5D29938A1862987_5DC5C8E54D9D9B6A3FE00D8C39C7E774();
	void SMGraphK2Node_GraphPropertyNode_5_5DF5EB69FB5B1350C77BA421EBD2B8FA_03EC49CA4DC57188A4D43AA5A2E41D99();
	void SMGraphK2Node_GraphPropertyNode_6_924251CE29BC1D7EDCFAB4DB3C0223AE_BF082F1A48D88B09F8AE4785A10EDAD4();
	void SMGraphK2Node_GraphPropertyNode_9_471AAF85555CF2679A4535DADFC63770_A3026D9549086097D89BAFA27E3CD4C3();
	void SMGraphK2Node_GraphPropertyNode_7_E0C31B330F532F42E5913DACC16F802B_B6C867124E32064BCB70A0BBC612AE13();
	void SMGraphK2Node_GraphPropertyNode_8_A22120CDAC3ACF3D903EA80FE84B0006_BE08084E4779B49FC5407B92B9A60B95();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMEvent_Level42_C">();
	}
	static class USMEvent_Level42_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMEvent_Level42_C>();
	}
};
static_assert(alignof(USMEvent_Level42_C) == 0x000008, "Wrong alignment on USMEvent_Level42_C");
static_assert(sizeof(USMEvent_Level42_C) == 0x001478, "Wrong size on USMEvent_Level42_C");
static_assert(offsetof(USMEvent_Level42_C, UberGraphFrame) == 0x0006A8, "Member 'USMEvent_Level42_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_TransitionResultNode_1_BDE812CC4480B700A7A7D29E7574D8F3) == 0x0006B0, "Member 'USMEvent_Level42_C::SMGraphK2Node_TransitionResultNode_1_BDE812CC4480B700A7A7D29E7574D8F3' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_TransitionResultNode_BDA981684B276EC423784ABB3BD69094) == 0x0008A8, "Member 'USMEvent_Level42_C::SMGraphK2Node_TransitionResultNode_BDA981684B276EC423784ABB3BD69094' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_StateEntryNode_86C436654B56DBBE4B20BEB341CDE107) == 0x000AA0, "Member 'USMEvent_Level42_C::SMGraphK2Node_StateEntryNode_86C436654B56DBBE4B20BEB341CDE107' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_ConduitResultNode_1_9A47E8E34AA197D539856887BAA58A7B) == 0x000C80, "Member 'USMEvent_Level42_C::SMGraphK2Node_ConduitResultNode_1_9A47E8E34AA197D539856887BAA58A7B' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_ConduitResultNode_189A5EBD4CA391B4B30B588A57ACA788) == 0x000E60, "Member 'USMEvent_Level42_C::SMGraphK2Node_ConduitResultNode_189A5EBD4CA391B4B30B588A57ACA788' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_14_D454C1E34AC84B86ABA5C081248B81AD) == 0x001040, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_14_D454C1E34AC84B86ABA5C081248B81AD' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_13_DB9FCE1043CD77015EE3ED9C5F6D21FC) == 0x001088, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_13_DB9FCE1043CD77015EE3ED9C5F6D21FC' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_12_514ED3264AEA1BB89A4BE7B5875AE8D1) == 0x0010D0, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_12_514ED3264AEA1BB89A4BE7B5875AE8D1' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_11_C71229E445A0CCBB453CF2ABDCDAE36A) == 0x001118, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_11_C71229E445A0CCBB453CF2ABDCDAE36A' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_10_3C8BB760475ECD7F9D03CD9D8E0AF911) == 0x001160, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_10_3C8BB760475ECD7F9D03CD9D8E0AF911' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_9_DECB51844915B392DBB23A9E1C90B032) == 0x0011A8, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_9_DECB51844915B392DBB23A9E1C90B032' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_8_9775521A4EFECE3CFAE3DCA522C0D40C) == 0x0011F0, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_8_9775521A4EFECE3CFAE3DCA522C0D40C' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_7_BC1917AA4CC77AEAC5F2F7BC90D99E47) == 0x001238, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_7_BC1917AA4CC77AEAC5F2F7BC90D99E47' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_6_4118019F4A1FAB518B508D9B681A302A) == 0x001280, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_6_4118019F4A1FAB518B508D9B681A302A' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_5_623CCFEF417D93E026F8F58BCE71982E) == 0x0012C8, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_5_623CCFEF417D93E026F8F58BCE71982E' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_4_BED77D284EED97A2A7665FB435196FD5) == 0x001310, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_4_BED77D284EED97A2A7665FB435196FD5' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_3_EC58B1A94E40F7AD957A5CA4C9FF8F10) == 0x001358, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_3_EC58B1A94E40F7AD957A5CA4C9FF8F10' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_2_44EC855948CAEAB2990E15B4ABDDD11B) == 0x0013A0, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_2_44EC855948CAEAB2990E15B4ABDDD11B' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_1_95D99BC348680E8BD59465921C501477) == 0x0013E8, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_1_95D99BC348680E8BD59465921C501477' has a wrong offset!");
static_assert(offsetof(USMEvent_Level42_C, SMGraphK2Node_GraphPropertyNode_89DA8E7C4F1D717072EBA4BE5E8682D8) == 0x001430, "Member 'USMEvent_Level42_C::SMGraphK2Node_GraphPropertyNode_89DA8E7C4F1D717072EBA4BE5E8682D8' has a wrong offset!");

}

