#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum SMSystem.ESMNetworkConfigurationType
// NumValues: 0x0004
enum class ESMNetworkConfigurationType : uint8
{
	SM_Client                                = 0,
	SM_Server                                = 1,
	SM_ClientAndServer                       = 2,
	SM_MAX                                   = 3,
};

// Enum SMSystem.ESMConditionalEvaluationType
// NumValues: 0x0005
enum class ESMConditionalEvaluationType : uint8
{
	SM_Graph                                 = 0,
	SM_NodeInstance                          = 1,
	SM_AlwaysFalse                           = 2,
	SM_AlwaysTrue                            = 3,
	SM_MAX                                   = 4,
};

// Enum SMSystem.ESMExposedFunctionExecutionType
// NumValues: 0x0004
enum class ESMExposedFunctionExecutionType : uint8
{
	SM_Graph                                 = 0,
	SM_NodeInstance                          = 1,
	SM_None                                  = 2,
	SM_MAX                                   = 3,
};

// Enum SMSystem.ESMNodeInput
// NumValues: 0x000C
enum class ESMNodeInput : uint8
{
	Disabled                                 = 0,
	UseOwningStateMachine                    = 1,
	UseContextController                     = 2,
	Player0                                  = 3,
	Player1                                  = 4,
	Player2                                  = 5,
	Player3                                  = 6,
	Player4                                  = 7,
	Player5                                  = 8,
	Player6                                  = 9,
	Player7                                  = 10,
	ESMNodeInput_MAX                         = 11,
};

// Enum SMSystem.ESMStateMachineInput
// NumValues: 0x000B
enum class ESMStateMachineInput : uint8
{
	Disabled                                 = 0,
	UseContextController                     = 1,
	Player0                                  = 2,
	Player1                                  = 3,
	Player2                                  = 4,
	Player3                                  = 5,
	Player4                                  = 6,
	Player5                                  = 7,
	Player6                                  = 8,
	Player7                                  = 9,
	ESMStateMachineInput_MAX                 = 10,
};

// Enum SMSystem.ESMExecutionEnvironment
// NumValues: 0x0003
enum class ESMExecutionEnvironment : uint8
{
	EditorExecution                          = 0,
	GameExecution                            = 1,
	ESMExecutionEnvironment_MAX              = 2,
};

// Enum SMSystem.ESMThreadMode
// NumValues: 0x0003
enum class ESMThreadMode : uint8
{
	Blocking                                 = 0,
	Async                                    = 1,
	ESMThreadMode_MAX                        = 2,
};

// Enum SMSystem.ESMTransactionType
// NumValues: 0x0009
enum class ESMTransactionType : uint8
{
	SM_Unknown                               = 0,
	SM_Transition                            = 1,
	SM_State                                 = 2,
	SM_FullSync                              = 3,
	SM_Start                                 = 4,
	SM_Stop                                  = 5,
	SM_Initialize                            = 6,
	SM_Shutdown                              = 7,
	SM_MAX                                   = 8,
};

// ScriptStruct SMSystem.SMTransaction_Base
// 0x0003 (0x0003 - 0x0000)
struct FSMTransaction_Base
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	ESMTransactionType                            TransactionType;                                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOriginatedFromServer : 1;                         // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
};
static_assert(alignof(FSMTransaction_Base) == 0x000001, "Wrong alignment on FSMTransaction_Base");
static_assert(sizeof(FSMTransaction_Base) == 0x000003, "Wrong size on FSMTransaction_Base");
static_assert(offsetof(FSMTransaction_Base, TransactionType) == 0x000001, "Member 'FSMTransaction_Base::TransactionType' has a wrong offset!");

// ScriptStruct SMSystem.SMFullSyncStateTransaction
// 0x0015 (0x0018 - 0x0003)
struct FSMFullSyncStateTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  BaseGuid;                                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInState;                                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMFullSyncStateTransaction) == 0x000004, "Wrong alignment on FSMFullSyncStateTransaction");
static_assert(sizeof(FSMFullSyncStateTransaction) == 0x000018, "Wrong size on FSMFullSyncStateTransaction");
static_assert(offsetof(FSMFullSyncStateTransaction, BaseGuid) == 0x000004, "Member 'FSMFullSyncStateTransaction::BaseGuid' has a wrong offset!");
static_assert(offsetof(FSMFullSyncStateTransaction, TimeInState) == 0x000014, "Member 'FSMFullSyncStateTransaction::TimeInState' has a wrong offset!");

// ScriptStruct SMSystem.SMInfo_Base
// 0x0060 (0x0060 - 0x0000)
struct FSMInfo_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NodeName;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OwnerGuid;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  NodeGuid;                                          // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OwnerNodeGuid;                                     // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMNodeInstance*                        NodeInstance;                                      // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMInfo_Base) == 0x000008, "Wrong alignment on FSMInfo_Base");
static_assert(sizeof(FSMInfo_Base) == 0x000060, "Wrong size on FSMInfo_Base");
static_assert(offsetof(FSMInfo_Base, NodeName) == 0x000008, "Member 'FSMInfo_Base::NodeName' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, Guid) == 0x000018, "Member 'FSMInfo_Base::Guid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, OwnerGuid) == 0x000028, "Member 'FSMInfo_Base::OwnerGuid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, NodeGuid) == 0x000038, "Member 'FSMInfo_Base::NodeGuid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, OwnerNodeGuid) == 0x000048, "Member 'FSMInfo_Base::OwnerNodeGuid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, NodeInstance) == 0x000058, "Member 'FSMInfo_Base::NodeInstance' has a wrong offset!");

// ScriptStruct SMSystem.SMExposedFunctionHandler
// 0x0028 (0x0028 - 0x0000)
struct FSMExposedFunctionHandler final
{
public:
	class FName                                   BoundFunction;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMExposedFunctionExecutionType               ExecutionType;                                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFunction*                              Function;                                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                OwnerObject;                                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMExposedFunctionHandler) == 0x000008, "Wrong alignment on FSMExposedFunctionHandler");
static_assert(sizeof(FSMExposedFunctionHandler) == 0x000028, "Wrong size on FSMExposedFunctionHandler");
static_assert(offsetof(FSMExposedFunctionHandler, BoundFunction) == 0x000000, "Member 'FSMExposedFunctionHandler::BoundFunction' has a wrong offset!");
static_assert(offsetof(FSMExposedFunctionHandler, ExecutionType) == 0x000008, "Member 'FSMExposedFunctionHandler::ExecutionType' has a wrong offset!");
static_assert(offsetof(FSMExposedFunctionHandler, Function) == 0x000010, "Member 'FSMExposedFunctionHandler::Function' has a wrong offset!");
static_assert(offsetof(FSMExposedFunctionHandler, OwnerObject) == 0x000018, "Member 'FSMExposedFunctionHandler::OwnerObject' has a wrong offset!");

// ScriptStruct SMSystem.SMTransitionInfo
// 0x0038 (0x0098 - 0x0060)
struct FSMTransitionInfo final : public FSMInfo_Base
{
public:
	struct FGuid                                  FromStateGuid;                                     // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ToStateGuid;                                       // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              LastNetworkTimestamp;                              // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMTransitionInfo) == 0x000008, "Wrong alignment on FSMTransitionInfo");
static_assert(sizeof(FSMTransitionInfo) == 0x000098, "Wrong size on FSMTransitionInfo");
static_assert(offsetof(FSMTransitionInfo, FromStateGuid) == 0x000060, "Member 'FSMTransitionInfo::FromStateGuid' has a wrong offset!");
static_assert(offsetof(FSMTransitionInfo, ToStateGuid) == 0x000070, "Member 'FSMTransitionInfo::ToStateGuid' has a wrong offset!");
static_assert(offsetof(FSMTransitionInfo, Priority) == 0x000080, "Member 'FSMTransitionInfo::Priority' has a wrong offset!");
static_assert(offsetof(FSMTransitionInfo, LastNetworkTimestamp) == 0x000088, "Member 'FSMTransitionInfo::LastNetworkTimestamp' has a wrong offset!");

// ScriptStruct SMSystem.SMGraphProperty_Base_Runtime
// 0x0048 (0x0048 - 0x0000)
struct FSMGraphProperty_Base_Runtime
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMExposedFunctionHandler>      GraphEvaluator;                                    // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  OwnerGuid;                                         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsDefaultValueOnly : 1;                           // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMGraphProperty_Base_Runtime) == 0x000008, "Wrong alignment on FSMGraphProperty_Base_Runtime");
static_assert(sizeof(FSMGraphProperty_Base_Runtime) == 0x000048, "Wrong size on FSMGraphProperty_Base_Runtime");
static_assert(offsetof(FSMGraphProperty_Base_Runtime, GraphEvaluator) == 0x000008, "Member 'FSMGraphProperty_Base_Runtime::GraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base_Runtime, Guid) == 0x000020, "Member 'FSMGraphProperty_Base_Runtime::Guid' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base_Runtime, OwnerGuid) == 0x000030, "Member 'FSMGraphProperty_Base_Runtime::OwnerGuid' has a wrong offset!");

// ScriptStruct SMSystem.SMGraphPropertyTemplateOwner
// 0x0010 (0x0010 - 0x0000)
struct FSMGraphPropertyTemplateOwner final
{
public:
	TArray<struct FSMGraphProperty_Base_Runtime>  VariableGraphProperties;                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMGraphPropertyTemplateOwner) == 0x000008, "Wrong alignment on FSMGraphPropertyTemplateOwner");
static_assert(sizeof(FSMGraphPropertyTemplateOwner) == 0x000010, "Wrong size on FSMGraphPropertyTemplateOwner");
static_assert(offsetof(FSMGraphPropertyTemplateOwner, VariableGraphProperties) == 0x000000, "Member 'FSMGraphPropertyTemplateOwner::VariableGraphProperties' has a wrong offset!");

// ScriptStruct SMSystem.SMInitializeTransaction
// 0x000D (0x0010 - 0x0003)
struct FSMInitializeTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Context;                                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMInitializeTransaction) == 0x000008, "Wrong alignment on FSMInitializeTransaction");
static_assert(sizeof(FSMInitializeTransaction) == 0x000010, "Wrong size on FSMInitializeTransaction");
static_assert(offsetof(FSMInitializeTransaction, Context) == 0x000008, "Member 'FSMInitializeTransaction::Context' has a wrong offset!");

// ScriptStruct SMSystem.SMStateInfo
// 0x0020 (0x0080 - 0x0060)
struct FSMStateInfo final : public FSMInfo_Base
{
public:
	TArray<struct FSMTransitionInfo>              OutgoingTransitions;                               // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsEndState;                                       // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMStateInfo) == 0x000008, "Wrong alignment on FSMStateInfo");
static_assert(sizeof(FSMStateInfo) == 0x000080, "Wrong size on FSMStateInfo");
static_assert(offsetof(FSMStateInfo, OutgoingTransitions) == 0x000060, "Member 'FSMStateInfo::OutgoingTransitions' has a wrong offset!");
static_assert(offsetof(FSMStateInfo, bIsEndState) == 0x000070, "Member 'FSMStateInfo::bIsEndState' has a wrong offset!");

// ScriptStruct SMSystem.SMNode_Base
// 0x0160 (0x0160 - 0x0000)
struct FSMNode_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMExposedFunctionHandler>      TransitionInitializedGraphEvaluators;              // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      TransitionShutdownGraphEvaluators;                 // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      OnRootStateMachineStartedGraphEvaluator;           // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      OnRootStateMachineStoppedGraphEvaluator;           // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         TimeInState;                                       // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInEndState;                                     // 0x004C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasUpdated;                                       // 0x004D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DuplicateId;                                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              NodePosition;                                      // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x005C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  OwnerGuid;                                         // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  PathGuid;                                          // 0x007C(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C[0xC];                                       // 0x008C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NodeName;                                          // 0x0098(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TemplateName;                                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           StackTemplateNames;                                // 0x00B0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class USMNodeInstance*>                StackNodeInstances;                                // 0x00C0(0x0010)(BlueprintVisible, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UClass*>                         NodeStackClasses;                                  // 0x00D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class USMInstance*                            OwningInstance;                                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMNodeInstance*                        NodeInstance;                                      // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, struct FSMGraphPropertyTemplateOwner> TemplateVariableGraphProperties;                   // 0x0100(0x0050)(Protected, NativeAccessSpecifierProtected)
	class UClass*                                 NodeInstanceClass;                                 // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMNode_Base) == 0x000008, "Wrong alignment on FSMNode_Base");
static_assert(sizeof(FSMNode_Base) == 0x000160, "Wrong size on FSMNode_Base");
static_assert(offsetof(FSMNode_Base, TransitionInitializedGraphEvaluators) == 0x000008, "Member 'FSMNode_Base::TransitionInitializedGraphEvaluators' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, TransitionShutdownGraphEvaluators) == 0x000018, "Member 'FSMNode_Base::TransitionShutdownGraphEvaluators' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, OnRootStateMachineStartedGraphEvaluator) == 0x000028, "Member 'FSMNode_Base::OnRootStateMachineStartedGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, OnRootStateMachineStoppedGraphEvaluator) == 0x000038, "Member 'FSMNode_Base::OnRootStateMachineStoppedGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, TimeInState) == 0x000048, "Member 'FSMNode_Base::TimeInState' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, bIsInEndState) == 0x00004C, "Member 'FSMNode_Base::bIsInEndState' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, bHasUpdated) == 0x00004D, "Member 'FSMNode_Base::bHasUpdated' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, DuplicateId) == 0x000050, "Member 'FSMNode_Base::DuplicateId' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodePosition) == 0x000054, "Member 'FSMNode_Base::NodePosition' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, Guid) == 0x00005C, "Member 'FSMNode_Base::Guid' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, OwnerGuid) == 0x00006C, "Member 'FSMNode_Base::OwnerGuid' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, PathGuid) == 0x00007C, "Member 'FSMNode_Base::PathGuid' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeName) == 0x000098, "Member 'FSMNode_Base::NodeName' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, TemplateName) == 0x0000A8, "Member 'FSMNode_Base::TemplateName' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, StackTemplateNames) == 0x0000B0, "Member 'FSMNode_Base::StackTemplateNames' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, StackNodeInstances) == 0x0000C0, "Member 'FSMNode_Base::StackNodeInstances' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeStackClasses) == 0x0000D0, "Member 'FSMNode_Base::NodeStackClasses' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, OwningInstance) == 0x0000E0, "Member 'FSMNode_Base::OwningInstance' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeInstance) == 0x0000E8, "Member 'FSMNode_Base::NodeInstance' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, TemplateVariableGraphProperties) == 0x000100, "Member 'FSMNode_Base::TemplateVariableGraphProperties' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeInstanceClass) == 0x000150, "Member 'FSMNode_Base::NodeInstanceClass' has a wrong offset!");

// ScriptStruct SMSystem.SMState_Base
// 0x0050 (0x01B0 - 0x0160)
struct FSMState_Base : public FSMNode_Base
{
public:
	uint8                                         bIsRootNode : 1;                                   // 0x0160(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysUpdate : 1;                                 // 0x0160(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalTransitionsOnStart : 1;                       // 0x0160(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableTickTransitionEvaluation : 1;              // 0x0160(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStayActiveOnStateChange : 1;                      // 0x0160(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowParallelReentry : 1;                         // 0x0160(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_161[0x4F];                                     // 0x0161(0x004F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMState_Base) == 0x000008, "Wrong alignment on FSMState_Base");
static_assert(sizeof(FSMState_Base) == 0x0001B0, "Wrong size on FSMState_Base");

// ScriptStruct SMSystem.SMConduit
// 0x0030 (0x01E0 - 0x01B0)
struct FSMConduit final : public FSMState_Base
{
public:
	uint8                                         bCanEnterTransition : 1;                           // 0x01B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluate : 1;                                  // 0x01B0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalWithTransitions : 1;                          // 0x01B0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMExposedFunctionHandler>      CanEnterConduitGraphEvaluator;                     // 0x01B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      ConduitEnteredGraphEvaluator;                      // 0x01C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	ESMConditionalEvaluationType                  ConditionalEvaluationType;                         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMConduit) == 0x000008, "Wrong alignment on FSMConduit");
static_assert(sizeof(FSMConduit) == 0x0001E0, "Wrong size on FSMConduit");
static_assert(offsetof(FSMConduit, CanEnterConduitGraphEvaluator) == 0x0001B8, "Member 'FSMConduit::CanEnterConduitGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMConduit, ConduitEnteredGraphEvaluator) == 0x0001C8, "Member 'FSMConduit::ConduitEnteredGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMConduit, ConditionalEvaluationType) == 0x0001D8, "Member 'FSMConduit::ConditionalEvaluationType' has a wrong offset!");

// ScriptStruct SMSystem.SMGraphProperty_Base
// 0x00C0 (0x0108 - 0x0048)
struct FSMGraphProperty_Base : public FSMGraphProperty_Base_Runtime
{
public:
	class FName                                   VariableName;                                      // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEdGraphPinType                        VariableType;                                      // 0x0050(0x0058)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMemberReference                       MemberReference;                                   // 0x00A8(0x0038)(NativeAccessSpecifierPublic)
	bool                                          bIsInArray;                                        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReadOnly;                                         // 0x00E1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHidden;                                           // 0x00E2(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  GuidUnmodified;                                    // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  TemplateGuid;                                      // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         GuidIndex;                                         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FSMGraphProperty_Base) == 0x000008, "Wrong alignment on FSMGraphProperty_Base");
static_assert(sizeof(FSMGraphProperty_Base) == 0x000108, "Wrong size on FSMGraphProperty_Base");
static_assert(offsetof(FSMGraphProperty_Base, VariableName) == 0x000048, "Member 'FSMGraphProperty_Base::VariableName' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, VariableType) == 0x000050, "Member 'FSMGraphProperty_Base::VariableType' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, MemberReference) == 0x0000A8, "Member 'FSMGraphProperty_Base::MemberReference' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, bIsInArray) == 0x0000E0, "Member 'FSMGraphProperty_Base::bIsInArray' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, bReadOnly) == 0x0000E1, "Member 'FSMGraphProperty_Base::bReadOnly' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, bHidden) == 0x0000E2, "Member 'FSMGraphProperty_Base::bHidden' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, GuidUnmodified) == 0x0000E4, "Member 'FSMGraphProperty_Base::GuidUnmodified' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, TemplateGuid) == 0x0000F4, "Member 'FSMGraphProperty_Base::TemplateGuid' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, GuidIndex) == 0x000104, "Member 'FSMGraphProperty_Base::GuidIndex' has a wrong offset!");

// ScriptStruct SMSystem.SMGraphProperty
// 0x0000 (0x0108 - 0x0108)
struct FSMGraphProperty final : public FSMGraphProperty_Base
{
};
static_assert(alignof(FSMGraphProperty) == 0x000008, "Wrong alignment on FSMGraphProperty");
static_assert(sizeof(FSMGraphProperty) == 0x000108, "Wrong size on FSMGraphProperty");

// ScriptStruct SMSystem.SMGraphProperty_Runtime
// 0x0000 (0x0048 - 0x0048)
struct FSMGraphProperty_Runtime final : public FSMGraphProperty_Base_Runtime
{
};
static_assert(alignof(FSMGraphProperty_Runtime) == 0x000008, "Wrong alignment on FSMGraphProperty_Runtime");
static_assert(sizeof(FSMGraphProperty_Runtime) == 0x000048, "Wrong size on FSMGraphProperty_Runtime");

// ScriptStruct SMSystem.SMReferenceContainer
// 0x0018 (0x0018 - 0x0000)
struct FSMReferenceContainer final
{
public:
	struct FGuid                                  PathGuid;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMInstance*                            Reference;                                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMReferenceContainer) == 0x000008, "Wrong alignment on FSMReferenceContainer");
static_assert(sizeof(FSMReferenceContainer) == 0x000018, "Wrong size on FSMReferenceContainer");
static_assert(offsetof(FSMReferenceContainer, PathGuid) == 0x000000, "Member 'FSMReferenceContainer::PathGuid' has a wrong offset!");
static_assert(offsetof(FSMReferenceContainer, Reference) == 0x000010, "Member 'FSMReferenceContainer::Reference' has a wrong offset!");

// ScriptStruct SMSystem.SMDebugStateMachine
// 0x0001 (0x0001 - 0x0000)
struct FSMDebugStateMachine final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMDebugStateMachine) == 0x000001, "Wrong alignment on FSMDebugStateMachine");
static_assert(sizeof(FSMDebugStateMachine) == 0x000001, "Wrong size on FSMDebugStateMachine");

// ScriptStruct SMSystem.SMStateHistory
// 0x0020 (0x0020 - 0x0000)
struct FSMStateHistory final
{
public:
	struct FGuid                                  StateGuid;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              StartTime;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInState;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ServerTimeInState;                                 // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMStateHistory) == 0x000008, "Wrong alignment on FSMStateHistory");
static_assert(sizeof(FSMStateHistory) == 0x000020, "Wrong size on FSMStateHistory");
static_assert(offsetof(FSMStateHistory, StateGuid) == 0x000000, "Member 'FSMStateHistory::StateGuid' has a wrong offset!");
static_assert(offsetof(FSMStateHistory, StartTime) == 0x000010, "Member 'FSMStateHistory::StartTime' has a wrong offset!");
static_assert(offsetof(FSMStateHistory, TimeInState) == 0x000018, "Member 'FSMStateHistory::TimeInState' has a wrong offset!");
static_assert(offsetof(FSMStateHistory, ServerTimeInState) == 0x00001C, "Member 'FSMStateHistory::ServerTimeInState' has a wrong offset!");

// ScriptStruct SMSystem.SMNodeDescription
// 0x0038 (0x0038 - 0x0000)
struct FSMNodeDescription final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Category;                                          // 0x0008(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0020(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMNodeDescription) == 0x000008, "Wrong alignment on FSMNodeDescription");
static_assert(sizeof(FSMNodeDescription) == 0x000038, "Wrong size on FSMNodeDescription");
static_assert(offsetof(FSMNodeDescription, Name) == 0x000000, "Member 'FSMNodeDescription::Name' has a wrong offset!");
static_assert(offsetof(FSMNodeDescription, Category) == 0x000008, "Member 'FSMNodeDescription::Category' has a wrong offset!");
static_assert(offsetof(FSMNodeDescription, Description) == 0x000020, "Member 'FSMNodeDescription::Description' has a wrong offset!");

// ScriptStruct SMSystem.SMConnectionValidator
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSMConnectionValidator
{
};
#pragma pack(pop)
static_assert(alignof(FSMConnectionValidator) == 0x000001, "Wrong alignment on FSMConnectionValidator");
static_assert(sizeof(FSMConnectionValidator) == 0x000001, "Wrong size on FSMConnectionValidator");

// ScriptStruct SMSystem.SMNodeClassRule
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FSMNodeClassRule
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIncludeChildren;                                  // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNOT;                                              // 0x0009(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMNodeClassRule) == 0x000008, "Wrong alignment on FSMNodeClassRule");
static_assert(sizeof(FSMNodeClassRule) == 0x000010, "Wrong size on FSMNodeClassRule");
static_assert(offsetof(FSMNodeClassRule, bIncludeChildren) == 0x000008, "Member 'FSMNodeClassRule::bIncludeChildren' has a wrong offset!");
static_assert(offsetof(FSMNodeClassRule, bNOT) == 0x000009, "Member 'FSMNodeClassRule::bNOT' has a wrong offset!");

// ScriptStruct SMSystem.SMStateClassRule
// 0x0028 (0x0038 - 0x0010)
struct FSMStateClassRule final : public FSMNodeClassRule
{
public:
	TSoftClassPtr<class UClass>                   StateClass;                                        // 0x0010(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMStateClassRule) == 0x000008, "Wrong alignment on FSMStateClassRule");
static_assert(sizeof(FSMStateClassRule) == 0x000038, "Wrong size on FSMStateClassRule");
static_assert(offsetof(FSMStateClassRule, StateClass) == 0x000010, "Member 'FSMStateClassRule::StateClass' has a wrong offset!");

// ScriptStruct SMSystem.SMStateMachineNodePlacementValidator
// 0x0040 (0x0040 - 0x0000)
struct FSMStateMachineNodePlacementValidator final : public FSMConnectionValidator
{
public:
	TArray<struct FSMStateClassRule>              AllowedStates;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bAllowReferences;                                  // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowParents;                                     // 0x0011(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSubStateMachines;                            // 0x0012(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   DefaultSubStateMachineClass;                       // 0x0018(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMStateMachineNodePlacementValidator) == 0x000008, "Wrong alignment on FSMStateMachineNodePlacementValidator");
static_assert(sizeof(FSMStateMachineNodePlacementValidator) == 0x000040, "Wrong size on FSMStateMachineNodePlacementValidator");
static_assert(offsetof(FSMStateMachineNodePlacementValidator, AllowedStates) == 0x000000, "Member 'FSMStateMachineNodePlacementValidator::AllowedStates' has a wrong offset!");
static_assert(offsetof(FSMStateMachineNodePlacementValidator, bAllowReferences) == 0x000010, "Member 'FSMStateMachineNodePlacementValidator::bAllowReferences' has a wrong offset!");
static_assert(offsetof(FSMStateMachineNodePlacementValidator, bAllowParents) == 0x000011, "Member 'FSMStateMachineNodePlacementValidator::bAllowParents' has a wrong offset!");
static_assert(offsetof(FSMStateMachineNodePlacementValidator, bAllowSubStateMachines) == 0x000012, "Member 'FSMStateMachineNodePlacementValidator::bAllowSubStateMachines' has a wrong offset!");
static_assert(offsetof(FSMStateMachineNodePlacementValidator, DefaultSubStateMachineClass) == 0x000018, "Member 'FSMStateMachineNodePlacementValidator::DefaultSubStateMachineClass' has a wrong offset!");

// ScriptStruct SMSystem.SMStateMachineClassRule
// 0x0028 (0x0038 - 0x0010)
struct FSMStateMachineClassRule final : public FSMNodeClassRule
{
public:
	TSoftClassPtr<class UClass>                   StateMachineClass;                                 // 0x0010(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMStateMachineClassRule) == 0x000008, "Wrong alignment on FSMStateMachineClassRule");
static_assert(sizeof(FSMStateMachineClassRule) == 0x000038, "Wrong size on FSMStateMachineClassRule");
static_assert(offsetof(FSMStateMachineClassRule, StateMachineClass) == 0x000010, "Member 'FSMStateMachineClassRule::StateMachineClass' has a wrong offset!");

// ScriptStruct SMSystem.SMStateConnectionValidator
// 0x0030 (0x0030 - 0x0000)
struct FSMStateConnectionValidator final : public FSMConnectionValidator
{
public:
	TArray<struct FSMStateClassRule>              AllowedInboundStates;                              // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FSMStateClassRule>              AllowedOutboundStates;                             // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FSMStateMachineClassRule>       AllowedInStateMachines;                            // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMStateConnectionValidator) == 0x000008, "Wrong alignment on FSMStateConnectionValidator");
static_assert(sizeof(FSMStateConnectionValidator) == 0x000030, "Wrong size on FSMStateConnectionValidator");
static_assert(offsetof(FSMStateConnectionValidator, AllowedInboundStates) == 0x000000, "Member 'FSMStateConnectionValidator::AllowedInboundStates' has a wrong offset!");
static_assert(offsetof(FSMStateConnectionValidator, AllowedOutboundStates) == 0x000010, "Member 'FSMStateConnectionValidator::AllowedOutboundStates' has a wrong offset!");
static_assert(offsetof(FSMStateConnectionValidator, AllowedInStateMachines) == 0x000020, "Member 'FSMStateConnectionValidator::AllowedInStateMachines' has a wrong offset!");

// ScriptStruct SMSystem.SMNodeConnectionRule
// 0x00A8 (0x00A8 - 0x0000)
struct FSMNodeConnectionRule final
{
public:
	struct FSMStateClassRule                      FromState;                                         // 0x0000(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSMStateClassRule                      ToState;                                           // 0x0038(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSMStateMachineClassRule               InStateMachine;                                    // 0x0070(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMNodeConnectionRule) == 0x000008, "Wrong alignment on FSMNodeConnectionRule");
static_assert(sizeof(FSMNodeConnectionRule) == 0x0000A8, "Wrong size on FSMNodeConnectionRule");
static_assert(offsetof(FSMNodeConnectionRule, FromState) == 0x000000, "Member 'FSMNodeConnectionRule::FromState' has a wrong offset!");
static_assert(offsetof(FSMNodeConnectionRule, ToState) == 0x000038, "Member 'FSMNodeConnectionRule::ToState' has a wrong offset!");
static_assert(offsetof(FSMNodeConnectionRule, InStateMachine) == 0x000070, "Member 'FSMNodeConnectionRule::InStateMachine' has a wrong offset!");

// ScriptStruct SMSystem.SMTransitionConnectionValidator
// 0x0010 (0x0010 - 0x0000)
struct FSMTransitionConnectionValidator final : public FSMConnectionValidator
{
public:
	TArray<struct FSMNodeConnectionRule>          AllowedConnections;                                // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMTransitionConnectionValidator) == 0x000008, "Wrong alignment on FSMTransitionConnectionValidator");
static_assert(sizeof(FSMTransitionConnectionValidator) == 0x000010, "Wrong size on FSMTransitionConnectionValidator");
static_assert(offsetof(FSMTransitionConnectionValidator, AllowedConnections) == 0x000000, "Member 'FSMTransitionConnectionValidator::AllowedConnections' has a wrong offset!");

// ScriptStruct SMSystem.SMNodeWidgetInfo
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSMNodeWidgetInfo
{
};
#pragma pack(pop)
static_assert(alignof(FSMNodeWidgetInfo) == 0x000001, "Wrong alignment on FSMNodeWidgetInfo");
static_assert(sizeof(FSMNodeWidgetInfo) == 0x000001, "Wrong size on FSMNodeWidgetInfo");

// ScriptStruct SMSystem.SMTextDisplayWidgetInfo
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSMTextDisplayWidgetInfo : public FSMNodeWidgetInfo
{
};
#pragma pack(pop)
static_assert(alignof(FSMTextDisplayWidgetInfo) == 0x000001, "Wrong alignment on FSMTextDisplayWidgetInfo");
static_assert(sizeof(FSMTextDisplayWidgetInfo) == 0x000001, "Wrong size on FSMTextDisplayWidgetInfo");

// ScriptStruct SMSystem.SMState
// 0x0030 (0x01E0 - 0x01B0)
struct FSMState final : public FSMState_Base
{
public:
	TArray<struct FSMExposedFunctionHandler>      BeginStateGraphEvaluator;                          // 0x01B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      UpdateStateGraphEvaluator;                         // 0x01C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      EndStateGraphEvaluator;                            // 0x01D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMState) == 0x000008, "Wrong alignment on FSMState");
static_assert(sizeof(FSMState) == 0x0001E0, "Wrong size on FSMState");
static_assert(offsetof(FSMState, BeginStateGraphEvaluator) == 0x0001B0, "Member 'FSMState::BeginStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMState, UpdateStateGraphEvaluator) == 0x0001C0, "Member 'FSMState::UpdateStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMState, EndStateGraphEvaluator) == 0x0001D0, "Member 'FSMState::EndStateGraphEvaluator' has a wrong offset!");

// ScriptStruct SMSystem.SMStateMachine
// 0x0170 (0x0320 - 0x01B0)
struct FSMStateMachine final : public FSMState_Base
{
public:
	uint8                                         bHasAdditionalLogic : 1;                           // 0x01B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReuseCurrentState : 1;                            // 0x01B0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOnlyReuseIfNotEndState : 1;                       // 0x01B0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowIndependentTick : 1;                         // 0x01B0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCallReferenceTickOnManualUpdate : 1;              // 0x01B0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWaitForEndState : 1;                              // 0x01B0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMExposedFunctionHandler>      BeginStateGraphEvaluator;                          // 0x01B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      UpdateStateGraphEvaluator;                         // 0x01C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      EndStateGraphEvaluator;                            // 0x01D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TScriptInterface<class ISMStateMachineNetworkedInterface> NetworkedInterface;                                // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F8[0xF0];                                     // 0x01F8(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReferencedStateMachineClass;                       // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ReferencedTemplateName;                            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   DynamicStateMachineReferenceVariable;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USMInstance*                            ReferencedStateMachine;                            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USMInstance*                            IsReferencedByInstance;                            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x10];                                     // 0x0310(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMStateMachine) == 0x000008, "Wrong alignment on FSMStateMachine");
static_assert(sizeof(FSMStateMachine) == 0x000320, "Wrong size on FSMStateMachine");
static_assert(offsetof(FSMStateMachine, BeginStateGraphEvaluator) == 0x0001B8, "Member 'FSMStateMachine::BeginStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, UpdateStateGraphEvaluator) == 0x0001C8, "Member 'FSMStateMachine::UpdateStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, EndStateGraphEvaluator) == 0x0001D8, "Member 'FSMStateMachine::EndStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, NetworkedInterface) == 0x0001E8, "Member 'FSMStateMachine::NetworkedInterface' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, ReferencedStateMachineClass) == 0x0002E8, "Member 'FSMStateMachine::ReferencedStateMachineClass' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, ReferencedTemplateName) == 0x0002F0, "Member 'FSMStateMachine::ReferencedTemplateName' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, DynamicStateMachineReferenceVariable) == 0x0002F8, "Member 'FSMStateMachine::DynamicStateMachineReferenceVariable' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, ReferencedStateMachine) == 0x000300, "Member 'FSMStateMachine::ReferencedStateMachine' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, IsReferencedByInstance) == 0x000308, "Member 'FSMStateMachine::IsReferencedByInstance' has a wrong offset!");

// ScriptStruct SMSystem.SMFullSyncTransaction
// 0x001D (0x0020 - 0x0003)
struct FSMFullSyncTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMFullSyncStateTransaction>    ActiveStates;                                      // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bHasStarted : 1;                                   // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFromUserLoad : 1;                                 // 0x0018(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMFullSyncTransaction) == 0x000008, "Wrong alignment on FSMFullSyncTransaction");
static_assert(sizeof(FSMFullSyncTransaction) == 0x000020, "Wrong size on FSMFullSyncTransaction");
static_assert(offsetof(FSMFullSyncTransaction, ActiveStates) == 0x000008, "Member 'FSMFullSyncTransaction::ActiveStates' has a wrong offset!");

// ScriptStruct SMSystem.SMActivateStateTransaction
// 0x0019 (0x001C - 0x0003)
struct FSMActivateStateTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  BaseGuid;                                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInState;                                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsActive : 1;                                     // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSetAllParents : 1;                                // 0x0018(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMActivateStateTransaction) == 0x000004, "Wrong alignment on FSMActivateStateTransaction");
static_assert(sizeof(FSMActivateStateTransaction) == 0x00001C, "Wrong size on FSMActivateStateTransaction");
static_assert(offsetof(FSMActivateStateTransaction, BaseGuid) == 0x000004, "Member 'FSMActivateStateTransaction::BaseGuid' has a wrong offset!");
static_assert(offsetof(FSMActivateStateTransaction, TimeInState) == 0x000014, "Member 'FSMActivateStateTransaction::TimeInState' has a wrong offset!");

// ScriptStruct SMSystem.SMTransitionTransaction
// 0x0035 (0x0038 - 0x0003)
struct FSMTransitionTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  BaseGuid;                                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGuid>                          AdditionalGuids;                                   // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                              Timestamp;                                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
