#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StunCameraModify_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass StunCameraModify_BP.StunCameraModify_BP_C
// 0x0AD8 (0x0B20 - 0x0048)
class UStunCameraModify_BP_C final : public UCameraModifier
{
public:
	struct FWeightedBlendables                    PostProcessMaterials;                              // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   StunPost;                                          // 0x0060(0x0560)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPostProcessSettings                   NoneStunPost;                                      // 0x05C0(0x0560)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BlueprintModifyPostProcess(float DeltaTime, float* PostProcessBlendWeight, struct FPostProcessSettings* PostProcessSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StunCameraModify_BP_C">();
	}
	static class UStunCameraModify_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStunCameraModify_BP_C>();
	}
};
static_assert(alignof(UStunCameraModify_BP_C) == 0x000010, "Wrong alignment on UStunCameraModify_BP_C");
static_assert(sizeof(UStunCameraModify_BP_C) == 0x000B20, "Wrong size on UStunCameraModify_BP_C");
static_assert(offsetof(UStunCameraModify_BP_C, PostProcessMaterials) == 0x000048, "Member 'UStunCameraModify_BP_C::PostProcessMaterials' has a wrong offset!");
static_assert(offsetof(UStunCameraModify_BP_C, StunPost) == 0x000060, "Member 'UStunCameraModify_BP_C::StunPost' has a wrong offset!");
static_assert(offsetof(UStunCameraModify_BP_C, NoneStunPost) == 0x0005C0, "Member 'UStunCameraModify_BP_C::NoneStunPost' has a wrong offset!");

}

