#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamInfo

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function TeamInfo.TeamInfo_C.ExecuteUbergraph_TeamInfo
// 0x0008 (0x0008 - 0x0000)
struct TeamInfo_C_ExecuteUbergraph_TeamInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamInfo_C_ExecuteUbergraph_TeamInfo) == 0x000004, "Wrong alignment on TeamInfo_C_ExecuteUbergraph_TeamInfo");
static_assert(sizeof(TeamInfo_C_ExecuteUbergraph_TeamInfo) == 0x000008, "Wrong size on TeamInfo_C_ExecuteUbergraph_TeamInfo");
static_assert(offsetof(TeamInfo_C_ExecuteUbergraph_TeamInfo, EntryPoint) == 0x000000, "Member 'TeamInfo_C_ExecuteUbergraph_TeamInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_ExecuteUbergraph_TeamInfo, K2Node_Event_IsDesignTime) == 0x000004, "Member 'TeamInfo_C_ExecuteUbergraph_TeamInfo::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function TeamInfo.TeamInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct TeamInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamInfo_C_PreConstruct) == 0x000001, "Wrong alignment on TeamInfo_C_PreConstruct");
static_assert(sizeof(TeamInfo_C_PreConstruct) == 0x000001, "Wrong size on TeamInfo_C_PreConstruct");
static_assert(offsetof(TeamInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'TeamInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function TeamInfo.TeamInfo_C.SetValues
// 0x0088 (0x0088 - 0x0000)
struct TeamInfo_C_SetValues final
{
public:
	bool                                          ChangeTeamMateCountMax;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TeamMateMax;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ChangeTeamMateCount;                               // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TeamMateCurrent;                                   // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ChangeTeam;                                        // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBTeam                                       IsBlueTeam;                                        // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBTeam                                       Temp_byte_Variable;                                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTeamName_Name;                         // 0x0048(0x0018)()
	class UTexture2D*                             Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamInfo_C_SetValues) == 0x000008, "Wrong alignment on TeamInfo_C_SetValues");
static_assert(sizeof(TeamInfo_C_SetValues) == 0x000088, "Wrong size on TeamInfo_C_SetValues");
static_assert(offsetof(TeamInfo_C_SetValues, ChangeTeamMateCountMax) == 0x000000, "Member 'TeamInfo_C_SetValues::ChangeTeamMateCountMax' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, TeamMateMax) == 0x000008, "Member 'TeamInfo_C_SetValues::TeamMateMax' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, ChangeTeamMateCount) == 0x000020, "Member 'TeamInfo_C_SetValues::ChangeTeamMateCount' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, TeamMateCurrent) == 0x000028, "Member 'TeamInfo_C_SetValues::TeamMateCurrent' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, ChangeTeam) == 0x000040, "Member 'TeamInfo_C_SetValues::ChangeTeam' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, IsBlueTeam) == 0x000041, "Member 'TeamInfo_C_SetValues::IsBlueTeam' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, Temp_byte_Variable) == 0x000042, "Member 'TeamInfo_C_SetValues::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, CallFunc_GetTeamName_Name) == 0x000048, "Member 'TeamInfo_C_SetValues::CallFunc_GetTeamName_Name' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, Temp_object_Variable) == 0x000060, "Member 'TeamInfo_C_SetValues::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, Temp_object_Variable_1) == 0x000068, "Member 'TeamInfo_C_SetValues::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, Temp_object_Variable_2) == 0x000070, "Member 'TeamInfo_C_SetValues::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, Temp_object_Variable_3) == 0x000078, "Member 'TeamInfo_C_SetValues::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(TeamInfo_C_SetValues, K2Node_Select_Default) == 0x000080, "Member 'TeamInfo_C_SetValues::K2Node_Select_Default' has a wrong offset!");

}

