#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamInfo

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamInfo.TeamInfo_C
// 0x0030 (0x0290 - 0x0260)
class UTeamInfo_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TeamCurrent;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TeamIcon;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TeamMax;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TeamName;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APBPlayerState*                         MyPlayerState;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TeamInfo(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetValues(bool ChangeTeamMateCountMax, const class FText& TeamMateMax, bool ChangeTeamMateCount, const class FText& TeamMateCurrent, bool ChangeTeam, EPBTeam IsBlueTeam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamInfo_C">();
	}
	static class UTeamInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamInfo_C>();
	}
};
static_assert(alignof(UTeamInfo_C) == 0x000008, "Wrong alignment on UTeamInfo_C");
static_assert(sizeof(UTeamInfo_C) == 0x000290, "Wrong size on UTeamInfo_C");
static_assert(offsetof(UTeamInfo_C, UberGraphFrame) == 0x000260, "Member 'UTeamInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamInfo_C, TeamCurrent) == 0x000268, "Member 'UTeamInfo_C::TeamCurrent' has a wrong offset!");
static_assert(offsetof(UTeamInfo_C, TeamIcon) == 0x000270, "Member 'UTeamInfo_C::TeamIcon' has a wrong offset!");
static_assert(offsetof(UTeamInfo_C, TeamMax) == 0x000278, "Member 'UTeamInfo_C::TeamMax' has a wrong offset!");
static_assert(offsetof(UTeamInfo_C, TeamName) == 0x000280, "Member 'UTeamInfo_C::TeamName' has a wrong offset!");
static_assert(offsetof(UTeamInfo_C, MyPlayerState) == 0x000288, "Member 'UTeamInfo_C::MyPlayerState' has a wrong offset!");

}

