#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TP82_Seletion_Mesh_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TP82_Seletion_Mesh_Skeleton_AnimBlueprint.TP82_Seletion_Mesh_Skeleton_AnimBlueprint_C
// 0x03E0 (0x06A0 - 0x02C0)
class UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x02F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0340(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x03C0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0408(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0450(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x04F0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0590(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0610(0x0080)()
	bool                                          isRightBarrel;                                     // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewVar_0;                                          // 0x0691(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsFullAmmo;                                       // 0x0692(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TP82_Seletion_Mesh_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TP82_Seletion_Mesh_Skeleton_AnimBlueprint_C">();
	}
	static class UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C) == 0x0006A0, "Wrong size on UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_2) == 0x0002F8, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_2) == 0x000340, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_1) == 0x0003C0, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000408, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendListByBool_1) == 0x000450, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendListByBool) == 0x0004F0, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_1) == 0x000590, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000610, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, isRightBarrel) == 0x000690, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::isRightBarrel' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, NewVar_0) == 0x000691, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C, bIsFullAmmo) == 0x000692, "Member 'UTP82_Seletion_Mesh_Skeleton_AnimBlueprint_C::bIsFullAmmo' has a wrong offset!");

}

