#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialBannerWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function TutorialBannerWidget.TutorialBannerWidget_C.ShowBanner
// 0x0020 (0x0020 - 0x0000)
struct TutorialBannerWidget_C_ShowBanner final
{
public:
	class FText                                   TargetTips;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutorialBannerWidget_C_ShowBanner) == 0x000008, "Wrong alignment on TutorialBannerWidget_C_ShowBanner");
static_assert(sizeof(TutorialBannerWidget_C_ShowBanner) == 0x000020, "Wrong size on TutorialBannerWidget_C_ShowBanner");
static_assert(offsetof(TutorialBannerWidget_C_ShowBanner, TargetTips) == 0x000000, "Member 'TutorialBannerWidget_C_ShowBanner::TargetTips' has a wrong offset!");
static_assert(offsetof(TutorialBannerWidget_C_ShowBanner, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'TutorialBannerWidget_C_ShowBanner::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function TutorialBannerWidget.TutorialBannerWidget_C.HideBanner
// 0x0008 (0x0008 - 0x0000)
struct TutorialBannerWidget_C_HideBanner final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutorialBannerWidget_C_HideBanner) == 0x000008, "Wrong alignment on TutorialBannerWidget_C_HideBanner");
static_assert(sizeof(TutorialBannerWidget_C_HideBanner) == 0x000008, "Wrong size on TutorialBannerWidget_C_HideBanner");
static_assert(offsetof(TutorialBannerWidget_C_HideBanner, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'TutorialBannerWidget_C_HideBanner::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function TutorialBannerWidget.TutorialBannerWidget_C.AddBannerButtonImage
// 0x0010 (0x0010 - 0x0000)
struct TutorialBannerWidget_C_AddBannerButtonImage final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutorialBannerWidget_C_AddBannerButtonImage) == 0x000008, "Wrong alignment on TutorialBannerWidget_C_AddBannerButtonImage");
static_assert(sizeof(TutorialBannerWidget_C_AddBannerButtonImage) == 0x000010, "Wrong size on TutorialBannerWidget_C_AddBannerButtonImage");
static_assert(offsetof(TutorialBannerWidget_C_AddBannerButtonImage, Content) == 0x000000, "Member 'TutorialBannerWidget_C_AddBannerButtonImage::Content' has a wrong offset!");
static_assert(offsetof(TutorialBannerWidget_C_AddBannerButtonImage, CallFunc_AddChild_ReturnValue) == 0x000008, "Member 'TutorialBannerWidget_C_AddBannerButtonImage::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function TutorialBannerWidget.TutorialBannerWidget_C.SetBannerText
// 0x0018 (0x0018 - 0x0000)
struct TutorialBannerWidget_C_SetBannerText final
{
public:
	class FText                                   BannerText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TutorialBannerWidget_C_SetBannerText) == 0x000008, "Wrong alignment on TutorialBannerWidget_C_SetBannerText");
static_assert(sizeof(TutorialBannerWidget_C_SetBannerText) == 0x000018, "Wrong size on TutorialBannerWidget_C_SetBannerText");
static_assert(offsetof(TutorialBannerWidget_C_SetBannerText, BannerText) == 0x000000, "Member 'TutorialBannerWidget_C_SetBannerText::BannerText' has a wrong offset!");

}

