#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialBannerWidget

#include "Basic.hpp"

#include "PBTutorialWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialBannerWidget.TutorialBannerWidget_C
// 0x0030 (0x0328 - 0x02F8)
class UTutorialBannerWidget_C final : public UPBTutorialWidget_C
{
public:
	class UWidgetAnimation*                       Visiable;                                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Black_BG;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Button_Image_Box;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_GameTIp2;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_180;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Tips;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ShowBanner(const class FText& TargetTips);
	void HideBanner();
	void AddBannerButtonImage(class UWidget* Content);
	void SetBannerText(class FText& BannerText);
	void ClearBannerButtonImage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialBannerWidget_C">();
	}
	static class UTutorialBannerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialBannerWidget_C>();
	}
};
static_assert(alignof(UTutorialBannerWidget_C) == 0x000008, "Wrong alignment on UTutorialBannerWidget_C");
static_assert(sizeof(UTutorialBannerWidget_C) == 0x000328, "Wrong size on UTutorialBannerWidget_C");
static_assert(offsetof(UTutorialBannerWidget_C, Visiable) == 0x0002F8, "Member 'UTutorialBannerWidget_C::Visiable' has a wrong offset!");
static_assert(offsetof(UTutorialBannerWidget_C, Black_BG) == 0x000300, "Member 'UTutorialBannerWidget_C::Black_BG' has a wrong offset!");
static_assert(offsetof(UTutorialBannerWidget_C, Button_Image_Box) == 0x000308, "Member 'UTutorialBannerWidget_C::Button_Image_Box' has a wrong offset!");
static_assert(offsetof(UTutorialBannerWidget_C, CanvasPanel_GameTIp2) == 0x000310, "Member 'UTutorialBannerWidget_C::CanvasPanel_GameTIp2' has a wrong offset!");
static_assert(offsetof(UTutorialBannerWidget_C, RichTextBlock_180) == 0x000318, "Member 'UTutorialBannerWidget_C::RichTextBlock_180' has a wrong offset!");
static_assert(offsetof(UTutorialBannerWidget_C, TextBlock_Tips) == 0x000320, "Member 'UTutorialBannerWidget_C::TextBlock_Tips' has a wrong offset!");

}

