#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tutorial_BlackFader

#include "Basic.hpp"

#include "InstantTutorial_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Tutorial_BlackFader.Tutorial_BlackFader_C.ExecuteUbergraph_Tutorial_BlackFader
// 0x0054 (0x0054 - 0x0000)
struct Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader) == 0x000004, "Wrong alignment on Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader");
static_assert(sizeof(Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader) == 0x000054, "Wrong size on Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader");
static_assert(offsetof(Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader, EntryPoint) == 0x000000, "Member 'Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader, K2Node_Event_IsDesignTime) == 0x000014, "Member 'Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader, K2Node_Event_MyGeometry) == 0x000018, "Member 'Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader, K2Node_Event_InDeltaTime) == 0x000050, "Member 'Tutorial_BlackFader_C_ExecuteUbergraph_Tutorial_BlackFader::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function Tutorial_BlackFader.Tutorial_BlackFader_C.Tick
// 0x003C (0x003C - 0x0000)
struct Tutorial_BlackFader_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_BlackFader_C_Tick) == 0x000004, "Wrong alignment on Tutorial_BlackFader_C_Tick");
static_assert(sizeof(Tutorial_BlackFader_C_Tick) == 0x00003C, "Wrong size on Tutorial_BlackFader_C_Tick");
static_assert(offsetof(Tutorial_BlackFader_C_Tick, MyGeometry) == 0x000000, "Member 'Tutorial_BlackFader_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_Tick, InDeltaTime) == 0x000038, "Member 'Tutorial_BlackFader_C_Tick::InDeltaTime' has a wrong offset!");

// Function Tutorial_BlackFader.Tutorial_BlackFader_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Tutorial_BlackFader_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tutorial_BlackFader_C_PreConstruct) == 0x000001, "Wrong alignment on Tutorial_BlackFader_C_PreConstruct");
static_assert(sizeof(Tutorial_BlackFader_C_PreConstruct) == 0x000001, "Wrong size on Tutorial_BlackFader_C_PreConstruct");
static_assert(offsetof(Tutorial_BlackFader_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Tutorial_BlackFader_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Tutorial_BlackFader.Tutorial_BlackFader_C.FadeEnterFunc
// 0x0010 (0x0010 - 0x0000)
struct Tutorial_BlackFader_C_FadeEnterFunc final
{
public:
	float                                         PlaybackSpeed;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_BlackFader_C_FadeEnterFunc) == 0x000008, "Wrong alignment on Tutorial_BlackFader_C_FadeEnterFunc");
static_assert(sizeof(Tutorial_BlackFader_C_FadeEnterFunc) == 0x000010, "Wrong size on Tutorial_BlackFader_C_FadeEnterFunc");
static_assert(offsetof(Tutorial_BlackFader_C_FadeEnterFunc, PlaybackSpeed) == 0x000000, "Member 'Tutorial_BlackFader_C_FadeEnterFunc::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_FadeEnterFunc, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'Tutorial_BlackFader_C_FadeEnterFunc::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function Tutorial_BlackFader.Tutorial_BlackFader_C.ShowIntro
// 0x00B0 (0x00B0 - 0x0000)
struct Tutorial_BlackFader_C_ShowIntro final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBGameStateMenu_BP_C*                  K2Node_DynamicCast_AsPBGame_State_Menu_BP;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInstantTutorial                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0078)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tutorial_BlackFader_C_ShowIntro) == 0x000008, "Wrong alignment on Tutorial_BlackFader_C_ShowIntro");
static_assert(sizeof(Tutorial_BlackFader_C_ShowIntro) == 0x0000B0, "Wrong size on Tutorial_BlackFader_C_ShowIntro");
static_assert(offsetof(Tutorial_BlackFader_C_ShowIntro, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'Tutorial_BlackFader_C_ShowIntro::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ShowIntro, K2Node_DynamicCast_AsPBGame_State_Menu_BP) == 0x000008, "Member 'Tutorial_BlackFader_C_ShowIntro::K2Node_DynamicCast_AsPBGame_State_Menu_BP' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ShowIntro, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Tutorial_BlackFader_C_ShowIntro::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ShowIntro, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'Tutorial_BlackFader_C_ShowIntro::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ShowIntro, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'Tutorial_BlackFader_C_ShowIntro::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ShowIntro, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'Tutorial_BlackFader_C_ShowIntro::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_ShowIntro, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A8, "Member 'Tutorial_BlackFader_C_ShowIntro::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function Tutorial_BlackFader.Tutorial_BlackFader_C.FadeQuitFunc
// 0x0010 (0x0010 - 0x0000)
struct Tutorial_BlackFader_C_FadeQuitFunc final
{
public:
	float                                         PlaybackSpeed;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_BlackFader_C_FadeQuitFunc) == 0x000008, "Wrong alignment on Tutorial_BlackFader_C_FadeQuitFunc");
static_assert(sizeof(Tutorial_BlackFader_C_FadeQuitFunc) == 0x000010, "Wrong size on Tutorial_BlackFader_C_FadeQuitFunc");
static_assert(offsetof(Tutorial_BlackFader_C_FadeQuitFunc, PlaybackSpeed) == 0x000000, "Member 'Tutorial_BlackFader_C_FadeQuitFunc::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(Tutorial_BlackFader_C_FadeQuitFunc, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'Tutorial_BlackFader_C_FadeQuitFunc::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

