#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialHintWidget

#include "Basic.hpp"

#include "PBTutorialWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialHintWidget.TutorialHintWidget_C
// 0x0030 (0x0328 - 0x02F8)
class UTutorialHintWidget_C final : public UPBTutorialWidget_C
{
public:
	class USizeBox*                               ButtonSpace;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_452;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      PBInputTipsImage_503;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TargetHintLine_1;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TargetText;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentAchieve;                                    // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalAchieve;                                      // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Finish_Format();
	void InitFormat();
	void ResetHintInfo();
	void TargetIsFinish(bool* IsFinish_0);
	void SetHintText(const class FText& HintText);
	void SetTargetFinish();
	void SetHintBtnIcon(class FName InputName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialHintWidget_C">();
	}
	static class UTutorialHintWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialHintWidget_C>();
	}
};
static_assert(alignof(UTutorialHintWidget_C) == 0x000008, "Wrong alignment on UTutorialHintWidget_C");
static_assert(sizeof(UTutorialHintWidget_C) == 0x000328, "Wrong size on UTutorialHintWidget_C");
static_assert(offsetof(UTutorialHintWidget_C, ButtonSpace) == 0x0002F8, "Member 'UTutorialHintWidget_C::ButtonSpace' has a wrong offset!");
static_assert(offsetof(UTutorialHintWidget_C, CheckBox_452) == 0x000300, "Member 'UTutorialHintWidget_C::CheckBox_452' has a wrong offset!");
static_assert(offsetof(UTutorialHintWidget_C, PBInputTipsImage_503) == 0x000308, "Member 'UTutorialHintWidget_C::PBInputTipsImage_503' has a wrong offset!");
static_assert(offsetof(UTutorialHintWidget_C, TargetHintLine_1) == 0x000310, "Member 'UTutorialHintWidget_C::TargetHintLine_1' has a wrong offset!");
static_assert(offsetof(UTutorialHintWidget_C, TextBlock_TargetText) == 0x000318, "Member 'UTutorialHintWidget_C::TextBlock_TargetText' has a wrong offset!");
static_assert(offsetof(UTutorialHintWidget_C, CurrentAchieve) == 0x000320, "Member 'UTutorialHintWidget_C::CurrentAchieve' has a wrong offset!");
static_assert(offsetof(UTutorialHintWidget_C, TotalAchieve) == 0x000324, "Member 'UTutorialHintWidget_C::TotalAchieve' has a wrong offset!");

}

