#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tutorial_BlackFader

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tutorial_BlackFader.Tutorial_BlackFader_C
// 0x0040 (0x02A0 - 0x0260)
class UTutorial_BlackFader_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeQuit;                                          // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeEnter;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_BG;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_39;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_192;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              FadeOutShowDispatcher;                             // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_Tutorial_BlackFader(int32 EntryPoint);
	void CustomEvent_0();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void FadeEnterFunc(float PlaybackSpeed);
	void AnimationEnd();
	void ShowIntro();
	void FadeQuitFunc(float PlaybackSpeed);
	void ShowIntroEnd();
	void SequenceEvent__ENTRYPOINTTutorial_BlackFader_0();
	void SequenceEvent__ENTRYPOINTTutorial_BlackFader_1();
	void SequenceEvent__ENTRYPOINTTutorial_BlackFader_2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tutorial_BlackFader_C">();
	}
	static class UTutorial_BlackFader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorial_BlackFader_C>();
	}
};
static_assert(alignof(UTutorial_BlackFader_C) == 0x000008, "Wrong alignment on UTutorial_BlackFader_C");
static_assert(sizeof(UTutorial_BlackFader_C) == 0x0002A0, "Wrong size on UTutorial_BlackFader_C");
static_assert(offsetof(UTutorial_BlackFader_C, UberGraphFrame) == 0x000260, "Member 'UTutorial_BlackFader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTutorial_BlackFader_C, FadeQuit) == 0x000268, "Member 'UTutorial_BlackFader_C::FadeQuit' has a wrong offset!");
static_assert(offsetof(UTutorial_BlackFader_C, FadeEnter) == 0x000270, "Member 'UTutorial_BlackFader_C::FadeEnter' has a wrong offset!");
static_assert(offsetof(UTutorial_BlackFader_C, Border_BG) == 0x000278, "Member 'UTutorial_BlackFader_C::Border_BG' has a wrong offset!");
static_assert(offsetof(UTutorial_BlackFader_C, TextBlock_39) == 0x000280, "Member 'UTutorial_BlackFader_C::TextBlock_39' has a wrong offset!");
static_assert(offsetof(UTutorial_BlackFader_C, TextBlock_192) == 0x000288, "Member 'UTutorial_BlackFader_C::TextBlock_192' has a wrong offset!");
static_assert(offsetof(UTutorial_BlackFader_C, FadeOutShowDispatcher) == 0x000290, "Member 'UTutorial_BlackFader_C::FadeOutShowDispatcher' has a wrong offset!");

}

