#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialMainWidget

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"
#include "PBTutorialWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialMainWidget.TutorialMainWidget_C
// 0x0080 (0x0378 - 0x02F8)
class UTutorialMainWidget_C final : public UPBTutorialWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TutorialMainWidget_C;               // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RefreshHint;                                       // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Finish;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Timer;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_UnFinish;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      Image_QuitHint;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TargetHint;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Subtitle_1;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_timer;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialBannerWidget_C*                TutorialBannerWidget;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialSubtitles_C*                   TutorialSubtitles;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialTimerWidget_C*                 TutorialTimerWidget;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Hint;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_TargetHint;                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_LeaveHint;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentBannerIndex;                                // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CurrentInputDevice;                                // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TutorialMainWidget(int32 EntryPoint);
	void Test();
	void OnInitialized();
	void Construct();
	void AddTargetHints();
	void TargetFinish(int32 FinishTargetNumber);
	void RefreshTimer(int32 CountDown);
	void InitTargetHint();
	void RefreshSubtitles(const class FText& SubtitlesText);
	void AddBannerButtonImage(class FName NewInputName);
	void SetBannerText(const class FText& BannerText);
	void RefreshBannerContent(const class FText& BannerText, class FName NewInputName);
	void ClearBannerButtonImage();
	void PlayBannerAnimation();
	void PlayTargetHintAnimation();
	void SetTargetHintCotent(const class FText& HintText, class FName InputName, int32 TargetNum);
	void BackToMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialMainWidget_C">();
	}
	static class UTutorialMainWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialMainWidget_C>();
	}
};
static_assert(alignof(UTutorialMainWidget_C) == 0x000008, "Wrong alignment on UTutorialMainWidget_C");
static_assert(sizeof(UTutorialMainWidget_C) == 0x000378, "Wrong size on UTutorialMainWidget_C");
static_assert(offsetof(UTutorialMainWidget_C, UberGraphFrame_TutorialMainWidget_C) == 0x0002F8, "Member 'UTutorialMainWidget_C::UberGraphFrame_TutorialMainWidget_C' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, RefreshHint) == 0x000300, "Member 'UTutorialMainWidget_C::RefreshHint' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, HorizontalBox_Finish) == 0x000308, "Member 'UTutorialMainWidget_C::HorizontalBox_Finish' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, HorizontalBox_Timer) == 0x000310, "Member 'UTutorialMainWidget_C::HorizontalBox_Timer' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, HorizontalBox_UnFinish) == 0x000318, "Member 'UTutorialMainWidget_C::HorizontalBox_UnFinish' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, Image_QuitHint) == 0x000320, "Member 'UTutorialMainWidget_C::Image_QuitHint' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, Overlay_TargetHint) == 0x000328, "Member 'UTutorialMainWidget_C::Overlay_TargetHint' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, Subtitle_1) == 0x000330, "Member 'UTutorialMainWidget_C::Subtitle_1' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, TextBlock_timer) == 0x000338, "Member 'UTutorialMainWidget_C::TextBlock_timer' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, TutorialBannerWidget) == 0x000340, "Member 'UTutorialMainWidget_C::TutorialBannerWidget' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, TutorialSubtitles) == 0x000348, "Member 'UTutorialMainWidget_C::TutorialSubtitles' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, TutorialTimerWidget) == 0x000350, "Member 'UTutorialMainWidget_C::TutorialTimerWidget' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, VerticalBox_Hint) == 0x000358, "Member 'UTutorialMainWidget_C::VerticalBox_Hint' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, VerticalBox_TargetHint) == 0x000360, "Member 'UTutorialMainWidget_C::VerticalBox_TargetHint' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, WidgetSwitcher_LeaveHint) == 0x000368, "Member 'UTutorialMainWidget_C::WidgetSwitcher_LeaveHint' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, CurrentBannerIndex) == 0x000370, "Member 'UTutorialMainWidget_C::CurrentBannerIndex' has a wrong offset!");
static_assert(offsetof(UTutorialMainWidget_C, CurrentInputDevice) == 0x000374, "Member 'UTutorialMainWidget_C::CurrentInputDevice' has a wrong offset!");

}

