#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialSubtitles

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TutorialSubtitles.TutorialSubtitles_C.ExecuteUbergraph_TutorialSubtitles
// 0x0020 (0x0020 - 0x0000)
struct TutorialSubtitles_C_ExecuteUbergraph_TutorialSubtitles final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_SubtitlesText1;                 // 0x0008(0x0018)()
};
static_assert(alignof(TutorialSubtitles_C_ExecuteUbergraph_TutorialSubtitles) == 0x000008, "Wrong alignment on TutorialSubtitles_C_ExecuteUbergraph_TutorialSubtitles");
static_assert(sizeof(TutorialSubtitles_C_ExecuteUbergraph_TutorialSubtitles) == 0x000020, "Wrong size on TutorialSubtitles_C_ExecuteUbergraph_TutorialSubtitles");
static_assert(offsetof(TutorialSubtitles_C_ExecuteUbergraph_TutorialSubtitles, EntryPoint) == 0x000000, "Member 'TutorialSubtitles_C_ExecuteUbergraph_TutorialSubtitles::EntryPoint' has a wrong offset!");
static_assert(offsetof(TutorialSubtitles_C_ExecuteUbergraph_TutorialSubtitles, K2Node_CustomEvent_SubtitlesText1) == 0x000008, "Member 'TutorialSubtitles_C_ExecuteUbergraph_TutorialSubtitles::K2Node_CustomEvent_SubtitlesText1' has a wrong offset!");

// Function TutorialSubtitles.TutorialSubtitles_C.UpdateSubtitles
// 0x0018 (0x0018 - 0x0000)
struct TutorialSubtitles_C_UpdateSubtitles final
{
public:
	class FText                                   SubtitlesText1;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(TutorialSubtitles_C_UpdateSubtitles) == 0x000008, "Wrong alignment on TutorialSubtitles_C_UpdateSubtitles");
static_assert(sizeof(TutorialSubtitles_C_UpdateSubtitles) == 0x000018, "Wrong size on TutorialSubtitles_C_UpdateSubtitles");
static_assert(offsetof(TutorialSubtitles_C_UpdateSubtitles, SubtitlesText1) == 0x000000, "Member 'TutorialSubtitles_C_UpdateSubtitles::SubtitlesText1' has a wrong offset!");

// Function TutorialSubtitles.TutorialSubtitles_C.SetSubtitle
// 0x0018 (0x0018 - 0x0000)
struct TutorialSubtitles_C_SetSubtitle final
{
public:
	class FText                                   SubtitleText;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(TutorialSubtitles_C_SetSubtitle) == 0x000008, "Wrong alignment on TutorialSubtitles_C_SetSubtitle");
static_assert(sizeof(TutorialSubtitles_C_SetSubtitle) == 0x000018, "Wrong size on TutorialSubtitles_C_SetSubtitle");
static_assert(offsetof(TutorialSubtitles_C_SetSubtitle, SubtitleText) == 0x000000, "Member 'TutorialSubtitles_C_SetSubtitle::SubtitleText' has a wrong offset!");

// Function TutorialSubtitles.TutorialSubtitles_C.SetIcon
// 0x0090 (0x0090 - 0x0000)
struct TutorialSubtitles_C_SetIcon final
{
public:
	class UTexture2D*                             NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0088)()
};
static_assert(alignof(TutorialSubtitles_C_SetIcon) == 0x000008, "Wrong alignment on TutorialSubtitles_C_SetIcon");
static_assert(sizeof(TutorialSubtitles_C_SetIcon) == 0x000090, "Wrong size on TutorialSubtitles_C_SetIcon");
static_assert(offsetof(TutorialSubtitles_C_SetIcon, NewParam) == 0x000000, "Member 'TutorialSubtitles_C_SetIcon::NewParam' has a wrong offset!");
static_assert(offsetof(TutorialSubtitles_C_SetIcon, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'TutorialSubtitles_C_SetIcon::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

