#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialSubtitles

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PBTutorialWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialSubtitles.TutorialSubtitles_C
// 0x0030 (0x0328 - 0x02F8)
class UTutorialSubtitles_C final : public UPBTutorialWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TutorialSubtitles_C;                // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Black_BG;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_136;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Subtitle;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TutorialSubtitles(int32 EntryPoint);
	void UpdateSubtitles(const class FText& SubtitlesText1);
	void Construct();
	void SetSubtitle(const class FText& SubtitleText);
	void SetIcon(class UTexture2D* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialSubtitles_C">();
	}
	static class UTutorialSubtitles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialSubtitles_C>();
	}
};
static_assert(alignof(UTutorialSubtitles_C) == 0x000008, "Wrong alignment on UTutorialSubtitles_C");
static_assert(sizeof(UTutorialSubtitles_C) == 0x000328, "Wrong size on UTutorialSubtitles_C");
static_assert(offsetof(UTutorialSubtitles_C, UberGraphFrame_TutorialSubtitles_C) == 0x0002F8, "Member 'UTutorialSubtitles_C::UberGraphFrame_TutorialSubtitles_C' has a wrong offset!");
static_assert(offsetof(UTutorialSubtitles_C, Flash) == 0x000300, "Member 'UTutorialSubtitles_C::Flash' has a wrong offset!");
static_assert(offsetof(UTutorialSubtitles_C, Black_BG) == 0x000308, "Member 'UTutorialSubtitles_C::Black_BG' has a wrong offset!");
static_assert(offsetof(UTutorialSubtitles_C, Image_Icon) == 0x000310, "Member 'UTutorialSubtitles_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UTutorialSubtitles_C, RichTextBlock_136) == 0x000318, "Member 'UTutorialSubtitles_C::RichTextBlock_136' has a wrong offset!");
static_assert(offsetof(UTutorialSubtitles_C, Subtitle) == 0x000320, "Member 'UTutorialSubtitles_C::Subtitle' has a wrong offset!");

}

