#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialLevelManager

#include "Basic.hpp"

#include "TutorialStateEnum_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TutorialLevelManager.TutorialLevelManager_C
// 0x0090 (0x02B0 - 0x0220)
class ATutorialLevelManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         InWhichLevel;                                      // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTutorial_BlackFader_C*                 FaderWidget;                                       // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETutorialStateEnum                            LevelState;                                        // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WaitingCountDown;                                  // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTutorialMainWidget_C*                  MainWidget;                                        // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              DispatcherLoadStreamLevel;                         // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   CurretnLevel;                                      // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IdleCountDown;                                     // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATutorialLevel_Root_C*                  CurrentLevelActor;                                 // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              DispatcherLoadLevelFinish;                         // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           TimerHandle_PlayVideo;                             // 0x0288(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimeHandle_WaitForIdle;                            // 0x0290(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle_WaitingForNextLevel;                   // 0x0298(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              DispatcherResetPlayerTransform;                    // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_TutorialLevelManager(int32 EntryPoint);
	void BindEventWhenLevelShown();
	void EventLevelLoadFinish();
	void UnloadStreamLevel();
	void ReceiveBeginPlay();
	void LoadStreamLevel();
	void ReceiveTick(float DeltaSeconds);
	void PrepareEnterStreamTrainingLevel(int32 LevelOrder, class UUserWidget* FromWidget);
	void EnterStreamTrainingLevel();
	void Fader_Enter_Show();
	void Fader_Quit_Show();
	class UTutorial_BlackFader_C* Create_Fader_Widget();
	void RefreshLevelState(ETutorialStateEnum LevelState_0);
	void WaitingForNextLevel();
	void InitLevel();
	void Leavel_Tutorial();
	void Init_Widget();
	void Spawn_Level_Actor();
	void Wait_ForIdle();
	void PreparSwitchLevel();
	void SwitchLevel();
	void LoadSubLevel();
	void PlayVideo();
	void VideoEndReached();
	void VideoOpened(const class FString& OpenedUrl);
	void RemoveFaderWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialLevelManager_C">();
	}
	static class ATutorialLevelManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATutorialLevelManager_C>();
	}
};
static_assert(alignof(ATutorialLevelManager_C) == 0x000008, "Wrong alignment on ATutorialLevelManager_C");
static_assert(sizeof(ATutorialLevelManager_C) == 0x0002B0, "Wrong size on ATutorialLevelManager_C");
static_assert(offsetof(ATutorialLevelManager_C, UberGraphFrame) == 0x000220, "Member 'ATutorialLevelManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, DefaultSceneRoot) == 0x000228, "Member 'ATutorialLevelManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, InWhichLevel) == 0x000230, "Member 'ATutorialLevelManager_C::InWhichLevel' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, FaderWidget) == 0x000238, "Member 'ATutorialLevelManager_C::FaderWidget' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, LevelState) == 0x000240, "Member 'ATutorialLevelManager_C::LevelState' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, WaitingCountDown) == 0x000244, "Member 'ATutorialLevelManager_C::WaitingCountDown' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, MainWidget) == 0x000248, "Member 'ATutorialLevelManager_C::MainWidget' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, DispatcherLoadStreamLevel) == 0x000250, "Member 'ATutorialLevelManager_C::DispatcherLoadStreamLevel' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, CurretnLevel) == 0x000260, "Member 'ATutorialLevelManager_C::CurretnLevel' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, IdleCountDown) == 0x000268, "Member 'ATutorialLevelManager_C::IdleCountDown' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, CurrentLevelActor) == 0x000270, "Member 'ATutorialLevelManager_C::CurrentLevelActor' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, DispatcherLoadLevelFinish) == 0x000278, "Member 'ATutorialLevelManager_C::DispatcherLoadLevelFinish' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, TimerHandle_PlayVideo) == 0x000288, "Member 'ATutorialLevelManager_C::TimerHandle_PlayVideo' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, TimeHandle_WaitForIdle) == 0x000290, "Member 'ATutorialLevelManager_C::TimeHandle_WaitForIdle' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, TimerHandle_WaitingForNextLevel) == 0x000298, "Member 'ATutorialLevelManager_C::TimerHandle_WaitingForNextLevel' has a wrong offset!");
static_assert(offsetof(ATutorialLevelManager_C, DispatcherResetPlayerTransform) == 0x0002A0, "Member 'ATutorialLevelManager_C::DispatcherResetPlayerTransform' has a wrong offset!");

}

