#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ColorPalettes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct UI_ColorPalettes.UI_ColorPalettes
// 0x00A0 (0x00A0 - 0x0000)
struct FUI_ColorPalettes final
{
public:
	struct FLinearColor                           HighlightBlue_2_D529F917475111E1C11B37A8BF8014C7;  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HightOrange_14_875E507B4C0B6E0AC198B89C36508C01;   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PaleWhite_4_A44EC7154A2A108D07B8F28589D4B2F3;      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PaleBlack_8_D111547340381105F5CA4780D232E502;      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PaleWhite_Transparent_24_12289C664A266F3AFA874B9D2CE8C32C; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PaleBlack_Transparent_23_8F9EB3D54783A49CB417A1A33F28120D; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TrueWhite_16_3AF894E146FA84C16BEEE5B4E7299DD5;     // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TrueBlack_18_CC1530B841D2956BC87B02BFBA65F027;     // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Transparent_White_27_38DDCE434155D3E5994B069CDF49C7B2; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Transparent_Black_28_C90A39C74AE8315204C676989554322A; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUI_ColorPalettes) == 0x000004, "Wrong alignment on FUI_ColorPalettes");
static_assert(sizeof(FUI_ColorPalettes) == 0x0000A0, "Wrong size on FUI_ColorPalettes");
static_assert(offsetof(FUI_ColorPalettes, HighlightBlue_2_D529F917475111E1C11B37A8BF8014C7) == 0x000000, "Member 'FUI_ColorPalettes::HighlightBlue_2_D529F917475111E1C11B37A8BF8014C7' has a wrong offset!");
static_assert(offsetof(FUI_ColorPalettes, HightOrange_14_875E507B4C0B6E0AC198B89C36508C01) == 0x000010, "Member 'FUI_ColorPalettes::HightOrange_14_875E507B4C0B6E0AC198B89C36508C01' has a wrong offset!");
static_assert(offsetof(FUI_ColorPalettes, PaleWhite_4_A44EC7154A2A108D07B8F28589D4B2F3) == 0x000020, "Member 'FUI_ColorPalettes::PaleWhite_4_A44EC7154A2A108D07B8F28589D4B2F3' has a wrong offset!");
static_assert(offsetof(FUI_ColorPalettes, PaleBlack_8_D111547340381105F5CA4780D232E502) == 0x000030, "Member 'FUI_ColorPalettes::PaleBlack_8_D111547340381105F5CA4780D232E502' has a wrong offset!");
static_assert(offsetof(FUI_ColorPalettes, PaleWhite_Transparent_24_12289C664A266F3AFA874B9D2CE8C32C) == 0x000040, "Member 'FUI_ColorPalettes::PaleWhite_Transparent_24_12289C664A266F3AFA874B9D2CE8C32C' has a wrong offset!");
static_assert(offsetof(FUI_ColorPalettes, PaleBlack_Transparent_23_8F9EB3D54783A49CB417A1A33F28120D) == 0x000050, "Member 'FUI_ColorPalettes::PaleBlack_Transparent_23_8F9EB3D54783A49CB417A1A33F28120D' has a wrong offset!");
static_assert(offsetof(FUI_ColorPalettes, TrueWhite_16_3AF894E146FA84C16BEEE5B4E7299DD5) == 0x000060, "Member 'FUI_ColorPalettes::TrueWhite_16_3AF894E146FA84C16BEEE5B4E7299DD5' has a wrong offset!");
static_assert(offsetof(FUI_ColorPalettes, TrueBlack_18_CC1530B841D2956BC87B02BFBA65F027) == 0x000070, "Member 'FUI_ColorPalettes::TrueBlack_18_CC1530B841D2956BC87B02BFBA65F027' has a wrong offset!");
static_assert(offsetof(FUI_ColorPalettes, Transparent_White_27_38DDCE434155D3E5994B069CDF49C7B2) == 0x000080, "Member 'FUI_ColorPalettes::Transparent_White_27_38DDCE434155D3E5994B069CDF49C7B2' has a wrong offset!");
static_assert(offsetof(FUI_ColorPalettes, Transparent_Black_28_C90A39C74AE8315204C676989554322A) == 0x000090, "Member 'FUI_ColorPalettes::Transparent_Black_28_C90A39C74AE8315204C676989554322A' has a wrong offset!");

}

