#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MenuTitle

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MenuTitle.UI_MenuTitle_C
// 0x0060 (0x02C0 - 0x0260)
class UUI_MenuTitle_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Switch_Next;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             FrameTitle;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LatticeBG;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MainHorizantalBox;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainTitle;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleImage;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MainTitleText;                                     // 0x0298(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             TitleImageTexture;                                 // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsHaveTab;                                         // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UI_MenuTitle(int32 EntryPoint);
	void SetInfo(const class FText& TitleText);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MenuTitle_C">();
	}
	static class UUI_MenuTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MenuTitle_C>();
	}
};
static_assert(alignof(UUI_MenuTitle_C) == 0x000008, "Wrong alignment on UUI_MenuTitle_C");
static_assert(sizeof(UUI_MenuTitle_C) == 0x0002C0, "Wrong size on UUI_MenuTitle_C");
static_assert(offsetof(UUI_MenuTitle_C, UberGraphFrame) == 0x000260, "Member 'UUI_MenuTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_C, Switch_Next) == 0x000268, "Member 'UUI_MenuTitle_C::Switch_Next' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_C, FrameTitle) == 0x000270, "Member 'UUI_MenuTitle_C::FrameTitle' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_C, LatticeBG) == 0x000278, "Member 'UUI_MenuTitle_C::LatticeBG' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_C, MainHorizantalBox) == 0x000280, "Member 'UUI_MenuTitle_C::MainHorizantalBox' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_C, MainTitle) == 0x000288, "Member 'UUI_MenuTitle_C::MainTitle' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_C, TitleImage) == 0x000290, "Member 'UUI_MenuTitle_C::TitleImage' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_C, MainTitleText) == 0x000298, "Member 'UUI_MenuTitle_C::MainTitleText' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_C, TitleImageTexture) == 0x0002B0, "Member 'UUI_MenuTitle_C::TitleImageTexture' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_C, IsHaveTab) == 0x0002B8, "Member 'UUI_MenuTitle_C::IsHaveTab' has a wrong offset!");

}

