#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MenuTitle

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_MenuTitle.UI_MenuTitle_C.ExecuteUbergraph_UI_MenuTitle
// 0x0040 (0x0040 - 0x0000)
struct UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0008(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_TitleText;                      // 0x0028(0x0018)()
};
static_assert(alignof(UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle) == 0x000008, "Wrong alignment on UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle");
static_assert(sizeof(UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle) == 0x000040, "Wrong size on UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle");
static_assert(offsetof(UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle, EntryPoint) == 0x000000, "Member 'UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle, CallFunc_TextToUpper_ReturnValue) == 0x000008, "Member 'UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle, K2Node_CustomEvent_TitleText) == 0x000028, "Member 'UI_MenuTitle_C_ExecuteUbergraph_UI_MenuTitle::K2Node_CustomEvent_TitleText' has a wrong offset!");

// Function UI_MenuTitle.UI_MenuTitle_C.SetInfo
// 0x0018 (0x0018 - 0x0000)
struct UI_MenuTitle_C_SetInfo final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_MenuTitle_C_SetInfo) == 0x000008, "Wrong alignment on UI_MenuTitle_C_SetInfo");
static_assert(sizeof(UI_MenuTitle_C_SetInfo) == 0x000018, "Wrong size on UI_MenuTitle_C_SetInfo");
static_assert(offsetof(UI_MenuTitle_C_SetInfo, TitleText) == 0x000000, "Member 'UI_MenuTitle_C_SetInfo::TitleText' has a wrong offset!");

// Function UI_MenuTitle.UI_MenuTitle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_MenuTitle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_MenuTitle_C_PreConstruct) == 0x000001, "Wrong alignment on UI_MenuTitle_C_PreConstruct");
static_assert(sizeof(UI_MenuTitle_C_PreConstruct) == 0x000001, "Wrong size on UI_MenuTitle_C_PreConstruct");
static_assert(offsetof(UI_MenuTitle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_MenuTitle_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

