#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MenuTitle_Small

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MainMenuWidget_Base_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MenuTitle_Small.UI_MenuTitle_Small_C
// 0x0158 (0x0448 - 0x02F0)
class UUI_MenuTitle_Small_C final : public UMainMenuWidget_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_MenuTitle_Small_C;               // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomLine;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CoundBox;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Count1;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Count2;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeyTip;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               KeyTipBox;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                KeyTipButton;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyTipIcon;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_101;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title_Text;                                        // 0x0350(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsHaveCountBox;                                    // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinWidth;                                          // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         CurrentNum;                                        // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MaxNum;                                            // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           BottomLine_Color_L;                                // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           BottomLine_Color_R;                                // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            CountTextColor;                                    // 0x0398(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            TitleTextColor;                                    // 0x03C0(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsHaveKeyTipBox;                                   // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KeyTipText;                                        // 0x03F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             KeyTipIconTexture;                                 // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            KeyTipTextColor;                                   // 0x0410(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              KeyTipButtonDispatcher;                            // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UI_MenuTitle_Small(int32 EntryPoint);
	void Construct();
	void FlashOn(bool On);
	void BndEvt__KeyTipButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void SetKeyTipBox(bool bIsHaveKeyTipBox, const class FText& KeyTipText_0, class UTexture2D* KeyTipIconTexture_0);
	void PreConstruct(bool IsDesignTime);
	void SetTitle(const class FText& Title_0);
	void SetCountBox(bool bIsHaveCountBox, int32 CurrentNum_0, int32 MaxNum_0);
	void SetInfo(const class FText& InText, bool IsHaveCountBox_0, int32 Numer, int32 Denomin);
	void ShowInPanel();
	void ShowOutPanel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MenuTitle_Small_C">();
	}
	static class UUI_MenuTitle_Small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MenuTitle_Small_C>();
	}
};
static_assert(alignof(UUI_MenuTitle_Small_C) == 0x000008, "Wrong alignment on UUI_MenuTitle_Small_C");
static_assert(sizeof(UUI_MenuTitle_Small_C) == 0x000448, "Wrong size on UUI_MenuTitle_Small_C");
static_assert(offsetof(UUI_MenuTitle_Small_C, UberGraphFrame_UI_MenuTitle_Small_C) == 0x0002F0, "Member 'UUI_MenuTitle_Small_C::UberGraphFrame_UI_MenuTitle_Small_C' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, Flash) == 0x0002F8, "Member 'UUI_MenuTitle_Small_C::Flash' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, BottomLine) == 0x000300, "Member 'UUI_MenuTitle_Small_C::BottomLine' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, CoundBox) == 0x000308, "Member 'UUI_MenuTitle_Small_C::CoundBox' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, Count1) == 0x000310, "Member 'UUI_MenuTitle_Small_C::Count1' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, Count2) == 0x000318, "Member 'UUI_MenuTitle_Small_C::Count2' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, KeyTip) == 0x000320, "Member 'UUI_MenuTitle_Small_C::KeyTip' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, KeyTipBox) == 0x000328, "Member 'UUI_MenuTitle_Small_C::KeyTipBox' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, KeyTipButton) == 0x000330, "Member 'UUI_MenuTitle_Small_C::KeyTipButton' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, KeyTipIcon) == 0x000338, "Member 'UUI_MenuTitle_Small_C::KeyTipIcon' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, SizeBox_101) == 0x000340, "Member 'UUI_MenuTitle_Small_C::SizeBox_101' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, Title) == 0x000348, "Member 'UUI_MenuTitle_Small_C::Title' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, Title_Text) == 0x000350, "Member 'UUI_MenuTitle_Small_C::Title_Text' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, IsHaveCountBox) == 0x000368, "Member 'UUI_MenuTitle_Small_C::IsHaveCountBox' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, MinWidth) == 0x00036C, "Member 'UUI_MenuTitle_Small_C::MinWidth' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, CurrentNum) == 0x000370, "Member 'UUI_MenuTitle_Small_C::CurrentNum' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, MaxNum) == 0x000374, "Member 'UUI_MenuTitle_Small_C::MaxNum' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, BottomLine_Color_L) == 0x000378, "Member 'UUI_MenuTitle_Small_C::BottomLine_Color_L' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, BottomLine_Color_R) == 0x000388, "Member 'UUI_MenuTitle_Small_C::BottomLine_Color_R' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, CountTextColor) == 0x000398, "Member 'UUI_MenuTitle_Small_C::CountTextColor' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, TitleTextColor) == 0x0003C0, "Member 'UUI_MenuTitle_Small_C::TitleTextColor' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, IsHaveKeyTipBox) == 0x0003E8, "Member 'UUI_MenuTitle_Small_C::IsHaveKeyTipBox' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, KeyTipText) == 0x0003F0, "Member 'UUI_MenuTitle_Small_C::KeyTipText' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, KeyTipIconTexture) == 0x000408, "Member 'UUI_MenuTitle_Small_C::KeyTipIconTexture' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, KeyTipTextColor) == 0x000410, "Member 'UUI_MenuTitle_Small_C::KeyTipTextColor' has a wrong offset!");
static_assert(offsetof(UUI_MenuTitle_Small_C, KeyTipButtonDispatcher) == 0x000438, "Member 'UUI_MenuTitle_Small_C::KeyTipButtonDispatcher' has a wrong offset!");

}

