#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MenuTitle_Small

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_MenuTitle_Small.UI_MenuTitle_Small_C.ExecuteUbergraph_UI_MenuTitle_Small
// 0x0110 (0x0110 - 0x0000)
struct UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0010(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0030(0x0018)()
	bool                                          K2Node_CustomEvent_IsHaveCountBox;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Numer;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Denomin;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0070(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsHaveCountBox;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CurrentNum;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaxNum;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Title;                          // 0x00A0(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsHaveKeyTipBox;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_KeyTipText;                     // 0x00C0(0x0018)()
	class UTexture2D*                             K2Node_CustomEvent_KeyTipIconTexture;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x00E0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small) == 0x000008, "Wrong alignment on UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small");
static_assert(sizeof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small) == 0x000110, "Wrong size on UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, EntryPoint) == 0x000000, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, Temp_bool_Variable) == 0x000004, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, Temp_byte_Variable) == 0x000005, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, Temp_byte_Variable_1) == 0x000006, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, Temp_bool_Variable_1) == 0x000007, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, Temp_byte_Variable_2) == 0x000008, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, Temp_byte_Variable_3) == 0x000009, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, CallFunc_TextToUpper_ReturnValue) == 0x000010, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_Select_Default) == 0x000028, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_InText) == 0x000030, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_IsHaveCountBox) == 0x000048, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_IsHaveCountBox' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_Numer) == 0x00004C, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_Numer' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_Denomin) == 0x000050, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_Denomin' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, CallFunc_Conv_IntToText_ReturnValue) == 0x000058, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000070, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_bIsHaveCountBox) == 0x000090, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_bIsHaveCountBox' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_CurrentNum) == 0x000094, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_CurrentNum' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_MaxNum) == 0x000098, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_MaxNum' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_Title) == 0x0000A0, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_Title' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_Event_IsDesignTime) == 0x0000B8, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_bIsHaveKeyTipBox) == 0x0000B9, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_bIsHaveKeyTipBox' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_KeyTipText) == 0x0000C0, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_KeyTipText' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_KeyTipIconTexture) == 0x0000D8, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_KeyTipIconTexture' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, CallFunc_TextToUpper_ReturnValue_1) == 0x0000E0, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_Select_Default_1) == 0x0000F8, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, K2Node_CustomEvent_On) == 0x0000F9, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, CallFunc_PlayAnimation_ReturnValue) == 0x000100, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small, CallFunc_PlayAnimation_ReturnValue_1) == 0x000108, "Member 'UI_MenuTitle_Small_C_ExecuteUbergraph_UI_MenuTitle_Small::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function UI_MenuTitle_Small.UI_MenuTitle_Small_C.FlashOn
// 0x0001 (0x0001 - 0x0000)
struct UI_MenuTitle_Small_C_FlashOn final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_MenuTitle_Small_C_FlashOn) == 0x000001, "Wrong alignment on UI_MenuTitle_Small_C_FlashOn");
static_assert(sizeof(UI_MenuTitle_Small_C_FlashOn) == 0x000001, "Wrong size on UI_MenuTitle_Small_C_FlashOn");
static_assert(offsetof(UI_MenuTitle_Small_C_FlashOn, On) == 0x000000, "Member 'UI_MenuTitle_Small_C_FlashOn::On' has a wrong offset!");

// Function UI_MenuTitle_Small.UI_MenuTitle_Small_C.SetKeyTipBox
// 0x0028 (0x0028 - 0x0000)
struct UI_MenuTitle_Small_C_SetKeyTipBox final
{
public:
	bool                                          bIsHaveKeyTipBox;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KeyTipText_0;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             KeyTipIconTexture_0;                               // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MenuTitle_Small_C_SetKeyTipBox) == 0x000008, "Wrong alignment on UI_MenuTitle_Small_C_SetKeyTipBox");
static_assert(sizeof(UI_MenuTitle_Small_C_SetKeyTipBox) == 0x000028, "Wrong size on UI_MenuTitle_Small_C_SetKeyTipBox");
static_assert(offsetof(UI_MenuTitle_Small_C_SetKeyTipBox, bIsHaveKeyTipBox) == 0x000000, "Member 'UI_MenuTitle_Small_C_SetKeyTipBox::bIsHaveKeyTipBox' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_SetKeyTipBox, KeyTipText_0) == 0x000008, "Member 'UI_MenuTitle_Small_C_SetKeyTipBox::KeyTipText_0' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_SetKeyTipBox, KeyTipIconTexture_0) == 0x000020, "Member 'UI_MenuTitle_Small_C_SetKeyTipBox::KeyTipIconTexture_0' has a wrong offset!");

// Function UI_MenuTitle_Small.UI_MenuTitle_Small_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_MenuTitle_Small_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_MenuTitle_Small_C_PreConstruct) == 0x000001, "Wrong alignment on UI_MenuTitle_Small_C_PreConstruct");
static_assert(sizeof(UI_MenuTitle_Small_C_PreConstruct) == 0x000001, "Wrong size on UI_MenuTitle_Small_C_PreConstruct");
static_assert(offsetof(UI_MenuTitle_Small_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_MenuTitle_Small_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_MenuTitle_Small.UI_MenuTitle_Small_C.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct UI_MenuTitle_Small_C_SetTitle final
{
public:
	class FText                                   Title_0;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_MenuTitle_Small_C_SetTitle) == 0x000008, "Wrong alignment on UI_MenuTitle_Small_C_SetTitle");
static_assert(sizeof(UI_MenuTitle_Small_C_SetTitle) == 0x000018, "Wrong size on UI_MenuTitle_Small_C_SetTitle");
static_assert(offsetof(UI_MenuTitle_Small_C_SetTitle, Title_0) == 0x000000, "Member 'UI_MenuTitle_Small_C_SetTitle::Title_0' has a wrong offset!");

// Function UI_MenuTitle_Small.UI_MenuTitle_Small_C.SetCountBox
// 0x000C (0x000C - 0x0000)
struct UI_MenuTitle_Small_C_SetCountBox final
{
public:
	bool                                          bIsHaveCountBox;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentNum_0;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNum_0;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MenuTitle_Small_C_SetCountBox) == 0x000004, "Wrong alignment on UI_MenuTitle_Small_C_SetCountBox");
static_assert(sizeof(UI_MenuTitle_Small_C_SetCountBox) == 0x00000C, "Wrong size on UI_MenuTitle_Small_C_SetCountBox");
static_assert(offsetof(UI_MenuTitle_Small_C_SetCountBox, bIsHaveCountBox) == 0x000000, "Member 'UI_MenuTitle_Small_C_SetCountBox::bIsHaveCountBox' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_SetCountBox, CurrentNum_0) == 0x000004, "Member 'UI_MenuTitle_Small_C_SetCountBox::CurrentNum_0' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_SetCountBox, MaxNum_0) == 0x000008, "Member 'UI_MenuTitle_Small_C_SetCountBox::MaxNum_0' has a wrong offset!");

// Function UI_MenuTitle_Small.UI_MenuTitle_Small_C.SetInfo
// 0x0028 (0x0028 - 0x0000)
struct UI_MenuTitle_Small_C_SetInfo final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsHaveCountBox_0;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Numer;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Denomin;                                           // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MenuTitle_Small_C_SetInfo) == 0x000008, "Wrong alignment on UI_MenuTitle_Small_C_SetInfo");
static_assert(sizeof(UI_MenuTitle_Small_C_SetInfo) == 0x000028, "Wrong size on UI_MenuTitle_Small_C_SetInfo");
static_assert(offsetof(UI_MenuTitle_Small_C_SetInfo, InText) == 0x000000, "Member 'UI_MenuTitle_Small_C_SetInfo::InText' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_SetInfo, IsHaveCountBox_0) == 0x000018, "Member 'UI_MenuTitle_Small_C_SetInfo::IsHaveCountBox_0' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_SetInfo, Numer) == 0x00001C, "Member 'UI_MenuTitle_Small_C_SetInfo::Numer' has a wrong offset!");
static_assert(offsetof(UI_MenuTitle_Small_C_SetInfo, Denomin) == 0x000020, "Member 'UI_MenuTitle_Small_C_SetInfo::Denomin' has a wrong offset!");

}

