#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DisplayModeFilterButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_DisplayModeFilterButton.UMG_DisplayModeFilterButton_C
// 0x0048 (0x02A8 - 0x0260)
class UUMG_DisplayModeFilterButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Filter;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_652;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BottomSelect;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Filter;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Click;                                             // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_DisplayModeFilterButton(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply On_Border_Filter_MouseButtonUp_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Set_Hide(bool bHide);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_DisplayModeFilterButton_C">();
	}
	static class UUMG_DisplayModeFilterButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_DisplayModeFilterButton_C>();
	}
};
static_assert(alignof(UUMG_DisplayModeFilterButton_C) == 0x000008, "Wrong alignment on UUMG_DisplayModeFilterButton_C");
static_assert(sizeof(UUMG_DisplayModeFilterButton_C) == 0x0002A8, "Wrong size on UUMG_DisplayModeFilterButton_C");
static_assert(offsetof(UUMG_DisplayModeFilterButton_C, UberGraphFrame) == 0x000260, "Member 'UUMG_DisplayModeFilterButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayModeFilterButton_C, Hide) == 0x000268, "Member 'UUMG_DisplayModeFilterButton_C::Hide' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayModeFilterButton_C, Border_Filter) == 0x000270, "Member 'UUMG_DisplayModeFilterButton_C::Border_Filter' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayModeFilterButton_C, Image_652) == 0x000278, "Member 'UUMG_DisplayModeFilterButton_C::Image_652' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayModeFilterButton_C, Image_BottomSelect) == 0x000280, "Member 'UUMG_DisplayModeFilterButton_C::Image_BottomSelect' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayModeFilterButton_C, RetainerBox_0) == 0x000288, "Member 'UUMG_DisplayModeFilterButton_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayModeFilterButton_C, VerticalBox_Filter) == 0x000290, "Member 'UUMG_DisplayModeFilterButton_C::VerticalBox_Filter' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayModeFilterButton_C, Click) == 0x000298, "Member 'UUMG_DisplayModeFilterButton_C::Click' has a wrong offset!");

}

