#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PromptStreamerMode

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_PromptStreamerMode.UMG_PromptStreamerMode_C.ExecuteUbergraph_UMG_PromptStreamerMode
// 0x0020 (0x0020 - 0x0000)
struct UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode) == 0x000008, "Wrong alignment on UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode");
static_assert(sizeof(UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode) == 0x000020, "Wrong size on UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode");
static_assert(offsetof(UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode, EntryPoint) == 0x000000, "Member 'UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000010, "Member 'UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000018, "Member 'UMG_PromptStreamerMode_C_ExecuteUbergraph_UMG_PromptStreamerMode::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_PromptStreamerMode.UMG_PromptStreamerMode_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_PromptStreamerMode_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PromptStreamerMode_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_PromptStreamerMode_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_PromptStreamerMode_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_PromptStreamerMode_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_PromptStreamerMode_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_PromptStreamerMode_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

