#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SwitcherLeft

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SwitcherLeft.UMG_SwitcherLeft_C
// 0x0020 (0x0280 - 0x0260)
class UUMG_SwitcherLeft_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG_1;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnLeftArrowClicked;                                // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_SwitcherLeft(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void RefreshEnableState(bool bIsEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SwitcherLeft_C">();
	}
	static class UUMG_SwitcherLeft_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SwitcherLeft_C>();
	}
};
static_assert(alignof(UUMG_SwitcherLeft_C) == 0x000008, "Wrong alignment on UUMG_SwitcherLeft_C");
static_assert(sizeof(UUMG_SwitcherLeft_C) == 0x000280, "Wrong size on UUMG_SwitcherLeft_C");
static_assert(offsetof(UUMG_SwitcherLeft_C, UberGraphFrame) == 0x000260, "Member 'UUMG_SwitcherLeft_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SwitcherLeft_C, Image_BG_1) == 0x000268, "Member 'UUMG_SwitcherLeft_C::Image_BG_1' has a wrong offset!");
static_assert(offsetof(UUMG_SwitcherLeft_C, OnLeftArrowClicked) == 0x000270, "Member 'UUMG_SwitcherLeft_C::OnLeftArrowClicked' has a wrong offset!");

}

