#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_AssignmentActionTeam

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_AssignmentActionTeam.UMG_AssignmentActionTeam_C
// 0x0058 (0x02F0 - 0x0298)
class UUMG_AssignmentActionTeam_C final : public UPBActionTeamWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_103;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_AssigmentMemberInfo_C*             MemberInfo_0;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_AssigmentMemberInfo_C*             MemberInfo_1;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_AssigmentMemberInfo_C*             MemberInfo_2;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_AssigmentMemberInfo_C*             MemberInfo_3;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_AssigmentMemberInfo_C*             MemberInfo_4;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Members;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TeamPlayerNumber;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Title;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_AssignmentActionTeam(int32 EntryPoint);
	void K2_SetActionTeamInfo();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_AssignmentActionTeam_C">();
	}
	static class UUMG_AssignmentActionTeam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_AssignmentActionTeam_C>();
	}
};
static_assert(alignof(UUMG_AssignmentActionTeam_C) == 0x000008, "Wrong alignment on UUMG_AssignmentActionTeam_C");
static_assert(sizeof(UUMG_AssignmentActionTeam_C) == 0x0002F0, "Wrong size on UUMG_AssignmentActionTeam_C");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, UberGraphFrame) == 0x000298, "Member 'UUMG_AssignmentActionTeam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, Image) == 0x0002A0, "Member 'UUMG_AssignmentActionTeam_C::Image' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, Image_103) == 0x0002A8, "Member 'UUMG_AssignmentActionTeam_C::Image_103' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, MemberInfo_0) == 0x0002B0, "Member 'UUMG_AssignmentActionTeam_C::MemberInfo_0' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, MemberInfo_1) == 0x0002B8, "Member 'UUMG_AssignmentActionTeam_C::MemberInfo_1' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, MemberInfo_2) == 0x0002C0, "Member 'UUMG_AssignmentActionTeam_C::MemberInfo_2' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, MemberInfo_3) == 0x0002C8, "Member 'UUMG_AssignmentActionTeam_C::MemberInfo_3' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, MemberInfo_4) == 0x0002D0, "Member 'UUMG_AssignmentActionTeam_C::MemberInfo_4' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, Members) == 0x0002D8, "Member 'UUMG_AssignmentActionTeam_C::Members' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, TextBlock_TeamPlayerNumber) == 0x0002E0, "Member 'UUMG_AssignmentActionTeam_C::TextBlock_TeamPlayerNumber' has a wrong offset!");
static_assert(offsetof(UUMG_AssignmentActionTeam_C, WidgetSwitcher_Title) == 0x0002E8, "Member 'UUMG_AssignmentActionTeam_C::WidgetSwitcher_Title' has a wrong offset!");

}

