#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FriendSocial_Tips

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_FriendSocial_Tips.UMG_FriendSocial_Tips_C
// 0x0018 (0x0278 - 0x0260)
class UUMG_FriendSocial_Tips_C final : public UPBUserWidget
{
public:
	class UUMG_SocialTip_Widget_C*                UMG_SocialTip_Career;                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SocialTip_Widget_C*                UMG_SocialTip_Invite;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SocialTip_Widget_C*                UMG_SocialTip_Report;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ShowSocialTips(EPBPlayerStatus InPlayerStatus);
	void HiddenSocialTips();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_FriendSocial_Tips_C">();
	}
	static class UUMG_FriendSocial_Tips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_FriendSocial_Tips_C>();
	}
};
static_assert(alignof(UUMG_FriendSocial_Tips_C) == 0x000008, "Wrong alignment on UUMG_FriendSocial_Tips_C");
static_assert(sizeof(UUMG_FriendSocial_Tips_C) == 0x000278, "Wrong size on UUMG_FriendSocial_Tips_C");
static_assert(offsetof(UUMG_FriendSocial_Tips_C, UMG_SocialTip_Career) == 0x000260, "Member 'UUMG_FriendSocial_Tips_C::UMG_SocialTip_Career' has a wrong offset!");
static_assert(offsetof(UUMG_FriendSocial_Tips_C, UMG_SocialTip_Invite) == 0x000268, "Member 'UUMG_FriendSocial_Tips_C::UMG_SocialTip_Invite' has a wrong offset!");
static_assert(offsetof(UUMG_FriendSocial_Tips_C, UMG_SocialTip_Report) == 0x000270, "Member 'UUMG_FriendSocial_Tips_C::UMG_SocialTip_Report' has a wrong offset!");

}

