#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_IngameHUD_Climbing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_IngameHUD_Climbing.UMG_IngameHUD_Climbing_C.ExecuteUbergraph_UMG_IngameHUD_Climbing
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
	bool                                          CallFunc_IsCaught_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0080(0x0028)()
};
static_assert(alignof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing) == 0x000008, "Wrong alignment on UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing");
static_assert(sizeof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing) == 0x0000A8, "Wrong size on UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, EntryPoint) == 0x000000, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, K2Node_MakeStruct_LinearColor) == 0x000020, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, K2Node_DynamicCast_AsPBCharacter) == 0x000030, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::K2Node_DynamicCast_AsPBCharacter' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, CallFunc_IsCaught_ReturnValue) == 0x000068, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::CallFunc_IsCaught_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, K2Node_MakeStruct_LinearColor_1) == 0x00006C, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing, K2Node_MakeStruct_SlateColor_1) == 0x000080, "Member 'UMG_IngameHUD_Climbing_C_ExecuteUbergraph_UMG_IngameHUD_Climbing::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

