#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ProfileGeneralInfo

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ProfileGeneralInfo.UMG_ProfileGeneralInfo_C
// 0x00A8 (0x0308 - 0x0260)
class UUMG_ProfileGeneralInfo_C final : public UPBProfileGeneralWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_DetailedCareerData_C*              AccuracyNum;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              BestKDNum;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              DeathNum;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              HeadshotNum;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              HeadshotRartioNum;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Card;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DogTag;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Imageline;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Imageline_0;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Imageline_1;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Imageline_2;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProfileCareerData_C*               KDNum;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              KillInOneLifeNum;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              KillNum;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              LongestKillDistanceNum;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              LosesNum;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProfileCareerData_C*               Spendtime;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionOperatorCard_C*         UMG_ProgressionOperatorCard;                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              WinNum;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProfileCareerData_C*               WinRatioNum;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ProfileGeneralInfo(int32 EntryPoint);
	void K2_RefreshInfo();
	void GetPercentageString(float Value, class FString* Return);
	void GetStringFromUsageTime(float UsageTime, class FString* UsageTimeString);
	void RefreshInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ProfileGeneralInfo_C">();
	}
	static class UUMG_ProfileGeneralInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ProfileGeneralInfo_C>();
	}
};
static_assert(alignof(UUMG_ProfileGeneralInfo_C) == 0x000008, "Wrong alignment on UUMG_ProfileGeneralInfo_C");
static_assert(sizeof(UUMG_ProfileGeneralInfo_C) == 0x000308, "Wrong size on UUMG_ProfileGeneralInfo_C");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, UberGraphFrame) == 0x000260, "Member 'UUMG_ProfileGeneralInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, AccuracyNum) == 0x000268, "Member 'UUMG_ProfileGeneralInfo_C::AccuracyNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, BestKDNum) == 0x000270, "Member 'UUMG_ProfileGeneralInfo_C::BestKDNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, DeathNum) == 0x000278, "Member 'UUMG_ProfileGeneralInfo_C::DeathNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, HeadshotNum) == 0x000280, "Member 'UUMG_ProfileGeneralInfo_C::HeadshotNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, HeadshotRartioNum) == 0x000288, "Member 'UUMG_ProfileGeneralInfo_C::HeadshotRartioNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, Image_Card) == 0x000290, "Member 'UUMG_ProfileGeneralInfo_C::Image_Card' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, Image_DogTag) == 0x000298, "Member 'UUMG_ProfileGeneralInfo_C::Image_DogTag' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, Imageline) == 0x0002A0, "Member 'UUMG_ProfileGeneralInfo_C::Imageline' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, Imageline_0) == 0x0002A8, "Member 'UUMG_ProfileGeneralInfo_C::Imageline_0' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, Imageline_1) == 0x0002B0, "Member 'UUMG_ProfileGeneralInfo_C::Imageline_1' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, Imageline_2) == 0x0002B8, "Member 'UUMG_ProfileGeneralInfo_C::Imageline_2' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, KDNum) == 0x0002C0, "Member 'UUMG_ProfileGeneralInfo_C::KDNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, KillInOneLifeNum) == 0x0002C8, "Member 'UUMG_ProfileGeneralInfo_C::KillInOneLifeNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, KillNum) == 0x0002D0, "Member 'UUMG_ProfileGeneralInfo_C::KillNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, LongestKillDistanceNum) == 0x0002D8, "Member 'UUMG_ProfileGeneralInfo_C::LongestKillDistanceNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, LosesNum) == 0x0002E0, "Member 'UUMG_ProfileGeneralInfo_C::LosesNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, Spendtime) == 0x0002E8, "Member 'UUMG_ProfileGeneralInfo_C::Spendtime' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, UMG_ProgressionOperatorCard) == 0x0002F0, "Member 'UUMG_ProfileGeneralInfo_C::UMG_ProgressionOperatorCard' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, WinNum) == 0x0002F8, "Member 'UUMG_ProfileGeneralInfo_C::WinNum' has a wrong offset!");
static_assert(offsetof(UUMG_ProfileGeneralInfo_C, WinRatioNum) == 0x000300, "Member 'UUMG_ProfileGeneralInfo_C::WinRatioNum' has a wrong offset!");

}

