#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SocialTip_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_SocialTip_Widget.UMG_SocialTip_Widget_C.ExecuteUbergraph_UMG_SocialTip_Widget
// 0x0048 (0x0048 - 0x0000)
struct UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0008(0x0010)(NoDestructor)
	TArray<struct FDataTableRowHandle>            K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0030(0x0018)()
};
static_assert(alignof(UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget) == 0x000008, "Wrong alignment on UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget");
static_assert(sizeof(UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget) == 0x000048, "Wrong size on UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget");
static_assert(offsetof(UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget, EntryPoint) == 0x000000, "Member 'UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget, K2Node_MakeStruct_DataTableRowHandle) == 0x000008, "Member 'UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget, K2Node_MakeArray_Array) == 0x000018, "Member 'UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget, K2Node_Event_IsDesignTime) == 0x000028, "Member 'UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget, CallFunc_TextToUpper_ReturnValue) == 0x000030, "Member 'UMG_SocialTip_Widget_C_ExecuteUbergraph_UMG_SocialTip_Widget::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function UMG_SocialTip_Widget.UMG_SocialTip_Widget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_SocialTip_Widget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SocialTip_Widget_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_SocialTip_Widget_C_PreConstruct");
static_assert(sizeof(UMG_SocialTip_Widget_C_PreConstruct) == 0x000001, "Wrong size on UMG_SocialTip_Widget_C_PreConstruct");
static_assert(offsetof(UMG_SocialTip_Widget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_SocialTip_Widget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_SocialTip_Widget.UMG_SocialTip_Widget_C.OnMouseButtonDown
// 0x0268 (0x0268 - 0x0000)
struct UMG_SocialTip_Widget_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerController_ShowRoom*           K2Node_DynamicCast_AsPBPlayer_Controller_Show_Room; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetKeysOfInput_ReturnValue;               // 0x0238(0x0010)(ReferenceParm)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x0248(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_SimulatePressKey_ReturnValue;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SocialTip_Widget_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UMG_SocialTip_Widget_C_OnMouseButtonDown");
static_assert(sizeof(UMG_SocialTip_Widget_C_OnMouseButtonDown) == 0x000268, "Wrong size on UMG_SocialTip_Widget_C_OnMouseButtonDown");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, CallFunc_GetPlayerController_ReturnValue) == 0x000218, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, K2Node_DynamicCast_AsPBPlayer_Controller_Show_Room) == 0x000220, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::K2Node_DynamicCast_AsPBPlayer_Controller_Show_Room' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000230, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, CallFunc_GetKeysOfInput_ReturnValue) == 0x000238, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::CallFunc_GetKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, CallFunc_Array_Get_Item) == 0x000248, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_OnMouseButtonDown, CallFunc_SimulatePressKey_ReturnValue) == 0x000260, "Member 'UMG_SocialTip_Widget_C_OnMouseButtonDown::CallFunc_SimulatePressKey_ReturnValue' has a wrong offset!");

// Function UMG_SocialTip_Widget.UMG_SocialTip_Widget_C.SetText
// 0x0030 (0x0030 - 0x0000)
struct UMG_SocialTip_Widget_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(UMG_SocialTip_Widget_C_SetText) == 0x000008, "Wrong alignment on UMG_SocialTip_Widget_C_SetText");
static_assert(sizeof(UMG_SocialTip_Widget_C_SetText) == 0x000030, "Wrong size on UMG_SocialTip_Widget_C_SetText");
static_assert(offsetof(UMG_SocialTip_Widget_C_SetText, InText) == 0x000000, "Member 'UMG_SocialTip_Widget_C_SetText::InText' has a wrong offset!");
static_assert(offsetof(UMG_SocialTip_Widget_C_SetText, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'UMG_SocialTip_Widget_C_SetText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

}

