#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DeployCharacter

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_DeployCharacter.UMG_DeployCharacter_C
// 0x0028 (0x0428 - 0x0400)
class UUMG_DeployCharacter_C final : public UPBItemFieldModWidget_Character
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_STD_Art_IconButton_C*              UMG_STD_Art_IconButton;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_HotZone_C*                     UMG_STD_HotZone;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Click;                                             // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_DeployCharacter(int32 EntryPoint);
	void BndEvt__UMG_DeployCharacter_UMG_STD_HotZone_K2Node_ComponentBoundEvent_1_OnUnhover_Default__DelegateSignature();
	void BndEvt__UMG_DeployCharacter_UMG_STD_HotZone_K2Node_ComponentBoundEvent_0_OnHover_Default__DelegateSignature();
	void K2_OnSelectCharacter();
	void BndEvt__UMG_DeployCharacter_UMG_STD_HotZone_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature();
	void Refresh_Character_Info();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_DeployCharacter_C">();
	}
	static class UUMG_DeployCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_DeployCharacter_C>();
	}
};
static_assert(alignof(UUMG_DeployCharacter_C) == 0x000008, "Wrong alignment on UUMG_DeployCharacter_C");
static_assert(sizeof(UUMG_DeployCharacter_C) == 0x000428, "Wrong size on UUMG_DeployCharacter_C");
static_assert(offsetof(UUMG_DeployCharacter_C, UberGraphFrame) == 0x000400, "Member 'UUMG_DeployCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_DeployCharacter_C, UMG_STD_Art_IconButton) == 0x000408, "Member 'UUMG_DeployCharacter_C::UMG_STD_Art_IconButton' has a wrong offset!");
static_assert(offsetof(UUMG_DeployCharacter_C, UMG_STD_HotZone) == 0x000410, "Member 'UUMG_DeployCharacter_C::UMG_STD_HotZone' has a wrong offset!");
static_assert(offsetof(UUMG_DeployCharacter_C, Click) == 0x000418, "Member 'UUMG_DeployCharacter_C::Click' has a wrong offset!");

}

