#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FieldModCharacterDetail

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_FieldModCharacterDetail.UMG_FieldModCharacterDetail_C.ExecuteUbergraph_UMG_FieldModCharacterDetail
// 0x00B8 (0x00B8 - 0x0000)
struct UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBAbilityDetail                       CallFunc_Array_Get_Item;                           // 0x0008(0x0058)()
	struct FPBAbilityDetail                       CallFunc_Array_Get_Item_1;                         // 0x0060(0x0058)()
};
static_assert(alignof(UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail) == 0x000008, "Wrong alignment on UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail");
static_assert(sizeof(UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail) == 0x0000B8, "Wrong size on UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail");
static_assert(offsetof(UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail, EntryPoint) == 0x000000, "Member 'UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail, CallFunc_Array_Get_Item) == 0x000008, "Member 'UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'UMG_FieldModCharacterDetail_C_ExecuteUbergraph_UMG_FieldModCharacterDetail::CallFunc_Array_Get_Item_1' has a wrong offset!");

}

