#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SocialSystem_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_SocialSystem_Widget.UMG_SocialSystem_Widget_C.ExecuteUbergraph_UMG_SocialSystem_Widget
// 0x0050 (0x0050 - 0x0000)
struct UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_CurrentSelectIndex;     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LastSelectIndex;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget) == 0x000008, "Wrong alignment on UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget");
static_assert(sizeof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget) == 0x000050, "Wrong size on UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget");
static_assert(offsetof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget, EntryPoint) == 0x000000, "Member 'UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget, K2Node_ComponentBoundEvent_CurrentSelectIndex) == 0x000030, "Member 'UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget::K2Node_ComponentBoundEvent_CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget, K2Node_ComponentBoundEvent_LastSelectIndex) == 0x000034, "Member 'UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget::K2Node_ComponentBoundEvent_LastSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000038, "Member 'UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget, CallFunc_GetDisplayName_ReturnValue_1) == 0x000040, "Member 'UMG_SocialSystem_Widget_C_ExecuteUbergraph_UMG_SocialSystem_Widget::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");

// Function UMG_SocialSystem_Widget.UMG_SocialSystem_Widget_C.BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_SocialSystem_Widget_C_BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature final
{
public:
	int32                                         CurrentSelectIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSelectIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SocialSystem_Widget_C_BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000004, "Wrong alignment on UMG_SocialSystem_Widget_C_BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(sizeof(UMG_SocialSystem_Widget_C_BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000008, "Wrong size on UMG_SocialSystem_Widget_C_BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(offsetof(UMG_SocialSystem_Widget_C_BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, CurrentSelectIndex) == 0x000000, "Member 'UMG_SocialSystem_Widget_C_BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_SocialSystem_Widget_C_BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, LastSelectIndex) == 0x000004, "Member 'UMG_SocialSystem_Widget_C_BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::LastSelectIndex' has a wrong offset!");

}

