#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Art_IconButton

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C
// 0x0108 (0x0368 - 0x0260)
class UUMG_STD_Art_IconButton_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnimation;                                    // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransparentBG;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_hover;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        BtnLable;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        BtnNameMain;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ContentSize;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RoleImage;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Icon;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TitleBox;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              SizeOverride;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NewBG_Material;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       NewButtonIconMaterial;                             // 0x02C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Text_NameUpperCase;                                // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Text_HaveName;                                     // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_MainText;                                     // 0x02F8(0x0018)(Edit, BlueprintVisible)
	int32                                         Text_MainTextSize;                                 // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Text_HaveLabel;                                    // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Text_Label_UpperCase;                              // 0x0315(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_316[0x2];                                      // 0x0316(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_Label_Name;                                   // 0x0318(0x0018)(Edit, BlueprintVisible)
	int32                                         Text_Label_TextSize;                               // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Text_MainFontMaterial;                             // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Text_LabelFontMaterial;                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Icon_HaveIcon;                                     // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Icon_TextOffsetByIcon;                             // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Icon_ChangeOnlyTexture;                            // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Icon_NewIconTex;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Icon_LocalScale;                                   // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Icon_BoderSize;                                    // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_STD_Art_IconButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateText(bool HaveMainName, const class FText& NewButtonName, bool HaveLabel, const class FText& NewButtonLabel);
	void UpdateIconOrIconMaterial(class UTexture* Texture, TSoftObjectPtr<class UMaterialInstance> Material, bool ChangeOnlyTexture);
	void UpdateSize(const struct FVector2D& InVec);
	void UpdateBG_Material(class UMaterialInterface* Material);
	void UpdateHaveIcon(bool Condition);
	void UpdateMainText(const class FText& InText);
	void UpdateLabelText(const class FText& InText);
	void UpdateWidget(bool ____FX_Text, bool HaveName, const class FText& NewButtonName, bool HaveLabel, const class FText& NewButtonLabel, bool ____FX_HaveIcon, bool HaveIcon, bool ____FX_Icon, class UTexture* IconTexture, TSoftObjectPtr<class UMaterialInstance> IconMaterial, bool ChangeOnlyTexture, bool ____FX_Size, const struct FVector2D& InVec, bool ____FX_BG_Mat, class UMaterialInterface* BG_Material);
	void GoTransparent(bool GoTrans);
	void Hover(bool bHover);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_STD_Art_IconButton_C">();
	}
	static class UUMG_STD_Art_IconButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_STD_Art_IconButton_C>();
	}
};
static_assert(alignof(UUMG_STD_Art_IconButton_C) == 0x000008, "Wrong alignment on UUMG_STD_Art_IconButton_C");
static_assert(sizeof(UUMG_STD_Art_IconButton_C) == 0x000368, "Wrong size on UUMG_STD_Art_IconButton_C");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, UberGraphFrame) == 0x000260, "Member 'UUMG_STD_Art_IconButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, HoverAnimation) == 0x000268, "Member 'UUMG_STD_Art_IconButton_C::HoverAnimation' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, TransparentBG) == 0x000270, "Member 'UUMG_STD_Art_IconButton_C::TransparentBG' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, BG) == 0x000278, "Member 'UUMG_STD_Art_IconButton_C::BG' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, BG_hover) == 0x000280, "Member 'UUMG_STD_Art_IconButton_C::BG_hover' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, BtnLable) == 0x000288, "Member 'UUMG_STD_Art_IconButton_C::BtnLable' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, BtnNameMain) == 0x000290, "Member 'UUMG_STD_Art_IconButton_C::BtnNameMain' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, ContentSize) == 0x000298, "Member 'UUMG_STD_Art_IconButton_C::ContentSize' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, RoleImage) == 0x0002A0, "Member 'UUMG_STD_Art_IconButton_C::RoleImage' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, SizeBox_Icon) == 0x0002A8, "Member 'UUMG_STD_Art_IconButton_C::SizeBox_Icon' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, TitleBox) == 0x0002B0, "Member 'UUMG_STD_Art_IconButton_C::TitleBox' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, SizeOverride) == 0x0002B8, "Member 'UUMG_STD_Art_IconButton_C::SizeOverride' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, NewBG_Material) == 0x0002C0, "Member 'UUMG_STD_Art_IconButton_C::NewBG_Material' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, NewButtonIconMaterial) == 0x0002C8, "Member 'UUMG_STD_Art_IconButton_C::NewButtonIconMaterial' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_NameUpperCase) == 0x0002F0, "Member 'UUMG_STD_Art_IconButton_C::Text_NameUpperCase' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_HaveName) == 0x0002F1, "Member 'UUMG_STD_Art_IconButton_C::Text_HaveName' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_MainText) == 0x0002F8, "Member 'UUMG_STD_Art_IconButton_C::Text_MainText' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_MainTextSize) == 0x000310, "Member 'UUMG_STD_Art_IconButton_C::Text_MainTextSize' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_HaveLabel) == 0x000314, "Member 'UUMG_STD_Art_IconButton_C::Text_HaveLabel' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_Label_UpperCase) == 0x000315, "Member 'UUMG_STD_Art_IconButton_C::Text_Label_UpperCase' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_Label_Name) == 0x000318, "Member 'UUMG_STD_Art_IconButton_C::Text_Label_Name' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_Label_TextSize) == 0x000330, "Member 'UUMG_STD_Art_IconButton_C::Text_Label_TextSize' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_MainFontMaterial) == 0x000338, "Member 'UUMG_STD_Art_IconButton_C::Text_MainFontMaterial' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Text_LabelFontMaterial) == 0x000340, "Member 'UUMG_STD_Art_IconButton_C::Text_LabelFontMaterial' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Icon_HaveIcon) == 0x000348, "Member 'UUMG_STD_Art_IconButton_C::Icon_HaveIcon' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Icon_TextOffsetByIcon) == 0x00034C, "Member 'UUMG_STD_Art_IconButton_C::Icon_TextOffsetByIcon' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Icon_ChangeOnlyTexture) == 0x000350, "Member 'UUMG_STD_Art_IconButton_C::Icon_ChangeOnlyTexture' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Icon_NewIconTex) == 0x000358, "Member 'UUMG_STD_Art_IconButton_C::Icon_NewIconTex' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Icon_LocalScale) == 0x000360, "Member 'UUMG_STD_Art_IconButton_C::Icon_LocalScale' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_IconButton_C, Icon_BoderSize) == 0x000364, "Member 'UUMG_STD_Art_IconButton_C::Icon_BoderSize' has a wrong offset!");

}

