#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityPopupPage

#include "Basic.hpp"

#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function UMG_ActivityPopupPage.UMG_ActivityPopupPage_C.ExecuteUbergraph_UMG_ActivityPopupPage
// 0x0004 (0x0004 - 0x0000)
struct UMG_ActivityPopupPage_C_ExecuteUbergraph_UMG_ActivityPopupPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityPopupPage_C_ExecuteUbergraph_UMG_ActivityPopupPage) == 0x000004, "Wrong alignment on UMG_ActivityPopupPage_C_ExecuteUbergraph_UMG_ActivityPopupPage");
static_assert(sizeof(UMG_ActivityPopupPage_C_ExecuteUbergraph_UMG_ActivityPopupPage) == 0x000004, "Wrong size on UMG_ActivityPopupPage_C_ExecuteUbergraph_UMG_ActivityPopupPage");
static_assert(offsetof(UMG_ActivityPopupPage_C_ExecuteUbergraph_UMG_ActivityPopupPage, EntryPoint) == 0x000000, "Member 'UMG_ActivityPopupPage_C_ExecuteUbergraph_UMG_ActivityPopupPage::EntryPoint' has a wrong offset!");

// Function UMG_ActivityPopupPage.UMG_ActivityPopupPage_C.ShowDailyLoginPage
// 0x0058 (0x0058 - 0x0000)
struct UMG_ActivityPopupPage_C_ShowDailyLoginPage final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UPBActivityManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeedShowLoginActivityPage_ReturnValue;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBDailyLoginActivityPageWidget*        CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0044(0x0010)(NoDestructor)
};
static_assert(alignof(UMG_ActivityPopupPage_C_ShowDailyLoginPage) == 0x000008, "Wrong alignment on UMG_ActivityPopupPage_C_ShowDailyLoginPage");
static_assert(sizeof(UMG_ActivityPopupPage_C_ShowDailyLoginPage) == 0x000058, "Wrong size on UMG_ActivityPopupPage_C_ShowDailyLoginPage");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowDailyLoginPage, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_ActivityPopupPage_C_ShowDailyLoginPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowDailyLoginPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UMG_ActivityPopupPage_C_ShowDailyLoginPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowDailyLoginPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'UMG_ActivityPopupPage_C_ShowDailyLoginPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowDailyLoginPage, CallFunc_IsNeedShowLoginActivityPage_ReturnValue) == 0x000020, "Member 'UMG_ActivityPopupPage_C_ShowDailyLoginPage::CallFunc_IsNeedShowLoginActivityPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowDailyLoginPage, CallFunc_Create_ReturnValue) == 0x000028, "Member 'UMG_ActivityPopupPage_C_ShowDailyLoginPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowDailyLoginPage, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'UMG_ActivityPopupPage_C_ShowDailyLoginPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowDailyLoginPage, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000038, "Member 'UMG_ActivityPopupPage_C_ShowDailyLoginPage::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowDailyLoginPage, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UMG_ActivityPopupPage_C_ShowDailyLoginPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowDailyLoginPage, K2Node_MakeStruct_Anchors) == 0x000044, "Member 'UMG_ActivityPopupPage_C_ShowDailyLoginPage::K2Node_MakeStruct_Anchors' has a wrong offset!");

// Function UMG_ActivityPopupPage.UMG_ActivityPopupPage_C.ShowCumulativeLoginPage
// 0x0058 (0x0058 - 0x0000)
struct UMG_ActivityPopupPage_C_ShowCumulativeLoginPage final
{
public:
	class UPBActivityManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeedShowLoginActivityPage_ReturnValue;  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0028(0x0010)(NoDestructor)
	class UPBCumulativeLoginActivityPageWidget*   CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage) == 0x000008, "Wrong alignment on UMG_ActivityPopupPage_C_ShowCumulativeLoginPage");
static_assert(sizeof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage) == 0x000058, "Wrong size on UMG_ActivityPopupPage_C_ShowCumulativeLoginPage");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_ActivityPopupPage_C_ShowCumulativeLoginPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage, CallFunc_IsNeedShowLoginActivityPage_ReturnValue) == 0x000008, "Member 'UMG_ActivityPopupPage_C_ShowCumulativeLoginPage::CallFunc_IsNeedShowLoginActivityPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'UMG_ActivityPopupPage_C_ShowCumulativeLoginPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'UMG_ActivityPopupPage_C_ShowCumulativeLoginPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage, K2Node_MakeStruct_Anchors) == 0x000028, "Member 'UMG_ActivityPopupPage_C_ShowCumulativeLoginPage::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage, CallFunc_Create_ReturnValue) == 0x000038, "Member 'UMG_ActivityPopupPage_C_ShowCumulativeLoginPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'UMG_ActivityPopupPage_C_ShowCumulativeLoginPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000048, "Member 'UMG_ActivityPopupPage_C_ShowCumulativeLoginPage::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowCumulativeLoginPage, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UMG_ActivityPopupPage_C_ShowCumulativeLoginPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_ActivityPopupPage.UMG_ActivityPopupPage_C.ShowLimitedTimeLoginPage
// 0x0068 (0x0068 - 0x0000)
struct UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage final
{
public:
	TDelegate<void(const class FString& ActivityID)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UPBActivityManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeedShowLoginActivityPage_ReturnValue;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_LimitedTimeLoginPage_C*            CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0040(0x0010)(NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage) == 0x000008, "Wrong alignment on UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage");
static_assert(sizeof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage) == 0x000068, "Wrong size on UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, CallFunc_IsNeedShowLoginActivityPage_ReturnValue) == 0x000028, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::CallFunc_IsNeedShowLoginActivityPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, CallFunc_Create_ReturnValue) == 0x000038, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, K2Node_MakeStruct_Anchors) == 0x000040, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000058, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UMG_ActivityPopupPage_C_ShowLimitedTimeLoginPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_ActivityPopupPage.UMG_ActivityPopupPage_C.ShowNotificationPage
// 0x0070 (0x0070 - 0x0000)
struct UMG_ActivityPopupPage_C_ShowNotificationPage final
{
public:
	class UPBActivityManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeedShowNotification_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& NotificationID)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBActivityManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_NotificationPage_C*                CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0060(0x0010)(NoDestructor)
};
static_assert(alignof(UMG_ActivityPopupPage_C_ShowNotificationPage) == 0x000008, "Wrong alignment on UMG_ActivityPopupPage_C_ShowNotificationPage");
static_assert(sizeof(UMG_ActivityPopupPage_C_ShowNotificationPage) == 0x000070, "Wrong size on UMG_ActivityPopupPage_C_ShowNotificationPage");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, CallFunc_IsNeedShowNotification_ReturnValue) == 0x000008, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::CallFunc_IsNeedShowNotification_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000038, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000048, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, CallFunc_Create_ReturnValue) == 0x000058, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_ShowNotificationPage, K2Node_MakeStruct_Anchors) == 0x000060, "Member 'UMG_ActivityPopupPage_C_ShowNotificationPage::K2Node_MakeStruct_Anchors' has a wrong offset!");

// Function UMG_ActivityPopupPage.UMG_ActivityPopupPage_C.CloseThisPage
// 0x0010 (0x0010 - 0x0000)
struct UMG_ActivityPopupPage_C_CloseThisPage final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityPopupPage_C_CloseThisPage) == 0x000008, "Wrong alignment on UMG_ActivityPopupPage_C_CloseThisPage");
static_assert(sizeof(UMG_ActivityPopupPage_C_CloseThisPage) == 0x000010, "Wrong size on UMG_ActivityPopupPage_C_CloseThisPage");
static_assert(offsetof(UMG_ActivityPopupPage_C_CloseThisPage, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_ActivityPopupPage_C_CloseThisPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_CloseThisPage, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'UMG_ActivityPopupPage_C_CloseThisPage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_CloseThisPage, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'UMG_ActivityPopupPage_C_CloseThisPage::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_ActivityPopupPage.UMG_ActivityPopupPage_C.GotoActivityPage
// 0x0050 (0x0050 - 0x0000)
struct UMG_ActivityPopupPage_C_GotoActivityPage final
{
public:
	class FString                                 ActivityID;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          News;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_GetTopMenuWidget_OutTopMenuWidget;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_MainMenuBase_C*                    K2Node_DynamicCast_AsUMG_Main_Menu_Base;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_SwitchPage_ActiveWidget;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ActivityCenter_C*                  K2Node_DynamicCast_AsUMG_Activity_Center;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityPopupPage_C_GotoActivityPage) == 0x000008, "Wrong alignment on UMG_ActivityPopupPage_C_GotoActivityPage");
static_assert(sizeof(UMG_ActivityPopupPage_C_GotoActivityPage) == 0x000050, "Wrong size on UMG_ActivityPopupPage_C_GotoActivityPage");
static_assert(offsetof(UMG_ActivityPopupPage_C_GotoActivityPage, ActivityID) == 0x000000, "Member 'UMG_ActivityPopupPage_C_GotoActivityPage::ActivityID' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_GotoActivityPage, News) == 0x000010, "Member 'UMG_ActivityPopupPage_C_GotoActivityPage::News' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_GotoActivityPage, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'UMG_ActivityPopupPage_C_GotoActivityPage::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_GotoActivityPage, CallFunc_GetTopMenuWidget_OutTopMenuWidget) == 0x000020, "Member 'UMG_ActivityPopupPage_C_GotoActivityPage::CallFunc_GetTopMenuWidget_OutTopMenuWidget' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_GotoActivityPage, K2Node_DynamicCast_AsUMG_Main_Menu_Base) == 0x000028, "Member 'UMG_ActivityPopupPage_C_GotoActivityPage::K2Node_DynamicCast_AsUMG_Main_Menu_Base' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_GotoActivityPage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UMG_ActivityPopupPage_C_GotoActivityPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_GotoActivityPage, CallFunc_SwitchPage_ActiveWidget) == 0x000038, "Member 'UMG_ActivityPopupPage_C_GotoActivityPage::CallFunc_SwitchPage_ActiveWidget' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_GotoActivityPage, K2Node_DynamicCast_AsUMG_Activity_Center) == 0x000040, "Member 'UMG_ActivityPopupPage_C_GotoActivityPage::K2Node_DynamicCast_AsUMG_Activity_Center' has a wrong offset!");
static_assert(offsetof(UMG_ActivityPopupPage_C_GotoActivityPage, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'UMG_ActivityPopupPage_C_GotoActivityPage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function UMG_ActivityPopupPage.UMG_ActivityPopupPage_C.OnClickedLimitedTimeLogin
// 0x0010 (0x0010 - 0x0000)
struct UMG_ActivityPopupPage_C_OnClickedLimitedTimeLogin final
{
public:
	class FString                                 ActivityID;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityPopupPage_C_OnClickedLimitedTimeLogin) == 0x000008, "Wrong alignment on UMG_ActivityPopupPage_C_OnClickedLimitedTimeLogin");
static_assert(sizeof(UMG_ActivityPopupPage_C_OnClickedLimitedTimeLogin) == 0x000010, "Wrong size on UMG_ActivityPopupPage_C_OnClickedLimitedTimeLogin");
static_assert(offsetof(UMG_ActivityPopupPage_C_OnClickedLimitedTimeLogin, ActivityID) == 0x000000, "Member 'UMG_ActivityPopupPage_C_OnClickedLimitedTimeLogin::ActivityID' has a wrong offset!");

// Function UMG_ActivityPopupPage.UMG_ActivityPopupPage_C.OnClickedToNotificationPage
// 0x0010 (0x0010 - 0x0000)
struct UMG_ActivityPopupPage_C_OnClickedToNotificationPage final
{
public:
	class FString                                 NotificationID;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityPopupPage_C_OnClickedToNotificationPage) == 0x000008, "Wrong alignment on UMG_ActivityPopupPage_C_OnClickedToNotificationPage");
static_assert(sizeof(UMG_ActivityPopupPage_C_OnClickedToNotificationPage) == 0x000010, "Wrong size on UMG_ActivityPopupPage_C_OnClickedToNotificationPage");
static_assert(offsetof(UMG_ActivityPopupPage_C_OnClickedToNotificationPage, NotificationID) == 0x000000, "Member 'UMG_ActivityPopupPage_C_OnClickedToNotificationPage::NotificationID' has a wrong offset!");

}

