#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameUpgradePage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EndGameUpgradePage.UMG_EndGameUpgradePage_C
// 0x0138 (0x0428 - 0x02F0)
class UUMG_EndGameUpgradePage_C final : public UPBEndGameUpgradePage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ExpAnimation;                                      // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScoreAnimation;                                    // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CurrentExpText;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentLevelText;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Exp;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ExpProgress;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Score;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_59;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_102;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_179;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_292;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_503;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Exp;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Score;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MaxLevelBox;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxLevelText;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NextLevelExpText;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NextLevelText;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         NormalLevelBlock;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBScrollBox*                           PBScrollBox_CharacterList;                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBScrollBox*                           PBScrollBox_LevelReward;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBScrollBox*                           PBScrollBox_NextLevelReward;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_NextLevelReward;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalBehaviorScoreText;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalExpText;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameOperatorCard_C*             UMG_EndGameOperatorCard;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameOperatorCard_C*             UMG_EndGameOperatorCard_1;                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameOperatorCard_C*             UMG_EndGameOperatorCard_2;                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameOperatorCard_C*             UMG_EndGameOperatorCard_3;                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameOperatorCard_C*             UMG_EndGameOperatorCard_4;                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameOperatorCard_C*             UMG_EndGameOperatorCard_5;                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem;                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem_1;                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem_2;                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem_3;                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem_4;                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem_5;                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_EndGameUpgradePage(int32 EntryPoint);
	void PlayExpAnimation();
	void K2_RefreshSecondLevel();
	void K2_RefreshFirstLevel();
	void K2_RefreshPage();
	void Construct();
	void RefreshCharacterList();
	void Refresh_Level_Reward(TArray<struct FPBProgressionItem>& ProgressionItemArray, class UPBScrollBox* LevelRewardBox, EPBProgressionRewardItemStatus InStatus);
	void RefreshInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EndGameUpgradePage_C">();
	}
	static class UUMG_EndGameUpgradePage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EndGameUpgradePage_C>();
	}
};
static_assert(alignof(UUMG_EndGameUpgradePage_C) == 0x000008, "Wrong alignment on UUMG_EndGameUpgradePage_C");
static_assert(sizeof(UUMG_EndGameUpgradePage_C) == 0x000428, "Wrong size on UUMG_EndGameUpgradePage_C");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UberGraphFrame) == 0x0002F0, "Member 'UUMG_EndGameUpgradePage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, ExpAnimation) == 0x0002F8, "Member 'UUMG_EndGameUpgradePage_C::ExpAnimation' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, ScoreAnimation) == 0x000300, "Member 'UUMG_EndGameUpgradePage_C::ScoreAnimation' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, CurrentExpText) == 0x000308, "Member 'UUMG_EndGameUpgradePage_C::CurrentExpText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, CurrentLevelText) == 0x000310, "Member 'UUMG_EndGameUpgradePage_C::CurrentLevelText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, HorizontalBox_Exp) == 0x000318, "Member 'UUMG_EndGameUpgradePage_C::HorizontalBox_Exp' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, HorizontalBox_ExpProgress) == 0x000320, "Member 'UUMG_EndGameUpgradePage_C::HorizontalBox_ExpProgress' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, HorizontalBox_Score) == 0x000328, "Member 'UUMG_EndGameUpgradePage_C::HorizontalBox_Score' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, Image) == 0x000330, "Member 'UUMG_EndGameUpgradePage_C::Image' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, Image_59) == 0x000338, "Member 'UUMG_EndGameUpgradePage_C::Image_59' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, Image_102) == 0x000340, "Member 'UUMG_EndGameUpgradePage_C::Image_102' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, Image_179) == 0x000348, "Member 'UUMG_EndGameUpgradePage_C::Image_179' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, Image_292) == 0x000350, "Member 'UUMG_EndGameUpgradePage_C::Image_292' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, Image_503) == 0x000358, "Member 'UUMG_EndGameUpgradePage_C::Image_503' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, Image_Exp) == 0x000360, "Member 'UUMG_EndGameUpgradePage_C::Image_Exp' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, Image_Score) == 0x000368, "Member 'UUMG_EndGameUpgradePage_C::Image_Score' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, MaxLevelBox) == 0x000370, "Member 'UUMG_EndGameUpgradePage_C::MaxLevelBox' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, MaxLevelText) == 0x000378, "Member 'UUMG_EndGameUpgradePage_C::MaxLevelText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, NextLevelExpText) == 0x000380, "Member 'UUMG_EndGameUpgradePage_C::NextLevelExpText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, NextLevelText) == 0x000388, "Member 'UUMG_EndGameUpgradePage_C::NextLevelText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, NormalLevelBlock) == 0x000390, "Member 'UUMG_EndGameUpgradePage_C::NormalLevelBlock' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, PBScrollBox_CharacterList) == 0x000398, "Member 'UUMG_EndGameUpgradePage_C::PBScrollBox_CharacterList' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, PBScrollBox_LevelReward) == 0x0003A0, "Member 'UUMG_EndGameUpgradePage_C::PBScrollBox_LevelReward' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, PBScrollBox_NextLevelReward) == 0x0003A8, "Member 'UUMG_EndGameUpgradePage_C::PBScrollBox_NextLevelReward' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, SizeBox_NextLevelReward) == 0x0003B0, "Member 'UUMG_EndGameUpgradePage_C::SizeBox_NextLevelReward' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, TotalBehaviorScoreText) == 0x0003B8, "Member 'UUMG_EndGameUpgradePage_C::TotalBehaviorScoreText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, TotalExpText) == 0x0003C0, "Member 'UUMG_EndGameUpgradePage_C::TotalExpText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_EndGameOperatorCard) == 0x0003C8, "Member 'UUMG_EndGameUpgradePage_C::UMG_EndGameOperatorCard' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_EndGameOperatorCard_1) == 0x0003D0, "Member 'UUMG_EndGameUpgradePage_C::UMG_EndGameOperatorCard_1' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_EndGameOperatorCard_2) == 0x0003D8, "Member 'UUMG_EndGameUpgradePage_C::UMG_EndGameOperatorCard_2' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_EndGameOperatorCard_3) == 0x0003E0, "Member 'UUMG_EndGameUpgradePage_C::UMG_EndGameOperatorCard_3' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_EndGameOperatorCard_4) == 0x0003E8, "Member 'UUMG_EndGameUpgradePage_C::UMG_EndGameOperatorCard_4' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_EndGameOperatorCard_5) == 0x0003F0, "Member 'UUMG_EndGameUpgradePage_C::UMG_EndGameOperatorCard_5' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_ProgressionRewardItem) == 0x0003F8, "Member 'UUMG_EndGameUpgradePage_C::UMG_ProgressionRewardItem' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_ProgressionRewardItem_1) == 0x000400, "Member 'UUMG_EndGameUpgradePage_C::UMG_ProgressionRewardItem_1' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_ProgressionRewardItem_2) == 0x000408, "Member 'UUMG_EndGameUpgradePage_C::UMG_ProgressionRewardItem_2' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_ProgressionRewardItem_3) == 0x000410, "Member 'UUMG_EndGameUpgradePage_C::UMG_ProgressionRewardItem_3' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_ProgressionRewardItem_4) == 0x000418, "Member 'UUMG_EndGameUpgradePage_C::UMG_ProgressionRewardItem_4' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameUpgradePage_C, UMG_ProgressionRewardItem_5) == 0x000420, "Member 'UUMG_EndGameUpgradePage_C::UMG_ProgressionRewardItem_5' has a wrong offset!");

}

