#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SpaceCoinAdditional

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_SpaceCoinAdditional.UMG_SpaceCoinAdditional_C.ExecuteUbergraph_UMG_SpaceCoinAdditional
// 0x0050 (0x0050 - 0x0000)
struct UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional) == 0x000004, "Wrong alignment on UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional");
static_assert(sizeof(UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional) == 0x000050, "Wrong size on UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional, EntryPoint) == 0x000000, "Member 'UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional, K2Node_Event_MyGeometry) == 0x000004, "Member 'UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional, CallFunc_Add_FloatFloat_ReturnValue) == 0x000040, "Member 'UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional, CallFunc_Lerp_ReturnValue_1) == 0x00004C, "Member 'UMG_SpaceCoinAdditional_C_ExecuteUbergraph_UMG_SpaceCoinAdditional::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");

// Function UMG_SpaceCoinAdditional.UMG_SpaceCoinAdditional_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_SpaceCoinAdditional_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SpaceCoinAdditional_C_Tick) == 0x000004, "Wrong alignment on UMG_SpaceCoinAdditional_C_Tick");
static_assert(sizeof(UMG_SpaceCoinAdditional_C_Tick) == 0x00003C, "Wrong size on UMG_SpaceCoinAdditional_C_Tick");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_SpaceCoinAdditional_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_SpaceCoinAdditional_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_SpaceCoinAdditional.UMG_SpaceCoinAdditional_C.SetCoinCountInfo
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_SpaceCoinAdditional_C_SetCoinCountInfo final
{
public:
	int32                                         InPreCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDeltaCount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxCount;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0090(0x0018)()
};
static_assert(alignof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo) == 0x000008, "Wrong alignment on UMG_SpaceCoinAdditional_C_SetCoinCountInfo");
static_assert(sizeof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo) == 0x0000A8, "Wrong size on UMG_SpaceCoinAdditional_C_SetCoinCountInfo");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, InPreCount) == 0x000000, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::InPreCount' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, InDeltaCount) == 0x000004, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::InDeltaCount' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, InMaxCount) == 0x000008, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::InMaxCount' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Less_IntInt_ReturnValue) == 0x00000D, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000018, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x00001C, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000024, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000028, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Add_IntInt_ReturnValue_2) == 0x000060, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Conv_IntToString_ReturnValue) == 0x000068, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000078, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SpaceCoinAdditional_C_SetCoinCountInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000090, "Member 'UMG_SpaceCoinAdditional_C_SetCoinCountInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

