#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_StoreProduct_Armory

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_StoreProduct_Armory.UMG_StoreProduct_Armory_C
// 0x0060 (0x0318 - 0x02B8)
class UUMG_StoreProduct_Armory_C final : public UPBArmoryProductWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focus;                                             // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             BoundaryCoin;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonMain;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DisplayName;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineBG;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineFocus;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineProduct;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineQuality;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpaceCoin;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextCategory;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         BoundaryCoinAmount;                                // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpcaeCoinAmount;                                   // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_StoreProduct_Armory(int32 EntryPoint);
	void BndEvt__UMG_StoreProduct_Armory_ButtonMain_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_StoreProduct_Armory_ButtonMain_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void K2_RefreshProduct();
	void SetCategoryText();
	void SetProductName();
	void SetProductTexture();
	void SetPaymentMethod();
	void SetGradeStyle();
	void PromptPurchase();
	void RecordInteractInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_StoreProduct_Armory_C">();
	}
	static class UUMG_StoreProduct_Armory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_StoreProduct_Armory_C>();
	}
};
static_assert(alignof(UUMG_StoreProduct_Armory_C) == 0x000008, "Wrong alignment on UUMG_StoreProduct_Armory_C");
static_assert(sizeof(UUMG_StoreProduct_Armory_C) == 0x000318, "Wrong size on UUMG_StoreProduct_Armory_C");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, UberGraphFrame) == 0x0002B8, "Member 'UUMG_StoreProduct_Armory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, Focus) == 0x0002C0, "Member 'UUMG_StoreProduct_Armory_C::Focus' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, BoundaryCoin) == 0x0002C8, "Member 'UUMG_StoreProduct_Armory_C::BoundaryCoin' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, ButtonMain) == 0x0002D0, "Member 'UUMG_StoreProduct_Armory_C::ButtonMain' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, DisplayName) == 0x0002D8, "Member 'UUMG_StoreProduct_Armory_C::DisplayName' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, ImagineBG) == 0x0002E0, "Member 'UUMG_StoreProduct_Armory_C::ImagineBG' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, ImagineFocus) == 0x0002E8, "Member 'UUMG_StoreProduct_Armory_C::ImagineFocus' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, ImagineProduct) == 0x0002F0, "Member 'UUMG_StoreProduct_Armory_C::ImagineProduct' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, ImagineQuality) == 0x0002F8, "Member 'UUMG_StoreProduct_Armory_C::ImagineQuality' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, SpaceCoin) == 0x000300, "Member 'UUMG_StoreProduct_Armory_C::SpaceCoin' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, TextCategory) == 0x000308, "Member 'UUMG_StoreProduct_Armory_C::TextCategory' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, BoundaryCoinAmount) == 0x000310, "Member 'UUMG_StoreProduct_Armory_C::BoundaryCoinAmount' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_Armory_C, SpcaeCoinAmount) == 0x000314, "Member 'UUMG_StoreProduct_Armory_C::SpcaeCoinAmount' has a wrong offset!");

}

