#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CrossHair_Missile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_Launcher_CrossHair_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CrossHair_Missile.UMG_CrossHair_Missile_C
// 0x0050 (0x0318 - 0x02C8)
class UUMG_CrossHair_Missile_C final : public UUMG_Launcher_CrossHair_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_CrossHair_Missile_C;            // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MissileCountImage;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ModeSwitcher;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APBVehicle*                             CurrentVehicle;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBHomingMissileLauncher*               MissileLauncher;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LaserGuidedMode;                                   // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUMG_Indicator_Character_C*>     IndicatorArray;                                    // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUMG_Indicator_Character_C*             Target;                                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_CrossHair_Missile(int32 EntryPoint);
	void K2_Equiped();
	void Destruct();
	void NotifyEquippedRadar();
	void UseAmmo();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateMissileCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CrossHair_Missile_C">();
	}
	static class UUMG_CrossHair_Missile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CrossHair_Missile_C>();
	}
};
static_assert(alignof(UUMG_CrossHair_Missile_C) == 0x000008, "Wrong alignment on UUMG_CrossHair_Missile_C");
static_assert(sizeof(UUMG_CrossHair_Missile_C) == 0x000318, "Wrong size on UUMG_CrossHair_Missile_C");
static_assert(offsetof(UUMG_CrossHair_Missile_C, UberGraphFrame_UMG_CrossHair_Missile_C) == 0x0002C8, "Member 'UUMG_CrossHair_Missile_C::UberGraphFrame_UMG_CrossHair_Missile_C' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_Missile_C, CanvasPanel_0) == 0x0002D0, "Member 'UUMG_CrossHair_Missile_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_Missile_C, MissileCountImage) == 0x0002D8, "Member 'UUMG_CrossHair_Missile_C::MissileCountImage' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_Missile_C, ModeSwitcher) == 0x0002E0, "Member 'UUMG_CrossHair_Missile_C::ModeSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_Missile_C, CurrentVehicle) == 0x0002E8, "Member 'UUMG_CrossHair_Missile_C::CurrentVehicle' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_Missile_C, MissileLauncher) == 0x0002F0, "Member 'UUMG_CrossHair_Missile_C::MissileLauncher' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_Missile_C, LaserGuidedMode) == 0x0002F8, "Member 'UUMG_CrossHair_Missile_C::LaserGuidedMode' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_Missile_C, IndicatorArray) == 0x000300, "Member 'UUMG_CrossHair_Missile_C::IndicatorArray' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_Missile_C, Target) == 0x000310, "Member 'UUMG_CrossHair_Missile_C::Target' has a wrong offset!");

}

