#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Benchmark_Result

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_Benchmark_Result.UMG_Benchmark_Result_C.ExecuteUbergraph_UMG_Benchmark_Result
// 0x0220 (0x0220 - 0x0000)
struct UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	EBenchmarkResultState                         Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBEnumOption                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0070)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumOption_ReturnValue;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x00E8(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0100(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0118(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_5;                              // 0x0138(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class UBBM_Subsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAntiAliasingQuality_ReturnValue;       // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0190(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x01B0(0x0018)()
	class UPBGameInstance*                        K2Node_DynamicCast_AsPBGame_Instance;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBGameInstance*                        K2Node_DynamicCast_AsPBGame_Instance_1;            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBLocalPlayer*                         K2Node_DynamicCast_AsPBLocal_Player;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBenchmarkResultState                         Temp_byte_Variable_1;                              // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0208(0x0018)()
};
static_assert(alignof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result) == 0x000008, "Wrong alignment on UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result");
static_assert(sizeof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result) == 0x000220, "Wrong size on UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, EntryPoint) == 0x000000, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_text_Variable) == 0x000008, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_text_Variable_1) == 0x000020, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_byte_Variable) == 0x000038, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_struct_Variable) == 0x00003C, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_struct_Variable_1) == 0x00004C, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000060, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D8, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetEnumOption_ReturnValue) == 0x0000D9, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetEnumOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000DC, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_int_Variable) == 0x0000E0, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_text_Variable_2) == 0x0000E8, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_text_Variable_3) == 0x000100, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_text_Variable_4) == 0x000118, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_bool_Variable) == 0x000130, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_text_Variable_5) == 0x000138, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_CreateDelegate_OutputDelegate) == 0x000150, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000160, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000168, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_Select_Default) == 0x000170, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetGameUserSettings_ReturnValue) == 0x000180, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetAntiAliasingQuality_ReturnValue) == 0x000188, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetAntiAliasingQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00018C, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_Select_Default_1) == 0x000190, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetGameInstance_ReturnValue) == 0x0001A8, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_Select_Default_2) == 0x0001B0, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_DynamicCast_AsPBGame_Instance) == 0x0001C8, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_DynamicCast_AsPBGame_Instance' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetGameInstance_ReturnValue_1) == 0x0001D8, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_DynamicCast_AsPBGame_Instance_1) == 0x0001E0, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_DynamicCast_AsPBGame_Instance_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x0001F0, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_DynamicCast_AsPBLocal_Player) == 0x0001F8, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_DynamicCast_AsPBLocal_Player' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_DynamicCast_bSuccess_2) == 0x000200, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, Temp_byte_Variable_1) == 0x000201, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result, K2Node_Select_Default_3) == 0x000208, "Member 'UMG_Benchmark_Result_C_ExecuteUbergraph_UMG_Benchmark_Result::K2Node_Select_Default_3' has a wrong offset!");

}

