#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_RedemptationPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_RedemptationPrompt.UMG_RedemptationPrompt_C
// 0x0038 (0x0358 - 0x0320)
class UUMG_RedemptationPrompt_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_356;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Discription;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Options;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Option_0;                                          // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Option_2;                                          // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_RedemptationPrompt(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void CustomEvent_0();
	void Construct();
	void SetErrorReason(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_RedemptationPrompt_C">();
	}
	static class UUMG_RedemptationPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_RedemptationPrompt_C>();
	}
};
static_assert(alignof(UUMG_RedemptationPrompt_C) == 0x000008, "Wrong alignment on UUMG_RedemptationPrompt_C");
static_assert(sizeof(UUMG_RedemptationPrompt_C) == 0x000358, "Wrong size on UUMG_RedemptationPrompt_C");
static_assert(offsetof(UUMG_RedemptationPrompt_C, UberGraphFrame) == 0x000320, "Member 'UUMG_RedemptationPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptationPrompt_C, Flash) == 0x000328, "Member 'UUMG_RedemptationPrompt_C::Flash' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptationPrompt_C, Image_112) == 0x000330, "Member 'UUMG_RedemptationPrompt_C::Image_112' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptationPrompt_C, Image_356) == 0x000338, "Member 'UUMG_RedemptationPrompt_C::Image_356' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptationPrompt_C, Text_Discription) == 0x000340, "Member 'UUMG_RedemptationPrompt_C::Text_Discription' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptationPrompt_C, WrapBox_Options) == 0x000348, "Member 'UUMG_RedemptationPrompt_C::WrapBox_Options' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptationPrompt_C, Option_0) == 0x000350, "Member 'UUMG_RedemptationPrompt_C::Option_0' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptationPrompt_C, Option_2) == 0x000351, "Member 'UUMG_RedemptationPrompt_C::Option_2' has a wrong offset!");

}

