#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SocialSystem_Widget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SocialSystem_Widget.UMG_SocialSystem_Widget_C
// 0x0030 (0x0350 - 0x0320)
class UUMG_SocialSystem_Widget_C final : public UPBSocialSystemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_141;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBAdvancedSwitcher*                    SocialSwitcher;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_FriendsList_Widget_C*              UMG_FriendsList_Widget;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LocalPlayerDetail_Widget_C*        UMG_LocalPlayerDetail_Widget;                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PartyMemberList_Widget_C*          UMG_PartyMemberList_Widget;                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SocialSystem_Widget(int32 EntryPoint);
	void BndEvt__UMG_SocialSystem_Widget_SocialSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature(int32 CurrentSelectIndex, int32 LastSelectIndex);
	void OnInitialized();
	void Construct();
	void OnPartyRefreshed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SocialSystem_Widget_C">();
	}
	static class UUMG_SocialSystem_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SocialSystem_Widget_C>();
	}
};
static_assert(alignof(UUMG_SocialSystem_Widget_C) == 0x000008, "Wrong alignment on UUMG_SocialSystem_Widget_C");
static_assert(sizeof(UUMG_SocialSystem_Widget_C) == 0x000350, "Wrong size on UUMG_SocialSystem_Widget_C");
static_assert(offsetof(UUMG_SocialSystem_Widget_C, UberGraphFrame) == 0x000320, "Member 'UUMG_SocialSystem_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SocialSystem_Widget_C, Image_141) == 0x000328, "Member 'UUMG_SocialSystem_Widget_C::Image_141' has a wrong offset!");
static_assert(offsetof(UUMG_SocialSystem_Widget_C, SocialSwitcher) == 0x000330, "Member 'UUMG_SocialSystem_Widget_C::SocialSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_SocialSystem_Widget_C, UMG_FriendsList_Widget) == 0x000338, "Member 'UUMG_SocialSystem_Widget_C::UMG_FriendsList_Widget' has a wrong offset!");
static_assert(offsetof(UUMG_SocialSystem_Widget_C, UMG_LocalPlayerDetail_Widget) == 0x000340, "Member 'UUMG_SocialSystem_Widget_C::UMG_LocalPlayerDetail_Widget' has a wrong offset!");
static_assert(offsetof(UUMG_SocialSystem_Widget_C, UMG_PartyMemberList_Widget) == 0x000348, "Member 'UUMG_SocialSystem_Widget_C::UMG_PartyMemberList_Widget' has a wrong offset!");

}

