#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PlaylistItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_PlaylistItem.UMG_PlaylistItem_C.ExecuteUbergraph_UMG_PlaylistItem
// 0x0070 (0x0070 - 0x0000)
struct UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchmakingNeedsRegionInfo_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCancelingSearching_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_MainMenuLayout_C*                  K2Node_DynamicCast_AsUMG_Main_Menu_Layout;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSavedGameModesByName_ReturnValue;      // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem) == 0x000008, "Wrong alignment on UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem");
static_assert(sizeof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem) == 0x000070, "Wrong size on UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, EntryPoint) == 0x000000, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, Temp_bool_Variable) == 0x000004, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_IsMatchmakingNeedsRegionInfo_ReturnValue) == 0x000018, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_IsMatchmakingNeedsRegionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000020, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000028, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_IsCancelingSearching_ReturnValue) == 0x000030, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_IsCancelingSearching_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000050, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000058, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, K2Node_DynamicCast_AsUMG_Main_Menu_Layout) == 0x000060, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::K2Node_DynamicCast_AsUMG_Main_Menu_Layout' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000069, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, Temp_byte_Variable) == 0x00006A, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, Temp_byte_Variable_1) == 0x00006B, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, K2Node_Select_Default) == 0x00006C, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem, CallFunc_HasSavedGameModesByName_ReturnValue) == 0x00006D, "Member 'UMG_PlaylistItem_C_ExecuteUbergraph_UMG_PlaylistItem::CallFunc_HasSavedGameModesByName_ReturnValue' has a wrong offset!");

// Function UMG_PlaylistItem.UMG_PlaylistItem_C.RefreshSearchMode
// 0x0001 (0x0001 - 0x0000)
struct UMG_PlaylistItem_C_RefreshSearchMode final
{
public:
	bool                                          IsPartyMember;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PlaylistItem_C_RefreshSearchMode) == 0x000001, "Wrong alignment on UMG_PlaylistItem_C_RefreshSearchMode");
static_assert(sizeof(UMG_PlaylistItem_C_RefreshSearchMode) == 0x000001, "Wrong size on UMG_PlaylistItem_C_RefreshSearchMode");
static_assert(offsetof(UMG_PlaylistItem_C_RefreshSearchMode, IsPartyMember) == 0x000000, "Member 'UMG_PlaylistItem_C_RefreshSearchMode::IsPartyMember' has a wrong offset!");

// Function UMG_PlaylistItem.UMG_PlaylistItem_C.RefreshNormalMode
// 0x0001 (0x0001 - 0x0000)
struct UMG_PlaylistItem_C_RefreshNormalMode final
{
public:
	bool                                          LastSearching;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PlaylistItem_C_RefreshNormalMode) == 0x000001, "Wrong alignment on UMG_PlaylistItem_C_RefreshNormalMode");
static_assert(sizeof(UMG_PlaylistItem_C_RefreshNormalMode) == 0x000001, "Wrong size on UMG_PlaylistItem_C_RefreshNormalMode");
static_assert(offsetof(UMG_PlaylistItem_C_RefreshNormalMode, LastSearching) == 0x000000, "Member 'UMG_PlaylistItem_C_RefreshNormalMode::LastSearching' has a wrong offset!");

// Function UMG_PlaylistItem.UMG_PlaylistItem_C.RefreshPartyStatus
// 0x0005 (0x0005 - 0x0000)
struct UMG_PlaylistItem_C_RefreshPartyStatus final
{
public:
	bool                                          IsPartMember;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PlaylistItem_C_RefreshPartyStatus) == 0x000001, "Wrong alignment on UMG_PlaylistItem_C_RefreshPartyStatus");
static_assert(sizeof(UMG_PlaylistItem_C_RefreshPartyStatus) == 0x000005, "Wrong size on UMG_PlaylistItem_C_RefreshPartyStatus");
static_assert(offsetof(UMG_PlaylistItem_C_RefreshPartyStatus, IsPartMember) == 0x000000, "Member 'UMG_PlaylistItem_C_RefreshPartyStatus::IsPartMember' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_RefreshPartyStatus, Temp_bool_Variable) == 0x000001, "Member 'UMG_PlaylistItem_C_RefreshPartyStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_RefreshPartyStatus, Temp_byte_Variable) == 0x000002, "Member 'UMG_PlaylistItem_C_RefreshPartyStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_RefreshPartyStatus, Temp_byte_Variable_1) == 0x000003, "Member 'UMG_PlaylistItem_C_RefreshPartyStatus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_RefreshPartyStatus, K2Node_Select_Default) == 0x000004, "Member 'UMG_PlaylistItem_C_RefreshPartyStatus::K2Node_Select_Default' has a wrong offset!");

// Function UMG_PlaylistItem.UMG_PlaylistItem_C.SetNormalMode
// 0x0020 (0x0020 - 0x0000)
struct UMG_PlaylistItem_C_SetNormalMode final
{
public:
	bool                                          NeedRevertFocusAnimtion;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PlaylistItem_C_SetNormalMode) == 0x000008, "Wrong alignment on UMG_PlaylistItem_C_SetNormalMode");
static_assert(sizeof(UMG_PlaylistItem_C_SetNormalMode) == 0x000020, "Wrong size on UMG_PlaylistItem_C_SetNormalMode");
static_assert(offsetof(UMG_PlaylistItem_C_SetNormalMode, NeedRevertFocusAnimtion) == 0x000000, "Member 'UMG_PlaylistItem_C_SetNormalMode::NeedRevertFocusAnimtion' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_SetNormalMode, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'UMG_PlaylistItem_C_SetNormalMode::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_SetNormalMode, CallFunc_GetEndTime_ReturnValue_1) == 0x000008, "Member 'UMG_PlaylistItem_C_SetNormalMode::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_SetNormalMode, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'UMG_PlaylistItem_C_SetNormalMode::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_SetNormalMode, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'UMG_PlaylistItem_C_SetNormalMode::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function UMG_PlaylistItem.UMG_PlaylistItem_C.SetSearchMode
// 0x0010 (0x0010 - 0x0000)
struct UMG_PlaylistItem_C_SetSearchMode final
{
public:
	bool                                          IsPartyMember;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PlaylistItem_C_SetSearchMode) == 0x000008, "Wrong alignment on UMG_PlaylistItem_C_SetSearchMode");
static_assert(sizeof(UMG_PlaylistItem_C_SetSearchMode) == 0x000010, "Wrong size on UMG_PlaylistItem_C_SetSearchMode");
static_assert(offsetof(UMG_PlaylistItem_C_SetSearchMode, IsPartyMember) == 0x000000, "Member 'UMG_PlaylistItem_C_SetSearchMode::IsPartyMember' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_SetSearchMode, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_PlaylistItem_C_SetSearchMode::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_PlaylistItem.UMG_PlaylistItem_C.DisplayModeFilter
// 0x0020 (0x0020 - 0x0000)
struct UMG_PlaylistItem_C_DisplayModeFilter final
{
public:
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushMenu_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ModeFilter_C*                      K2Node_DynamicCast_AsUMG_Mode_Filter;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PlaylistItem_C_DisplayModeFilter) == 0x000008, "Wrong alignment on UMG_PlaylistItem_C_DisplayModeFilter");
static_assert(sizeof(UMG_PlaylistItem_C_DisplayModeFilter) == 0x000020, "Wrong size on UMG_PlaylistItem_C_DisplayModeFilter");
static_assert(offsetof(UMG_PlaylistItem_C_DisplayModeFilter, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'UMG_PlaylistItem_C_DisplayModeFilter::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_DisplayModeFilter, CallFunc_PushMenu_ReturnValue) == 0x000008, "Member 'UMG_PlaylistItem_C_DisplayModeFilter::CallFunc_PushMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_DisplayModeFilter, K2Node_DynamicCast_AsUMG_Mode_Filter) == 0x000010, "Member 'UMG_PlaylistItem_C_DisplayModeFilter::K2Node_DynamicCast_AsUMG_Mode_Filter' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_DisplayModeFilter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_PlaylistItem_C_DisplayModeFilter::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_PlaylistItem.UMG_PlaylistItem_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_PlaylistItem_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_PlaylistItem_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_PlaylistItem_C_OnFocusReceived");
static_assert(sizeof(UMG_PlaylistItem_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_PlaylistItem_C_OnFocusReceived");
static_assert(offsetof(UMG_PlaylistItem_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_PlaylistItem_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_PlaylistItem_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_PlaylistItem_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlaylistItem_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_PlaylistItem_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

