#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameWidget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EndGameWidget.UMG_EndGameWidget_C
// 0x0068 (0x03E8 - 0x0380)
class UUMG_EndGameWidget_C final : public UPBEndGameWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBAdvancedSwitcher*                    AdvancedSwitcher;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Main;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_143;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Mark;                                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BottomParty_C*                     UMG_BottomParty;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengePage_C*            UMG_EndGameChallengePage_78;                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGamePerformancePage_C*          UMG_EndGamePerformancePage;                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameScoreboardPage_C*           UMG_EndGameScoreboardPage_167;                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameUpgradePage_C*              UMG_EndGameUpgradePage;                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           Option_Texts;                                      // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_EndGameWidget(int32 EntryPoint);
	void BndEvt__UMG_EndGameWidget_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature(int32 CurrentSelectIndex, int32 LastSelectIndex);
	void K2_LoadingTimeout();
	void BP_OnActivated();
	void K2_RefreshUIData(bool bDataReady);
	void Construct();
	void UpdateFocus();
	void ShowPage();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	bool BP_OnHandleBackAction();
	void BackToOverview(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EndGameWidget_C">();
	}
	static class UUMG_EndGameWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EndGameWidget_C>();
	}
};
static_assert(alignof(UUMG_EndGameWidget_C) == 0x000008, "Wrong alignment on UUMG_EndGameWidget_C");
static_assert(sizeof(UUMG_EndGameWidget_C) == 0x0003E8, "Wrong size on UUMG_EndGameWidget_C");
static_assert(offsetof(UUMG_EndGameWidget_C, UberGraphFrame) == 0x000380, "Member 'UUMG_EndGameWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, AdvancedSwitcher) == 0x000388, "Member 'UUMG_EndGameWidget_C::AdvancedSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, Button_Main) == 0x000390, "Member 'UUMG_EndGameWidget_C::Button_Main' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, Image_143) == 0x000398, "Member 'UUMG_EndGameWidget_C::Image_143' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, Mark) == 0x0003A0, "Member 'UUMG_EndGameWidget_C::Mark' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, SafeZone_0) == 0x0003A8, "Member 'UUMG_EndGameWidget_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, UMG_BottomParty) == 0x0003B0, "Member 'UUMG_EndGameWidget_C::UMG_BottomParty' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, UMG_EndGameChallengePage_78) == 0x0003B8, "Member 'UUMG_EndGameWidget_C::UMG_EndGameChallengePage_78' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, UMG_EndGamePerformancePage) == 0x0003C0, "Member 'UUMG_EndGameWidget_C::UMG_EndGamePerformancePage' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, UMG_EndGameScoreboardPage_167) == 0x0003C8, "Member 'UUMG_EndGameWidget_C::UMG_EndGameScoreboardPage_167' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, UMG_EndGameUpgradePage) == 0x0003D0, "Member 'UUMG_EndGameWidget_C::UMG_EndGameUpgradePage' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameWidget_C, Option_Texts) == 0x0003D8, "Member 'UUMG_EndGameWidget_C::Option_Texts' has a wrong offset!");

}

