#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Overview

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Overview.UMG_Overview_C
// 0x0090 (0x03B0 - 0x0320)
class UUMG_Overview_C final : public UPBCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_MainMenuPlayCard_C*                ActivityMode;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Detail;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        LoadingMask;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MainMenuPlayCard_C*                QuickPlay;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Activity;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MainMenuPlayCard_C*                Store;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ImagineBG;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCommonActivatableWidget*             FocusedWidget;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CardHovered;                                       // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              StoreBtnClicked;                                   // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FPBPlaylistItemData>            Playlist;                                          // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsQuickPlaying;                                    // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsQuickActivity;                                   // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_QueryPlayList;                               // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Overview(int32 EntryPoint);
	void OnInitialized();
	void Construct();
	void BndEvt__UMG_Overview_Store_K2Node_ComponentBoundEvent_7_BtnReleased__DelegateSignature();
	void BndEvt__UMG_Overview_Store_K2Node_ComponentBoundEvent_6_BtnPressed__DelegateSignature();
	void BndEvt__UMG_Overview_ActivityMode_K2Node_ComponentBoundEvent_5_BtnClick__DelegateSignature();
	void BndEvt__UMG_Overview_ActivityMode_K2Node_ComponentBoundEvent_4_HintsHover__DelegateSignature();
	void BndEvt__UMG_Overview_QuickPlay_K2Node_ComponentBoundEvent_3_BtnClick__DelegateSignature();
	void BndEvt__UMG_Overview_QuickPlay_K2Node_ComponentBoundEvent_2_HintsHover__DelegateSignature();
	void BndEvt__UMG_Overview_Store_K2Node_ComponentBoundEvent_1_BtnClick__DelegateSignature();
	void BndEvt__UMG_Overview_Store_K2Node_ComponentBoundEvent_0_HintsHover__DelegateSignature();
	void BP_OnActivated();
	void OnPlaylistUpdated(bool bWasSuccessful, const TArray<struct FPBPlaylistItemData>& UpdatedDatas, const EPBPlayListType PlayListType);
	void InitFocus();
	void OnMatchingStateChanged(EPBMatchmakingStatus NewState);
	void Query_Play_List();
	void OnQueryPlayListFailed();
	void OnCreatePartySuccessfully();
	void OnJoinPartyFinished();
	void OnPromoteMemberFinished();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Overview_C">();
	}
	static class UUMG_Overview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Overview_C>();
	}
};
static_assert(alignof(UUMG_Overview_C) == 0x000008, "Wrong alignment on UUMG_Overview_C");
static_assert(sizeof(UUMG_Overview_C) == 0x0003B0, "Wrong size on UUMG_Overview_C");
static_assert(offsetof(UUMG_Overview_C, UberGraphFrame) == 0x000320, "Member 'UUMG_Overview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, ActivityMode) == 0x000328, "Member 'UUMG_Overview_C::ActivityMode' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, Detail) == 0x000330, "Member 'UUMG_Overview_C::Detail' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, LoadingMask) == 0x000338, "Member 'UUMG_Overview_C::LoadingMask' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, QuickPlay) == 0x000340, "Member 'UUMG_Overview_C::QuickPlay' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, SizeBox_Activity) == 0x000348, "Member 'UUMG_Overview_C::SizeBox_Activity' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, Store) == 0x000350, "Member 'UUMG_Overview_C::Store' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, Title) == 0x000358, "Member 'UUMG_Overview_C::Title' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, ImagineBG) == 0x000360, "Member 'UUMG_Overview_C::ImagineBG' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, FocusedWidget) == 0x000368, "Member 'UUMG_Overview_C::FocusedWidget' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, CardHovered) == 0x000370, "Member 'UUMG_Overview_C::CardHovered' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, StoreBtnClicked) == 0x000380, "Member 'UUMG_Overview_C::StoreBtnClicked' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, Playlist) == 0x000390, "Member 'UUMG_Overview_C::Playlist' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, IsQuickPlaying) == 0x0003A0, "Member 'UUMG_Overview_C::IsQuickPlaying' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, IsQuickActivity) == 0x0003A1, "Member 'UUMG_Overview_C::IsQuickActivity' has a wrong offset!");
static_assert(offsetof(UUMG_Overview_C, Timer_QueryPlayList) == 0x0003A8, "Member 'UUMG_Overview_C::Timer_QueryPlayList' has a wrong offset!");

}

