#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_AssignmentActionTeam

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_AssignmentActionTeam.UMG_AssignmentActionTeam_C.ExecuteUbergraph_UMG_AssignmentActionTeam
// 0x00C8 (0x00C8 - 0x0000)
struct UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_AssigmentMemberInfo_C*             K2Node_DynamicCast_AsUMG_Assigment_Member_Info;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBLobbyPlayerState*                    CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_AssigmentMemberInfo_C*             K2Node_DynamicCast_AsUMG_Assigment_Member_Info_1;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0018)()
};
static_assert(alignof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam) == 0x000008, "Wrong alignment on UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam");
static_assert(sizeof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam) == 0x0000C8, "Wrong size on UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, EntryPoint) == 0x000000, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Array_Get_Item) == 0x000030, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, K2Node_DynamicCast_AsUMG_Assigment_Member_Info) == 0x000038, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::K2Node_DynamicCast_AsUMG_Assigment_Member_Info' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, K2Node_DynamicCast_AsUMG_Assigment_Member_Info_1) == 0x000058, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::K2Node_DynamicCast_AsUMG_Assigment_Member_Info_1' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Less_IntInt_ReturnValue) == 0x000061, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, K2Node_SwitchEnum_CmpSuccess) == 0x000069, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_MakeLiteralString_ReturnValue) == 0x000070, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000080, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A0, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'UMG_AssignmentActionTeam_C_ExecuteUbergraph_UMG_AssignmentActionTeam::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

