#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameChallengeCard

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_EndGameChallengeCard.UMG_EndGameChallengeCard_C.ExecuteUbergraph_UMG_EndGameChallengeCard
// 0x0080 (0x0080 - 0x0000)
struct UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0018)()
	class UUMG_ProgressionRewardItem_C*           CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CallFunc_SpawnObject_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBProgressionItem                     CallFunc_Array_Get_Item;                           // 0x0058(0x000C)(NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard) == 0x000008, "Wrong alignment on UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard");
static_assert(sizeof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard) == 0x000080, "Wrong size on UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, EntryPoint) == 0x000000, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, K2Node_Event_IsDesignTime) == 0x000010, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000030, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_Create_ReturnValue) == 0x000048, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_SpawnObject_ReturnValue) == 0x000050, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_Array_Get_Item) == 0x000058, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_AddChild_ReturnValue) == 0x000068, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard, CallFunc_AddChild_ReturnValue_1) == 0x000078, "Member 'UMG_EndGameChallengeCard_C_ExecuteUbergraph_UMG_EndGameChallengeCard::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function UMG_EndGameChallengeCard.UMG_EndGameChallengeCard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_EndGameChallengeCard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EndGameChallengeCard_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_EndGameChallengeCard_C_PreConstruct");
static_assert(sizeof(UMG_EndGameChallengeCard_C_PreConstruct) == 0x000001, "Wrong size on UMG_EndGameChallengeCard_C_PreConstruct");
static_assert(offsetof(UMG_EndGameChallengeCard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_EndGameChallengeCard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_EndGameChallengeCard.UMG_EndGameChallengeCard_C.UpdateStyle
// 0x0020 (0x0020 - 0x0000)
struct UMG_EndGameChallengeCard_C_UpdateStyle final
{
public:
	class UPBProgression*                         LocalProgression;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBProgressionManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBProgression*                         CallFunc_GetProgression_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EndGameChallengeCard_C_UpdateStyle) == 0x000008, "Wrong alignment on UMG_EndGameChallengeCard_C_UpdateStyle");
static_assert(sizeof(UMG_EndGameChallengeCard_C_UpdateStyle) == 0x000020, "Wrong size on UMG_EndGameChallengeCard_C_UpdateStyle");
static_assert(offsetof(UMG_EndGameChallengeCard_C_UpdateStyle, LocalProgression) == 0x000000, "Member 'UMG_EndGameChallengeCard_C_UpdateStyle::LocalProgression' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_UpdateStyle, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_EndGameChallengeCard_C_UpdateStyle::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_UpdateStyle, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UMG_EndGameChallengeCard_C_UpdateStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_UpdateStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'UMG_EndGameChallengeCard_C_UpdateStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_UpdateStyle, CallFunc_GetProgression_ReturnValue) == 0x000018, "Member 'UMG_EndGameChallengeCard_C_UpdateStyle::CallFunc_GetProgression_ReturnValue' has a wrong offset!");

// Function UMG_EndGameChallengeCard.UMG_EndGameChallengeCard_C.UpdateProgressBar
// 0x000C (0x000C - 0x0000)
struct UMG_EndGameChallengeCard_C_UpdateProgressBar final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EndGameChallengeCard_C_UpdateProgressBar) == 0x000004, "Wrong alignment on UMG_EndGameChallengeCard_C_UpdateProgressBar");
static_assert(sizeof(UMG_EndGameChallengeCard_C_UpdateProgressBar) == 0x00000C, "Wrong size on UMG_EndGameChallengeCard_C_UpdateProgressBar");
static_assert(offsetof(UMG_EndGameChallengeCard_C_UpdateProgressBar, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'UMG_EndGameChallengeCard_C_UpdateProgressBar::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_UpdateProgressBar, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000004, "Member 'UMG_EndGameChallengeCard_C_UpdateProgressBar::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameChallengeCard_C_UpdateProgressBar, CallFunc_SafeDivide_ReturnValue) == 0x000008, "Member 'UMG_EndGameChallengeCard_C_UpdateProgressBar::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");

}

