#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_KeyBindingOptionItem

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_KeyBindingOptionItem.UMG_KeyBindingOptionItem_C
// 0x0060 (0x0310 - 0x02B0)
class UUMG_KeyBindingOptionItem_C final : public UPBKeyBindingOptionItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ReadyToRecord2;                                    // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReadyToRecord1;                                    // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Bind1;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Bind2;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ReadyForInputText;                                 // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnEndRecordKeyEvent;                               // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_KeyBindingOptionItem(int32 EntryPoint);
	void K2_ShowConfirmReplaceConflictPage(const TArray<struct FPBInputSecondMappingDataTableRowBase>& ConflictRowArray);
	void K2_EndRecordKey();
	void K2_ReadyToRecordKey();
	void BndEvt__UMG_KeyBindingOptionItem_Bind2_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_KeyBindingOptionItem_Bind1_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void RefreshKeyName();
	void K2_Ready_To_Record_Key();
	void EndBindding();
	void ShowConfirmReplacePage(TArray<struct FPBInputSecondMappingDataTableRowBase>& ConflictRowArray);
	void ConfirmReplaceConflictInput(bool bConfirm);
	void GetKeyName(const struct FKey& Key, class FText* KeyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_KeyBindingOptionItem_C">();
	}
	static class UUMG_KeyBindingOptionItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_KeyBindingOptionItem_C>();
	}
};
static_assert(alignof(UUMG_KeyBindingOptionItem_C) == 0x000008, "Wrong alignment on UUMG_KeyBindingOptionItem_C");
static_assert(sizeof(UUMG_KeyBindingOptionItem_C) == 0x000310, "Wrong size on UUMG_KeyBindingOptionItem_C");
static_assert(offsetof(UUMG_KeyBindingOptionItem_C, UberGraphFrame) == 0x0002B0, "Member 'UUMG_KeyBindingOptionItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_KeyBindingOptionItem_C, ReadyToRecord2) == 0x0002B8, "Member 'UUMG_KeyBindingOptionItem_C::ReadyToRecord2' has a wrong offset!");
static_assert(offsetof(UUMG_KeyBindingOptionItem_C, ReadyToRecord1) == 0x0002C0, "Member 'UUMG_KeyBindingOptionItem_C::ReadyToRecord1' has a wrong offset!");
static_assert(offsetof(UUMG_KeyBindingOptionItem_C, Bind1) == 0x0002C8, "Member 'UUMG_KeyBindingOptionItem_C::Bind1' has a wrong offset!");
static_assert(offsetof(UUMG_KeyBindingOptionItem_C, Bind2) == 0x0002D0, "Member 'UUMG_KeyBindingOptionItem_C::Bind2' has a wrong offset!");
static_assert(offsetof(UUMG_KeyBindingOptionItem_C, CommonTextBlock_1) == 0x0002D8, "Member 'UUMG_KeyBindingOptionItem_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UUMG_KeyBindingOptionItem_C, CommonTextBlock_2) == 0x0002E0, "Member 'UUMG_KeyBindingOptionItem_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UUMG_KeyBindingOptionItem_C, ReadyForInputText) == 0x0002E8, "Member 'UUMG_KeyBindingOptionItem_C::ReadyForInputText' has a wrong offset!");
static_assert(offsetof(UUMG_KeyBindingOptionItem_C, OnEndRecordKeyEvent) == 0x000300, "Member 'UUMG_KeyBindingOptionItem_C::OnEndRecordKeyEvent' has a wrong offset!");

}

