#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_Mother

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_InGameHUD_Mother.UMG_InGameHUD_Mother_C
// 0x00E0 (0x0348 - 0x0268)
class UUMG_InGameHUD_Mother_C final : public UPBHelmetHUD_Mother
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideOnADS;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EngineShut;                                        // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_IngameHUD_WarningWidget;                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoin_MiniMap;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Health;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_HorizonIndicator;                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Mobility;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_MobilityHint;                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Pod_Left;                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Pod_Right;                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Velocity;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_WeaponInfo;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUD_BeingRescue_C*                     HUD_BeingRescue;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_IngameHUD_AllowedClimb_C*          UMG_IngameHUD_AllowedClimb;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_IngameHUD_Climbing_C*              UMG_IngameHUD_Climbing;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_IngameHUD_ClimbState_C*            UMG_IngameHUD_ClimbState;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InGameHUD_Health_C*                UMG_InGameHUD_Health_L;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InGameHUD_Health_C*                UMG_InGameHUD_Health_R;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InGameHUD_OperationInstruction_C*  UMG_InGameHUD_OperationInstruction;                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InGameHUD_Progress_MG_Deploy_C*    UMG_InGameHUD_Progress_MG_Deploy;                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_IngameHUD_AmmoWarning_C*           WBP_IngameHUD_AmmoWarning;                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBWarningWidget*                       WarningWidget;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBWarningWidget*                       BackPackWarningWidget;                             // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_0;                                          // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBLauncherWidget*                      LeftLauncherWidget;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBLauncherWidget*                      RightLauncherWidget;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_InGameHUD_Mother(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void CustomEvent_InitMobilityIcon();
	void EngineIdle(bool GoIdle);
	void FindItemNameFromPBItemDataTable(class APBWeapon* Target, bool* Succeed, class FText* ItemName);
	void ShowBeingRescuedTip();
	void HiddenBeingRescuedTip();
	void AddWarningWidget(class UPBWarningWidget* InWidget);
	void AddBackPackWidget(class UPBWarningWidget* InWidget);
	class APBCharacter* GetOwningCharacter_();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_InGameHUD_Mother_C">();
	}
	static class UUMG_InGameHUD_Mother_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_InGameHUD_Mother_C>();
	}
};
static_assert(alignof(UUMG_InGameHUD_Mother_C) == 0x000008, "Wrong alignment on UUMG_InGameHUD_Mother_C");
static_assert(sizeof(UUMG_InGameHUD_Mother_C) == 0x000348, "Wrong size on UUMG_InGameHUD_Mother_C");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, UberGraphFrame) == 0x000268, "Member 'UUMG_InGameHUD_Mother_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, HideOnADS) == 0x000270, "Member 'UUMG_InGameHUD_Mother_C::HideOnADS' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, EngineShut) == 0x000278, "Member 'UUMG_InGameHUD_Mother_C::EngineShut' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, Border_IngameHUD_WarningWidget) == 0x000280, "Member 'UUMG_InGameHUD_Mother_C::Border_IngameHUD_WarningWidget' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, ExtensionPoin_MiniMap) == 0x000288, "Member 'UUMG_InGameHUD_Mother_C::ExtensionPoin_MiniMap' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, ExtensionPoint_Health) == 0x000290, "Member 'UUMG_InGameHUD_Mother_C::ExtensionPoint_Health' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, ExtensionPoint_HorizonIndicator) == 0x000298, "Member 'UUMG_InGameHUD_Mother_C::ExtensionPoint_HorizonIndicator' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, ExtensionPoint_Mobility) == 0x0002A0, "Member 'UUMG_InGameHUD_Mother_C::ExtensionPoint_Mobility' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, ExtensionPoint_MobilityHint) == 0x0002A8, "Member 'UUMG_InGameHUD_Mother_C::ExtensionPoint_MobilityHint' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, ExtensionPoint_Pod_Left) == 0x0002B0, "Member 'UUMG_InGameHUD_Mother_C::ExtensionPoint_Pod_Left' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, ExtensionPoint_Pod_Right) == 0x0002B8, "Member 'UUMG_InGameHUD_Mother_C::ExtensionPoint_Pod_Right' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, ExtensionPoint_Velocity) == 0x0002C0, "Member 'UUMG_InGameHUD_Mother_C::ExtensionPoint_Velocity' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, ExtensionPoint_WeaponInfo) == 0x0002C8, "Member 'UUMG_InGameHUD_Mother_C::ExtensionPoint_WeaponInfo' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, HUD_BeingRescue) == 0x0002D0, "Member 'UUMG_InGameHUD_Mother_C::HUD_BeingRescue' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, InvalidationBox_0) == 0x0002D8, "Member 'UUMG_InGameHUD_Mother_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, UMG_IngameHUD_AllowedClimb) == 0x0002E0, "Member 'UUMG_InGameHUD_Mother_C::UMG_IngameHUD_AllowedClimb' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, UMG_IngameHUD_Climbing) == 0x0002E8, "Member 'UUMG_InGameHUD_Mother_C::UMG_IngameHUD_Climbing' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, UMG_IngameHUD_ClimbState) == 0x0002F0, "Member 'UUMG_InGameHUD_Mother_C::UMG_IngameHUD_ClimbState' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, UMG_InGameHUD_Health_L) == 0x0002F8, "Member 'UUMG_InGameHUD_Mother_C::UMG_InGameHUD_Health_L' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, UMG_InGameHUD_Health_R) == 0x000300, "Member 'UUMG_InGameHUD_Mother_C::UMG_InGameHUD_Health_R' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, UMG_InGameHUD_OperationInstruction) == 0x000308, "Member 'UUMG_InGameHUD_Mother_C::UMG_InGameHUD_OperationInstruction' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, UMG_InGameHUD_Progress_MG_Deploy) == 0x000310, "Member 'UUMG_InGameHUD_Mother_C::UMG_InGameHUD_Progress_MG_Deploy' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, WBP_IngameHUD_AmmoWarning) == 0x000318, "Member 'UUMG_InGameHUD_Mother_C::WBP_IngameHUD_AmmoWarning' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, WarningWidget) == 0x000320, "Member 'UUMG_InGameHUD_Mother_C::WarningWidget' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, BackPackWarningWidget) == 0x000328, "Member 'UUMG_InGameHUD_Mother_C::BackPackWarningWidget' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, NewVar_0) == 0x000330, "Member 'UUMG_InGameHUD_Mother_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, LeftLauncherWidget) == 0x000338, "Member 'UUMG_InGameHUD_Mother_C::LeftLauncherWidget' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Mother_C, RightLauncherWidget) == 0x000340, "Member 'UUMG_InGameHUD_Mother_C::RightLauncherWidget' has a wrong offset!");

}

