#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FeedbackWidget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_FeedbackWidget.UMG_FeedbackWidget_C
// 0x0050 (0x03A0 - 0x0350)
class UUMG_FeedbackWidget_C final : public UPBFeedbackWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Cancel;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Send;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ContentTextNum;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_109;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_191;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerName;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleTextNum;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_FeedbackWidget(int32 EntryPoint);
	void BP_OnActivated();
	void CustomEvent_0(bool bConfirm);
	void ConfirmPopMenu(bool bConfirm);
	void Construct();
	void BndEvt__UMG_FeedbackWidget_Title_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void K2_OnCreateFeedbackComplete(bool bWasSuccessful, int32 ErrorCode);
	void BndEvt__UMG_FeedbackWidget_Button_Cancel_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_FeedbackWidget_Button_Send_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_FeedbackWidget_ContentWidget_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_FeedbackWidget_C">();
	}
	static class UUMG_FeedbackWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_FeedbackWidget_C>();
	}
};
static_assert(alignof(UUMG_FeedbackWidget_C) == 0x000008, "Wrong alignment on UUMG_FeedbackWidget_C");
static_assert(sizeof(UUMG_FeedbackWidget_C) == 0x0003A0, "Wrong size on UUMG_FeedbackWidget_C");
static_assert(offsetof(UUMG_FeedbackWidget_C, UberGraphFrame) == 0x000350, "Member 'UUMG_FeedbackWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_FeedbackWidget_C, Button_Cancel) == 0x000358, "Member 'UUMG_FeedbackWidget_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UUMG_FeedbackWidget_C, Button_Send) == 0x000360, "Member 'UUMG_FeedbackWidget_C::Button_Send' has a wrong offset!");
static_assert(offsetof(UUMG_FeedbackWidget_C, ContentTextNum) == 0x000368, "Member 'UUMG_FeedbackWidget_C::ContentTextNum' has a wrong offset!");
static_assert(offsetof(UUMG_FeedbackWidget_C, Image_2) == 0x000370, "Member 'UUMG_FeedbackWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUMG_FeedbackWidget_C, Image_3) == 0x000378, "Member 'UUMG_FeedbackWidget_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUMG_FeedbackWidget_C, Image_109) == 0x000380, "Member 'UUMG_FeedbackWidget_C::Image_109' has a wrong offset!");
static_assert(offsetof(UUMG_FeedbackWidget_C, Image_191) == 0x000388, "Member 'UUMG_FeedbackWidget_C::Image_191' has a wrong offset!");
static_assert(offsetof(UUMG_FeedbackWidget_C, TextBlock_PlayerName) == 0x000390, "Member 'UUMG_FeedbackWidget_C::TextBlock_PlayerName' has a wrong offset!");
static_assert(offsetof(UUMG_FeedbackWidget_C, TitleTextNum) == 0x000398, "Member 'UUMG_FeedbackWidget_C::TitleTextNum' has a wrong offset!");

}

