#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGamePlayerScoreWidget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EndGamePlayerScoreWidget.UMG_EndGamePlayerScoreWidget_C
// 0x0050 (0x02E8 - 0x0298)
class UUMG_EndGamePlayerScoreWidget_C final : public UPBEndGamePlayerScoreWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ASSISTSText;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DeathText;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KDText;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KillText;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MvpImage;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreText;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollText_C*                          ScrollText;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsBlackBG;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_EndGamePlayerScoreWidget(int32 EntryPoint);
	void K2_UpdatePlayerData();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetStyle(bool bIsSelf_0, bool bIsBlackBG);
	void RefreshData();
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EndGamePlayerScoreWidget_C">();
	}
	static class UUMG_EndGamePlayerScoreWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EndGamePlayerScoreWidget_C>();
	}
};
static_assert(alignof(UUMG_EndGamePlayerScoreWidget_C) == 0x000008, "Wrong alignment on UUMG_EndGamePlayerScoreWidget_C");
static_assert(sizeof(UUMG_EndGamePlayerScoreWidget_C) == 0x0002E8, "Wrong size on UUMG_EndGamePlayerScoreWidget_C");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, UberGraphFrame) == 0x000298, "Member 'UUMG_EndGamePlayerScoreWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, ASSISTSText) == 0x0002A0, "Member 'UUMG_EndGamePlayerScoreWidget_C::ASSISTSText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, DeathText) == 0x0002A8, "Member 'UUMG_EndGamePlayerScoreWidget_C::DeathText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, Image_BG) == 0x0002B0, "Member 'UUMG_EndGamePlayerScoreWidget_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, KDText) == 0x0002B8, "Member 'UUMG_EndGamePlayerScoreWidget_C::KDText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, KillText) == 0x0002C0, "Member 'UUMG_EndGamePlayerScoreWidget_C::KillText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, MvpImage) == 0x0002C8, "Member 'UUMG_EndGamePlayerScoreWidget_C::MvpImage' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, ScoreText) == 0x0002D0, "Member 'UUMG_EndGamePlayerScoreWidget_C::ScoreText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, ScrollText) == 0x0002D8, "Member 'UUMG_EndGamePlayerScoreWidget_C::ScrollText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePlayerScoreWidget_C, IsBlackBG) == 0x0002E0, "Member 'UUMG_EndGamePlayerScoreWidget_C::IsBlackBG' has a wrong offset!");

}

