#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_WeaponInfo_AmmoCount

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_InGameHUD_WeaponInfo_AmmoCount.UMG_InGameHUD_WeaponInfo_AmmoCount_C.ExecuteUbergraph_UMG_InGameHUD_WeaponInfo_AmmoCount
// 0x0004 (0x0004 - 0x0000)
struct UMG_InGameHUD_WeaponInfo_AmmoCount_C_ExecuteUbergraph_UMG_InGameHUD_WeaponInfo_AmmoCount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_ExecuteUbergraph_UMG_InGameHUD_WeaponInfo_AmmoCount) == 0x000004, "Wrong alignment on UMG_InGameHUD_WeaponInfo_AmmoCount_C_ExecuteUbergraph_UMG_InGameHUD_WeaponInfo_AmmoCount");
static_assert(sizeof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_ExecuteUbergraph_UMG_InGameHUD_WeaponInfo_AmmoCount) == 0x000004, "Wrong size on UMG_InGameHUD_WeaponInfo_AmmoCount_C_ExecuteUbergraph_UMG_InGameHUD_WeaponInfo_AmmoCount");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_ExecuteUbergraph_UMG_InGameHUD_WeaponInfo_AmmoCount, EntryPoint) == 0x000000, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_ExecuteUbergraph_UMG_InGameHUD_WeaponInfo_AmmoCount::EntryPoint' has a wrong offset!");

// Function UMG_InGameHUD_WeaponInfo_AmmoCount.UMG_InGameHUD_WeaponInfo_AmmoCount_C.RefreshAmmoTypeInfo
// 0x08F0 (0x08F0 - 0x0000)
struct UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetWeaponId_ReturnValue;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponDefinitionRedirectionRow      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponDefinitionRow                 CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0028(0x0210)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBRayProjectileConfigRow_Replace      CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0240(0x06A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x08E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo");
static_assert(sizeof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo) == 0x0008F0, "Wrong size on UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo, CallFunc_GetWeaponId_ReturnValue) == 0x000004, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo::CallFunc_GetWeaponId_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000028, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000238, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000240, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x0008E8, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo, K2Node_SwitchEnum_CmpSuccess) == 0x0008E9, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoTypeInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_InGameHUD_WeaponInfo_AmmoCount.UMG_InGameHUD_WeaponInfo_AmmoCount_C.RefreshFireModeInfo
// 0x0002 (0x0002 - 0x0000)
struct UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshFireModeInfo final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshFireModeInfo) == 0x000001, "Wrong alignment on UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshFireModeInfo");
static_assert(sizeof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshFireModeInfo) == 0x000002, "Wrong size on UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshFireModeInfo");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshFireModeInfo, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshFireModeInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshFireModeInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshFireModeInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_InGameHUD_WeaponInfo_AmmoCount.UMG_InGameHUD_WeaponInfo_AmmoCount_C.RefreshAmmoInclipInfo
// 0x00C8 (0x00C8 - 0x0000)
struct UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	int32                                         CallFunc_GetWarningAmmo_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue_1;       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0078(0x0028)()
	int32                                         CallFunc_GetCriticalWarningAmmo_ReturnValue;       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue_2;       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B0(0x0018)()
};
static_assert(alignof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo");
static_assert(sizeof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo) == 0x0000C8, "Wrong size on UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_GetCurrentAmmoInClip_ReturnValue) == 0x000004, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_GetCurrentAmmoInClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_GetWarningAmmo_ReturnValue) == 0x000060, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_GetWarningAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_GetCurrentAmmoInClip_ReturnValue_1) == 0x000064, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_GetCurrentAmmoInClip_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000068, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000070, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, K2Node_MakeStruct_SlateColor_2) == 0x000078, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_GetCriticalWarningAmmo_ReturnValue) == 0x0000A0, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_GetCriticalWarningAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_GetCurrentAmmoInClip_ReturnValue_2) == 0x0000A4, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_GetCurrentAmmoInClip_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000A8, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B0, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshAmmoInclipInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_WeaponInfo_AmmoCount.UMG_InGameHUD_WeaponInfo_AmmoCount_C.RefreshRemainingAmmoInfo
// 0x00B8 (0x00B8 - 0x0000)
struct UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo final
{
public:
	int32                                         LocalRemainingAmmo;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentAmmo_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0028)()
	int32                                         CallFunc_GetWarningAmmo_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0070(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0090(0x0028)()
};
static_assert(alignof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo");
static_assert(sizeof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo) == 0x0000B8, "Wrong size on UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, LocalRemainingAmmo) == 0x000000, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::LocalRemainingAmmo' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, CallFunc_GetCurrentAmmoInClip_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::CallFunc_GetCurrentAmmoInClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, CallFunc_GetCurrentAmmo_ReturnValue) == 0x00000C, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::CallFunc_GetCurrentAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, CallFunc_GetWarningAmmo_ReturnValue) == 0x000068, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::CallFunc_GetWarningAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000070, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000088, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo, K2Node_MakeStruct_SlateColor_2) == 0x000090, "Member 'UMG_InGameHUD_WeaponInfo_AmmoCount_C_RefreshRemainingAmmoInfo::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

}

