#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SettingBase

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SettingBase.UMG_SettingBase_C
// 0x0078 (0x02E8 - 0x0270)
class UUMG_SettingBase_C final : public UPBSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBAdvancedSwitcher*                    MainSwitcher;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ContentFilter_C*                   UMG_ContentFilter;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SettingAudioLanguage_C*            UMG_SettingAudioLanguage;                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SettingController_C*               UMG_SettingController;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SettingGraphics_C*                 UMG_SettingGraphics;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SettingMouseKeyboard_C*            UMG_SettingMouseKeyboard;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentPageIndex;                                  // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bShow)>    OnShowControllerButtonSettingEvent;                // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnTryBackEvent;                                    // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPBUserWidget*                          FocusWidget;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Activated)> OnGraphicsSettingsActivatedChanged;                // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_SettingBase(int32 EntryPoint);
	void BndEvt__UMG_SettingBase_UMG_SettingGraphics_K2Node_ComponentBoundEvent_2_OnWidgetActivationChanged__DelegateSignature();
	void BndEvt__UMG_SettingBase_UMG_SettingGraphics_K2Node_ComponentBoundEvent_1_OnWidgetActivationChanged__DelegateSignature();
	void BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature(int32 CurrentSelectIndex, int32 LastSelectIndex);
	void K2_SwitchPageTab(bool bToLeft);
	void K2_ShowResetConfirmPage();
	void K2_ShowSaveConfirmPage();
	void K2_TryBack();
	void OnInitialized();
	void ShowSaveConfirmPage();
	void IsContainsKey(class FName InputActionName, const struct FKey& InKey, bool* bContains);
	void ShowResetConfirmPage();
	void HandleResetConfirm(int32 Index_0);
	void ResetOption();
	void BindSubPageBtnClick();
	void BackPreviousEvent(bool bQuitgame);
	void OnShowButtonSetting(bool bShow);
	void InitializeSwitcher();
	void RestoreFocus();
	void CallNotifyTryBack();
	void CallNotifyShowReset();
	void CallNotifyTrySave();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SettingBase_C">();
	}
	static class UUMG_SettingBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SettingBase_C>();
	}
};
static_assert(alignof(UUMG_SettingBase_C) == 0x000008, "Wrong alignment on UUMG_SettingBase_C");
static_assert(sizeof(UUMG_SettingBase_C) == 0x0002E8, "Wrong size on UUMG_SettingBase_C");
static_assert(offsetof(UUMG_SettingBase_C, UberGraphFrame) == 0x000270, "Member 'UUMG_SettingBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, MainSwitcher) == 0x000278, "Member 'UUMG_SettingBase_C::MainSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, UMG_ContentFilter) == 0x000280, "Member 'UUMG_SettingBase_C::UMG_ContentFilter' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, UMG_SettingAudioLanguage) == 0x000288, "Member 'UUMG_SettingBase_C::UMG_SettingAudioLanguage' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, UMG_SettingController) == 0x000290, "Member 'UUMG_SettingBase_C::UMG_SettingController' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, UMG_SettingGraphics) == 0x000298, "Member 'UUMG_SettingBase_C::UMG_SettingGraphics' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, UMG_SettingMouseKeyboard) == 0x0002A0, "Member 'UUMG_SettingBase_C::UMG_SettingMouseKeyboard' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, CurrentPageIndex) == 0x0002A8, "Member 'UUMG_SettingBase_C::CurrentPageIndex' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, OnShowControllerButtonSettingEvent) == 0x0002B0, "Member 'UUMG_SettingBase_C::OnShowControllerButtonSettingEvent' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, OnTryBackEvent) == 0x0002C0, "Member 'UUMG_SettingBase_C::OnTryBackEvent' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, FocusWidget) == 0x0002D0, "Member 'UUMG_SettingBase_C::FocusWidget' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_C, OnGraphicsSettingsActivatedChanged) == 0x0002D8, "Member 'UUMG_SettingBase_C::OnGraphicsSettingsActivatedChanged' has a wrong offset!");

}

