#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EnumOptionItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EnumOptionItem.UMG_EnumOptionItem_C
// 0x0050 (0x02E8 - 0x0298)
class UUMG_EnumOptionItem_C final : public UPBEnumOptionItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SelectedOn;                                        // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CheckImageR;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PodName;                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                OptionButtonLeft;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                OptionButtonRight;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TabBoard;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TabBoardRight;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnSelected;                                        // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_EnumOptionItem(int32 EntryPoint);
	void K2_RefreshValue();
	void K2_SetValid(bool bIsValid);
	void K2_InitValue();
	void K2_SwitchValue(bool bNext);
	void BndEvt__UMG_EnumItem_OptionButtonRight_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_EnumItem_OptionButtonLeft_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void K2_CancelSelect();
	void K2_Select();
	void Construct();
	void RefreshValueStyle();
	class UWidget* NavigationCustom(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EnumOptionItem_C">();
	}
	static class UUMG_EnumOptionItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EnumOptionItem_C>();
	}
};
static_assert(alignof(UUMG_EnumOptionItem_C) == 0x000008, "Wrong alignment on UUMG_EnumOptionItem_C");
static_assert(sizeof(UUMG_EnumOptionItem_C) == 0x0002E8, "Wrong size on UUMG_EnumOptionItem_C");
static_assert(offsetof(UUMG_EnumOptionItem_C, UberGraphFrame) == 0x000298, "Member 'UUMG_EnumOptionItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EnumOptionItem_C, SelectedOn) == 0x0002A0, "Member 'UUMG_EnumOptionItem_C::SelectedOn' has a wrong offset!");
static_assert(offsetof(UUMG_EnumOptionItem_C, CheckImageR) == 0x0002A8, "Member 'UUMG_EnumOptionItem_C::CheckImageR' has a wrong offset!");
static_assert(offsetof(UUMG_EnumOptionItem_C, CommonTextBlock_PodName) == 0x0002B0, "Member 'UUMG_EnumOptionItem_C::CommonTextBlock_PodName' has a wrong offset!");
static_assert(offsetof(UUMG_EnumOptionItem_C, OptionButtonLeft) == 0x0002B8, "Member 'UUMG_EnumOptionItem_C::OptionButtonLeft' has a wrong offset!");
static_assert(offsetof(UUMG_EnumOptionItem_C, OptionButtonRight) == 0x0002C0, "Member 'UUMG_EnumOptionItem_C::OptionButtonRight' has a wrong offset!");
static_assert(offsetof(UUMG_EnumOptionItem_C, TabBoard) == 0x0002C8, "Member 'UUMG_EnumOptionItem_C::TabBoard' has a wrong offset!");
static_assert(offsetof(UUMG_EnumOptionItem_C, TabBoardRight) == 0x0002D0, "Member 'UUMG_EnumOptionItem_C::TabBoardRight' has a wrong offset!");
static_assert(offsetof(UUMG_EnumOptionItem_C, OnSelected) == 0x0002D8, "Member 'UUMG_EnumOptionItem_C::OnSelected' has a wrong offset!");

}

