#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_Catching

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_HelmetHUD_Catching.UMG_HelmetHUD_Catching_C
// 0x0050 (0x0380 - 0x0330)
class UUMG_HelmetHUD_Catching_C final : public UPBHelmetHUD_Catching
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_CoolDown;                                     // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Activate;                                     // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Gamepad_PS;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Gamepad_XBox;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IconBG;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NameBG;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      PBInputTipsImage_KeyBoard;                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_HelmetHUD_Catching(int32 EntryPoint);
	void K2_RefreshEndCoolDownInfo();
	void K2_RefreshStartCoolDownInfo(const float InCoolDownDuration);
	void K2_RefreshCatchingActivateInfo();
	void OnInitialized();
	void K2_RefreshInfo();
	void RefreshInfo();
	void RefreshNameInfo();
	void RefreshIconInfo();
	void RefreshActivateInfo();
	void RefreshCoolDownInfo(float InCoolDownDuration);
	void OnInputDeviceupdate(EInputDevice CurrentDevice);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_HelmetHUD_Catching_C">();
	}
	static class UUMG_HelmetHUD_Catching_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_HelmetHUD_Catching_C>();
	}
};
static_assert(alignof(UUMG_HelmetHUD_Catching_C) == 0x000008, "Wrong alignment on UUMG_HelmetHUD_Catching_C");
static_assert(sizeof(UUMG_HelmetHUD_Catching_C) == 0x000380, "Wrong size on UUMG_HelmetHUD_Catching_C");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, UberGraphFrame) == 0x000330, "Member 'UUMG_HelmetHUD_Catching_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, Anim_CoolDown) == 0x000338, "Member 'UUMG_HelmetHUD_Catching_C::Anim_CoolDown' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, Anim_Activate) == 0x000340, "Member 'UUMG_HelmetHUD_Catching_C::Anim_Activate' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, Image_Gamepad_PS) == 0x000348, "Member 'UUMG_HelmetHUD_Catching_C::Image_Gamepad_PS' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, Image_Gamepad_XBox) == 0x000350, "Member 'UUMG_HelmetHUD_Catching_C::Image_Gamepad_XBox' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, Image_Icon) == 0x000358, "Member 'UUMG_HelmetHUD_Catching_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, Image_IconBG) == 0x000360, "Member 'UUMG_HelmetHUD_Catching_C::Image_IconBG' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, Image_NameBG) == 0x000368, "Member 'UUMG_HelmetHUD_Catching_C::Image_NameBG' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, PBInputTipsImage_KeyBoard) == 0x000370, "Member 'UUMG_HelmetHUD_Catching_C::PBInputTipsImage_KeyBoard' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Catching_C, Text_Name) == 0x000378, "Member 'UUMG_HelmetHUD_Catching_C::Text_Name' has a wrong offset!");

}

