#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DisplayMode

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_DisplayMode.UMG_DisplayMode_C
// 0x00C0 (0x0330 - 0x0270)
class UUMG_DisplayMode_C final : public UPBDisplayModeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Collapse;                                          // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FocusOn;                                           // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_45;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DisplayModeFilterButton_C*         UMG_DisplayModeFilterButton;                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Art_ImageBox_6_C*              UMG_STD_Art_ImageBox_6;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             PlotTexture;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Btn_Clicked;                                       // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             MatchModeTexture;                                  // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBRadioButtonPanelWidget*              In_Radio_Button_Panel_Widget;                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ModeGameName;                                      // 0x02D0(0x0018)(Edit, BlueprintVisible)
	class FText                                   ModePlot;                                          // 0x02E8(0x0018)(Edit, BlueprintVisible)
	bool                                          Searching;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName PlaylistItemName)> Btn_Hover;                                         // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUMG_ModeFilter_C*                      ModeFilter;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             LargePlotTexture;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_DisplayMode(int32 EntryPoint);
	void BndEvt__UMG_DisplayMode_UMG_DisplayModeFilterButton_K2Node_ComponentBoundEvent_0_Click__DelegateSignature();
	void Construct();
	void BndEvt__UMG_DisplayMode_UMG_STD_Art_ImageBox_6_K2Node_ComponentBoundEvent_7_Btn_Unhover__DelegateSignature();
	void BndEvt__UMG_DisplayMode_UMG_STD_Art_ImageBox_6_K2Node_ComponentBoundEvent_6_Btn_Hover__DelegateSignature();
	void BndEvt__UMG_DisplayMode_UMG_STD_Art_ImageBox_6_K2Node_ComponentBoundEvent_5_Btn_Clicked__DelegateSignature();
	void UnselectOption();
	void SetRadioButtonPanel(class UPBRadioButtonPanelWidget* InRadioButtonPanelWidget);
	void SelectOption();
	void Reset();
	void DisplayModeFilter();
	void RefreshSearchMode(bool IsPartyMember);
	void RefreshNormalMode();
	void RefreshPartyStatus(bool IsPartMember);
	void SetSearchMode(bool IsPartyMember);
	void SetNormalMode(bool NeedRevertFocusAnimtion);
	struct FEventReply On_Border_Filter_MouseButtonUp_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_DisplayMode_C">();
	}
	static class UUMG_DisplayMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_DisplayMode_C>();
	}
};
static_assert(alignof(UUMG_DisplayMode_C) == 0x000008, "Wrong alignment on UUMG_DisplayMode_C");
static_assert(sizeof(UUMG_DisplayMode_C) == 0x000330, "Wrong size on UUMG_DisplayMode_C");
static_assert(offsetof(UUMG_DisplayMode_C, UberGraphFrame) == 0x000270, "Member 'UUMG_DisplayMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, Collapse) == 0x000278, "Member 'UUMG_DisplayMode_C::Collapse' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, FocusOn) == 0x000280, "Member 'UUMG_DisplayMode_C::FocusOn' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, HorizontalBox_0) == 0x000288, "Member 'UUMG_DisplayMode_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, Spacer_45) == 0x000290, "Member 'UUMG_DisplayMode_C::Spacer_45' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, UMG_DisplayModeFilterButton) == 0x000298, "Member 'UUMG_DisplayMode_C::UMG_DisplayModeFilterButton' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, UMG_STD_Art_ImageBox_6) == 0x0002A0, "Member 'UUMG_DisplayMode_C::UMG_STD_Art_ImageBox_6' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, PlotTexture) == 0x0002A8, "Member 'UUMG_DisplayMode_C::PlotTexture' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, Btn_Clicked) == 0x0002B0, "Member 'UUMG_DisplayMode_C::Btn_Clicked' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, MatchModeTexture) == 0x0002C0, "Member 'UUMG_DisplayMode_C::MatchModeTexture' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, In_Radio_Button_Panel_Widget) == 0x0002C8, "Member 'UUMG_DisplayMode_C::In_Radio_Button_Panel_Widget' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, ModeGameName) == 0x0002D0, "Member 'UUMG_DisplayMode_C::ModeGameName' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, ModePlot) == 0x0002E8, "Member 'UUMG_DisplayMode_C::ModePlot' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, Searching) == 0x000300, "Member 'UUMG_DisplayMode_C::Searching' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, Btn_Hover) == 0x000308, "Member 'UUMG_DisplayMode_C::Btn_Hover' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, ModeFilter) == 0x000318, "Member 'UUMG_DisplayMode_C::ModeFilter' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, bIsSelected) == 0x000320, "Member 'UUMG_DisplayMode_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayMode_C, LargePlotTexture) == 0x000328, "Member 'UUMG_DisplayMode_C::LargePlotTexture' has a wrong offset!");

}

