#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PlayerDetail_Widget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_PlayerDetail_Widget.UMG_PlayerDetail_Widget_C
// 0x0020 (0x0280 - 0x0260)
class UUMG_PlayerDetail_Widget_C final : public UPBUserWidget
{
public:
	class UImage*                                 Avatar;                                            // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LogicServerID;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollText_C*                          ScrollText;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PartyLeaderWidget_C*               UMG_PartyLeaderWidget;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RefreshInfo(class UPBUserObject* InUserObject, bool IsFromParty);
	void OnAvatarRefreshed(class UTexture2D* InAvatar);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_PlayerDetail_Widget_C">();
	}
	static class UUMG_PlayerDetail_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_PlayerDetail_Widget_C>();
	}
};
static_assert(alignof(UUMG_PlayerDetail_Widget_C) == 0x000008, "Wrong alignment on UUMG_PlayerDetail_Widget_C");
static_assert(sizeof(UUMG_PlayerDetail_Widget_C) == 0x000280, "Wrong size on UUMG_PlayerDetail_Widget_C");
static_assert(offsetof(UUMG_PlayerDetail_Widget_C, Avatar) == 0x000260, "Member 'UUMG_PlayerDetail_Widget_C::Avatar' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerDetail_Widget_C, LogicServerID) == 0x000268, "Member 'UUMG_PlayerDetail_Widget_C::LogicServerID' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerDetail_Widget_C, ScrollText) == 0x000270, "Member 'UUMG_PlayerDetail_Widget_C::ScrollText' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerDetail_Widget_C, UMG_PartyLeaderWidget) == 0x000278, "Member 'UUMG_PlayerDetail_Widget_C::UMG_PartyLeaderWidget' has a wrong offset!");

}

