#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityPopupPage

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ActivityPopupPage.UMG_ActivityPopupPage_C
// 0x0030 (0x0378 - 0x0348)
class UUMG_ActivityPopupPage_C final : public UPBActivityPopupPageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBDailyLoginActivityPageWidget*        DailyLoginPage;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCumulativeLoginActivityPageWidget*   CumulativeLoginPage;                               // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBLimitedTimeLoginActivityPageWidget*  LimitedTimeLoginPage;                              // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBNotificationPageWidget*              NotificationPage;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ActivityPopupPage(int32 EntryPoint);
	void BP_OnActivated();
	void K2_ShowPopupPage();
	void Construct();
	void ShowDailyLoginPage();
	void ShowCumulativeLoginPage();
	void ShowLimitedTimeLoginPage();
	void ShowNotificationPage();
	void CloseThisPage();
	void GotoActivityPage(const class FString& ActivityID, bool News);
	void OnClickedLimitedTimeLogin(const class FString& ActivityID);
	void OnClickedToNotificationPage(const class FString& NotificationID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ActivityPopupPage_C">();
	}
	static class UUMG_ActivityPopupPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ActivityPopupPage_C>();
	}
};
static_assert(alignof(UUMG_ActivityPopupPage_C) == 0x000008, "Wrong alignment on UUMG_ActivityPopupPage_C");
static_assert(sizeof(UUMG_ActivityPopupPage_C) == 0x000378, "Wrong size on UUMG_ActivityPopupPage_C");
static_assert(offsetof(UUMG_ActivityPopupPage_C, UberGraphFrame) == 0x000348, "Member 'UUMG_ActivityPopupPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityPopupPage_C, CanvasPanel_0) == 0x000350, "Member 'UUMG_ActivityPopupPage_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityPopupPage_C, DailyLoginPage) == 0x000358, "Member 'UUMG_ActivityPopupPage_C::DailyLoginPage' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityPopupPage_C, CumulativeLoginPage) == 0x000360, "Member 'UUMG_ActivityPopupPage_C::CumulativeLoginPage' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityPopupPage_C, LimitedTimeLoginPage) == 0x000368, "Member 'UUMG_ActivityPopupPage_C::LimitedTimeLoginPage' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityPopupPage_C, NotificationPage) == 0x000370, "Member 'UUMG_ActivityPopupPage_C::NotificationPage' has a wrong offset!");

}

