#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_HorizonIndicator

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_HelmetHUD_HorizonIndicator.UMG_HelmetHUD_HorizonIndicator_C
// 0x0020 (0x02C8 - 0x02A8)
class UUMG_HelmetHUD_HorizonIndicator_C final : public UPBHelmetHUD_HorizonIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_StartCatching;                                // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Horizon;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShouldShowHint;                                   // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_HelmetHUD_HorizonIndicator(int32 EntryPoint);
	void K2_RefreshEndCatchingInfo();
	void K2_RefreshStartCatchingInfo();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_HelmetHUD_HorizonIndicator_C">();
	}
	static class UUMG_HelmetHUD_HorizonIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_HelmetHUD_HorizonIndicator_C>();
	}
};
static_assert(alignof(UUMG_HelmetHUD_HorizonIndicator_C) == 0x000008, "Wrong alignment on UUMG_HelmetHUD_HorizonIndicator_C");
static_assert(sizeof(UUMG_HelmetHUD_HorizonIndicator_C) == 0x0002C8, "Wrong size on UUMG_HelmetHUD_HorizonIndicator_C");
static_assert(offsetof(UUMG_HelmetHUD_HorizonIndicator_C, UberGraphFrame) == 0x0002A8, "Member 'UUMG_HelmetHUD_HorizonIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_HorizonIndicator_C, Anim_StartCatching) == 0x0002B0, "Member 'UUMG_HelmetHUD_HorizonIndicator_C::Anim_StartCatching' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_HorizonIndicator_C, Image_Horizon) == 0x0002B8, "Member 'UUMG_HelmetHUD_HorizonIndicator_C::Image_Horizon' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_HorizonIndicator_C, bShouldShowHint) == 0x0002C0, "Member 'UUMG_HelmetHUD_HorizonIndicator_C::bShouldShowHint' has a wrong offset!");

}

