#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SpaceCoinAdditional

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SpaceCoinAdditional.UMG_SpaceCoinAdditional_C
// 0x0068 (0x02C8 - 0x0260)
class UUMG_SpaceCoinAdditional_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AdditionalCoinText;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Coin;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Completed;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           SpaceCoinProgressBar;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CurrentCoinCount;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Max;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_TotalCoinCount;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PreCount;                                          // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DeltaCount;                                        // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCount;                                          // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartPercent;                                      // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndPercent;                                        // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldStartPregressBarAnimation;                   // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ALPHA;                                             // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SpaceCoinAdditional(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetCoinCountInfo(int32 InPreCount, int32 InDeltaCount, int32 InMaxCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SpaceCoinAdditional_C">();
	}
	static class UUMG_SpaceCoinAdditional_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SpaceCoinAdditional_C>();
	}
};
static_assert(alignof(UUMG_SpaceCoinAdditional_C) == 0x000008, "Wrong alignment on UUMG_SpaceCoinAdditional_C");
static_assert(sizeof(UUMG_SpaceCoinAdditional_C) == 0x0002C8, "Wrong size on UUMG_SpaceCoinAdditional_C");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, UberGraphFrame) == 0x000260, "Member 'UUMG_SpaceCoinAdditional_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, AdditionalCoinText) == 0x000268, "Member 'UUMG_SpaceCoinAdditional_C::AdditionalCoinText' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, HorizontalBox_Coin) == 0x000270, "Member 'UUMG_SpaceCoinAdditional_C::HorizontalBox_Coin' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, Image_Completed) == 0x000278, "Member 'UUMG_SpaceCoinAdditional_C::Image_Completed' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, SpaceCoinProgressBar) == 0x000280, "Member 'UUMG_SpaceCoinAdditional_C::SpaceCoinProgressBar' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, Text_CurrentCoinCount) == 0x000288, "Member 'UUMG_SpaceCoinAdditional_C::Text_CurrentCoinCount' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, Text_Description) == 0x000290, "Member 'UUMG_SpaceCoinAdditional_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, Text_Max) == 0x000298, "Member 'UUMG_SpaceCoinAdditional_C::Text_Max' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, Text_TotalCoinCount) == 0x0002A0, "Member 'UUMG_SpaceCoinAdditional_C::Text_TotalCoinCount' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, PreCount) == 0x0002A8, "Member 'UUMG_SpaceCoinAdditional_C::PreCount' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, DeltaCount) == 0x0002AC, "Member 'UUMG_SpaceCoinAdditional_C::DeltaCount' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, MaxCount) == 0x0002B0, "Member 'UUMG_SpaceCoinAdditional_C::MaxCount' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, StartPercent) == 0x0002B4, "Member 'UUMG_SpaceCoinAdditional_C::StartPercent' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, EndPercent) == 0x0002B8, "Member 'UUMG_SpaceCoinAdditional_C::EndPercent' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, ShouldStartPregressBarAnimation) == 0x0002BC, "Member 'UUMG_SpaceCoinAdditional_C::ShouldStartPregressBarAnimation' has a wrong offset!");
static_assert(offsetof(UUMG_SpaceCoinAdditional_C, ALPHA) == 0x0002C0, "Member 'UUMG_SpaceCoinAdditional_C::ALPHA' has a wrong offset!");

}

