#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Launcher_LauncherLandDistance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_Launcher_CrossHair_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Launcher_LauncherLandDistance.UMG_Launcher_LauncherLandDistance_C
// 0x0018 (0x02E0 - 0x02C8)
class UUMG_Launcher_LauncherLandDistance_C final : public UUMG_Launcher_CrossHair_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_Launcher_LauncherLandDistance_C; // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_127;                                     // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Launcher_CrossHair_C*              LauncherHUD;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Launcher_LauncherLandDistance(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	class FText GetDistanceText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Launcher_LauncherLandDistance_C">();
	}
	static class UUMG_Launcher_LauncherLandDistance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Launcher_LauncherLandDistance_C>();
	}
};
static_assert(alignof(UUMG_Launcher_LauncherLandDistance_C) == 0x000008, "Wrong alignment on UUMG_Launcher_LauncherLandDistance_C");
static_assert(sizeof(UUMG_Launcher_LauncherLandDistance_C) == 0x0002E0, "Wrong size on UUMG_Launcher_LauncherLandDistance_C");
static_assert(offsetof(UUMG_Launcher_LauncherLandDistance_C, UberGraphFrame_UMG_Launcher_LauncherLandDistance_C) == 0x0002C8, "Member 'UUMG_Launcher_LauncherLandDistance_C::UberGraphFrame_UMG_Launcher_LauncherLandDistance_C' has a wrong offset!");
static_assert(offsetof(UUMG_Launcher_LauncherLandDistance_C, TextBlock_127) == 0x0002D0, "Member 'UUMG_Launcher_LauncherLandDistance_C::TextBlock_127' has a wrong offset!");
static_assert(offsetof(UUMG_Launcher_LauncherLandDistance_C, LauncherHUD) == 0x0002D8, "Member 'UUMG_Launcher_LauncherLandDistance_C::LauncherHUD' has a wrong offset!");

}

