#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CrossHair_AGL

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_Launcher_CrossHair_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CrossHair_AGL.UMG_CrossHair_AGL_C
// 0x00C8 (0x0390 - 0x02C8)
class UUMG_CrossHair_AGL_C final : public UUMG_Launcher_CrossHair_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_CrossHair_AGL_C;                // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LandDistanceLeftToRight;                           // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LandDistanceRightToLeft;                           // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         AmmoClip;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_53;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_18;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_144;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_322;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NoAmmo;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Circle_1;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Cross;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_442;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Reload;                                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_166;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Ver_NoAmmo;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Launcher_LauncherLandDistance_C*   WBP_Launcher_LauncherLandDistance;                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUMG_CrossHair_AmmoCount_C*>     AllAmmo;                                           // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Reloading;                                         // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReloadingTime;                                     // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayedAnimation;                                   // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               SpreadCircleMid;                                   // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_CrossHair_AGL(int32 EntryPoint);
	void ReloadLauncher();
	void UseAmmo();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void NoAmmo(bool bNoAmmo);
	void Construct();
	float GetLauncherAmmoPercentage();
	void LeftLauncherSetting();
	void RightLauncherSetting();
	void DefaultLauncherSetting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CrossHair_AGL_C">();
	}
	static class UUMG_CrossHair_AGL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CrossHair_AGL_C>();
	}
};
static_assert(alignof(UUMG_CrossHair_AGL_C) == 0x000008, "Wrong alignment on UUMG_CrossHair_AGL_C");
static_assert(sizeof(UUMG_CrossHair_AGL_C) == 0x000390, "Wrong size on UUMG_CrossHair_AGL_C");
static_assert(offsetof(UUMG_CrossHair_AGL_C, UberGraphFrame_UMG_CrossHair_AGL_C) == 0x0002C8, "Member 'UUMG_CrossHair_AGL_C::UberGraphFrame_UMG_CrossHair_AGL_C' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, LandDistanceLeftToRight) == 0x0002D0, "Member 'UUMG_CrossHair_AGL_C::LandDistanceLeftToRight' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, LandDistanceRightToLeft) == 0x0002D8, "Member 'UUMG_CrossHair_AGL_C::LandDistanceRightToLeft' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, AmmoClip) == 0x0002E0, "Member 'UUMG_CrossHair_AGL_C::AmmoClip' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, CanvasPanel_0) == 0x0002E8, "Member 'UUMG_CrossHair_AGL_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, CanvasPanel_53) == 0x0002F0, "Member 'UUMG_CrossHair_AGL_C::CanvasPanel_53' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, HorizontalBox_0) == 0x0002F8, "Member 'UUMG_CrossHair_AGL_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Image_0) == 0x000300, "Member 'UUMG_CrossHair_AGL_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Image_9) == 0x000308, "Member 'UUMG_CrossHair_AGL_C::Image_9' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Image_18) == 0x000310, "Member 'UUMG_CrossHair_AGL_C::Image_18' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Image_144) == 0x000318, "Member 'UUMG_CrossHair_AGL_C::Image_144' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Image_322) == 0x000320, "Member 'UUMG_CrossHair_AGL_C::Image_322' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Image_NoAmmo) == 0x000328, "Member 'UUMG_CrossHair_AGL_C::Image_NoAmmo' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Img_Circle_1) == 0x000330, "Member 'UUMG_CrossHair_AGL_C::Img_Circle_1' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Img_Cross) == 0x000338, "Member 'UUMG_CrossHair_AGL_C::Img_Cross' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, ProgressBar_442) == 0x000340, "Member 'UUMG_CrossHair_AGL_C::ProgressBar_442' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Reload) == 0x000348, "Member 'UUMG_CrossHair_AGL_C::Reload' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, ScaleBox_166) == 0x000350, "Member 'UUMG_CrossHair_AGL_C::ScaleBox_166' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Ver_NoAmmo) == 0x000358, "Member 'UUMG_CrossHair_AGL_C::Ver_NoAmmo' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, WBP_Launcher_LauncherLandDistance) == 0x000360, "Member 'UUMG_CrossHair_AGL_C::WBP_Launcher_LauncherLandDistance' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, AllAmmo) == 0x000368, "Member 'UUMG_CrossHair_AGL_C::AllAmmo' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, Reloading) == 0x000378, "Member 'UUMG_CrossHair_AGL_C::Reloading' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, ReloadingTime) == 0x00037C, "Member 'UUMG_CrossHair_AGL_C::ReloadingTime' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, PlayedAnimation) == 0x000380, "Member 'UUMG_CrossHair_AGL_C::PlayedAnimation' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_AGL_C, SpreadCircleMid) == 0x000388, "Member 'UUMG_CrossHair_AGL_C::SpreadCircleMid' has a wrong offset!");

}

