#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Option

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Option.UMG_Option_C
// 0x00D8 (0x0398 - 0x02C0)
class UUMG_Option_C final : public UPBOptionBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SelectedOn;                                        // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FocusOn;                                           // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           BGBoard;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 blackBG;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Extra;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 divideLine;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ExtraOption;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusMask;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ExtraButton;                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MainButton;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainTitle;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainTItle_Selected;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ExtraButton;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_OptionItemButton;                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedTextBG;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_OptionName;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         OptionNameLeftPadding;                             // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptionItemBase*                      OptionItemWidget;                                  // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClickEvent;                                      // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnValueChange;                                     // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         DefalutOptionNameLeftPadding;                      // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnConfigurableChange;                              // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bCanSelected;                                      // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_Option(int32 EntryPoint);
	void Construct();
	void K2_SetConfigurable();
	void K2_CancelSelect();
	void K2_Select();
	void BndEvt__UMG_Option_Button_Extra_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_Option_Button_Extra_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_Option_MainButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__UMG_EnumOption_MainButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Designer_OnUnfocus();
	void Designer_OnFocus();
	void Init();
	void InitOptionName();
	void InitOptionItem();
	void InitExtraButton();
	void InitExtraOption();
	void ToggleBoolOption();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void ToggleExtraOption();
	void OnOptionValueChange();
	void RefreshBoolItemValue(class UUMG_BoolOptionItem_C* OptionItemWidget_0);
	void RefreshFloatItemValue(class UUMG_FloatOptionItem_C* OptionItemWidget_0);
	void RefreshEnumItemValue(class UUMG_EnumOptionItem_C* OptionItemWidget_0);
	void RefreshStyle();
	void RefreshItemValue();
	void RefreshItemWidgetValid();
	void OnClickMainButton();
	void RefreshInfo(class FName InOptionName, EPBOptionsTypes InOptionsTypes, const class FText& InOptionTitle, bool bIsGroup, bool bExtraOptionCollapsible_0, bool bShowExtraOption_0);
	void UMG_Option_AutoGenFunc(class UPBSettingOption* Option, bool bIsDependencyChanged);
	void BroadcastOptionOnClickEvent();
	void Init_Option_BP_Properties();
	void SetOptionConfigurability();
	void HandleOptionGroup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Option_C">();
	}
	static class UUMG_Option_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Option_C>();
	}
};
static_assert(alignof(UUMG_Option_C) == 0x000008, "Wrong alignment on UUMG_Option_C");
static_assert(sizeof(UUMG_Option_C) == 0x000398, "Wrong size on UUMG_Option_C");
static_assert(offsetof(UUMG_Option_C, UberGraphFrame) == 0x0002C0, "Member 'UUMG_Option_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, SelectedOn) == 0x0002C8, "Member 'UUMG_Option_C::SelectedOn' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, FocusOn) == 0x0002D0, "Member 'UUMG_Option_C::FocusOn' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, BGBoard) == 0x0002D8, "Member 'UUMG_Option_C::BGBoard' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, blackBG) == 0x0002E0, "Member 'UUMG_Option_C::blackBG' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, Button_Extra) == 0x0002E8, "Member 'UUMG_Option_C::Button_Extra' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, divideLine) == 0x0002F0, "Member 'UUMG_Option_C::divideLine' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, ExtraOption) == 0x0002F8, "Member 'UUMG_Option_C::ExtraOption' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, FocusMask) == 0x000300, "Member 'UUMG_Option_C::FocusMask' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, HorizontalBox_ExtraButton) == 0x000308, "Member 'UUMG_Option_C::HorizontalBox_ExtraButton' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, MainButton) == 0x000310, "Member 'UUMG_Option_C::MainButton' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, MainTitle) == 0x000318, "Member 'UUMG_Option_C::MainTitle' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, MainTItle_Selected) == 0x000320, "Member 'UUMG_Option_C::MainTItle_Selected' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, Overlay_ExtraButton) == 0x000328, "Member 'UUMG_Option_C::Overlay_ExtraButton' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, Overlay_OptionItemButton) == 0x000330, "Member 'UUMG_Option_C::Overlay_OptionItemButton' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, SelectedTextBG) == 0x000338, "Member 'UUMG_Option_C::SelectedTextBG' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, SizeBox_OptionName) == 0x000340, "Member 'UUMG_Option_C::SizeBox_OptionName' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, OptionNameLeftPadding) == 0x000348, "Member 'UUMG_Option_C::OptionNameLeftPadding' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, OptionItemWidget) == 0x000350, "Member 'UUMG_Option_C::OptionItemWidget' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, OnClickEvent) == 0x000358, "Member 'UUMG_Option_C::OnClickEvent' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, OnValueChange) == 0x000368, "Member 'UUMG_Option_C::OnValueChange' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, DefalutOptionNameLeftPadding) == 0x000378, "Member 'UUMG_Option_C::DefalutOptionNameLeftPadding' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, OnConfigurableChange) == 0x000380, "Member 'UUMG_Option_C::OnConfigurableChange' has a wrong offset!");
static_assert(offsetof(UUMG_Option_C, bCanSelected) == 0x000390, "Member 'UUMG_Option_C::bCanSelected' has a wrong offset!");

}

