#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_BottomParty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_BottomParty.UMG_BottomParty_C
// 0x0028 (0x0288 - 0x0260)
class UUMG_BottomParty_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Option;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_FriendEntrance_C*                  UMG_FriendEntrance;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Party_Widget_C*                    UMG_Party_Widget;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SettingCard_C*                     UMG_SettingCard_103;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_BottomParty(int32 EntryPoint);
	void Construct();
	void SetIsInSocialPage(bool IsInSocialPage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_BottomParty_C">();
	}
	static class UUMG_BottomParty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_BottomParty_C>();
	}
};
static_assert(alignof(UUMG_BottomParty_C) == 0x000008, "Wrong alignment on UUMG_BottomParty_C");
static_assert(sizeof(UUMG_BottomParty_C) == 0x000288, "Wrong size on UUMG_BottomParty_C");
static_assert(offsetof(UUMG_BottomParty_C, UberGraphFrame) == 0x000260, "Member 'UUMG_BottomParty_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_BottomParty_C, Image_Option) == 0x000268, "Member 'UUMG_BottomParty_C::Image_Option' has a wrong offset!");
static_assert(offsetof(UUMG_BottomParty_C, UMG_FriendEntrance) == 0x000270, "Member 'UUMG_BottomParty_C::UMG_FriendEntrance' has a wrong offset!");
static_assert(offsetof(UUMG_BottomParty_C, UMG_Party_Widget) == 0x000278, "Member 'UUMG_BottomParty_C::UMG_Party_Widget' has a wrong offset!");
static_assert(offsetof(UUMG_BottomParty_C, UMG_SettingCard_103) == 0x000280, "Member 'UUMG_BottomParty_C::UMG_SettingCard_103' has a wrong offset!");

}

