#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Art_ImageBox_4

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_STD_Art_ImageBox_4.UMG_STD_Art_ImageBox_4_C
// 0x0050 (0x02B0 - 0x0260)
class UUMG_STD_Art_ImageBox_4_C final : public UUserWidget
{
public:
	class UImage*                                 Image_90;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_214;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_592;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Item;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PossessFlag;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectFlag;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Lock;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Content;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_QuotaNumber;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateWidget(const struct FVector2D& ContentSize, bool IsLock, const class FText& ItemName, const class FText& Quota, TSoftObjectPtr<class UTexture2D> Icon, bool IsPreordering);
	void UpdateMaterialandTextureForWeaponCapture(class UTexture* Color, class UTexture* Depth, class UMaterialInstance* Material);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_STD_Art_ImageBox_4_C">();
	}
	static class UUMG_STD_Art_ImageBox_4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_STD_Art_ImageBox_4_C>();
	}
};
static_assert(alignof(UUMG_STD_Art_ImageBox_4_C) == 0x000008, "Wrong alignment on UUMG_STD_Art_ImageBox_4_C");
static_assert(sizeof(UUMG_STD_Art_ImageBox_4_C) == 0x0002B0, "Wrong size on UUMG_STD_Art_ImageBox_4_C");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, Image_90) == 0x000260, "Member 'UUMG_STD_Art_ImageBox_4_C::Image_90' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, Image_214) == 0x000268, "Member 'UUMG_STD_Art_ImageBox_4_C::Image_214' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, Image_592) == 0x000270, "Member 'UUMG_STD_Art_ImageBox_4_C::Image_592' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, Image_Item) == 0x000278, "Member 'UUMG_STD_Art_ImageBox_4_C::Image_Item' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, Image_PossessFlag) == 0x000280, "Member 'UUMG_STD_Art_ImageBox_4_C::Image_PossessFlag' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, Image_SelectFlag) == 0x000288, "Member 'UUMG_STD_Art_ImageBox_4_C::Image_SelectFlag' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, Overlay_Lock) == 0x000290, "Member 'UUMG_STD_Art_ImageBox_4_C::Overlay_Lock' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, SizeBox_Content) == 0x000298, "Member 'UUMG_STD_Art_ImageBox_4_C::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, TextBlock_ItemName) == 0x0002A0, "Member 'UUMG_STD_Art_ImageBox_4_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_4_C, TextBlock_QuotaNumber) == 0x0002A8, "Member 'UUMG_STD_Art_ImageBox_4_C::TextBlock_QuotaNumber' has a wrong offset!");

}

