#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_AssigmentMemberInfo

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_AssigmentMemberInfo.UMG_AssigmentMemberInfo_C.ExecuteUbergraph_UMG_AssigmentMemberInfo
// 0x0008 (0x0008 - 0x0000)
struct UMG_AssigmentMemberInfo_C_ExecuteUbergraph_UMG_AssigmentMemberInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_AssigmentMemberInfo_C_ExecuteUbergraph_UMG_AssigmentMemberInfo) == 0x000004, "Wrong alignment on UMG_AssigmentMemberInfo_C_ExecuteUbergraph_UMG_AssigmentMemberInfo");
static_assert(sizeof(UMG_AssigmentMemberInfo_C_ExecuteUbergraph_UMG_AssigmentMemberInfo) == 0x000008, "Wrong size on UMG_AssigmentMemberInfo_C_ExecuteUbergraph_UMG_AssigmentMemberInfo");
static_assert(offsetof(UMG_AssigmentMemberInfo_C_ExecuteUbergraph_UMG_AssigmentMemberInfo, EntryPoint) == 0x000000, "Member 'UMG_AssigmentMemberInfo_C_ExecuteUbergraph_UMG_AssigmentMemberInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_AssigmentMemberInfo_C_ExecuteUbergraph_UMG_AssigmentMemberInfo, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_AssigmentMemberInfo_C_ExecuteUbergraph_UMG_AssigmentMemberInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_AssigmentMemberInfo.UMG_AssigmentMemberInfo_C.UpdateName
// 0x0020 (0x0020 - 0x0000)
struct UMG_AssigmentMemberInfo_C_UpdateName final
{
public:
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0000(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_AssigmentMemberInfo_C_UpdateName) == 0x000008, "Wrong alignment on UMG_AssigmentMemberInfo_C_UpdateName");
static_assert(sizeof(UMG_AssigmentMemberInfo_C_UpdateName) == 0x000020, "Wrong size on UMG_AssigmentMemberInfo_C_UpdateName");
static_assert(offsetof(UMG_AssigmentMemberInfo_C_UpdateName, CallFunc_GetDisplayName_ReturnValue) == 0x000000, "Member 'UMG_AssigmentMemberInfo_C_UpdateName::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AssigmentMemberInfo_C_UpdateName, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UMG_AssigmentMemberInfo_C_UpdateName::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

