#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Progression_SubPage_Operator

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.ExecuteUbergraph_UMG_Progression_SubPage_Operator
// 0x0008 (0x0008 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_ExecuteUbergraph_UMG_Progression_SubPage_Operator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_ExecuteUbergraph_UMG_Progression_SubPage_Operator) == 0x000004, "Wrong alignment on UMG_Progression_SubPage_Operator_C_ExecuteUbergraph_UMG_Progression_SubPage_Operator");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_ExecuteUbergraph_UMG_Progression_SubPage_Operator) == 0x000008, "Wrong size on UMG_Progression_SubPage_Operator_C_ExecuteUbergraph_UMG_Progression_SubPage_Operator");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_ExecuteUbergraph_UMG_Progression_SubPage_Operator, EntryPoint) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_ExecuteUbergraph_UMG_Progression_SubPage_Operator::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_ExecuteUbergraph_UMG_Progression_SubPage_Operator, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_Progression_SubPage_Operator_C_ExecuteUbergraph_UMG_Progression_SubPage_Operator::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_Progression_SubPage_Operator_C_PreConstruct");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_PreConstruct) == 0x000001, "Wrong size on UMG_Progression_SubPage_Operator_C_PreConstruct");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.InitCharacterList
// 0x0088 (0x0088 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_InitCharacterList final
{
public:
	class UUMG_ProgressionRoot_C*                 CharacterWidget;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UUMG_ProgressionRoot_C* ClickedWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionRoot_C*                 CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBDataTableManager*                    CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDefaultCharacterDefinitionTableIDScope_ReturnValue; // 0x0060(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_InitCharacterList) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Operator_C_InitCharacterList");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_InitCharacterList) == 0x000088, "Wrong size on UMG_Progression_SubPage_Operator_C_InitCharacterList");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CharacterWidget) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CharacterWidget' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, K2Node_MakeStruct_Margin) == 0x00000C, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CallFunc_Create_ReturnValue) == 0x000038, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000048, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000058, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CallFunc_GetDefaultCharacterDefinitionTableIDScope_ReturnValue) == 0x000060, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CallFunc_GetDefaultCharacterDefinitionTableIDScope_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CallFunc_Array_Get_Item) == 0x000074, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_InitCharacterList, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'UMG_Progression_SubPage_Operator_C_InitCharacterList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.RefreshCharacterName
// 0x03D8 (0x03D8 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_RefreshCharacterName final
{
public:
	struct FPBCharacterDefinitionRow              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x03D0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_RefreshCharacterName) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Operator_C_RefreshCharacterName");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_RefreshCharacterName) == 0x0003D8, "Wrong size on UMG_Progression_SubPage_Operator_C_RefreshCharacterName");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshCharacterName, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_RefreshCharacterName::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshCharacterName, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003D0, "Member 'UMG_Progression_SubPage_Operator_C_RefreshCharacterName::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.RefreshProgressionList
// 0x00A0 (0x00A0 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_RefreshProgressionList final
{
public:
	class UUMG_ProgressionReward_C*               ProgressionWidget;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBProgression*                         Progression;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBProgressionManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUMG_ProgressionReward_C* Widget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionReward_C*               CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UPBProgression*>                 CallFunc_GetAllCharacterLevelProgression_ReturnValue; // 0x0068(0x0010)(ReferenceParm)
	class UPBProgression*                         CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Operator_C_RefreshProgressionList");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList) == 0x0000A0, "Wrong size on UMG_Progression_SubPage_Operator_C_RefreshProgressionList");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, ProgressionWidget) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::ProgressionWidget' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, Progression) == 0x000008, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::Progression' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, Temp_int_Array_Index_Variable) == 0x000010, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, CallFunc_Create_ReturnValue) == 0x000050, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, K2Node_MakeStruct_Margin) == 0x000058, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, CallFunc_GetAllCharacterLevelProgression_ReturnValue) == 0x000068, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::CallFunc_GetAllCharacterLevelProgression_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, CallFunc_Array_Get_Item) == 0x000078, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, CallFunc_AddChild_ReturnValue) == 0x000088, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000090, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshProgressionList, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'UMG_Progression_SubPage_Operator_C_RefreshProgressionList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.OnSelectedCharacter
// 0x0018 (0x0018 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_OnSelectedCharacter final
{
public:
	class UUMG_ProgressionRoot_C*                 ClickedWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_OnSelectedCharacter) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Operator_C_OnSelectedCharacter");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_OnSelectedCharacter) == 0x000018, "Wrong size on UMG_Progression_SubPage_Operator_C_OnSelectedCharacter");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_OnSelectedCharacter, ClickedWidget) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_OnSelectedCharacter::ClickedWidget' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_OnSelectedCharacter, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'UMG_Progression_SubPage_Operator_C_OnSelectedCharacter::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_OnSelectedCharacter, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_Progression_SubPage_Operator_C_OnSelectedCharacter::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_OnSelectedCharacter, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'UMG_Progression_SubPage_Operator_C_OnSelectedCharacter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_OnSelectedCharacter, CallFunc_SelectInt_ReturnValue) == 0x000010, "Member 'UMG_Progression_SubPage_Operator_C_OnSelectedCharacter::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.FocusFirstCharacter
// 0x0018 (0x0018 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_FocusFirstCharacter final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionRoot_C*                 K2Node_DynamicCast_AsUMG_Progression_Root;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_FocusFirstCharacter) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Operator_C_FocusFirstCharacter");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_FocusFirstCharacter) == 0x000018, "Wrong size on UMG_Progression_SubPage_Operator_C_FocusFirstCharacter");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_FocusFirstCharacter, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_FocusFirstCharacter::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_FocusFirstCharacter, K2Node_DynamicCast_AsUMG_Progression_Root) == 0x000008, "Member 'UMG_Progression_SubPage_Operator_C_FocusFirstCharacter::K2Node_DynamicCast_AsUMG_Progression_Root' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_FocusFirstCharacter, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UMG_Progression_SubPage_Operator_C_FocusFirstCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.OnRewardSwitch
// 0x0010 (0x0010 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_OnRewardSwitch final
{
public:
	class UUMG_ProgressionReward_C*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_OnRewardSwitch) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Operator_C_OnRewardSwitch");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_OnRewardSwitch) == 0x000010, "Wrong size on UMG_Progression_SubPage_Operator_C_OnRewardSwitch");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_OnRewardSwitch, Widget) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_OnRewardSwitch::Widget' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_OnRewardSwitch, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_Progression_SubPage_Operator_C_OnRewardSwitch::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.NavigationToFirstReward
// 0x0018 (0x0018 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_NavigationToFirstReward final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_NavigationToFirstReward) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Operator_C_NavigationToFirstReward");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_NavigationToFirstReward) == 0x000018, "Wrong size on UMG_Progression_SubPage_Operator_C_NavigationToFirstReward");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_NavigationToFirstReward, Navigation_0) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_NavigationToFirstReward::Navigation_0' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_NavigationToFirstReward, ReturnValue) == 0x000008, "Member 'UMG_Progression_SubPage_Operator_C_NavigationToFirstReward::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_NavigationToFirstReward, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'UMG_Progression_SubPage_Operator_C_NavigationToFirstReward::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.NavigationToSelectedCharacter
// 0x0010 (0x0010 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_NavigationToSelectedCharacter final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_NavigationToSelectedCharacter) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Operator_C_NavigationToSelectedCharacter");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_NavigationToSelectedCharacter) == 0x000010, "Wrong size on UMG_Progression_SubPage_Operator_C_NavigationToSelectedCharacter");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_NavigationToSelectedCharacter, Navigation_0) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_NavigationToSelectedCharacter::Navigation_0' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_NavigationToSelectedCharacter, ReturnValue) == 0x000008, "Member 'UMG_Progression_SubPage_Operator_C_NavigationToSelectedCharacter::ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.UnfocusCurrentCharacter
// 0x0001 (0x0001 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_UnfocusCurrentCharacter final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_UnfocusCurrentCharacter) == 0x000001, "Wrong alignment on UMG_Progression_SubPage_Operator_C_UnfocusCurrentCharacter");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_UnfocusCurrentCharacter) == 0x000001, "Wrong size on UMG_Progression_SubPage_Operator_C_UnfocusCurrentCharacter");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_UnfocusCurrentCharacter, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_UnfocusCurrentCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Operator.UMG_Progression_SubPage_Operator_C.RefreshCharacterNewFlag
// 0x0001 (0x0001 - 0x0000)
struct UMG_Progression_SubPage_Operator_C_RefreshCharacterNewFlag final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Operator_C_RefreshCharacterNewFlag) == 0x000001, "Wrong alignment on UMG_Progression_SubPage_Operator_C_RefreshCharacterNewFlag");
static_assert(sizeof(UMG_Progression_SubPage_Operator_C_RefreshCharacterNewFlag) == 0x000001, "Wrong size on UMG_Progression_SubPage_Operator_C_RefreshCharacterNewFlag");
static_assert(offsetof(UMG_Progression_SubPage_Operator_C_RefreshCharacterNewFlag, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_Progression_SubPage_Operator_C_RefreshCharacterNewFlag::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

