#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MatchMessage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_MatchMessage.UMG_MatchMessage_C
// 0x0020 (0x0330 - 0x0310)
class UUMG_MatchMessage_C final : public UPBMatchMessageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               MessageBottomList;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               MessageCenterList;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               MessageTopList;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_MatchMessage(int32 EntryPoint);
	void K2_AddMessage(class UPBMessageBaseWidget* MessageWidget, EPBMessageLocation InLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_MatchMessage_C">();
	}
	static class UUMG_MatchMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_MatchMessage_C>();
	}
};
static_assert(alignof(UUMG_MatchMessage_C) == 0x000008, "Wrong alignment on UUMG_MatchMessage_C");
static_assert(sizeof(UUMG_MatchMessage_C) == 0x000330, "Wrong size on UUMG_MatchMessage_C");
static_assert(offsetof(UUMG_MatchMessage_C, UberGraphFrame) == 0x000310, "Member 'UUMG_MatchMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_MatchMessage_C, MessageBottomList) == 0x000318, "Member 'UUMG_MatchMessage_C::MessageBottomList' has a wrong offset!");
static_assert(offsetof(UUMG_MatchMessage_C, MessageCenterList) == 0x000320, "Member 'UUMG_MatchMessage_C::MessageCenterList' has a wrong offset!");
static_assert(offsetof(UUMG_MatchMessage_C, MessageTopList) == 0x000328, "Member 'UUMG_MatchMessage_C::MessageTopList' has a wrong offset!");

}

