#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Text

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_STD_Text.UMG_STD_Text_C
// 0x00C0 (0x0320 - 0x0260)
class UUMG_STD_Text_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URetainerBox*                           RetainerText;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMain;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextContent;                                       // 0x0278(0x0018)(Edit, BlueprintVisible)
	bool                                          FX_ForceUpperCase;                                 // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         InFontInfo;                                        // 0x0298(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          FX_RenderAsLabelWithHollowText;                    // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     HollowLableMat;                                    // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  TextJustify;                                       // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ShadowOffset;                                      // 0x0304(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShadowColor;                                       // 0x030C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_STD_Text(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateFont(const struct FSlateFontInfo& InFontInfo_0, ETextJustify Justification);
	void UpdateText(const class FText& InText, bool ForceUpperCase);
	void UpdateShadow(const struct FVector2D& InShadowOffset, const struct FLinearColor& InShadowColorAndOpacity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_STD_Text_C">();
	}
	static class UUMG_STD_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_STD_Text_C>();
	}
};
static_assert(alignof(UUMG_STD_Text_C) == 0x000008, "Wrong alignment on UUMG_STD_Text_C");
static_assert(sizeof(UUMG_STD_Text_C) == 0x000320, "Wrong size on UUMG_STD_Text_C");
static_assert(offsetof(UUMG_STD_Text_C, UberGraphFrame) == 0x000260, "Member 'UUMG_STD_Text_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, RetainerText) == 0x000268, "Member 'UUMG_STD_Text_C::RetainerText' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, TextMain) == 0x000270, "Member 'UUMG_STD_Text_C::TextMain' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, TextContent) == 0x000278, "Member 'UUMG_STD_Text_C::TextContent' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, FX_ForceUpperCase) == 0x000290, "Member 'UUMG_STD_Text_C::FX_ForceUpperCase' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, InFontInfo) == 0x000298, "Member 'UUMG_STD_Text_C::InFontInfo' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, FX_RenderAsLabelWithHollowText) == 0x0002F0, "Member 'UUMG_STD_Text_C::FX_RenderAsLabelWithHollowText' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, HollowLableMat) == 0x0002F8, "Member 'UUMG_STD_Text_C::HollowLableMat' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, TextJustify) == 0x000300, "Member 'UUMG_STD_Text_C::TextJustify' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, ShadowOffset) == 0x000304, "Member 'UUMG_STD_Text_C::ShadowOffset' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Text_C, ShadowColor) == 0x00030C, "Member 'UUMG_STD_Text_C::ShadowColor' has a wrong offset!");

}

