#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_HotZone

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_STD_HotZone.UMG_STD_HotZone_C
// 0x00D0 (0x0330 - 0x0260)
class UUMG_STD_HotZone_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                CoverButton;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Art_FX_C*                      UMG_STD_FX;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClick;                                           // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPress;                                           // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRelease;                                         // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSelect;                                          // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnselect;                                        // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHover_Default;                                   // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhover_Default;                                 // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHover_Selected;                                  // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhover_Selected;                                // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsSelected;                                       // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSelectAsToggle;                                   // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bUseDefaultSelectFX;                               // 0x030A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B[0x5];                                      // 0x030B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSetSelected;                                     // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSetUnselected;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_STD_HotZone(int32 EntryPoint);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__UMG_STD_Gen_Button_OverButton_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__UMG_STD_Gen_Button_OverButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UMG_STD_Button_OverButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_STD_Button_OverButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_STD_Button_OverButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void GetIsSelected(bool* bIsSelected_0);
	void SetIsSelected(bool Select, bool* bIsSelected_0);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_STD_HotZone_C">();
	}
	static class UUMG_STD_HotZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_STD_HotZone_C>();
	}
};
static_assert(alignof(UUMG_STD_HotZone_C) == 0x000008, "Wrong alignment on UUMG_STD_HotZone_C");
static_assert(sizeof(UUMG_STD_HotZone_C) == 0x000330, "Wrong size on UUMG_STD_HotZone_C");
static_assert(offsetof(UUMG_STD_HotZone_C, UberGraphFrame) == 0x000260, "Member 'UUMG_STD_HotZone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, CoverButton) == 0x000268, "Member 'UUMG_STD_HotZone_C::CoverButton' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, UMG_STD_FX) == 0x000270, "Member 'UUMG_STD_HotZone_C::UMG_STD_FX' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnClick) == 0x000278, "Member 'UUMG_STD_HotZone_C::OnClick' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnPress) == 0x000288, "Member 'UUMG_STD_HotZone_C::OnPress' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnRelease) == 0x000298, "Member 'UUMG_STD_HotZone_C::OnRelease' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnSelect) == 0x0002A8, "Member 'UUMG_STD_HotZone_C::OnSelect' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnUnselect) == 0x0002B8, "Member 'UUMG_STD_HotZone_C::OnUnselect' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnHover_Default) == 0x0002C8, "Member 'UUMG_STD_HotZone_C::OnHover_Default' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnUnhover_Default) == 0x0002D8, "Member 'UUMG_STD_HotZone_C::OnUnhover_Default' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnHover_Selected) == 0x0002E8, "Member 'UUMG_STD_HotZone_C::OnHover_Selected' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnUnhover_Selected) == 0x0002F8, "Member 'UUMG_STD_HotZone_C::OnUnhover_Selected' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, bIsSelected) == 0x000308, "Member 'UUMG_STD_HotZone_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, bSelectAsToggle) == 0x000309, "Member 'UUMG_STD_HotZone_C::bSelectAsToggle' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, bUseDefaultSelectFX) == 0x00030A, "Member 'UUMG_STD_HotZone_C::bUseDefaultSelectFX' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnSetSelected) == 0x000310, "Member 'UUMG_STD_HotZone_C::OnSetSelected' has a wrong offset!");
static_assert(offsetof(UUMG_STD_HotZone_C, OnSetUnselected) == 0x000320, "Member 'UUMG_STD_HotZone_C::OnSetUnselected' has a wrong offset!");

}

