#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Benchmark_Bottom

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Benchmark_Bottom.UMG_Benchmark_Bottom_C
// 0x0020 (0x0358 - 0x0338)
class UUMG_Benchmark_Bottom_C final : public UPBBenchmarkBottomWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_Benchmark_Start_Button_C*          Benchmark_Start_Button;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnStartButtonClick;                                // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_Benchmark_Bottom(int32 EntryPoint);
	void BndEvt__UMG_Benchmark_Bottom_Benchmark_Start_Button_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Benchmark_Bottom_C">();
	}
	static class UUMG_Benchmark_Bottom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Benchmark_Bottom_C>();
	}
};
static_assert(alignof(UUMG_Benchmark_Bottom_C) == 0x000008, "Wrong alignment on UUMG_Benchmark_Bottom_C");
static_assert(sizeof(UUMG_Benchmark_Bottom_C) == 0x000358, "Wrong size on UUMG_Benchmark_Bottom_C");
static_assert(offsetof(UUMG_Benchmark_Bottom_C, UberGraphFrame) == 0x000338, "Member 'UUMG_Benchmark_Bottom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Bottom_C, Benchmark_Start_Button) == 0x000340, "Member 'UUMG_Benchmark_Bottom_C::Benchmark_Start_Button' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Bottom_C, OnStartButtonClick) == 0x000348, "Member 'UUMG_Benchmark_Bottom_C::OnStartButtonClick' has a wrong offset!");

}

