#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NewUnLockedItems

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FPB_MedalDetailsConfig_BP_structs.hpp"
#include "MainMenuWidget_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_NewUnLockedItems.UMG_NewUnLockedItems_C
// 0x0268 (0x0558 - 0x02F0)
class UUMG_NewUnLockedItems_C final : public UMainMenuWidget_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_NewUnLockedItems_C;             // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UConfirmPageButton_C*                   ConfirmPageButton_Yes;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentIndex;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_109;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxCount;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_79;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TRUE_0;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_1;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_2;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_3;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_4;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_5;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_6;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_7;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_8;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_9;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_10;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_11;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_12;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_13;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_14;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_15;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_16;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_18;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_19;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_20;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_21;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_22;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_23;                                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_24;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_25;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Challenge;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, struct FFPB_MedalDetailsConfig_BP> MedalDetailsConfigMap;                             // 0x0408(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class FName, int32>                      ObtainedMedalCountMap;                             // 0x0458(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_0;                              // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_1;                              // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_2;                              // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_3;                              // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_4;                              // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_5;                              // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_6;                              // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_7;                              // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_8;                              // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_9;                              // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_10;                             // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_11;                             // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_12;                             // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_13;                             // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_14;                             // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_15;                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_16;                             // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_17;                             // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_18;                             // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleMedal_C*                     UMG_SingleMedal_17_19;                             // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              BtnClick;                                          // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_NewUnLockedItems(int32 EntryPoint);
	void BndEvt__UMG_NewUnLockedItems_ConfirmPageButton_Yes_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature();
	void OnInitialized();
	void LoadAssetsCompleteEvent();
	void GetMedalsCount();
	void SetDefaultFocus();
	void ShowMedalDetails(class FName InMedalID);
	void SetCurrentIndex(int32 InSerialNumber);
	void SetMaxCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_NewUnLockedItems_C">();
	}
	static class UUMG_NewUnLockedItems_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_NewUnLockedItems_C>();
	}
};
static_assert(alignof(UUMG_NewUnLockedItems_C) == 0x000008, "Wrong alignment on UUMG_NewUnLockedItems_C");
static_assert(sizeof(UUMG_NewUnLockedItems_C) == 0x000558, "Wrong size on UUMG_NewUnLockedItems_C");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UberGraphFrame_UMG_NewUnLockedItems_C) == 0x0002F0, "Member 'UUMG_NewUnLockedItems_C::UberGraphFrame_UMG_NewUnLockedItems_C' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, ConfirmPageButton_Yes) == 0x0002F8, "Member 'UUMG_NewUnLockedItems_C::ConfirmPageButton_Yes' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, CurrentIndex) == 0x000300, "Member 'UUMG_NewUnLockedItems_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, Image_2) == 0x000308, "Member 'UUMG_NewUnLockedItems_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, Image_109) == 0x000310, "Member 'UUMG_NewUnLockedItems_C::Image_109' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, MaxCount) == 0x000318, "Member 'UUMG_NewUnLockedItems_C::MaxCount' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, ScrollBox_79) == 0x000320, "Member 'UUMG_NewUnLockedItems_C::ScrollBox_79' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, TRUE_0) == 0x000328, "Member 'UUMG_NewUnLockedItems_C::TRUE_0' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal) == 0x000330, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_1) == 0x000338, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_1' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_2) == 0x000340, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_2' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_3) == 0x000348, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_3' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_4) == 0x000350, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_4' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_5) == 0x000358, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_5' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_6) == 0x000360, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_6' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_7) == 0x000368, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_7' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_8) == 0x000370, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_8' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_9) == 0x000378, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_9' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_10) == 0x000380, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_10' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_11) == 0x000388, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_11' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_12) == 0x000390, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_12' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_13) == 0x000398, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_13' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_14) == 0x0003A0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_14' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_15) == 0x0003A8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_15' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_16) == 0x0003B0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_16' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17) == 0x0003B8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_18) == 0x0003C0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_18' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_19) == 0x0003C8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_19' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_20) == 0x0003D0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_20' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_21) == 0x0003D8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_21' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_22) == 0x0003E0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_22' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_23) == 0x0003E8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_23' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_24) == 0x0003F0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_24' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_25) == 0x0003F8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_25' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, WrapBox_Challenge) == 0x000400, "Member 'UUMG_NewUnLockedItems_C::WrapBox_Challenge' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, MedalDetailsConfigMap) == 0x000408, "Member 'UUMG_NewUnLockedItems_C::MedalDetailsConfigMap' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, ObtainedMedalCountMap) == 0x000458, "Member 'UUMG_NewUnLockedItems_C::ObtainedMedalCountMap' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_0) == 0x0004A8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_0' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_1) == 0x0004B0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_1' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_2) == 0x0004B8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_2' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_3) == 0x0004C0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_3' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_4) == 0x0004C8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_4' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_5) == 0x0004D0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_5' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_6) == 0x0004D8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_6' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_7) == 0x0004E0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_7' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_8) == 0x0004E8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_8' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_9) == 0x0004F0, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_9' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_10) == 0x0004F8, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_10' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_11) == 0x000500, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_11' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_12) == 0x000508, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_12' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_13) == 0x000510, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_13' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_14) == 0x000518, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_14' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_15) == 0x000520, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_15' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_16) == 0x000528, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_16' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_17) == 0x000530, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_17' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_18) == 0x000538, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_18' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, UMG_SingleMedal_17_19) == 0x000540, "Member 'UUMG_NewUnLockedItems_C::UMG_SingleMedal_17_19' has a wrong offset!");
static_assert(offsetof(UUMG_NewUnLockedItems_C, BtnClick) == 0x000548, "Member 'UUMG_NewUnLockedItems_C::BtnClick' has a wrong offset!");

}

