#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ContentFilter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_SettingPageBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ContentFilter.UMG_ContentFilter_C
// 0x0038 (0x03B0 - 0x0378)
class UUMG_ContentFilter_C final : public UUMG_SettingPageBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_ContentFilter_C;                // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCard_MainOption_C*                     Card_Gameplay;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             List_GamePlay;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_DisplayChatRoom;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_DisplayRealName;                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SubPage_CardList;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_MKContent;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ContentFilter(int32 EntryPoint);
	void BP_OnActivated();
	void OnInitialized();
	void BndEvt__UMG_SettingMouseKeyboard_Card_Gameplay_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature(int32 Index_0);
	void SwitchOptionList(int32 Index_0);
	void Reset();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ContentFilter_C">();
	}
	static class UUMG_ContentFilter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ContentFilter_C>();
	}
};
static_assert(alignof(UUMG_ContentFilter_C) == 0x000008, "Wrong alignment on UUMG_ContentFilter_C");
static_assert(sizeof(UUMG_ContentFilter_C) == 0x0003B0, "Wrong size on UUMG_ContentFilter_C");
static_assert(offsetof(UUMG_ContentFilter_C, UberGraphFrame_UMG_ContentFilter_C) == 0x000378, "Member 'UUMG_ContentFilter_C::UberGraphFrame_UMG_ContentFilter_C' has a wrong offset!");
static_assert(offsetof(UUMG_ContentFilter_C, Card_Gameplay) == 0x000380, "Member 'UUMG_ContentFilter_C::Card_Gameplay' has a wrong offset!");
static_assert(offsetof(UUMG_ContentFilter_C, List_GamePlay) == 0x000388, "Member 'UUMG_ContentFilter_C::List_GamePlay' has a wrong offset!");
static_assert(offsetof(UUMG_ContentFilter_C, Option_DisplayChatRoom) == 0x000390, "Member 'UUMG_ContentFilter_C::Option_DisplayChatRoom' has a wrong offset!");
static_assert(offsetof(UUMG_ContentFilter_C, Option_DisplayRealName) == 0x000398, "Member 'UUMG_ContentFilter_C::Option_DisplayRealName' has a wrong offset!");
static_assert(offsetof(UUMG_ContentFilter_C, SubPage_CardList) == 0x0003A0, "Member 'UUMG_ContentFilter_C::SubPage_CardList' has a wrong offset!");
static_assert(offsetof(UUMG_ContentFilter_C, Switcher_MKContent) == 0x0003A8, "Member 'UUMG_ContentFilter_C::Switcher_MKContent' has a wrong offset!");

}

