#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PlayerWidget_Friend

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_PlayerWidget_Friend.UMG_PlayerWidget_Friend_C.ExecuteUbergraph_UMG_PlayerWidget_Friend
// 0x0080 (0x0080 - 0x0000)
struct UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetPlatformID_ReturnValue;                // 0x0008(0x0028)(ConstParm, HasGetValueTypeHash)
	EPBPlayerStatus                               CallFunc_GetPlayerStatus_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBFlippingBook*                        K2Node_DynamicCast_AsPBFlipping_Book;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBPlayerStatus                               CallFunc_GetPlayerStatus_ReturnValue_1;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBPartyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ItemObject;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBFriendObject_C*                      K2Node_DynamicCast_AsPBFriend_Object;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend) == 0x000008, "Wrong alignment on UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend");
static_assert(sizeof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend) == 0x000080, "Wrong size on UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, EntryPoint) == 0x000000, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, CallFunc_GetPlatformID_ReturnValue) == 0x000008, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::CallFunc_GetPlatformID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, CallFunc_GetPlayerStatus_ReturnValue) == 0x000030, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::CallFunc_GetPlayerStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, CallFunc_GetOuterObject_ReturnValue) == 0x000038, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, K2Node_DynamicCast_AsPBFlipping_Book) == 0x000048, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::K2Node_DynamicCast_AsPBFlipping_Book' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, CallFunc_GetPlayerStatus_ReturnValue_1) == 0x000051, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::CallFunc_GetPlayerStatus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, K2Node_Event_bIsExpanded) == 0x000060, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, K2Node_Event_bIsSelected) == 0x000061, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, K2Node_Event_ItemObject) == 0x000068, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::K2Node_Event_ItemObject' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, K2Node_DynamicCast_AsPBFriend_Object) == 0x000070, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::K2Node_DynamicCast_AsPBFriend_Object' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend, CallFunc_GetIndexForItem_ReturnValue) == 0x00007C, "Member 'UMG_PlayerWidget_Friend_C_ExecuteUbergraph_UMG_PlayerWidget_Friend::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");

// Function UMG_PlayerWidget_Friend.UMG_PlayerWidget_Friend_C.K2_OnItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UMG_PlayerWidget_Friend_C_K2_OnItemObjectSet final
{
public:
	class UObject*                                ItemObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PlayerWidget_Friend_C_K2_OnItemObjectSet) == 0x000008, "Wrong alignment on UMG_PlayerWidget_Friend_C_K2_OnItemObjectSet");
static_assert(sizeof(UMG_PlayerWidget_Friend_C_K2_OnItemObjectSet) == 0x000008, "Wrong size on UMG_PlayerWidget_Friend_C_K2_OnItemObjectSet");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_K2_OnItemObjectSet, ItemObject) == 0x000000, "Member 'UMG_PlayerWidget_Friend_C_K2_OnItemObjectSet::ItemObject' has a wrong offset!");

// Function UMG_PlayerWidget_Friend.UMG_PlayerWidget_Friend_C.K2_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UMG_PlayerWidget_Friend_C_K2_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PlayerWidget_Friend_C_K2_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UMG_PlayerWidget_Friend_C_K2_OnItemSelectionChanged");
static_assert(sizeof(UMG_PlayerWidget_Friend_C_K2_OnItemSelectionChanged) == 0x000001, "Wrong size on UMG_PlayerWidget_Friend_C_K2_OnItemSelectionChanged");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_K2_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UMG_PlayerWidget_Friend_C_K2_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UMG_PlayerWidget_Friend.UMG_PlayerWidget_Friend_C.K2_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UMG_PlayerWidget_Friend_C_K2_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PlayerWidget_Friend_C_K2_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UMG_PlayerWidget_Friend_C_K2_OnItemExpansionChanged");
static_assert(sizeof(UMG_PlayerWidget_Friend_C_K2_OnItemExpansionChanged) == 0x000001, "Wrong size on UMG_PlayerWidget_Friend_C_K2_OnItemExpansionChanged");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_K2_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UMG_PlayerWidget_Friend_C_K2_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UMG_PlayerWidget_Friend.UMG_PlayerWidget_Friend_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_PlayerWidget_Friend_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_PlayerWidget_Friend_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_PlayerWidget_Friend_C_OnFocusReceived");
static_assert(sizeof(UMG_PlayerWidget_Friend_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_PlayerWidget_Friend_C_OnFocusReceived");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_PlayerWidget_Friend_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_PlayerWidget_Friend_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_PlayerWidget_Friend_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'UMG_PlayerWidget_Friend_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UMG_PlayerWidget_Friend.UMG_PlayerWidget_Friend_C.OnKeyDown
// 0x0320 (0x0320 - 0x0000)
struct UMG_PlayerWidget_Friend_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   LocalKey;                                          // 0x0128(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UPBPartyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0148(0x0018)(HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue;  // 0x0168(0x0010)(ReferenceParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0178(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetPlatformID_ReturnValue;                // 0x0238(0x0028)(ConstParm, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0260(0x00B8)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PlayerWidget_Friend_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_PlayerWidget_Friend_C_OnKeyDown");
static_assert(sizeof(UMG_PlayerWidget_Friend_C_OnKeyDown) == 0x000320, "Wrong size on UMG_PlayerWidget_Friend_C_OnKeyDown");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, LocalKey) == 0x000128, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::LocalKey' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000140, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000148, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000160, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue) == 0x000168, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000178, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, CallFunc_IsValid_ReturnValue) == 0x000230, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, CallFunc_GetPlatformID_ReturnValue) == 0x000238, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::CallFunc_GetPlatformID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000260, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PlayerWidget_Friend_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue) == 0x000318, "Member 'UMG_PlayerWidget_Friend_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

}

