#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_BattleBoard_InGame_Panel

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_BattleBoard_InGame_Panel.UMG_BattleBoard_InGame_Panel_C.ExecuteUbergraph_UMG_BattleBoard_InGame_Panel
// 0x01E8 (0x01E8 - 0x0000)
struct UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanMutePendingMutePlayer_ReturnValue;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0018(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0030(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0040(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0050(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0068(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0080(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x00A0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x00B8(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBPlayerController*                    K2Node_DynamicCast_AsPBPlayer_Controller;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController_BP_C*                 K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00FC(0x0008)(NoDestructor)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0118(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x0130(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x0140(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x0158(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x0168(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x0180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x0190(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CanMutePendingMutePlayer_ReturnValue_1;   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel) == 0x000008, "Wrong alignment on UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel");
static_assert(sizeof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel) == 0x0001E8, "Wrong size on UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, EntryPoint) == 0x000000, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_CanMutePendingMutePlayer_ReturnValue) == 0x000004, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_CanMutePendingMutePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_MakeArray_Array) == 0x000008, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Format_ReturnValue) == 0x000018, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_MakeArray_Array_1) == 0x000030, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_MakeArray_Array_2) == 0x000040, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Format_ReturnValue_1) == 0x000050, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Format_ReturnValue_2) == 0x000068, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_MakeArray_Array_3) == 0x000080, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_MakeArray_Array_4) == 0x000090, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Format_ReturnValue_3) == 0x0000A0, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Format_ReturnValue_4) == 0x0000B8, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_IsInViewport_ReturnValue) == 0x0000D8, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_DynamicCast_AsPBPlayer_Controller) == 0x0000E0, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_DynamicCast_AsPBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x0000F0, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000F9, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_Event_InFocusEvent) == 0x0000FC, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_MakeArray_Array_5) == 0x000108, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Format_ReturnValue_5) == 0x000118, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_MakeArray_Array_6) == 0x000130, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Format_ReturnValue_6) == 0x000140, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Format_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_MakeArray_Array_7) == 0x000158, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Format_ReturnValue_7) == 0x000168, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Format_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_MakeArray_Array_8) == 0x000180, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Format_ReturnValue_8) == 0x000190, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Format_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, K2Node_CreateDelegate_OutputDelegate) == 0x0001A8, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_CanMutePendingMutePlayer_ReturnValue_1) == 0x0001B8, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_CanMutePendingMutePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_GetDisplayName_ReturnValue) == 0x0001C0, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_Not_PreBool_ReturnValue) == 0x0001D0, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel, CallFunc_GetDisplayName_ReturnValue_1) == 0x0001D8, "Member 'UMG_BattleBoard_InGame_Panel_C_ExecuteUbergraph_UMG_BattleBoard_InGame_Panel::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");

// Function UMG_BattleBoard_InGame_Panel.UMG_BattleBoard_InGame_Panel_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_BattleBoard_InGame_Panel_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_BattleBoard_InGame_Panel_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_BattleBoard_InGame_Panel_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_BattleBoard_InGame_Panel_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_BattleBoard_InGame_Panel_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_BattleBoard_InGame_Panel_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_BattleBoard_InGame_Panel.UMG_BattleBoard_InGame_Panel_C.OnKeyDown
// 0x0460 (0x0460 - 0x0000)
struct UMG_BattleBoard_InGame_Panel_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetKeysOfInput_ReturnValue;               // 0x0150(0x0010)(ReferenceParm)
	TArray<struct FKey>                           CallFunc_GetKeysOfInput_ReturnValue_1;             // 0x0160(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0178(0x00B8)()
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x0238(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x02F0(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x03A8(0x00B8)()
};
static_assert(alignof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_BattleBoard_InGame_Panel_C_OnKeyDown");
static_assert(sizeof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown) == 0x000460, "Wrong size on UMG_BattleBoard_InGame_Panel_C_OnKeyDown");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000140, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000148, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_GetKeysOfInput_ReturnValue) == 0x000150, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_GetKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_GetKeysOfInput_ReturnValue_1) == 0x000160, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_GetKeysOfInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue) == 0x000170, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue_1) == 0x000171, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000178, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_GetIsEnabled_ReturnValue) == 0x000230, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_GetIsEnabled_ReturnValue_1) == 0x000231, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_Unhandled_ReturnValue_1) == 0x000238, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_Unhandled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x0002F0, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_OnKeyDown, CallFunc_Handled_ReturnValue_1) == 0x0003A8, "Member 'UMG_BattleBoard_InGame_Panel_C_OnKeyDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");

// Function UMG_BattleBoard_InGame_Panel.UMG_BattleBoard_InGame_Panel_C.CanMutePendingMutePlayer
// 0x0018 (0x0018 - 0x0000)
struct UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetAttitudeByActor_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer) == 0x000008, "Wrong alignment on UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer");
static_assert(sizeof(UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer) == 0x000018, "Wrong size on UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer, ReturnValue) == 0x000000, "Member 'UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer, CallFunc_GetAttitudeByActor_ReturnValue) == 0x000010, "Member 'UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer::CallFunc_GetAttitudeByActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000011, "Member 'UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'UMG_BattleBoard_InGame_Panel_C_CanMutePendingMutePlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

