#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityCenter_Progress

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ActivityCenter_Progress.UMG_ActivityCenter_Progress_C
// 0x0058 (0x02F8 - 0x02A0)
class UUMG_ActivityCenter_Progress_C final : public UPBProgressActivityWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Line;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_QuestList;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Countdown_C*                       UMG_Countdown;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EventTaskProgress_C*               UMG_EventTaskProgress;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_QuestInfoSeasonEXP_C*              UMG_QuestInfoSeasonEXP;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_QuestInfoSeasonEXP_C*              UMG_QuestInfoSeasonEXP_1;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_QuestInfoSeasonEXP_C*              UMG_QuestInfoSeasonEXP_2;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_1;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_3;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_73;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ActivityCenter_Progress(int32 EntryPoint);
	void K2_RefreshInfo();
	void RefreshProgressReward();
	void RefreshQuestList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ActivityCenter_Progress_C">();
	}
	static class UUMG_ActivityCenter_Progress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ActivityCenter_Progress_C>();
	}
};
static_assert(alignof(UUMG_ActivityCenter_Progress_C) == 0x000008, "Wrong alignment on UUMG_ActivityCenter_Progress_C");
static_assert(sizeof(UUMG_ActivityCenter_Progress_C) == 0x0002F8, "Wrong size on UUMG_ActivityCenter_Progress_C");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, UberGraphFrame) == 0x0002A0, "Member 'UUMG_ActivityCenter_Progress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, Image_Line) == 0x0002A8, "Member 'UUMG_ActivityCenter_Progress_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, ScrollBox_QuestList) == 0x0002B0, "Member 'UUMG_ActivityCenter_Progress_C::ScrollBox_QuestList' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, UMG_Countdown) == 0x0002B8, "Member 'UUMG_ActivityCenter_Progress_C::UMG_Countdown' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, UMG_EventTaskProgress) == 0x0002C0, "Member 'UUMG_ActivityCenter_Progress_C::UMG_EventTaskProgress' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, UMG_QuestInfoSeasonEXP) == 0x0002C8, "Member 'UUMG_ActivityCenter_Progress_C::UMG_QuestInfoSeasonEXP' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, UMG_QuestInfoSeasonEXP_1) == 0x0002D0, "Member 'UUMG_ActivityCenter_Progress_C::UMG_QuestInfoSeasonEXP_1' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, UMG_QuestInfoSeasonEXP_2) == 0x0002D8, "Member 'UUMG_ActivityCenter_Progress_C::UMG_QuestInfoSeasonEXP_2' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, UMG_STD_Text_1) == 0x0002E0, "Member 'UUMG_ActivityCenter_Progress_C::UMG_STD_Text_1' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, UMG_STD_Text_3) == 0x0002E8, "Member 'UUMG_ActivityCenter_Progress_C::UMG_STD_Text_3' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Progress_C, UMG_STD_Text_73) == 0x0002F0, "Member 'UUMG_ActivityCenter_Progress_C::UMG_STD_Text_73' has a wrong offset!");

}

