#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_BottomParty

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_BottomParty.UMG_BottomParty_C.ExecuteUbergraph_UMG_BottomParty
// 0x0020 (0x0020 - 0x0000)
struct UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty) == 0x000008, "Wrong alignment on UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty");
static_assert(sizeof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty) == 0x000020, "Wrong size on UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, EntryPoint) == 0x000000, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, Temp_bool_Variable) == 0x000004, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, Temp_byte_Variable) == 0x000005, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, Temp_byte_Variable_1) == 0x000006, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000019, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00001A, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, CallFunc_BooleanOR_ReturnValue_1) == 0x00001C, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty, K2Node_Select_Default) == 0x00001D, "Member 'UMG_BottomParty_C_ExecuteUbergraph_UMG_BottomParty::K2Node_Select_Default' has a wrong offset!");

// Function UMG_BottomParty.UMG_BottomParty_C.SetIsInSocialPage
// 0x0001 (0x0001 - 0x0000)
struct UMG_BottomParty_C_SetIsInSocialPage final
{
public:
	bool                                          IsInSocialPage;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_BottomParty_C_SetIsInSocialPage) == 0x000001, "Wrong alignment on UMG_BottomParty_C_SetIsInSocialPage");
static_assert(sizeof(UMG_BottomParty_C_SetIsInSocialPage) == 0x000001, "Wrong size on UMG_BottomParty_C_SetIsInSocialPage");
static_assert(offsetof(UMG_BottomParty_C_SetIsInSocialPage, IsInSocialPage) == 0x000000, "Member 'UMG_BottomParty_C_SetIsInSocialPage::IsInSocialPage' has a wrong offset!");

}

