#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_LimitedTimeLoginPage_Base

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_LimitedTimeLoginPage_Base.UMG_LimitedTimeLoginPage_Base_C
// 0x0048 (0x03A8 - 0x0360)
class UUMG_LimitedTimeLoginPage_Base_C final : public UPBLimitedTimeLoginActivityPageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Line;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_DateCard;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Countdown_C*                       UMG_Countdown;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem;                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem_2;                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_1;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_2;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_3;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_LimitedTimeLoginPage_Base(int32 EntryPoint);
	void K2_RefreshLoginActivityInfo();
	void RefreshRewardList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_LimitedTimeLoginPage_Base_C">();
	}
	static class UUMG_LimitedTimeLoginPage_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_LimitedTimeLoginPage_Base_C>();
	}
};
static_assert(alignof(UUMG_LimitedTimeLoginPage_Base_C) == 0x000008, "Wrong alignment on UUMG_LimitedTimeLoginPage_Base_C");
static_assert(sizeof(UUMG_LimitedTimeLoginPage_Base_C) == 0x0003A8, "Wrong size on UUMG_LimitedTimeLoginPage_Base_C");
static_assert(offsetof(UUMG_LimitedTimeLoginPage_Base_C, UberGraphFrame) == 0x000360, "Member 'UUMG_LimitedTimeLoginPage_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_LimitedTimeLoginPage_Base_C, Image_Line) == 0x000368, "Member 'UUMG_LimitedTimeLoginPage_Base_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UUMG_LimitedTimeLoginPage_Base_C, ScrollBox_DateCard) == 0x000370, "Member 'UUMG_LimitedTimeLoginPage_Base_C::ScrollBox_DateCard' has a wrong offset!");
static_assert(offsetof(UUMG_LimitedTimeLoginPage_Base_C, UMG_Countdown) == 0x000378, "Member 'UUMG_LimitedTimeLoginPage_Base_C::UMG_Countdown' has a wrong offset!");
static_assert(offsetof(UUMG_LimitedTimeLoginPage_Base_C, UMG_ProgressionRewardItem) == 0x000380, "Member 'UUMG_LimitedTimeLoginPage_Base_C::UMG_ProgressionRewardItem' has a wrong offset!");
static_assert(offsetof(UUMG_LimitedTimeLoginPage_Base_C, UMG_ProgressionRewardItem_2) == 0x000388, "Member 'UUMG_LimitedTimeLoginPage_Base_C::UMG_ProgressionRewardItem_2' has a wrong offset!");
static_assert(offsetof(UUMG_LimitedTimeLoginPage_Base_C, UMG_STD_Text_1) == 0x000390, "Member 'UUMG_LimitedTimeLoginPage_Base_C::UMG_STD_Text_1' has a wrong offset!");
static_assert(offsetof(UUMG_LimitedTimeLoginPage_Base_C, UMG_STD_Text_2) == 0x000398, "Member 'UUMG_LimitedTimeLoginPage_Base_C::UMG_STD_Text_2' has a wrong offset!");
static_assert(offsetof(UUMG_LimitedTimeLoginPage_Base_C, UMG_STD_Text_3) == 0x0003A0, "Member 'UUMG_LimitedTimeLoginPage_Base_C::UMG_STD_Text_3' has a wrong offset!");

}

