#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_QuotaList

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_QuotaList.UMG_QuotaList_C
// 0x0028 (0x0340 - 0x0318)
class UUMG_QuotaList_C final : public UPBFieldModQuotaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_FieldModQuotaItem_C*               UMG_FieldModQuotaItem_1;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_Quotas;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUMG_FieldModQuotaItem_C*>       Quotas;                                            // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_UMG_QuotaList(int32 EntryPoint);
	void K2_InitCharacterQuotaList();
	void K2_RefreshCharacterQuota();
	void InitCharacterQuotas();
	void CalcQuota();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_QuotaList_C">();
	}
	static class UUMG_QuotaList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_QuotaList_C>();
	}
};
static_assert(alignof(UUMG_QuotaList_C) == 0x000008, "Wrong alignment on UUMG_QuotaList_C");
static_assert(sizeof(UUMG_QuotaList_C) == 0x000340, "Wrong size on UUMG_QuotaList_C");
static_assert(offsetof(UUMG_QuotaList_C, UberGraphFrame) == 0x000318, "Member 'UUMG_QuotaList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_QuotaList_C, UMG_FieldModQuotaItem_1) == 0x000320, "Member 'UUMG_QuotaList_C::UMG_FieldModQuotaItem_1' has a wrong offset!");
static_assert(offsetof(UUMG_QuotaList_C, UniformGridPanel_Quotas) == 0x000328, "Member 'UUMG_QuotaList_C::UniformGridPanel_Quotas' has a wrong offset!");
static_assert(offsetof(UUMG_QuotaList_C, Quotas) == 0x000330, "Member 'UUMG_QuotaList_C::Quotas' has a wrong offset!");

}

