#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FriendsList_Widget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.ExecuteUbergraph_UMG_FriendsList_Widget
// 0x0028 (0x0028 - 0x0000)
struct UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EInputDevice CurrentDevice)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  K2Node_CustomEvent_CurrentDevice;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget) == 0x000008, "Wrong alignment on UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget");
static_assert(sizeof(UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget) == 0x000028, "Wrong size on UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget");
static_assert(offsetof(UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget, EntryPoint) == 0x000000, "Member 'UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000018, "Member 'UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget, K2Node_CustomEvent_CurrentDevice) == 0x000020, "Member 'UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget::K2Node_CustomEvent_CurrentDevice' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x000021, "Member 'UMG_FriendsList_Widget_C_ExecuteUbergraph_UMG_FriendsList_Widget::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.DSP_OnSwitchInputDevice_Event_0
// 0x0001 (0x0001 - 0x0000)
struct UMG_FriendsList_Widget_C_DSP_OnSwitchInputDevice_Event_0 final
{
public:
	EInputDevice                                  CurrentDevice;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FriendsList_Widget_C_DSP_OnSwitchInputDevice_Event_0) == 0x000001, "Wrong alignment on UMG_FriendsList_Widget_C_DSP_OnSwitchInputDevice_Event_0");
static_assert(sizeof(UMG_FriendsList_Widget_C_DSP_OnSwitchInputDevice_Event_0) == 0x000001, "Wrong size on UMG_FriendsList_Widget_C_DSP_OnSwitchInputDevice_Event_0");
static_assert(offsetof(UMG_FriendsList_Widget_C_DSP_OnSwitchInputDevice_Event_0, CurrentDevice) == 0x000000, "Member 'UMG_FriendsList_Widget_C_DSP_OnSwitchInputDevice_Event_0::CurrentDevice' has a wrong offset!");

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.RefreshInfo
// 0x0150 (0x0150 - 0x0000)
struct UMG_FriendsList_Widget_C_RefreshInfo final
{
public:
	int32                                         LocalIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       LocalFriendPlatformId;                             // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBUserManager*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUserCached_BP_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetLogicServerID_LogicServerID;           // 0x0050(0x0028)(HasGetValueTypeHash)
	class UPBUserManager*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBUserObject*                          CallFunc_GetUserObjectByPlatformId_BP_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetLogicServerID_ReturnValue;             // 0x0088(0x0028)(ConstParm, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_Array_Get_Item;                           // 0x00B0(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetPlatformID_ReturnValue;                // 0x00E0(0x0028)(ConstParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0110(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0128(0x0018)()
	class UPBUserManager*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBFriendObject_C*                      CallFunc_SpawnObject_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FriendsList_Widget_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_FriendsList_Widget_C_RefreshInfo");
static_assert(sizeof(UMG_FriendsList_Widget_C_RefreshInfo) == 0x000150, "Wrong size on UMG_FriendsList_Widget_C_RefreshInfo");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, LocalIndex) == 0x000000, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::LocalIndex' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, LocalFriendPlatformId) == 0x000008, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::LocalFriendPlatformId' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, Temp_int_Array_Index_Variable) == 0x000030, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_IsUserCached_BP_ReturnValue) == 0x000048, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_IsUserCached_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_GetLogicServerID_LogicServerID) == 0x000050, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_GetLogicServerID_LogicServerID' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000078, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_GetUserObjectByPlatformId_BP_ReturnValue) == 0x000080, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_GetUserObjectByPlatformId_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_GetLogicServerID_ReturnValue) == 0x000088, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_GetLogicServerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_GetPlatformID_ReturnValue) == 0x0000E0, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_GetPlatformID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_Array_Length_ReturnValue_1) == 0x000108, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000110, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000128, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000140, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshInfo, CallFunc_SpawnObject_ReturnValue) == 0x000148, "Member 'UMG_FriendsList_Widget_C_RefreshInfo::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.RefreshFlippingBook
// 0x0018 (0x0018 - 0x0000)
struct UMG_FriendsList_Widget_C_RefreshFlippingBook final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
};
static_assert(alignof(UMG_FriendsList_Widget_C_RefreshFlippingBook) == 0x000008, "Wrong alignment on UMG_FriendsList_Widget_C_RefreshFlippingBook");
static_assert(sizeof(UMG_FriendsList_Widget_C_RefreshFlippingBook) == 0x000018, "Wrong size on UMG_FriendsList_Widget_C_RefreshFlippingBook");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshFlippingBook, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'UMG_FriendsList_Widget_C_RefreshFlippingBook::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.OnKeyDown
// 0x03C0 (0x03C0 - 0x0000)
struct UMG_FriendsList_Widget_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   LocalKey;                                          // 0x0128(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0140(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0158(0x00B8)()
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue;  // 0x0218(0x0010)(ReferenceParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0228(0x00B8)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x02E8(0x00B8)()
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_1; // 0x03A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FriendsList_Widget_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_FriendsList_Widget_C_OnKeyDown");
static_assert(sizeof(UMG_FriendsList_Widget_C_OnKeyDown) == 0x0003C0, "Wrong size on UMG_FriendsList_Widget_C_OnKeyDown");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, LocalKey) == 0x000128, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::LocalKey' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000140, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000158, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000210, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue) == 0x000218, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_Handled_ReturnValue_1) == 0x000228, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue) == 0x0002E0, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x0002E8, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x0003A0, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_1) == 0x0003A8, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue_1) == 0x0003B8, "Member 'UMG_FriendsList_Widget_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.UpdateInputDeviceInfo
// 0x0002 (0x0002 - 0x0000)
struct UMG_FriendsList_Widget_C_UpdateInputDeviceInfo final
{
public:
	EInputDevice                                  Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FriendsList_Widget_C_UpdateInputDeviceInfo) == 0x000001, "Wrong alignment on UMG_FriendsList_Widget_C_UpdateInputDeviceInfo");
static_assert(sizeof(UMG_FriendsList_Widget_C_UpdateInputDeviceInfo) == 0x000002, "Wrong size on UMG_FriendsList_Widget_C_UpdateInputDeviceInfo");
static_assert(offsetof(UMG_FriendsList_Widget_C_UpdateInputDeviceInfo, Selection) == 0x000000, "Member 'UMG_FriendsList_Widget_C_UpdateInputDeviceInfo::Selection' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_UpdateInputDeviceInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UMG_FriendsList_Widget_C_UpdateInputDeviceInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.SetDefaultFocus
// 0x0010 (0x0010 - 0x0000)
struct UMG_FriendsList_Widget_C_SetDefaultFocus final
{
public:
	class UUMG_PlayerWidget_Friend_C*             K2Node_DynamicCast_AsUMG_Player_Widget_Friend;     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FriendsList_Widget_C_SetDefaultFocus) == 0x000008, "Wrong alignment on UMG_FriendsList_Widget_C_SetDefaultFocus");
static_assert(sizeof(UMG_FriendsList_Widget_C_SetDefaultFocus) == 0x000010, "Wrong size on UMG_FriendsList_Widget_C_SetDefaultFocus");
static_assert(offsetof(UMG_FriendsList_Widget_C_SetDefaultFocus, K2Node_DynamicCast_AsUMG_Player_Widget_Friend) == 0x000000, "Member 'UMG_FriendsList_Widget_C_SetDefaultFocus::K2Node_DynamicCast_AsUMG_Player_Widget_Friend' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_SetDefaultFocus, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'UMG_FriendsList_Widget_C_SetDefaultFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.RefreshSwitcherInfo
// 0x0020 (0x0020 - 0x0000)
struct UMG_FriendsList_Widget_C_RefreshSwitcherInfo final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
	bool                                          CallFunc_IsLastPage_ReturnValue;                   // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFirstPage_ReturnValue;                  // 0x001A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FriendsList_Widget_C_RefreshSwitcherInfo) == 0x000008, "Wrong alignment on UMG_FriendsList_Widget_C_RefreshSwitcherInfo");
static_assert(sizeof(UMG_FriendsList_Widget_C_RefreshSwitcherInfo) == 0x000020, "Wrong size on UMG_FriendsList_Widget_C_RefreshSwitcherInfo");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshSwitcherInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'UMG_FriendsList_Widget_C_RefreshSwitcherInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshSwitcherInfo, CallFunc_IsLastPage_ReturnValue) == 0x000018, "Member 'UMG_FriendsList_Widget_C_RefreshSwitcherInfo::CallFunc_IsLastPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshSwitcherInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'UMG_FriendsList_Widget_C_RefreshSwitcherInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshSwitcherInfo, CallFunc_IsFirstPage_ReturnValue) == 0x00001A, "Member 'UMG_FriendsList_Widget_C_RefreshSwitcherInfo::CallFunc_IsFirstPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_RefreshSwitcherInfo, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001B, "Member 'UMG_FriendsList_Widget_C_RefreshSwitcherInfo::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.GetLogicServerID
// 0x0060 (0x0060 - 0x0000)
struct UMG_FriendsList_Widget_C_GetLogicServerID final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       LogicServerID;                                     // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_MakeStruct_UniqueNetIdRepl;                 // 0x0030(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FriendsList_Widget_C_GetLogicServerID) == 0x000008, "Wrong alignment on UMG_FriendsList_Widget_C_GetLogicServerID");
static_assert(sizeof(UMG_FriendsList_Widget_C_GetLogicServerID) == 0x000060, "Wrong size on UMG_FriendsList_Widget_C_GetLogicServerID");
static_assert(offsetof(UMG_FriendsList_Widget_C_GetLogicServerID, InIndex) == 0x000000, "Member 'UMG_FriendsList_Widget_C_GetLogicServerID::InIndex' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_GetLogicServerID, LogicServerID) == 0x000008, "Member 'UMG_FriendsList_Widget_C_GetLogicServerID::LogicServerID' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_GetLogicServerID, K2Node_MakeStruct_UniqueNetIdRepl) == 0x000030, "Member 'UMG_FriendsList_Widget_C_GetLogicServerID::K2Node_MakeStruct_UniqueNetIdRepl' has a wrong offset!");
static_assert(offsetof(UMG_FriendsList_Widget_C_GetLogicServerID, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000058, "Member 'UMG_FriendsList_Widget_C_GetLogicServerID::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function UMG_FriendsList_Widget.UMG_FriendsList_Widget_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_FriendsList_Widget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FriendsList_Widget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_FriendsList_Widget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_FriendsList_Widget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_FriendsList_Widget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_FriendsList_Widget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_FriendsList_Widget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

