#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Widget_PlayerInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_Widget_PlayerInfo.UMG_Widget_PlayerInfo_C.ExecuteUbergraph_UMG_Widget_PlayerInfo
// 0x0014 (0x0014 - 0x0000)
struct UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
};
static_assert(alignof(UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo) == 0x000004, "Wrong alignment on UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo");
static_assert(sizeof(UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo) == 0x000014, "Wrong size on UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo, EntryPoint) == 0x000000, "Member 'UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'UMG_Widget_PlayerInfo_C_ExecuteUbergraph_UMG_Widget_PlayerInfo::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function UMG_Widget_PlayerInfo.UMG_Widget_PlayerInfo_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_Widget_PlayerInfo_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_Widget_PlayerInfo_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_Widget_PlayerInfo_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_Widget_PlayerInfo_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_Widget_PlayerInfo_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_Widget_PlayerInfo_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_Widget_PlayerInfo.UMG_Widget_PlayerInfo_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_Widget_PlayerInfo_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_Widget_PlayerInfo_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_Widget_PlayerInfo_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_Widget_PlayerInfo_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_Widget_PlayerInfo_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_Widget_PlayerInfo_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_Widget_PlayerInfo.UMG_Widget_PlayerInfo_C.RefreshInfo
// 0x0018 (0x0018 - 0x0000)
struct UMG_Widget_PlayerInfo_C_RefreshInfo final
{
public:
	class UPBUserObject*                          InUserObject;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPBUserObject* UserObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UMG_Widget_PlayerInfo_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_Widget_PlayerInfo_C_RefreshInfo");
static_assert(sizeof(UMG_Widget_PlayerInfo_C_RefreshInfo) == 0x000018, "Wrong size on UMG_Widget_PlayerInfo_C_RefreshInfo");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshInfo, InUserObject) == 0x000000, "Member 'UMG_Widget_PlayerInfo_C_RefreshInfo::InUserObject' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UMG_Widget_PlayerInfo_C_RefreshInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function UMG_Widget_PlayerInfo.UMG_Widget_PlayerInfo_C.SetAvatarImg
// 0x0008 (0x0008 - 0x0000)
struct UMG_Widget_PlayerInfo_C_SetAvatarImg final
{
public:
	class UTexture2D*                             IconTexture;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Widget_PlayerInfo_C_SetAvatarImg) == 0x000008, "Wrong alignment on UMG_Widget_PlayerInfo_C_SetAvatarImg");
static_assert(sizeof(UMG_Widget_PlayerInfo_C_SetAvatarImg) == 0x000008, "Wrong size on UMG_Widget_PlayerInfo_C_SetAvatarImg");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_SetAvatarImg, IconTexture) == 0x000000, "Member 'UMG_Widget_PlayerInfo_C_SetAvatarImg::IconTexture' has a wrong offset!");

// Function UMG_Widget_PlayerInfo.UMG_Widget_PlayerInfo_C.ShowPartyLeaderIcon
// 0x0005 (0x0005 - 0x0000)
struct UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon) == 0x000001, "Wrong alignment on UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon");
static_assert(sizeof(UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon) == 0x000005, "Wrong size on UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon, IsShow) == 0x000000, "Member 'UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon::IsShow' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon, Temp_bool_Variable) == 0x000001, "Member 'UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon, Temp_byte_Variable) == 0x000002, "Member 'UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon, Temp_byte_Variable_1) == 0x000003, "Member 'UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon, K2Node_Select_Default) == 0x000004, "Member 'UMG_Widget_PlayerInfo_C_ShowPartyLeaderIcon::K2Node_Select_Default' has a wrong offset!");

// Function UMG_Widget_PlayerInfo.UMG_Widget_PlayerInfo_C.RefreshDisplayInfo
// 0x0100 (0x0100 - 0x0000)
struct UMG_Widget_PlayerInfo_C_RefreshDisplayInfo final
{
public:
	class FText                                   LocalPlayerStatusText;                             // 0x0000(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           LocalTextColor;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LocalOnlineStateText;                              // 0x0028(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             CallFunc_GetAvatar_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBPlayerStatus                               CallFunc_GetPlayerStatus_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBOnlineState                                CallFunc_GetOnlineState_ReturnValue;               // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	TDelegate<void(class UTexture2D* InAvatar)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0028)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E8(0x0018)()
};
static_assert(alignof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo) == 0x000008, "Wrong alignment on UMG_Widget_PlayerInfo_C_RefreshDisplayInfo");
static_assert(sizeof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo) == 0x000100, "Wrong size on UMG_Widget_PlayerInfo_C_RefreshDisplayInfo");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, LocalPlayerStatusText) == 0x000000, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::LocalPlayerStatusText' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, LocalTextColor) == 0x000018, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::LocalTextColor' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, LocalOnlineStateText) == 0x000028, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::LocalOnlineStateText' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_GetAvatar_ReturnValue) == 0x000040, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_GetAvatar_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_GetPlayerStatus_ReturnValue) == 0x000048, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_GetPlayerStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, K2Node_SwitchEnum_CmpSuccess) == 0x00004A, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_GetOnlineState_ReturnValue) == 0x00004B, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_GetOnlineState_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_GetDisplayName_ReturnValue) == 0x000050, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, K2Node_SwitchEnum_CmpSuccess_1) == 0x000060, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B8, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C8, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D8, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_RefreshDisplayInfo, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E8, "Member 'UMG_Widget_PlayerInfo_C_RefreshDisplayInfo::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function UMG_Widget_PlayerInfo.UMG_Widget_PlayerInfo_C.UMG_Widget_PlayerInfo_AutoGenFunc
// 0x0008 (0x0008 - 0x0000)
struct UMG_Widget_PlayerInfo_C_UMG_Widget_PlayerInfo_AutoGenFunc final
{
public:
	class UPBUserObject*                          UserObject_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Widget_PlayerInfo_C_UMG_Widget_PlayerInfo_AutoGenFunc) == 0x000008, "Wrong alignment on UMG_Widget_PlayerInfo_C_UMG_Widget_PlayerInfo_AutoGenFunc");
static_assert(sizeof(UMG_Widget_PlayerInfo_C_UMG_Widget_PlayerInfo_AutoGenFunc) == 0x000008, "Wrong size on UMG_Widget_PlayerInfo_C_UMG_Widget_PlayerInfo_AutoGenFunc");
static_assert(offsetof(UMG_Widget_PlayerInfo_C_UMG_Widget_PlayerInfo_AutoGenFunc, UserObject_0) == 0x000000, "Member 'UMG_Widget_PlayerInfo_C_UMG_Widget_PlayerInfo_AutoGenFunc::UserObject_0' has a wrong offset!");

}

