#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InventoryItem

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_InventoryItem.UMG_InventoryItem_C
// 0x0050 (0x0350 - 0x0300)
class UUMG_InventoryItem_C final : public UPBItemFieldModWidget_Inventory
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_STD_Art_ImageBox_4_C*              UMG_STD_Art_ImageBox_4;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_HotZone_C*                     UMG_STD_HotZone;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_FieldModCompareTip_C*              CompareTipPanel;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisplayCaptureWeapon;                             // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              NoneItem;                                          // 0x0328(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_InventoryItem(int32 EntryPoint);
	void K2_OnRefreshItem();
	void BndEvt__UMG_InventoryItem_UMG_STD_HotZone_K2Node_ComponentBoundEvent_1_OnHover_Default__DelegateSignature();
	void BndEvt__UMG_InventoryItem_UMG_STD_HotZone_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_InventoryItem_C">();
	}
	static class UUMG_InventoryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_InventoryItem_C>();
	}
};
static_assert(alignof(UUMG_InventoryItem_C) == 0x000008, "Wrong alignment on UUMG_InventoryItem_C");
static_assert(sizeof(UUMG_InventoryItem_C) == 0x000350, "Wrong size on UUMG_InventoryItem_C");
static_assert(offsetof(UUMG_InventoryItem_C, UberGraphFrame) == 0x000300, "Member 'UUMG_InventoryItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryItem_C, UMG_STD_Art_ImageBox_4) == 0x000308, "Member 'UUMG_InventoryItem_C::UMG_STD_Art_ImageBox_4' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryItem_C, UMG_STD_HotZone) == 0x000310, "Member 'UUMG_InventoryItem_C::UMG_STD_HotZone' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryItem_C, CompareTipPanel) == 0x000318, "Member 'UUMG_InventoryItem_C::CompareTipPanel' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryItem_C, bDisplayCaptureWeapon) == 0x000320, "Member 'UUMG_InventoryItem_C::bDisplayCaptureWeapon' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryItem_C, NoneItem) == 0x000328, "Member 'UUMG_InventoryItem_C::NoneItem' has a wrong offset!");

}

