#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_BoolOptionItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_BoolOptionItem.UMG_BoolOptionItem_C.ExecuteUbergraph_UMG_BoolOptionItem
// 0x0038 (0x0038 - 0x0000)
struct UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerController*                    K2Node_DynamicCast_AsPBPlayer_Controller;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsValid;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem) == 0x000008, "Wrong alignment on UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem");
static_assert(sizeof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem) == 0x000038, "Wrong size on UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem");
static_assert(offsetof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem, EntryPoint) == 0x000000, "Member 'UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem, CallFunc_GetPlayerControllerFromID_ReturnValue) == 0x000008, "Member 'UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem::CallFunc_GetPlayerControllerFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem, K2Node_DynamicCast_AsPBPlayer_Controller) == 0x000010, "Member 'UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem::K2Node_DynamicCast_AsPBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00001A, "Member 'UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem, K2Node_Event_bIsValid) == 0x000030, "Member 'UMG_BoolOptionItem_C_ExecuteUbergraph_UMG_BoolOptionItem::K2Node_Event_bIsValid' has a wrong offset!");

// Function UMG_BoolOptionItem.UMG_BoolOptionItem_C.K2_SetValid
// 0x0001 (0x0001 - 0x0000)
struct UMG_BoolOptionItem_C_K2_SetValid final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_BoolOptionItem_C_K2_SetValid) == 0x000001, "Wrong alignment on UMG_BoolOptionItem_C_K2_SetValid");
static_assert(sizeof(UMG_BoolOptionItem_C_K2_SetValid) == 0x000001, "Wrong size on UMG_BoolOptionItem_C_K2_SetValid");
static_assert(offsetof(UMG_BoolOptionItem_C_K2_SetValid, bIsValid) == 0x000000, "Member 'UMG_BoolOptionItem_C_K2_SetValid::bIsValid' has a wrong offset!");

// Function UMG_BoolOptionItem.UMG_BoolOptionItem_C.RefreshValueStyle
// 0x0048 (0x0048 - 0x0000)
struct UMG_BoolOptionItem_C_RefreshValueStyle final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_BoolOptionItem_C_RefreshValueStyle) == 0x000008, "Wrong alignment on UMG_BoolOptionItem_C_RefreshValueStyle");
static_assert(sizeof(UMG_BoolOptionItem_C_RefreshValueStyle) == 0x000048, "Wrong size on UMG_BoolOptionItem_C_RefreshValueStyle");
static_assert(offsetof(UMG_BoolOptionItem_C_RefreshValueStyle, K2Node_MakeStruct_Margin) == 0x000000, "Member 'UMG_BoolOptionItem_C_RefreshValueStyle::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_RefreshValueStyle, K2Node_MakeStruct_Margin_1) == 0x000010, "Member 'UMG_BoolOptionItem_C_RefreshValueStyle::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_RefreshValueStyle, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UMG_BoolOptionItem_C_RefreshValueStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_RefreshValueStyle, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000028, "Member 'UMG_BoolOptionItem_C_RefreshValueStyle::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_RefreshValueStyle, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'UMG_BoolOptionItem_C_RefreshValueStyle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_RefreshValueStyle, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000038, "Member 'UMG_BoolOptionItem_C_RefreshValueStyle::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BoolOptionItem_C_RefreshValueStyle, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'UMG_BoolOptionItem_C_RefreshValueStyle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

