#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Customize

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Customize.UMG_Customize_C
// 0x0050 (0x0370 - 0x0320)
class UUMG_Customize_C final : public UPBCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextDescription;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMain;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MainMenuPlayCard_C*                UMG_Armory;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MainMenuPlayCard_C*                UMG_MainMenuPlayCard_1;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MainMenuPlayCard_C*                UMG_Progression;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ImagineBG;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CardHovered;                                       // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPBCommonActivatableWidget*             FocusedWidget;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Customize(int32 EntryPoint);
	void BP_OnActivated();
	void BndEvt__UMG_Customize_UMG_Armory_K2Node_ComponentBoundEvent_0_BtnClick__DelegateSignature();
	void BndEvt__UMG_Customize_UMG_MainMenuPlayCard_258_K2Node_ComponentBoundEvent_2_HintsHover__DelegateSignature();
	void BndEvt__UMG_Customize_UMG_MainMenuPlayCard_K2Node_ComponentBoundEvent_1_HintsHover__DelegateSignature();
	void InitializeFocus();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Customize_C">();
	}
	static class UUMG_Customize_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Customize_C>();
	}
};
static_assert(alignof(UUMG_Customize_C) == 0x000008, "Wrong alignment on UUMG_Customize_C");
static_assert(sizeof(UUMG_Customize_C) == 0x000370, "Wrong size on UUMG_Customize_C");
static_assert(offsetof(UUMG_Customize_C, UberGraphFrame) == 0x000320, "Member 'UUMG_Customize_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Customize_C, TextDescription) == 0x000328, "Member 'UUMG_Customize_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UUMG_Customize_C, TextMain) == 0x000330, "Member 'UUMG_Customize_C::TextMain' has a wrong offset!");
static_assert(offsetof(UUMG_Customize_C, UMG_Armory) == 0x000338, "Member 'UUMG_Customize_C::UMG_Armory' has a wrong offset!");
static_assert(offsetof(UUMG_Customize_C, UMG_MainMenuPlayCard_1) == 0x000340, "Member 'UUMG_Customize_C::UMG_MainMenuPlayCard_1' has a wrong offset!");
static_assert(offsetof(UUMG_Customize_C, UMG_Progression) == 0x000348, "Member 'UUMG_Customize_C::UMG_Progression' has a wrong offset!");
static_assert(offsetof(UUMG_Customize_C, ImagineBG) == 0x000350, "Member 'UUMG_Customize_C::ImagineBG' has a wrong offset!");
static_assert(offsetof(UUMG_Customize_C, CardHovered) == 0x000358, "Member 'UUMG_Customize_C::CardHovered' has a wrong offset!");
static_assert(offsetof(UUMG_Customize_C, FocusedWidget) == 0x000368, "Member 'UUMG_Customize_C::FocusedWidget' has a wrong offset!");

}

