#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_GeneralSettingPage

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_GeneralSettingPage.UMG_GeneralSettingPage_C.ExecuteUbergraph_UMG_GeneralSettingPage
// 0x0004 (0x0004 - 0x0000)
struct UMG_GeneralSettingPage_C_ExecuteUbergraph_UMG_GeneralSettingPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_GeneralSettingPage_C_ExecuteUbergraph_UMG_GeneralSettingPage) == 0x000004, "Wrong alignment on UMG_GeneralSettingPage_C_ExecuteUbergraph_UMG_GeneralSettingPage");
static_assert(sizeof(UMG_GeneralSettingPage_C_ExecuteUbergraph_UMG_GeneralSettingPage) == 0x000004, "Wrong size on UMG_GeneralSettingPage_C_ExecuteUbergraph_UMG_GeneralSettingPage");
static_assert(offsetof(UMG_GeneralSettingPage_C_ExecuteUbergraph_UMG_GeneralSettingPage, EntryPoint) == 0x000000, "Member 'UMG_GeneralSettingPage_C_ExecuteUbergraph_UMG_GeneralSettingPage::EntryPoint' has a wrong offset!");

// Function UMG_GeneralSettingPage.UMG_GeneralSettingPage_C.SwitchOptionList
// 0x0004 (0x0004 - 0x0000)
struct UMG_GeneralSettingPage_C_SwitchOptionList final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_GeneralSettingPage_C_SwitchOptionList) == 0x000004, "Wrong alignment on UMG_GeneralSettingPage_C_SwitchOptionList");
static_assert(sizeof(UMG_GeneralSettingPage_C_SwitchOptionList) == 0x000004, "Wrong size on UMG_GeneralSettingPage_C_SwitchOptionList");
static_assert(offsetof(UMG_GeneralSettingPage_C_SwitchOptionList, Index_0) == 0x000000, "Member 'UMG_GeneralSettingPage_C_SwitchOptionList::Index_0' has a wrong offset!");

// Function UMG_GeneralSettingPage.UMG_GeneralSettingPage_C.CreateUI
// 0x0090 (0x0090 - 0x0000)
struct UMG_GeneralSettingPage_C_CreateUI final
{
public:
	class UPBSettingOptionNode*                   SettingOptionNode;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCard_MainOption_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSettingOptionNode*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSettingOptionNode*                   CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0040(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UScrollBox*                             CallFunc_SpawnObject_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_GeneralSettingPage_C_CreateUI) == 0x000008, "Wrong alignment on UMG_GeneralSettingPage_C_CreateUI");
static_assert(sizeof(UMG_GeneralSettingPage_C_CreateUI) == 0x000090, "Wrong size on UMG_GeneralSettingPage_C_CreateUI");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, SettingOptionNode) == 0x000000, "Member 'UMG_GeneralSettingPage_C_CreateUI::SettingOptionNode' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UMG_GeneralSettingPage_C_CreateUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UMG_GeneralSettingPage_C_CreateUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'UMG_GeneralSettingPage_C_CreateUI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'UMG_GeneralSettingPage_C_CreateUI::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Array_Get_Item) == 0x000030, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Map_Find_Value) == 0x000040, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Map_Find_ReturnValue) == 0x000058, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'UMG_GeneralSettingPage_C_CreateUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_SpawnObject_ReturnValue) == 0x000078, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateUI, CallFunc_AddChild_ReturnValue_1) == 0x000088, "Member 'UMG_GeneralSettingPage_C_CreateUI::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function UMG_GeneralSettingPage.UMG_GeneralSettingPage_C.CreateOption
// 0x0090 (0x0090 - 0x0000)
struct UMG_GeneralSettingPage_C_CreateOption final
{
public:
	class UPBSettingOptionNode*                   SettingOptionNode;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Option_C*                          ParentOption;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Option_C*                          CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldHideOption_ShouldHIdeOption;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSettingOptionNode*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Option_C*                          CallFunc_Create_ReturnValue_1;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0060(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UPBSettingOption>           CallFunc_Map_Find_Value_1;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_GeneralSettingPage_C_CreateOption) == 0x000008, "Wrong alignment on UMG_GeneralSettingPage_C_CreateOption");
static_assert(sizeof(UMG_GeneralSettingPage_C_CreateOption) == 0x000090, "Wrong size on UMG_GeneralSettingPage_C_CreateOption");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, SettingOptionNode) == 0x000000, "Member 'UMG_GeneralSettingPage_C_CreateOption::SettingOptionNode' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, ScrollBox) == 0x000008, "Member 'UMG_GeneralSettingPage_C_CreateOption::ScrollBox' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, ParentOption) == 0x000010, "Member 'UMG_GeneralSettingPage_C_CreateOption::ParentOption' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Create_ReturnValue) == 0x000020, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_ShouldHideOption_ShouldHIdeOption) == 0x000028, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_ShouldHideOption_ShouldHIdeOption' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, Temp_int_Array_Index_Variable) == 0x000038, "Member 'UMG_GeneralSettingPage_C_CreateOption::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'UMG_GeneralSettingPage_C_CreateOption::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Array_Get_Item) == 0x000040, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Create_ReturnValue_1) == 0x000050, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Map_Find_Value) == 0x000060, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Map_Find_Value_1) == 0x000080, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_CreateOption, CallFunc_Map_Find_ReturnValue_1) == 0x000088, "Member 'UMG_GeneralSettingPage_C_CreateOption::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function UMG_GeneralSettingPage.UMG_GeneralSettingPage_C.OnSubOptionClicked
// 0x0004 (0x0004 - 0x0000)
struct UMG_GeneralSettingPage_C_OnSubOptionClicked final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_GeneralSettingPage_C_OnSubOptionClicked) == 0x000004, "Wrong alignment on UMG_GeneralSettingPage_C_OnSubOptionClicked");
static_assert(sizeof(UMG_GeneralSettingPage_C_OnSubOptionClicked) == 0x000004, "Wrong size on UMG_GeneralSettingPage_C_OnSubOptionClicked");
static_assert(offsetof(UMG_GeneralSettingPage_C_OnSubOptionClicked, Index_0) == 0x000000, "Member 'UMG_GeneralSettingPage_C_OnSubOptionClicked::Index_0' has a wrong offset!");

// Function UMG_GeneralSettingPage.UMG_GeneralSettingPage_C.ShouldHideOption
// 0x0048 (0x0048 - 0x0000)
struct UMG_GeneralSettingPage_C_ShouldHideOption final
{
public:
	class FName                                   OptionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHideOption_0;                                // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBGameMode_Range_BP_C*                 K2Node_DynamicCast_AsPBGame_Mode_Range_BP;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_GeneralSettingPage_C_ShouldHideOption) == 0x000008, "Wrong alignment on UMG_GeneralSettingPage_C_ShouldHideOption");
static_assert(sizeof(UMG_GeneralSettingPage_C_ShouldHideOption) == 0x000048, "Wrong size on UMG_GeneralSettingPage_C_ShouldHideOption");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, OptionName) == 0x000000, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::OptionName' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, ShouldHideOption_0) == 0x000008, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::ShouldHideOption_0' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000018, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, K2Node_DynamicCast_AsPBGame_Mode_Range_BP) == 0x000020, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::K2Node_DynamicCast_AsPBGame_Mode_Range_BP' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000029, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x00002B, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_GetPlatformName_ReturnValue) == 0x000030, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000041, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_BooleanAND_ReturnValue_1) == 0x000042, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_ShouldHideOption, CallFunc_BooleanOR_ReturnValue_1) == 0x000043, "Member 'UMG_GeneralSettingPage_C_ShouldHideOption::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function UMG_GeneralSettingPage.UMG_GeneralSettingPage_C.BP_GetDesiredFocusTarget
// 0x0050 (0x0050 - 0x0000)
struct UMG_GeneralSettingPage_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Option_C*                          K2Node_DynamicCast_AsUMG_Option;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_GeneralSettingPage_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_GeneralSettingPage_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_GeneralSettingPage_C_BP_GetDesiredFocusTarget) == 0x000050, "Wrong size on UMG_GeneralSettingPage_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_GeneralSettingPage_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_GeneralSettingPage_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GeneralSettingPage_C_BP_GetDesiredFocusTarget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_GeneralSettingPage_C_BP_GetDesiredFocusTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
