#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EnterGame

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_EnterGame.UMG_EnterGame_C.ExecuteUbergraph_UMG_EnterGame
// 0x0010 (0x0010 - 0x0000)
struct UMG_EnterGame_C_ExecuteUbergraph_UMG_EnterGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EnterGame_C_ExecuteUbergraph_UMG_EnterGame) == 0x000008, "Wrong alignment on UMG_EnterGame_C_ExecuteUbergraph_UMG_EnterGame");
static_assert(sizeof(UMG_EnterGame_C_ExecuteUbergraph_UMG_EnterGame) == 0x000010, "Wrong size on UMG_EnterGame_C_ExecuteUbergraph_UMG_EnterGame");
static_assert(offsetof(UMG_EnterGame_C_ExecuteUbergraph_UMG_EnterGame, EntryPoint) == 0x000000, "Member 'UMG_EnterGame_C_ExecuteUbergraph_UMG_EnterGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_EnterGame_C_ExecuteUbergraph_UMG_EnterGame, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'UMG_EnterGame_C_ExecuteUbergraph_UMG_EnterGame::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function UMG_EnterGame.UMG_EnterGame_C.BndEvt__UMG_EnterGame_UMG_PrerequisiteButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_EnterGame_C_BndEvt__UMG_EnterGame_UMG_PrerequisiteButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EnterGame_C_BndEvt__UMG_EnterGame_UMG_PrerequisiteButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_EnterGame_C_BndEvt__UMG_EnterGame_UMG_PrerequisiteButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_EnterGame_C_BndEvt__UMG_EnterGame_UMG_PrerequisiteButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_EnterGame_C_BndEvt__UMG_EnterGame_UMG_PrerequisiteButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_EnterGame_C_BndEvt__UMG_EnterGame_UMG_PrerequisiteButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_EnterGame_C_BndEvt__UMG_EnterGame_UMG_PrerequisiteButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_EnterGame.UMG_EnterGame_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UMG_EnterGame_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_EnterGame_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UMG_EnterGame_C_OnMouseButtonDown");
static_assert(sizeof(UMG_EnterGame_C_OnMouseButtonDown) == 0x000218, "Wrong size on UMG_EnterGame_C_OnMouseButtonDown");
static_assert(offsetof(UMG_EnterGame_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UMG_EnterGame_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_EnterGame_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UMG_EnterGame_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_EnterGame_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UMG_EnterGame_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EnterGame_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_EnterGame_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_EnterGame.UMG_EnterGame_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_EnterGame_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_EnterGame_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_EnterGame_C_OnFocusReceived");
static_assert(sizeof(UMG_EnterGame_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_EnterGame_C_OnFocusReceived");
static_assert(offsetof(UMG_EnterGame_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_EnterGame_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_EnterGame_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_EnterGame_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_EnterGame_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_EnterGame_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EnterGame_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_EnterGame_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

