#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityCenter

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.ExecuteUbergraph_UMG_ActivityCenter
// 0x0080 (0x0080 - 0x0000)
struct UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_CurrentSelectIndex;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LastSelectIndex;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBActivityManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter");
static_assert(sizeof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter) == 0x000080, "Wrong size on UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, EntryPoint) == 0x000000, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, K2Node_ComponentBoundEvent_CurrentSelectIndex) == 0x000008, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::K2Node_ComponentBoundEvent_CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, K2Node_ComponentBoundEvent_LastSelectIndex) == 0x00000C, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::K2Node_ComponentBoundEvent_LastSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_GetChildAt_ReturnValue_1) == 0x000030, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_GetActiveWidget_ReturnValue) == 0x000050, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_GetDisplayName_ReturnValue_1) == 0x000058, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_IsWithEditor_ReturnValue) == 0x000078, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter, CallFunc_GetChildIndex_ReturnValue) == 0x00007C, "Member 'UMG_ActivityCenter_C_ExecuteUbergraph_UMG_ActivityCenter::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_ActivityCenter_C_BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature final
{
public:
	int32                                         CurrentSelectIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSelectIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityCenter_C_BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000004, "Wrong alignment on UMG_ActivityCenter_C_BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(sizeof(UMG_ActivityCenter_C_BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000008, "Wrong size on UMG_ActivityCenter_C_BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(offsetof(UMG_ActivityCenter_C_BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, CurrentSelectIndex) == 0x000000, "Member 'UMG_ActivityCenter_C_BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, LastSelectIndex) == 0x000004, "Member 'UMG_ActivityCenter_C_BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::LastSelectIndex' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_ActivityCenter_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_ActivityCenter_C_PreConstruct");
static_assert(sizeof(UMG_ActivityCenter_C_PreConstruct) == 0x000001, "Wrong size on UMG_ActivityCenter_C_PreConstruct");
static_assert(offsetof(UMG_ActivityCenter_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_ActivityCenter_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.RefreshCardList
// 0x00E8 (0x00E8 - 0x0000)
struct UMG_ActivityCenter_C_RefreshCardList final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUMG_ActivityCenter_TitleCard_C* ClickedWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUMG_ActivityCenter_TitleCard_C* ClickedWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivityValid_Out;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        CallFunc_Create_ReturnValue_1;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivityValid_Out_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot_1;            // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_RefreshCardList) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_RefreshCardList");
static_assert(sizeof(UMG_ActivityCenter_C_RefreshCardList) == 0x0000E8, "Wrong size on UMG_ActivityCenter_C_RefreshCardList");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_ActivityCenter_C_RefreshCardList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_ActivityCenter_C_RefreshCardList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'UMG_ActivityCenter_C_RefreshCardList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, K2Node_MakeStruct_Margin) == 0x000010, "Member 'UMG_ActivityCenter_C_RefreshCardList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'UMG_ActivityCenter_C_RefreshCardList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'UMG_ActivityCenter_C_RefreshCardList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Array_Get_Item) == 0x000048, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_IsActivityValid_Out) == 0x00005C, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_IsActivityValid_Out' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Create_ReturnValue) == 0x000068, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, K2Node_MakeStruct_Margin_1) == 0x000070, "Member 'UMG_ActivityCenter_C_RefreshCardList::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000088, "Member 'UMG_ActivityCenter_C_RefreshCardList::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'UMG_ActivityCenter_C_RefreshCardList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, Temp_int_Loop_Counter_Variable_1) == 0x000094, "Member 'UMG_ActivityCenter_C_RefreshCardList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000A0, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Create_ReturnValue_1) == 0x0000A8, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_IsActivityValid_Out_1) == 0x0000C0, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_IsActivityValid_Out_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Array_Length_ReturnValue_1) == 0x0000C4, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C8, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, CallFunc_AddChild_ReturnValue_1) == 0x0000D0, "Member 'UMG_ActivityCenter_C_RefreshCardList::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, K2Node_DynamicCast_AsScroll_Box_Slot_1) == 0x0000D8, "Member 'UMG_ActivityCenter_C_RefreshCardList::K2Node_DynamicCast_AsScroll_Box_Slot_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshCardList, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'UMG_ActivityCenter_C_RefreshCardList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.OnSelectedNewsCard
// 0x0010 (0x0010 - 0x0000)
struct UMG_ActivityCenter_C_OnSelectedNewsCard final
{
public:
	class UUMG_ActivityCenter_TitleCard_C*        ClickedWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RefreshSelectedCard_bUpdated;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_OnSelectedNewsCard) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_OnSelectedNewsCard");
static_assert(sizeof(UMG_ActivityCenter_C_OnSelectedNewsCard) == 0x000010, "Wrong size on UMG_ActivityCenter_C_OnSelectedNewsCard");
static_assert(offsetof(UMG_ActivityCenter_C_OnSelectedNewsCard, ClickedWidget) == 0x000000, "Member 'UMG_ActivityCenter_C_OnSelectedNewsCard::ClickedWidget' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_OnSelectedNewsCard, CallFunc_RefreshSelectedCard_bUpdated) == 0x000008, "Member 'UMG_ActivityCenter_C_OnSelectedNewsCard::CallFunc_RefreshSelectedCard_bUpdated' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.OnSelectedEventCard
// 0x0010 (0x0010 - 0x0000)
struct UMG_ActivityCenter_C_OnSelectedEventCard final
{
public:
	class UUMG_ActivityCenter_TitleCard_C*        ClickedWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RefreshSelectedCard_bUpdated;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_OnSelectedEventCard) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_OnSelectedEventCard");
static_assert(sizeof(UMG_ActivityCenter_C_OnSelectedEventCard) == 0x000010, "Wrong size on UMG_ActivityCenter_C_OnSelectedEventCard");
static_assert(offsetof(UMG_ActivityCenter_C_OnSelectedEventCard, ClickedWidget) == 0x000000, "Member 'UMG_ActivityCenter_C_OnSelectedEventCard::ClickedWidget' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_OnSelectedEventCard, CallFunc_RefreshSelectedCard_bUpdated) == 0x000008, "Member 'UMG_ActivityCenter_C_OnSelectedEventCard::CallFunc_RefreshSelectedCard_bUpdated' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.RefreshNewsContent
// 0x0001 (0x0001 - 0x0000)
struct UMG_ActivityCenter_C_RefreshNewsContent final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_RefreshNewsContent) == 0x000001, "Wrong alignment on UMG_ActivityCenter_C_RefreshNewsContent");
static_assert(sizeof(UMG_ActivityCenter_C_RefreshNewsContent) == 0x000001, "Wrong size on UMG_ActivityCenter_C_RefreshNewsContent");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshNewsContent, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_ActivityCenter_C_RefreshNewsContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.RefreshSelectedCard
// 0x0010 (0x0010 - 0x0000)
struct UMG_ActivityCenter_C_RefreshSelectedCard final
{
public:
	class UUMG_ActivityCenter_TitleCard_C*        SelectedWidget_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdated;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_RefreshSelectedCard) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_RefreshSelectedCard");
static_assert(sizeof(UMG_ActivityCenter_C_RefreshSelectedCard) == 0x000010, "Wrong size on UMG_ActivityCenter_C_RefreshSelectedCard");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshSelectedCard, SelectedWidget_0) == 0x000000, "Member 'UMG_ActivityCenter_C_RefreshSelectedCard::SelectedWidget_0' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshSelectedCard, bUpdated) == 0x000008, "Member 'UMG_ActivityCenter_C_RefreshSelectedCard::bUpdated' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshSelectedCard, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'UMG_ActivityCenter_C_RefreshSelectedCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshSelectedCard, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00000A, "Member 'UMG_ActivityCenter_C_RefreshSelectedCard::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.RefreshEventContent
// 0x0178 (0x0178 - 0x0000)
struct UMG_ActivityCenter_C_RefreshEventContent final
{
public:
	struct FPBActivity                            Activity;                                          // 0x0000(0x00B0)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBActivityManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBActivity                            CallFunc_GetActivity_Activity;                     // 0x00C0(0x00B0)()
	bool                                          CallFunc_GetActivity_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_RefreshEventContent) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_RefreshEventContent");
static_assert(sizeof(UMG_ActivityCenter_C_RefreshEventContent) == 0x000178, "Wrong size on UMG_ActivityCenter_C_RefreshEventContent");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshEventContent, Activity) == 0x000000, "Member 'UMG_ActivityCenter_C_RefreshEventContent::Activity' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshEventContent, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'UMG_ActivityCenter_C_RefreshEventContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshEventContent, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000B8, "Member 'UMG_ActivityCenter_C_RefreshEventContent::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshEventContent, CallFunc_GetActivity_Activity) == 0x0000C0, "Member 'UMG_ActivityCenter_C_RefreshEventContent::CallFunc_GetActivity_Activity' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshEventContent, CallFunc_GetActivity_ReturnValue) == 0x000170, "Member 'UMG_ActivityCenter_C_RefreshEventContent::CallFunc_GetActivity_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_RefreshEventContent, K2Node_SwitchEnum_CmpSuccess) == 0x000171, "Member 'UMG_ActivityCenter_C_RefreshEventContent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.SetDefaultSelect
// 0x0010 (0x0010 - 0x0000)
struct UMG_ActivityCenter_C_SetDefaultSelect final
{
public:
	class UUMG_ActivityCenter_TitleCard_C*        SelectedWidget_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RefreshSelectedCard_bUpdated;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_SetDefaultSelect) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_SetDefaultSelect");
static_assert(sizeof(UMG_ActivityCenter_C_SetDefaultSelect) == 0x000010, "Wrong size on UMG_ActivityCenter_C_SetDefaultSelect");
static_assert(offsetof(UMG_ActivityCenter_C_SetDefaultSelect, SelectedWidget_0) == 0x000000, "Member 'UMG_ActivityCenter_C_SetDefaultSelect::SelectedWidget_0' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_SetDefaultSelect, CallFunc_RefreshSelectedCard_bUpdated) == 0x000008, "Member 'UMG_ActivityCenter_C_SetDefaultSelect::CallFunc_RefreshSelectedCard_bUpdated' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.SelectNewDefaultSelect
// 0x0020 (0x0020 - 0x0000)
struct UMG_ActivityCenter_C_SelectNewDefaultSelect final
{
public:
	int32                                         SelectedIntex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        K2Node_DynamicCast_AsUMG_Activity_Center_Title_Card; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_SelectNewDefaultSelect) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_SelectNewDefaultSelect");
static_assert(sizeof(UMG_ActivityCenter_C_SelectNewDefaultSelect) == 0x000020, "Wrong size on UMG_ActivityCenter_C_SelectNewDefaultSelect");
static_assert(offsetof(UMG_ActivityCenter_C_SelectNewDefaultSelect, SelectedIntex) == 0x000000, "Member 'UMG_ActivityCenter_C_SelectNewDefaultSelect::SelectedIntex' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_SelectNewDefaultSelect, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'UMG_ActivityCenter_C_SelectNewDefaultSelect::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_SelectNewDefaultSelect, K2Node_DynamicCast_AsUMG_Activity_Center_Title_Card) == 0x000010, "Member 'UMG_ActivityCenter_C_SelectNewDefaultSelect::K2Node_DynamicCast_AsUMG_Activity_Center_Title_Card' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_SelectNewDefaultSelect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_ActivityCenter_C_SelectNewDefaultSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_SelectNewDefaultSelect, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'UMG_ActivityCenter_C_SelectNewDefaultSelect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.SelectEventDefaultSelect
// 0x0020 (0x0020 - 0x0000)
struct UMG_ActivityCenter_C_SelectEventDefaultSelect final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        K2Node_DynamicCast_AsUMG_Activity_Center_Title_Card; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_SelectEventDefaultSelect) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_SelectEventDefaultSelect");
static_assert(sizeof(UMG_ActivityCenter_C_SelectEventDefaultSelect) == 0x000020, "Wrong size on UMG_ActivityCenter_C_SelectEventDefaultSelect");
static_assert(offsetof(UMG_ActivityCenter_C_SelectEventDefaultSelect, SelectedIndex) == 0x000000, "Member 'UMG_ActivityCenter_C_SelectEventDefaultSelect::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_SelectEventDefaultSelect, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'UMG_ActivityCenter_C_SelectEventDefaultSelect::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_SelectEventDefaultSelect, K2Node_DynamicCast_AsUMG_Activity_Center_Title_Card) == 0x000010, "Member 'UMG_ActivityCenter_C_SelectEventDefaultSelect::K2Node_DynamicCast_AsUMG_Activity_Center_Title_Card' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_SelectEventDefaultSelect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_ActivityCenter_C_SelectEventDefaultSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_SelectEventDefaultSelect, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'UMG_ActivityCenter_C_SelectEventDefaultSelect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.DailyActivityPage
// 0x0028 (0x0028 - 0x0000)
struct UMG_ActivityCenter_C_DailyActivityPage final
{
public:
	class FString                                 ActivityID;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ActivityCenter_Daily_C*            CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityCenter_C_DailyActivityPage) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_DailyActivityPage");
static_assert(sizeof(UMG_ActivityCenter_C_DailyActivityPage) == 0x000028, "Wrong size on UMG_ActivityCenter_C_DailyActivityPage");
static_assert(offsetof(UMG_ActivityCenter_C_DailyActivityPage, ActivityID) == 0x000000, "Member 'UMG_ActivityCenter_C_DailyActivityPage::ActivityID' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_DailyActivityPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'UMG_ActivityCenter_C_DailyActivityPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_DailyActivityPage, CallFunc_Create_ReturnValue) == 0x000018, "Member 'UMG_ActivityCenter_C_DailyActivityPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_DailyActivityPage, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'UMG_ActivityCenter_C_DailyActivityPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.NormalActivityPage
// 0x0028 (0x0028 - 0x0000)
struct UMG_ActivityCenter_C_NormalActivityPage final
{
public:
	class FString                                 ActivityID;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ActivityCenter_Normal_C*           CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityCenter_C_NormalActivityPage) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_NormalActivityPage");
static_assert(sizeof(UMG_ActivityCenter_C_NormalActivityPage) == 0x000028, "Wrong size on UMG_ActivityCenter_C_NormalActivityPage");
static_assert(offsetof(UMG_ActivityCenter_C_NormalActivityPage, ActivityID) == 0x000000, "Member 'UMG_ActivityCenter_C_NormalActivityPage::ActivityID' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_NormalActivityPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'UMG_ActivityCenter_C_NormalActivityPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_NormalActivityPage, CallFunc_Create_ReturnValue) == 0x000018, "Member 'UMG_ActivityCenter_C_NormalActivityPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_NormalActivityPage, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'UMG_ActivityCenter_C_NormalActivityPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.ProgressActivityPage
// 0x0028 (0x0028 - 0x0000)
struct UMG_ActivityCenter_C_ProgressActivityPage final
{
public:
	class FString                                 ActivityID;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ActivityCenter_Progress_C*         CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityCenter_C_ProgressActivityPage) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_ProgressActivityPage");
static_assert(sizeof(UMG_ActivityCenter_C_ProgressActivityPage) == 0x000028, "Wrong size on UMG_ActivityCenter_C_ProgressActivityPage");
static_assert(offsetof(UMG_ActivityCenter_C_ProgressActivityPage, ActivityID) == 0x000000, "Member 'UMG_ActivityCenter_C_ProgressActivityPage::ActivityID' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ProgressActivityPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'UMG_ActivityCenter_C_ProgressActivityPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ProgressActivityPage, CallFunc_Create_ReturnValue) == 0x000018, "Member 'UMG_ActivityCenter_C_ProgressActivityPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_ProgressActivityPage, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'UMG_ActivityCenter_C_ProgressActivityPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.DailyLoginPage
// 0x0018 (0x0018 - 0x0000)
struct UMG_ActivityCenter_C_DailyLoginPage final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_DailyLoginPage_Base_C*             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityCenter_C_DailyLoginPage) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_DailyLoginPage");
static_assert(sizeof(UMG_ActivityCenter_C_DailyLoginPage) == 0x000018, "Wrong size on UMG_ActivityCenter_C_DailyLoginPage");
static_assert(offsetof(UMG_ActivityCenter_C_DailyLoginPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'UMG_ActivityCenter_C_DailyLoginPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_DailyLoginPage, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UMG_ActivityCenter_C_DailyLoginPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_DailyLoginPage, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'UMG_ActivityCenter_C_DailyLoginPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.CumylativeLoginPage
// 0x0018 (0x0018 - 0x0000)
struct UMG_ActivityCenter_C_CumylativeLoginPage final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_CumulativeLoginPage_Base_C*        CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityCenter_C_CumylativeLoginPage) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_CumylativeLoginPage");
static_assert(sizeof(UMG_ActivityCenter_C_CumylativeLoginPage) == 0x000018, "Wrong size on UMG_ActivityCenter_C_CumylativeLoginPage");
static_assert(offsetof(UMG_ActivityCenter_C_CumylativeLoginPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'UMG_ActivityCenter_C_CumylativeLoginPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_CumylativeLoginPage, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UMG_ActivityCenter_C_CumylativeLoginPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_CumylativeLoginPage, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'UMG_ActivityCenter_C_CumylativeLoginPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.LimitedTimeLoginPage
// 0x0018 (0x0018 - 0x0000)
struct UMG_ActivityCenter_C_LimitedTimeLoginPage final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_LimitedTimeLoginPage_Base_C*       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityCenter_C_LimitedTimeLoginPage) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_LimitedTimeLoginPage");
static_assert(sizeof(UMG_ActivityCenter_C_LimitedTimeLoginPage) == 0x000018, "Wrong size on UMG_ActivityCenter_C_LimitedTimeLoginPage");
static_assert(offsetof(UMG_ActivityCenter_C_LimitedTimeLoginPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'UMG_ActivityCenter_C_LimitedTimeLoginPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_LimitedTimeLoginPage, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UMG_ActivityCenter_C_LimitedTimeLoginPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_LimitedTimeLoginPage, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'UMG_ActivityCenter_C_LimitedTimeLoginPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_ActivityCenter.UMG_ActivityCenter_C.Goto Activity
// 0x0098 (0x0098 - 0x0000)
struct UMG_ActivityCenter_C_Goto_Activity final
{
public:
	class FString                                 ActivityID;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          News_0;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ActivityCenter_TitleCard_C*        K2Node_DynamicCast_AsUMG_Activity_Center_Title_Card; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        K2Node_DynamicCast_AsUMG_Activity_Center_Title_Card_1; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_C_Goto_Activity) == 0x000008, "Wrong alignment on UMG_ActivityCenter_C_Goto_Activity");
static_assert(sizeof(UMG_ActivityCenter_C_Goto_Activity) == 0x000098, "Wrong size on UMG_ActivityCenter_C_Goto_Activity");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, ActivityID) == 0x000000, "Member 'UMG_ActivityCenter_C_Goto_Activity::ActivityID' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, News_0) == 0x000010, "Member 'UMG_ActivityCenter_C_Goto_Activity::News_0' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, Temp_bool_True_if_break_was_hit_Variable) == 0x000011, "Member 'UMG_ActivityCenter_C_Goto_Activity::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'UMG_ActivityCenter_C_Goto_Activity::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UMG_ActivityCenter_C_Goto_Activity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UMG_ActivityCenter_C_Goto_Activity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, Temp_bool_True_if_break_was_hit_Variable_1) == 0x00001C, "Member 'UMG_ActivityCenter_C_Goto_Activity::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, Temp_int_Array_Index_Variable) == 0x000020, "Member 'UMG_ActivityCenter_C_Goto_Activity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, CallFunc_Not_PreBool_ReturnValue_1) == 0x000024, "Member 'UMG_ActivityCenter_C_Goto_Activity::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'UMG_ActivityCenter_C_Goto_Activity::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, CallFunc_GetAllChildren_ReturnValue_1) == 0x000038, "Member 'UMG_ActivityCenter_C_Goto_Activity::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UMG_ActivityCenter_C_Goto_Activity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, CallFunc_Array_Get_Item) == 0x000050, "Member 'UMG_ActivityCenter_C_Goto_Activity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_C_Goto_Activity, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'UMG_ActivityCenter_C_Goto_Activity::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
