#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CareerCrew

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_CareerCrew.UMG_CareerCrew_C.ExecuteUbergraph_UMG_CareerCrew
// 0x0008 (0x0008 - 0x0000)
struct UMG_CareerCrew_C_ExecuteUbergraph_UMG_CareerCrew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerCrew_C_ExecuteUbergraph_UMG_CareerCrew) == 0x000004, "Wrong alignment on UMG_CareerCrew_C_ExecuteUbergraph_UMG_CareerCrew");
static_assert(sizeof(UMG_CareerCrew_C_ExecuteUbergraph_UMG_CareerCrew) == 0x000008, "Wrong size on UMG_CareerCrew_C_ExecuteUbergraph_UMG_CareerCrew");
static_assert(offsetof(UMG_CareerCrew_C_ExecuteUbergraph_UMG_CareerCrew, EntryPoint) == 0x000000, "Member 'UMG_CareerCrew_C_ExecuteUbergraph_UMG_CareerCrew::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_ExecuteUbergraph_UMG_CareerCrew, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_CareerCrew_C_ExecuteUbergraph_UMG_CareerCrew::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_CareerCrew.UMG_CareerCrew_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_CareerCrew_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerCrew_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_CareerCrew_C_PreConstruct");
static_assert(sizeof(UMG_CareerCrew_C_PreConstruct) == 0x000001, "Wrong size on UMG_CareerCrew_C_PreConstruct");
static_assert(offsetof(UMG_CareerCrew_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_CareerCrew_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_CareerCrew.UMG_CareerCrew_C.RefreshInfo
// 0x0010 (0x0010 - 0x0000)
struct UMG_CareerCrew_C_RefreshInfo final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerCrew_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_CareerCrew_C_RefreshInfo");
static_assert(sizeof(UMG_CareerCrew_C_RefreshInfo) == 0x000010, "Wrong size on UMG_CareerCrew_C_RefreshInfo");
static_assert(offsetof(UMG_CareerCrew_C_RefreshInfo, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'UMG_CareerCrew_C_RefreshInfo::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_RefreshInfo, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_CareerCrew_C_RefreshInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_CareerCrew.UMG_CareerCrew_C.InitCharacterList
// 0x0060 (0x0060 - 0x0000)
struct UMG_CareerCrew_C_InitCharacterList final
{
public:
	class UPBDataTableManager*                    CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDefaultCharacterDefinitionTableIDScope_ReturnValue; // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUMG_ProgressionOperatorCard_C* Widget)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionOperatorCard_C*         CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CareerCrew_C_InitCharacterList) == 0x000008, "Wrong alignment on UMG_CareerCrew_C_InitCharacterList");
static_assert(sizeof(UMG_CareerCrew_C_InitCharacterList) == 0x000060, "Wrong size on UMG_CareerCrew_C_InitCharacterList");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000000, "Member 'UMG_CareerCrew_C_InitCharacterList::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, CallFunc_GetDefaultCharacterDefinitionTableIDScope_ReturnValue) == 0x000008, "Member 'UMG_CareerCrew_C_InitCharacterList::CallFunc_GetDefaultCharacterDefinitionTableIDScope_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, Temp_int_Array_Index_Variable) == 0x000018, "Member 'UMG_CareerCrew_C_InitCharacterList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'UMG_CareerCrew_C_InitCharacterList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, CallFunc_Array_Get_Item) == 0x000020, "Member 'UMG_CareerCrew_C_InitCharacterList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'UMG_CareerCrew_C_InitCharacterList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'UMG_CareerCrew_C_InitCharacterList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'UMG_CareerCrew_C_InitCharacterList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'UMG_CareerCrew_C_InitCharacterList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'UMG_CareerCrew_C_InitCharacterList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, CallFunc_Create_ReturnValue) == 0x000050, "Member 'UMG_CareerCrew_C_InitCharacterList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitCharacterList, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'UMG_CareerCrew_C_InitCharacterList::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_CareerCrew.UMG_CareerCrew_C.OnSelectedCharacter
// 0x0010 (0x0010 - 0x0000)
struct UMG_CareerCrew_C_OnSelectedCharacter final
{
public:
	class UUMG_ProgressionOperatorCard_C*         Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerCrew_C_OnSelectedCharacter) == 0x000008, "Wrong alignment on UMG_CareerCrew_C_OnSelectedCharacter");
static_assert(sizeof(UMG_CareerCrew_C_OnSelectedCharacter) == 0x000010, "Wrong size on UMG_CareerCrew_C_OnSelectedCharacter");
static_assert(offsetof(UMG_CareerCrew_C_OnSelectedCharacter, Widget) == 0x000000, "Member 'UMG_CareerCrew_C_OnSelectedCharacter::Widget' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_OnSelectedCharacter, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_CareerCrew_C_OnSelectedCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_OnSelectedCharacter, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'UMG_CareerCrew_C_OnSelectedCharacter::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function UMG_CareerCrew.UMG_CareerCrew_C.InitFocus
// 0x0010 (0x0010 - 0x0000)
struct UMG_CareerCrew_C_InitFocus final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerCrew_C_InitFocus) == 0x000008, "Wrong alignment on UMG_CareerCrew_C_InitFocus");
static_assert(sizeof(UMG_CareerCrew_C_InitFocus) == 0x000010, "Wrong size on UMG_CareerCrew_C_InitFocus");
static_assert(offsetof(UMG_CareerCrew_C_InitFocus, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'UMG_CareerCrew_C_InitFocus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerCrew_C_InitFocus, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_CareerCrew_C_InitFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

