#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_WaterMark

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_WaterMark.UMG_WaterMark_C
// 0x00F8 (0x0358 - 0x0260)
class UUMG_WaterMark_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HintFlashStop;                                     // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HintFlash;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowHint;                                          // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_20;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_195;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_523;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageNumber;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBWidgetSwitcher*                      PagesSwitcher;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerID;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerID_1;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextID;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextID_1;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalPages;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_WaterMarkCenter_C*                 UMG_WaterMarkCenter_366;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_WaterMarkGroup_C*                  UMG_WaterMarkGroup_8;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_WaterMarkGroup_C*                  UMG_WaterMarkGroup_9;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_198;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Version;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Version_1;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextWidgets;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         PageIndex;                                         // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerRight;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerLeft;                                         // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 MarkRowArray;                                      // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 MarkColumnArray;                                   // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPBLocalPlayer*                         PBLocal_Player;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_WaterMark(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void PingPongHint();
	void StopHintHighlight();
	void PlayHintHighlight();
	void NavLeft();
	void NavRight();
	void HintHide();
	void HintShow();
	void SteamCheckID();
	void OnInitialized();
	void HandlePlatformID(class UPBLocalPlayer* LocalPlayer);
	void HandldeDefaultUID(class UPBLocalPlayer* self2);
	void HandleGameVersion();
	void InitMark();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_WaterMark_C">();
	}
	static class UUMG_WaterMark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_WaterMark_C>();
	}
};
static_assert(alignof(UUMG_WaterMark_C) == 0x000008, "Wrong alignment on UUMG_WaterMark_C");
static_assert(sizeof(UUMG_WaterMark_C) == 0x000358, "Wrong size on UUMG_WaterMark_C");
static_assert(offsetof(UUMG_WaterMark_C, UberGraphFrame) == 0x000260, "Member 'UUMG_WaterMark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, HintFlashStop) == 0x000268, "Member 'UUMG_WaterMark_C::HintFlashStop' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, HintFlash) == 0x000270, "Member 'UUMG_WaterMark_C::HintFlash' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, ShowHint) == 0x000278, "Member 'UUMG_WaterMark_C::ShowHint' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, Image_20) == 0x000280, "Member 'UUMG_WaterMark_C::Image_20' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, Image_195) == 0x000288, "Member 'UUMG_WaterMark_C::Image_195' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, Image_523) == 0x000290, "Member 'UUMG_WaterMark_C::Image_523' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, PageNumber) == 0x000298, "Member 'UUMG_WaterMark_C::PageNumber' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, PagesSwitcher) == 0x0002A0, "Member 'UUMG_WaterMark_C::PagesSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, Text_PlayerID) == 0x0002A8, "Member 'UUMG_WaterMark_C::Text_PlayerID' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, Text_PlayerID_1) == 0x0002B0, "Member 'UUMG_WaterMark_C::Text_PlayerID_1' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, TextID) == 0x0002B8, "Member 'UUMG_WaterMark_C::TextID' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, TextID_1) == 0x0002C0, "Member 'UUMG_WaterMark_C::TextID_1' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, TotalPages) == 0x0002C8, "Member 'UUMG_WaterMark_C::TotalPages' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, UMG_WaterMarkCenter_366) == 0x0002D0, "Member 'UUMG_WaterMark_C::UMG_WaterMarkCenter_366' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, UMG_WaterMarkGroup_8) == 0x0002D8, "Member 'UUMG_WaterMark_C::UMG_WaterMarkGroup_8' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, UMG_WaterMarkGroup_9) == 0x0002E0, "Member 'UUMG_WaterMark_C::UMG_WaterMarkGroup_9' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, UniformGridPanel_198) == 0x0002E8, "Member 'UUMG_WaterMark_C::UniformGridPanel_198' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, Version) == 0x0002F0, "Member 'UUMG_WaterMark_C::Version' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, Version_1) == 0x0002F8, "Member 'UUMG_WaterMark_C::Version_1' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, TextWidgets) == 0x000300, "Member 'UUMG_WaterMark_C::TextWidgets' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, PageIndex) == 0x000310, "Member 'UUMG_WaterMark_C::PageIndex' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, TimerRight) == 0x000318, "Member 'UUMG_WaterMark_C::TimerRight' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, TimerLeft) == 0x000320, "Member 'UUMG_WaterMark_C::TimerLeft' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, MarkRowArray) == 0x000328, "Member 'UUMG_WaterMark_C::MarkRowArray' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, MarkColumnArray) == 0x000338, "Member 'UUMG_WaterMark_C::MarkColumnArray' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, PBLocal_Player) == 0x000348, "Member 'UUMG_WaterMark_C::PBLocal_Player' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMark_C, TimerHandle) == 0x000350, "Member 'UUMG_WaterMark_C::TimerHandle' has a wrong offset!");

}

