#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SwitcherRight

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SwitcherRight.UMG_SwitcherRight_C
// 0x0028 (0x0288 - 0x0260)
class UUMG_SwitcherRight_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Arrow_Right;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRightArrowClicked;                               // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_SwitcherRight(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void RefreshEnableState(bool bIsEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SwitcherRight_C">();
	}
	static class UUMG_SwitcherRight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SwitcherRight_C>();
	}
};
static_assert(alignof(UUMG_SwitcherRight_C) == 0x000008, "Wrong alignment on UUMG_SwitcherRight_C");
static_assert(sizeof(UUMG_SwitcherRight_C) == 0x000288, "Wrong size on UUMG_SwitcherRight_C");
static_assert(offsetof(UUMG_SwitcherRight_C, UberGraphFrame) == 0x000260, "Member 'UUMG_SwitcherRight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SwitcherRight_C, Arrow_Right) == 0x000268, "Member 'UUMG_SwitcherRight_C::Arrow_Right' has a wrong offset!");
static_assert(offsetof(UUMG_SwitcherRight_C, Image_BG) == 0x000270, "Member 'UUMG_SwitcherRight_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UUMG_SwitcherRight_C, OnRightArrowClicked) == 0x000278, "Member 'UUMG_SwitcherRight_C::OnRightArrowClicked' has a wrong offset!");

}

