#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_Health

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_InGameHUD_Health.UMG_InGameHUD_Health_C
// 0x0030 (0x02B8 - 0x0288)
class UUMG_InGameHUD_Health_C final : public UPBHealthHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Health;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Red;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InGameHUD_Mother_C*                ParientHUD;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChunkSize;                                         // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHealthPercentInterped;                      // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_InGameHUD_Health(int32 EntryPoint);
	void Construct();
	void K2_OnHealthUpdated();
	void Event_ParientPreConstruct(class UUMG_InGameHUD_Mother_C* Parient);
	void UpdateBarPerform();
	void SetBarShieldLine(class UProgressBar* InBarPtr);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_InGameHUD_Health_C">();
	}
	static class UUMG_InGameHUD_Health_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_InGameHUD_Health_C>();
	}
};
static_assert(alignof(UUMG_InGameHUD_Health_C) == 0x000008, "Wrong alignment on UUMG_InGameHUD_Health_C");
static_assert(sizeof(UUMG_InGameHUD_Health_C) == 0x0002B8, "Wrong size on UUMG_InGameHUD_Health_C");
static_assert(offsetof(UUMG_InGameHUD_Health_C, UberGraphFrame) == 0x000288, "Member 'UUMG_InGameHUD_Health_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Health_C, Hide) == 0x000290, "Member 'UUMG_InGameHUD_Health_C::Hide' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Health_C, ProgressBar_Health) == 0x000298, "Member 'UUMG_InGameHUD_Health_C::ProgressBar_Health' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Health_C, ProgressBar_Red) == 0x0002A0, "Member 'UUMG_InGameHUD_Health_C::ProgressBar_Red' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Health_C, ParientHUD) == 0x0002A8, "Member 'UUMG_InGameHUD_Health_C::ParientHUD' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Health_C, ChunkSize) == 0x0002B0, "Member 'UUMG_InGameHUD_Health_C::ChunkSize' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_Health_C, CurrentHealthPercentInterped) == 0x0002B4, "Member 'UUMG_InGameHUD_Health_C::CurrentHealthPercentInterped' has a wrong offset!");

}

