#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MatchMedal

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_MatchMedal.UMG_MatchMedal_C.RefreshMedalInfos
// 0x0138 (0x0138 - 0x0000)
struct UMG_MatchMedal_C_RefreshMedalInfos final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCareerManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCareerManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Medal_Small_C*                     K2Node_DynamicCast_AsUMG_Medal_Small;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0038(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBStateMachineEventRow                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPBMedalDetailsDataTableRowBase& InMedalDetail, int32 InCount, class UUMG_Medal_Small_C* InSelectedMedal)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBMedalDetailsDataTableRowBase        CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00E0(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Medal_Small_C*                     CallFunc_Create_ReturnValue;                       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchMedal_C_RefreshMedalInfos) == 0x000008, "Wrong alignment on UMG_MatchMedal_C_RefreshMedalInfos");
static_assert(sizeof(UMG_MatchMedal_C_RefreshMedalInfos) == 0x000138, "Wrong size on UMG_MatchMedal_C_RefreshMedalInfos");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000020, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, K2Node_DynamicCast_AsUMG_Medal_Small) == 0x000028, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::K2Node_DynamicCast_AsUMG_Medal_Small' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Map_Keys_Keys) == 0x000038, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Array_Get_Item) == 0x000048, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Map_Find_Value) == 0x00005C, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Map_Find_ReturnValue) == 0x000060, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Less_IntInt_ReturnValue) == 0x000061, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Conv_StringToName_ReturnValue) == 0x000064, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B0, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C8, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000D8, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000E0, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000120, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_Create_ReturnValue) == 0x000128, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_RefreshMedalInfos, CallFunc_AddChild_ReturnValue) == 0x000130, "Member 'UMG_MatchMedal_C_RefreshMedalInfos::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_MatchMedal.UMG_MatchMedal_C.OnMedalSelected
// 0x0058 (0x0058 - 0x0000)
struct UMG_MatchMedal_C_OnMedalSelected final
{
public:
	struct FPBMedalDetailsDataTableRowBase        InMedalDetail;                                     // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InCount;                                           // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Medal_Small_C*                     InSelectedMedal;                                   // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MatchMedal_C_OnMedalSelected) == 0x000008, "Wrong alignment on UMG_MatchMedal_C_OnMedalSelected");
static_assert(sizeof(UMG_MatchMedal_C_OnMedalSelected) == 0x000058, "Wrong size on UMG_MatchMedal_C_OnMedalSelected");
static_assert(offsetof(UMG_MatchMedal_C_OnMedalSelected, InMedalDetail) == 0x000000, "Member 'UMG_MatchMedal_C_OnMedalSelected::InMedalDetail' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_OnMedalSelected, InCount) == 0x000040, "Member 'UMG_MatchMedal_C_OnMedalSelected::InCount' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_OnMedalSelected, InSelectedMedal) == 0x000048, "Member 'UMG_MatchMedal_C_OnMedalSelected::InSelectedMedal' has a wrong offset!");
static_assert(offsetof(UMG_MatchMedal_C_OnMedalSelected, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'UMG_MatchMedal_C_OnMedalSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

