#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_CatchingHint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_HelmetHUD_CatchingHint.UMG_HelmetHUD_CatchingHint_C.ExecuteUbergraph_UMG_HelmetHUD_CatchingHint
// 0x0044 (0x0044 - 0x0000)
struct UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InCoolDownDuration;                   // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint) == 0x000004, "Wrong alignment on UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint");
static_assert(sizeof(UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint) == 0x000044, "Wrong size on UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint, EntryPoint) == 0x000000, "Member 'UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint, K2Node_Event_InCoolDownDuration) == 0x000004, "Member 'UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint::K2Node_Event_InCoolDownDuration' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint, K2Node_Event_MyGeometry) == 0x000008, "Member 'UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint, K2Node_Event_InDeltaTime) == 0x000040, "Member 'UMG_HelmetHUD_CatchingHint_C_ExecuteUbergraph_UMG_HelmetHUD_CatchingHint::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function UMG_HelmetHUD_CatchingHint.UMG_HelmetHUD_CatchingHint_C.K2_RefreshStartCoolDownInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_CatchingHint_C_K2_RefreshStartCoolDownInfo final
{
public:
	float                                         InCoolDownDuration;                                // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_CatchingHint_C_K2_RefreshStartCoolDownInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_CatchingHint_C_K2_RefreshStartCoolDownInfo");
static_assert(sizeof(UMG_HelmetHUD_CatchingHint_C_K2_RefreshStartCoolDownInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_CatchingHint_C_K2_RefreshStartCoolDownInfo");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_K2_RefreshStartCoolDownInfo, InCoolDownDuration) == 0x000000, "Member 'UMG_HelmetHUD_CatchingHint_C_K2_RefreshStartCoolDownInfo::InCoolDownDuration' has a wrong offset!");

// Function UMG_HelmetHUD_CatchingHint.UMG_HelmetHUD_CatchingHint_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_HelmetHUD_CatchingHint_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_CatchingHint_C_Tick) == 0x000004, "Wrong alignment on UMG_HelmetHUD_CatchingHint_C_Tick");
static_assert(sizeof(UMG_HelmetHUD_CatchingHint_C_Tick) == 0x00003C, "Wrong size on UMG_HelmetHUD_CatchingHint_C_Tick");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_HelmetHUD_CatchingHint_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_HelmetHUD_CatchingHint_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_HelmetHUD_CatchingHint.UMG_HelmetHUD_CatchingHint_C.RefreshCoolDownInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_CatchingHint_C_RefreshCoolDownInfo final
{
public:
	float                                         InCoolDownDuration;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_CatchingHint_C_RefreshCoolDownInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_CatchingHint_C_RefreshCoolDownInfo");
static_assert(sizeof(UMG_HelmetHUD_CatchingHint_C_RefreshCoolDownInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_CatchingHint_C_RefreshCoolDownInfo");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_RefreshCoolDownInfo, InCoolDownDuration) == 0x000000, "Member 'UMG_HelmetHUD_CatchingHint_C_RefreshCoolDownInfo::InCoolDownDuration' has a wrong offset!");

// Function UMG_HelmetHUD_CatchingHint.UMG_HelmetHUD_CatchingHint_C.RefreshLockedInfo
// 0x0008 (0x0008 - 0x0000)
struct UMG_HelmetHUD_CatchingHint_C_RefreshLockedInfo final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_CatchingHint_C_RefreshLockedInfo) == 0x000008, "Wrong alignment on UMG_HelmetHUD_CatchingHint_C_RefreshLockedInfo");
static_assert(sizeof(UMG_HelmetHUD_CatchingHint_C_RefreshLockedInfo) == 0x000008, "Wrong size on UMG_HelmetHUD_CatchingHint_C_RefreshLockedInfo");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_RefreshLockedInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_HelmetHUD_CatchingHint_C_RefreshLockedInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_HelmetHUD_CatchingHint.UMG_HelmetHUD_CatchingHint_C.RefreshUnlockInfo
// 0x0008 (0x0008 - 0x0000)
struct UMG_HelmetHUD_CatchingHint_C_RefreshUnlockInfo final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_CatchingHint_C_RefreshUnlockInfo) == 0x000008, "Wrong alignment on UMG_HelmetHUD_CatchingHint_C_RefreshUnlockInfo");
static_assert(sizeof(UMG_HelmetHUD_CatchingHint_C_RefreshUnlockInfo) == 0x000008, "Wrong size on UMG_HelmetHUD_CatchingHint_C_RefreshUnlockInfo");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_RefreshUnlockInfo, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'UMG_HelmetHUD_CatchingHint_C_RefreshUnlockInfo::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function UMG_HelmetHUD_CatchingHint.UMG_HelmetHUD_CatchingHint_C.UpdateHintPosition
// 0x0044 (0x0044 - 0x0000)
struct UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition final
{
public:
	struct FVector2D                              LocalHintPosition;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShowHint_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetHintPosition_ReturnValue;              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetScreenPositionFromWorldLocation_ScreenPosition; // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScreenPositionFromWorldLocation_ReturnValue; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Vector2DInterpTo_ReturnValue;             // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition) == 0x000004, "Wrong alignment on UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition");
static_assert(sizeof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition) == 0x000044, "Wrong size on UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, LocalHintPosition) == 0x000000, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::LocalHintPosition' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_ShouldShowHint_ReturnValue) == 0x000009, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_ShouldShowHint_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_GetHintPosition_ReturnValue) == 0x00000C, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_GetHintPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_GetScreenPositionFromWorldLocation_ScreenPosition) == 0x000014, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_GetScreenPositionFromWorldLocation_ScreenPosition' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_GetScreenPositionFromWorldLocation_ReturnValue) == 0x00001C, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_GetScreenPositionFromWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001D, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001E, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_BooleanOR_ReturnValue) == 0x00001F, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_GetViewportSize_ReturnValue) == 0x000024, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x00002C, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000034, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition, CallFunc_Vector2DInterpTo_ReturnValue) == 0x00003C, "Member 'UMG_HelmetHUD_CatchingHint_C_UpdateHintPosition::CallFunc_Vector2DInterpTo_ReturnValue' has a wrong offset!");

}

