#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_OperationInstruction

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "FPBGameEventConfig_BP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C
// 0x0110 (0x0378 - 0x0268)
class UUMG_InGameHUD_OperationInstruction_C final : public UPBWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Drop;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_210;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      Image_ButtonHnit;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      Image_ButtonHnit_1;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MechUAVIconOverlay;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OperationTipButtonHnit;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_364;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_MechUAV;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressBarframe;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressBarframe_1;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SB_Progress_MechUAV;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SB_ProgressHorizontalBox;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_Operation;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_Operation_1;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_RemainTime;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_RemainTime_MechUAV;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_RemainTime_MechUAV_1;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InGameHUD_Mother_C*                ParientHUD;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ProgressBarTimer;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EPBInteractionEventType                       CurrentGamePlayEventType;                          // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBInteractionEventType, struct FFPBGameEventConfig_BP> GameEventMap;                                      // 0x0318(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	EPBInteractionEventType                       PrevGamePlayEventType;                             // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           MechUAVProgressBarTimer;                           // 0x0370(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_InGameHUD_OperationInstruction(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Event_ParientPreConstruct(class UUMG_InGameHUD_Mother_C* Parient);
	void Construct();
	void RefreshPerefrence(const class FText& InText, class FName InputName);
	void UpdateProgressBarProgress();
	void StopProgressBarTimer();
	void GetPickUPWeaponName(class FText* WeaponName);
	void ShowGameEventHint(EPBInteractionEventType InGamePlayEventType);
	void BackToPrevGameEventHint();
	void ShowMechUAVHint();
	void HiddenMechUAVHint();
	void UpdateMechUAVProgressBar();
	void RefreshInteractiveButton();
	void ShowDropHint();
	void HideDropHint();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_InGameHUD_OperationInstruction_C">();
	}
	static class UUMG_InGameHUD_OperationInstruction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_InGameHUD_OperationInstruction_C>();
	}
};
static_assert(alignof(UUMG_InGameHUD_OperationInstruction_C) == 0x000008, "Wrong alignment on UUMG_InGameHUD_OperationInstruction_C");
static_assert(sizeof(UUMG_InGameHUD_OperationInstruction_C) == 0x000378, "Wrong size on UUMG_InGameHUD_OperationInstruction_C");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, UberGraphFrame) == 0x000268, "Member 'UUMG_InGameHUD_OperationInstruction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, HorizontalBox_Drop) == 0x000270, "Member 'UUMG_InGameHUD_OperationInstruction_C::HorizontalBox_Drop' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, Image) == 0x000278, "Member 'UUMG_InGameHUD_OperationInstruction_C::Image' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, Image_210) == 0x000280, "Member 'UUMG_InGameHUD_OperationInstruction_C::Image_210' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, Image_ButtonHnit) == 0x000288, "Member 'UUMG_InGameHUD_OperationInstruction_C::Image_ButtonHnit' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, Image_ButtonHnit_1) == 0x000290, "Member 'UUMG_InGameHUD_OperationInstruction_C::Image_ButtonHnit_1' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, MechUAVIconOverlay) == 0x000298, "Member 'UUMG_InGameHUD_OperationInstruction_C::MechUAVIconOverlay' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, OperationTipButtonHnit) == 0x0002A0, "Member 'UUMG_InGameHUD_OperationInstruction_C::OperationTipButtonHnit' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, ProgressBar_364) == 0x0002A8, "Member 'UUMG_InGameHUD_OperationInstruction_C::ProgressBar_364' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, ProgressBar_MechUAV) == 0x0002B0, "Member 'UUMG_InGameHUD_OperationInstruction_C::ProgressBar_MechUAV' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, ProgressBarframe) == 0x0002B8, "Member 'UUMG_InGameHUD_OperationInstruction_C::ProgressBarframe' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, ProgressBarframe_1) == 0x0002C0, "Member 'UUMG_InGameHUD_OperationInstruction_C::ProgressBarframe_1' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, SB_Progress_MechUAV) == 0x0002C8, "Member 'UUMG_InGameHUD_OperationInstruction_C::SB_Progress_MechUAV' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, SB_ProgressHorizontalBox) == 0x0002D0, "Member 'UUMG_InGameHUD_OperationInstruction_C::SB_ProgressHorizontalBox' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, Tex_Operation) == 0x0002D8, "Member 'UUMG_InGameHUD_OperationInstruction_C::Tex_Operation' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, Tex_Operation_1) == 0x0002E0, "Member 'UUMG_InGameHUD_OperationInstruction_C::Tex_Operation_1' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, Tex_RemainTime) == 0x0002E8, "Member 'UUMG_InGameHUD_OperationInstruction_C::Tex_RemainTime' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, Tex_RemainTime_MechUAV) == 0x0002F0, "Member 'UUMG_InGameHUD_OperationInstruction_C::Tex_RemainTime_MechUAV' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, Tex_RemainTime_MechUAV_1) == 0x0002F8, "Member 'UUMG_InGameHUD_OperationInstruction_C::Tex_RemainTime_MechUAV_1' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, ParientHUD) == 0x000300, "Member 'UUMG_InGameHUD_OperationInstruction_C::ParientHUD' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, ProgressBarTimer) == 0x000308, "Member 'UUMG_InGameHUD_OperationInstruction_C::ProgressBarTimer' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, CurrentGamePlayEventType) == 0x000310, "Member 'UUMG_InGameHUD_OperationInstruction_C::CurrentGamePlayEventType' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, GameEventMap) == 0x000318, "Member 'UUMG_InGameHUD_OperationInstruction_C::GameEventMap' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, PrevGamePlayEventType) == 0x000368, "Member 'UUMG_InGameHUD_OperationInstruction_C::PrevGamePlayEventType' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_OperationInstruction_C, MechUAVProgressBarTimer) == 0x000370, "Member 'UUMG_InGameHUD_OperationInstruction_C::MechUAVProgressBarTimer' has a wrong offset!");

}

