#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PartyMember_Widget

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_PartyMember_Widget.UMG_PartyMember_Widget_C.ExecuteUbergraph_UMG_PartyMember_Widget
// 0x0120 (0x0120 - 0x0000)
struct UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0070)(ConstParm)
};
static_assert(alignof(UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget) == 0x000008, "Wrong alignment on UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget");
static_assert(sizeof(UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget) == 0x000120, "Wrong size on UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget");
static_assert(offsetof(UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget, EntryPoint) == 0x000000, "Member 'UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget, K2Node_Event_MyGeometry) == 0x000004, "Member 'UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget, K2Node_Event_MouseEvent) == 0x0000B0, "Member 'UMG_PartyMember_Widget_C_ExecuteUbergraph_UMG_PartyMember_Widget::K2Node_Event_MouseEvent' has a wrong offset!");

// Function UMG_PartyMember_Widget.UMG_PartyMember_Widget_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UMG_PartyMember_Widget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_PartyMember_Widget_C_OnMouseLeave) == 0x000008, "Wrong alignment on UMG_PartyMember_Widget_C_OnMouseLeave");
static_assert(sizeof(UMG_PartyMember_Widget_C_OnMouseLeave) == 0x000070, "Wrong size on UMG_PartyMember_Widget_C_OnMouseLeave");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UMG_PartyMember_Widget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UMG_PartyMember_Widget.UMG_PartyMember_Widget_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_PartyMember_Widget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_PartyMember_Widget_C_OnMouseEnter) == 0x000008, "Wrong alignment on UMG_PartyMember_Widget_C_OnMouseEnter");
static_assert(sizeof(UMG_PartyMember_Widget_C_OnMouseEnter) == 0x0000A8, "Wrong size on UMG_PartyMember_Widget_C_OnMouseEnter");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UMG_PartyMember_Widget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UMG_PartyMember_Widget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UMG_PartyMember_Widget.UMG_PartyMember_Widget_C.OnMouseButtonUp
// 0x0228 (0x0228 - 0x0000)
struct UMG_PartyMember_Widget_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue;             // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyMember_Widget_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on UMG_PartyMember_Widget_C_OnMouseButtonUp");
static_assert(sizeof(UMG_PartyMember_Widget_C_OnMouseButtonUp) == 0x000228, "Wrong size on UMG_PartyMember_Widget_C_OnMouseButtonUp");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'UMG_PartyMember_Widget_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'UMG_PartyMember_Widget_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'UMG_PartyMember_Widget_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnMouseButtonUp, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UMG_PartyMember_Widget_C_OnMouseButtonUp::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnMouseButtonUp, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000218, "Member 'UMG_PartyMember_Widget_C_OnMouseButtonUp::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnMouseButtonUp, CallFunc_PushNormalPrompt_ReturnValue) == 0x000220, "Member 'UMG_PartyMember_Widget_C_OnMouseButtonUp::CallFunc_PushNormalPrompt_ReturnValue' has a wrong offset!");

// Function UMG_PartyMember_Widget.UMG_PartyMember_Widget_C.RefreshPartyMemberInfo
// 0x0058 (0x0058 - 0x0000)
struct UMG_PartyMember_Widget_C_RefreshPartyMemberInfo final
{
public:
	class UPBUserObject*                          InPartyMemberObject;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture2D* InAvatar)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UPBUserObject* UserObject)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2D*                             CallFunc_GetAvatar_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture2D* InAvatar)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPBUserObject* UserObject)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo) == 0x000008, "Wrong alignment on UMG_PartyMember_Widget_C_RefreshPartyMemberInfo");
static_assert(sizeof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo) == 0x000058, "Wrong size on UMG_PartyMember_Widget_C_RefreshPartyMemberInfo");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo, InPartyMemberObject) == 0x000000, "Member 'UMG_PartyMember_Widget_C_RefreshPartyMemberInfo::InPartyMemberObject' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UMG_PartyMember_Widget_C_RefreshPartyMemberInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'UMG_PartyMember_Widget_C_RefreshPartyMemberInfo::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo, CallFunc_GetAvatar_ReturnValue) == 0x000028, "Member 'UMG_PartyMember_Widget_C_RefreshPartyMemberInfo::CallFunc_GetAvatar_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'UMG_PartyMember_Widget_C_RefreshPartyMemberInfo::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'UMG_PartyMember_Widget_C_RefreshPartyMemberInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'UMG_PartyMember_Widget_C_RefreshPartyMemberInfo::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshPartyMemberInfo, CallFunc_IsValid_ReturnValue_1) == 0x000054, "Member 'UMG_PartyMember_Widget_C_RefreshPartyMemberInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function UMG_PartyMember_Widget.UMG_PartyMember_Widget_C.On User Data Update
// 0x0010 (0x0010 - 0x0000)
struct UMG_PartyMember_Widget_C_On_User_Data_Update final
{
public:
	class UPBUserObject*                          InUserObject;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PartyMember_Widget_C_On_User_Data_Update) == 0x000008, "Wrong alignment on UMG_PartyMember_Widget_C_On_User_Data_Update");
static_assert(sizeof(UMG_PartyMember_Widget_C_On_User_Data_Update) == 0x000010, "Wrong size on UMG_PartyMember_Widget_C_On_User_Data_Update");
static_assert(offsetof(UMG_PartyMember_Widget_C_On_User_Data_Update, InUserObject) == 0x000000, "Member 'UMG_PartyMember_Widget_C_On_User_Data_Update::InUserObject' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_On_User_Data_Update, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'UMG_PartyMember_Widget_C_On_User_Data_Update::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function UMG_PartyMember_Widget.UMG_PartyMember_Widget_C.OnAvatarRefreshed
// 0x0008 (0x0008 - 0x0000)
struct UMG_PartyMember_Widget_C_OnAvatarRefreshed final
{
public:
	class UTexture2D*                             InAvatar;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyMember_Widget_C_OnAvatarRefreshed) == 0x000008, "Wrong alignment on UMG_PartyMember_Widget_C_OnAvatarRefreshed");
static_assert(sizeof(UMG_PartyMember_Widget_C_OnAvatarRefreshed) == 0x000008, "Wrong size on UMG_PartyMember_Widget_C_OnAvatarRefreshed");
static_assert(offsetof(UMG_PartyMember_Widget_C_OnAvatarRefreshed, InAvatar) == 0x000000, "Member 'UMG_PartyMember_Widget_C_OnAvatarRefreshed::InAvatar' has a wrong offset!");

// Function UMG_PartyMember_Widget.UMG_PartyMember_Widget_C.RefreshInfo
// 0x0038 (0x0038 - 0x0000)
struct UMG_PartyMember_Widget_C_RefreshInfo final
{
public:
	struct FUniqueNetIdRepl                       CallFunc_GetLogicServerID_ReturnValue;             // 0x0000(0x0028)(ConstParm, HasGetValueTypeHash)
	class UPBPartyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsTargetPartyLeader_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PartyMember_Widget_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_PartyMember_Widget_C_RefreshInfo");
static_assert(sizeof(UMG_PartyMember_Widget_C_RefreshInfo) == 0x000038, "Wrong size on UMG_PartyMember_Widget_C_RefreshInfo");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshInfo, CallFunc_GetLogicServerID_ReturnValue) == 0x000000, "Member 'UMG_PartyMember_Widget_C_RefreshInfo::CallFunc_GetLogicServerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'UMG_PartyMember_Widget_C_RefreshInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMember_Widget_C_RefreshInfo, CallFunc_BP_IsTargetPartyLeader_ReturnValue) == 0x000030, "Member 'UMG_PartyMember_Widget_C_RefreshInfo::CallFunc_BP_IsTargetPartyLeader_ReturnValue' has a wrong offset!");

}

