#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EULA

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_EULA.UMG_EULA_C.ExecuteUbergraph_UMG_EULA
// 0x0020 (0x0020 - 0x0000)
struct UMG_EULA_C_ExecuteUbergraph_UMG_EULA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_ScrollPercent;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EULA_C_ExecuteUbergraph_UMG_EULA) == 0x000008, "Wrong alignment on UMG_EULA_C_ExecuteUbergraph_UMG_EULA");
static_assert(sizeof(UMG_EULA_C_ExecuteUbergraph_UMG_EULA) == 0x000020, "Wrong size on UMG_EULA_C_ExecuteUbergraph_UMG_EULA");
static_assert(offsetof(UMG_EULA_C_ExecuteUbergraph_UMG_EULA, EntryPoint) == 0x000000, "Member 'UMG_EULA_C_ExecuteUbergraph_UMG_EULA::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_ExecuteUbergraph_UMG_EULA, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'UMG_EULA_C_ExecuteUbergraph_UMG_EULA::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_ExecuteUbergraph_UMG_EULA, K2Node_ComponentBoundEvent_ScrollPercent) == 0x000010, "Member 'UMG_EULA_C_ExecuteUbergraph_UMG_EULA::K2Node_ComponentBoundEvent_ScrollPercent' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_ExecuteUbergraph_UMG_EULA, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'UMG_EULA_C_ExecuteUbergraph_UMG_EULA::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_ExecuteUbergraph_UMG_EULA, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'UMG_EULA_C_ExecuteUbergraph_UMG_EULA::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function UMG_EULA.UMG_EULA_C.BndEvt__UMG_EULA_Accept_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_EULA_C_BndEvt__UMG_EULA_Accept_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EULA_C_BndEvt__UMG_EULA_Accept_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_EULA_C_BndEvt__UMG_EULA_Accept_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_EULA_C_BndEvt__UMG_EULA_Accept_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_EULA_C_BndEvt__UMG_EULA_Accept_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_EULA_C_BndEvt__UMG_EULA_Accept_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_EULA_C_BndEvt__UMG_EULA_Accept_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_EULA.UMG_EULA_C.BndEvt__UMG_EULA_Refuse_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_EULA_C_BndEvt__UMG_EULA_Refuse_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EULA_C_BndEvt__UMG_EULA_Refuse_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_EULA_C_BndEvt__UMG_EULA_Refuse_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_EULA_C_BndEvt__UMG_EULA_Refuse_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_EULA_C_BndEvt__UMG_EULA_Refuse_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_EULA_C_BndEvt__UMG_EULA_Refuse_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_EULA_C_BndEvt__UMG_EULA_Refuse_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_EULA.UMG_EULA_C.BndEvt__UMG_EULA_UMG_AdvancedScrollBox_K2Node_ComponentBoundEvent_4_OnScrollBy__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_EULA_C_BndEvt__UMG_EULA_UMG_AdvancedScrollBox_K2Node_ComponentBoundEvent_4_OnScrollBy__DelegateSignature final
{
public:
	float                                         ScrollPercent;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EULA_C_BndEvt__UMG_EULA_UMG_AdvancedScrollBox_K2Node_ComponentBoundEvent_4_OnScrollBy__DelegateSignature) == 0x000004, "Wrong alignment on UMG_EULA_C_BndEvt__UMG_EULA_UMG_AdvancedScrollBox_K2Node_ComponentBoundEvent_4_OnScrollBy__DelegateSignature");
static_assert(sizeof(UMG_EULA_C_BndEvt__UMG_EULA_UMG_AdvancedScrollBox_K2Node_ComponentBoundEvent_4_OnScrollBy__DelegateSignature) == 0x000004, "Wrong size on UMG_EULA_C_BndEvt__UMG_EULA_UMG_AdvancedScrollBox_K2Node_ComponentBoundEvent_4_OnScrollBy__DelegateSignature");
static_assert(offsetof(UMG_EULA_C_BndEvt__UMG_EULA_UMG_AdvancedScrollBox_K2Node_ComponentBoundEvent_4_OnScrollBy__DelegateSignature, ScrollPercent) == 0x000000, "Member 'UMG_EULA_C_BndEvt__UMG_EULA_UMG_AdvancedScrollBox_K2Node_ComponentBoundEvent_4_OnScrollBy__DelegateSignature::ScrollPercent' has a wrong offset!");

// Function UMG_EULA.UMG_EULA_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_EULA_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_EULA_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_EULA_C_OnFocusReceived");
static_assert(sizeof(UMG_EULA_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_EULA_C_OnFocusReceived");
static_assert(offsetof(UMG_EULA_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_EULA_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_EULA_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_EULA_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_EULA_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_EULA.UMG_EULA_C.On_AcceptBorder_MouseButtonDown_0
// 0x0218 (0x0218 - 0x0000)
struct UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0) == 0x000008, "Wrong alignment on UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0");
static_assert(sizeof(UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0) == 0x000218, "Wrong size on UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0");
static_assert(offsetof(UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0, MyGeometry) == 0x000000, "Member 'UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0, MouseEvent) == 0x000038, "Member 'UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0, ReturnValue) == 0x0000A8, "Member 'UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_EULA_C_On_AcceptBorder_MouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_EULA.UMG_EULA_C.OnMouseButtonUp_0
// 0x0218 (0x0218 - 0x0000)
struct UMG_EULA_C_OnMouseButtonUp_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_EULA_C_OnMouseButtonUp_0) == 0x000008, "Wrong alignment on UMG_EULA_C_OnMouseButtonUp_0");
static_assert(sizeof(UMG_EULA_C_OnMouseButtonUp_0) == 0x000218, "Wrong size on UMG_EULA_C_OnMouseButtonUp_0");
static_assert(offsetof(UMG_EULA_C_OnMouseButtonUp_0, MyGeometry) == 0x000000, "Member 'UMG_EULA_C_OnMouseButtonUp_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_OnMouseButtonUp_0, MouseEvent) == 0x000038, "Member 'UMG_EULA_C_OnMouseButtonUp_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_OnMouseButtonUp_0, ReturnValue) == 0x0000A8, "Member 'UMG_EULA_C_OnMouseButtonUp_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_OnMouseButtonUp_0, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_EULA_C_OnMouseButtonUp_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_EULA.UMG_EULA_C.On_AcceptBorder_MouseButtonUp_0
// 0x0218 (0x0218 - 0x0000)
struct UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0) == 0x000008, "Wrong alignment on UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0");
static_assert(sizeof(UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0) == 0x000218, "Wrong size on UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0");
static_assert(offsetof(UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0, MyGeometry) == 0x000000, "Member 'UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0, MouseEvent) == 0x000038, "Member 'UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0, ReturnValue) == 0x0000A8, "Member 'UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_EULA_C_On_AcceptBorder_MouseButtonUp_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

