#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MatchMessage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_MatchMessage.UMG_MatchMessage_C.ExecuteUbergraph_UMG_MatchMessage
// 0x0028 (0x0028 - 0x0000)
struct UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBMessageLocation                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMessageBaseWidget*                   K2Node_Event_MessageWidget;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBMessageLocation                            K2Node_Event_InLocation;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWrapBox*                               K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage) == 0x000008, "Wrong alignment on UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage");
static_assert(sizeof(UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage) == 0x000028, "Wrong size on UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage");
static_assert(offsetof(UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage, EntryPoint) == 0x000000, "Member 'UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage, Temp_byte_Variable) == 0x000004, "Member 'UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage, K2Node_Event_MessageWidget) == 0x000008, "Member 'UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage::K2Node_Event_MessageWidget' has a wrong offset!");
static_assert(offsetof(UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage, K2Node_Event_InLocation) == 0x000010, "Member 'UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage::K2Node_Event_InLocation' has a wrong offset!");
static_assert(offsetof(UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage, K2Node_Select_Default) == 0x000018, "Member 'UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000020, "Member 'UMG_MatchMessage_C_ExecuteUbergraph_UMG_MatchMessage::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");

// Function UMG_MatchMessage.UMG_MatchMessage_C.K2_AddMessage
// 0x0010 (0x0010 - 0x0000)
struct UMG_MatchMessage_C_K2_AddMessage final
{
public:
	class UPBMessageBaseWidget*                   MessageWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBMessageLocation                            InLocation;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchMessage_C_K2_AddMessage) == 0x000008, "Wrong alignment on UMG_MatchMessage_C_K2_AddMessage");
static_assert(sizeof(UMG_MatchMessage_C_K2_AddMessage) == 0x000010, "Wrong size on UMG_MatchMessage_C_K2_AddMessage");
static_assert(offsetof(UMG_MatchMessage_C_K2_AddMessage, MessageWidget) == 0x000000, "Member 'UMG_MatchMessage_C_K2_AddMessage::MessageWidget' has a wrong offset!");
static_assert(offsetof(UMG_MatchMessage_C_K2_AddMessage, InLocation) == 0x000008, "Member 'UMG_MatchMessage_C_K2_AddMessage::InLocation' has a wrong offset!");

}

