#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Prompt

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_Prompt.UMG_Prompt_C.ExecuteUbergraph_UMG_Prompt
// 0x0098 (0x0098 - 0x0000)
struct UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfirmPageButton_C*                   CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0070(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt) == 0x000008, "Wrong alignment on UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt");
static_assert(sizeof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt) == 0x000098, "Wrong size on UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, EntryPoint) == 0x000000, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, Temp_struct_Variable) == 0x000008, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, Temp_struct_Variable_1) == 0x00001C, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, CallFunc_Create_ReturnValue) == 0x000030, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, Temp_int_Array_Index_Variable) == 0x000048, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, CallFunc_Array_Get_Item) == 0x000050, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, Temp_struct_Variable_2) == 0x000070, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, K2Node_CustomEvent_Index) == 0x000080, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt, CallFunc_AddChild_ReturnValue) == 0x000090, "Member 'UMG_Prompt_C_ExecuteUbergraph_UMG_Prompt::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_Prompt.UMG_Prompt_C.CustomEvent_1
// 0x0004 (0x0004 - 0x0000)
struct UMG_Prompt_C_CustomEvent_1 final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Prompt_C_CustomEvent_1) == 0x000004, "Wrong alignment on UMG_Prompt_C_CustomEvent_1");
static_assert(sizeof(UMG_Prompt_C_CustomEvent_1) == 0x000004, "Wrong size on UMG_Prompt_C_CustomEvent_1");
static_assert(offsetof(UMG_Prompt_C_CustomEvent_1, Index_0) == 0x000000, "Member 'UMG_Prompt_C_CustomEvent_1::Index_0' has a wrong offset!");

// Function UMG_Prompt.UMG_Prompt_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct UMG_Prompt_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Prompt_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on UMG_Prompt_C_BP_OnHandleBackAction");
static_assert(sizeof(UMG_Prompt_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on UMG_Prompt_C_BP_OnHandleBackAction");
static_assert(offsetof(UMG_Prompt_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'UMG_Prompt_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function UMG_Prompt.UMG_Prompt_C.BP_GetDesiredFocusTarget
// 0x0018 (0x0018 - 0x0000)
struct UMG_Prompt_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Prompt_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_Prompt_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_Prompt_C_BP_GetDesiredFocusTarget) == 0x000018, "Wrong size on UMG_Prompt_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_Prompt_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_Prompt_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_BP_GetDesiredFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'UMG_Prompt_C_BP_GetDesiredFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Prompt_C_BP_GetDesiredFocusTarget, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'UMG_Prompt_C_BP_GetDesiredFocusTarget::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

}

