#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_StoreProductInPurchasePage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_StoreProductInPurchasePage.UMG_StoreProductInPurchasePage_C.UpdateWidget
// 0x0048 (0x0048 - 0x0000)
struct UMG_StoreProductInPurchasePage_C_UpdateWidget final
{
public:
	TSoftObjectPtr<class UTexture2D>              InTexture;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   InItemName;                                        // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EPBItemType                                   InItemType;                                        // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBItemGradeType                              InGradeType;                                       // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_StoreProductInPurchasePage_C_UpdateWidget) == 0x000008, "Wrong alignment on UMG_StoreProductInPurchasePage_C_UpdateWidget");
static_assert(sizeof(UMG_StoreProductInPurchasePage_C_UpdateWidget) == 0x000048, "Wrong size on UMG_StoreProductInPurchasePage_C_UpdateWidget");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_UpdateWidget, InTexture) == 0x000000, "Member 'UMG_StoreProductInPurchasePage_C_UpdateWidget::InTexture' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_UpdateWidget, InItemName) == 0x000028, "Member 'UMG_StoreProductInPurchasePage_C_UpdateWidget::InItemName' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_UpdateWidget, InItemType) == 0x000040, "Member 'UMG_StoreProductInPurchasePage_C_UpdateWidget::InItemType' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_UpdateWidget, InGradeType) == 0x000041, "Member 'UMG_StoreProductInPurchasePage_C_UpdateWidget::InGradeType' has a wrong offset!");

// Function UMG_StoreProductInPurchasePage.UMG_StoreProductInPurchasePage_C.SetItemType
// 0x0002 (0x0002 - 0x0000)
struct UMG_StoreProductInPurchasePage_C_SetItemType final
{
public:
	EPBItemType                                   InItemType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_StoreProductInPurchasePage_C_SetItemType) == 0x000001, "Wrong alignment on UMG_StoreProductInPurchasePage_C_SetItemType");
static_assert(sizeof(UMG_StoreProductInPurchasePage_C_SetItemType) == 0x000002, "Wrong size on UMG_StoreProductInPurchasePage_C_SetItemType");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetItemType, InItemType) == 0x000000, "Member 'UMG_StoreProductInPurchasePage_C_SetItemType::InItemType' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetItemType, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UMG_StoreProductInPurchasePage_C_SetItemType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_StoreProductInPurchasePage.UMG_StoreProductInPurchasePage_C.SetGradeStyle
// 0x0064 (0x0064 - 0x0000)
struct UMG_StoreProductInPurchasePage_C_SetGradeStyle final
{
public:
	EPBItemGradeType                              InGrade;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_3;                  // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_4;                  // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_5;                  // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_StoreProductInPurchasePage_C_SetGradeStyle) == 0x000004, "Wrong alignment on UMG_StoreProductInPurchasePage_C_SetGradeStyle");
static_assert(sizeof(UMG_StoreProductInPurchasePage_C_SetGradeStyle) == 0x000064, "Wrong size on UMG_StoreProductInPurchasePage_C_SetGradeStyle");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetGradeStyle, InGrade) == 0x000000, "Member 'UMG_StoreProductInPurchasePage_C_SetGradeStyle::InGrade' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetGradeStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UMG_StoreProductInPurchasePage_C_SetGradeStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue) == 0x000004, "Member 'UMG_StoreProductInPurchasePage_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_1) == 0x000014, "Member 'UMG_StoreProductInPurchasePage_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_2) == 0x000024, "Member 'UMG_StoreProductInPurchasePage_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_3) == 0x000034, "Member 'UMG_StoreProductInPurchasePage_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_4) == 0x000044, "Member 'UMG_StoreProductInPurchasePage_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_StoreProductInPurchasePage_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_5) == 0x000054, "Member 'UMG_StoreProductInPurchasePage_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_5' has a wrong offset!");

}

