#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SoundTrackLabel

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_SoundTrackLabel.UMG_SoundTrackLabel_C.ExecuteUbergraph_UMG_SoundTrackLabel
// 0x0004 (0x0004 - 0x0000)
struct UMG_SoundTrackLabel_C_ExecuteUbergraph_UMG_SoundTrackLabel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SoundTrackLabel_C_ExecuteUbergraph_UMG_SoundTrackLabel) == 0x000004, "Wrong alignment on UMG_SoundTrackLabel_C_ExecuteUbergraph_UMG_SoundTrackLabel");
static_assert(sizeof(UMG_SoundTrackLabel_C_ExecuteUbergraph_UMG_SoundTrackLabel) == 0x000004, "Wrong size on UMG_SoundTrackLabel_C_ExecuteUbergraph_UMG_SoundTrackLabel");
static_assert(offsetof(UMG_SoundTrackLabel_C_ExecuteUbergraph_UMG_SoundTrackLabel, EntryPoint) == 0x000000, "Member 'UMG_SoundTrackLabel_C_ExecuteUbergraph_UMG_SoundTrackLabel::EntryPoint' has a wrong offset!");

// Function UMG_SoundTrackLabel.UMG_SoundTrackLabel_C.OpenSoundTrackPage
// 0x0030 (0x0030 - 0x0000)
struct UMG_SoundTrackLabel_C_OpenSoundTrackPage final
{
public:
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InSoundIndex)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UUMG_OriginalSoundTrack_C*              K2Node_DynamicCast_AsUMG_Original_Sound_Track;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SoundTrackLabel_C_OpenSoundTrackPage) == 0x000008, "Wrong alignment on UMG_SoundTrackLabel_C_OpenSoundTrackPage");
static_assert(sizeof(UMG_SoundTrackLabel_C_OpenSoundTrackPage) == 0x000030, "Wrong size on UMG_SoundTrackLabel_C_OpenSoundTrackPage");
static_assert(offsetof(UMG_SoundTrackLabel_C_OpenSoundTrackPage, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'UMG_SoundTrackLabel_C_OpenSoundTrackPage::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OpenSoundTrackPage, CallFunc_PushNormalPrompt_ReturnValue) == 0x000008, "Member 'UMG_SoundTrackLabel_C_OpenSoundTrackPage::CallFunc_PushNormalPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OpenSoundTrackPage, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UMG_SoundTrackLabel_C_OpenSoundTrackPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OpenSoundTrackPage, K2Node_DynamicCast_AsUMG_Original_Sound_Track) == 0x000020, "Member 'UMG_SoundTrackLabel_C_OpenSoundTrackPage::K2Node_DynamicCast_AsUMG_Original_Sound_Track' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OpenSoundTrackPage, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UMG_SoundTrackLabel_C_OpenSoundTrackPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_SoundTrackLabel.UMG_SoundTrackLabel_C.PlayArtBookMusic
// 0x0030 (0x0030 - 0x0000)
struct UMG_SoundTrackLabel_C_PlayArtBookMusic final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_CreateSound2D_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USoundWave* PlayingSoundWave, float PlaybackPercent)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UMG_SoundTrackLabel_C_PlayArtBookMusic) == 0x000008, "Wrong alignment on UMG_SoundTrackLabel_C_PlayArtBookMusic");
static_assert(sizeof(UMG_SoundTrackLabel_C_PlayArtBookMusic) == 0x000030, "Wrong size on UMG_SoundTrackLabel_C_PlayArtBookMusic");
static_assert(offsetof(UMG_SoundTrackLabel_C_PlayArtBookMusic, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_SoundTrackLabel_C_PlayArtBookMusic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_PlayArtBookMusic, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'UMG_SoundTrackLabel_C_PlayArtBookMusic::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_PlayArtBookMusic, CallFunc_CreateSound2D_ReturnValue) == 0x000018, "Member 'UMG_SoundTrackLabel_C_PlayArtBookMusic::CallFunc_CreateSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_PlayArtBookMusic, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'UMG_SoundTrackLabel_C_PlayArtBookMusic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function UMG_SoundTrackLabel.UMG_SoundTrackLabel_C.StopArtBookMusic
// 0x0014 (0x0014 - 0x0000)
struct UMG_SoundTrackLabel_C_StopArtBookMusic final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SoundTrackLabel_C_StopArtBookMusic) == 0x000004, "Wrong alignment on UMG_SoundTrackLabel_C_StopArtBookMusic");
static_assert(sizeof(UMG_SoundTrackLabel_C_StopArtBookMusic) == 0x000014, "Wrong size on UMG_SoundTrackLabel_C_StopArtBookMusic");
static_assert(offsetof(UMG_SoundTrackLabel_C_StopArtBookMusic, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_SoundTrackLabel_C_StopArtBookMusic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_StopArtBookMusic, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UMG_SoundTrackLabel_C_StopArtBookMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_SoundTrackLabel.UMG_SoundTrackLabel_C.OnPlaybackPercent
// 0x0050 (0x0050 - 0x0000)
struct UMG_SoundTrackLabel_C_OnPlaybackPercent final
{
public:
	const class USoundWave*                       PlayingSoundWave;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackPercent;                                   // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertTime_OutMinutes;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertTime_OutSeconds;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
};
static_assert(alignof(UMG_SoundTrackLabel_C_OnPlaybackPercent) == 0x000008, "Wrong alignment on UMG_SoundTrackLabel_C_OnPlaybackPercent");
static_assert(sizeof(UMG_SoundTrackLabel_C_OnPlaybackPercent) == 0x000050, "Wrong size on UMG_SoundTrackLabel_C_OnPlaybackPercent");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlaybackPercent, PlayingSoundWave) == 0x000000, "Member 'UMG_SoundTrackLabel_C_OnPlaybackPercent::PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlaybackPercent, PlaybackPercent) == 0x000008, "Member 'UMG_SoundTrackLabel_C_OnPlaybackPercent::PlaybackPercent' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlaybackPercent, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'UMG_SoundTrackLabel_C_OnPlaybackPercent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlaybackPercent, CallFunc_IsValid_ReturnValue_1) == 0x00000D, "Member 'UMG_SoundTrackLabel_C_OnPlaybackPercent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlaybackPercent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'UMG_SoundTrackLabel_C_OnPlaybackPercent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlaybackPercent, CallFunc_ConvertTime_OutMinutes) == 0x000014, "Member 'UMG_SoundTrackLabel_C_OnPlaybackPercent::CallFunc_ConvertTime_OutMinutes' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlaybackPercent, CallFunc_ConvertTime_OutSeconds) == 0x000018, "Member 'UMG_SoundTrackLabel_C_OnPlaybackPercent::CallFunc_ConvertTime_OutSeconds' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlaybackPercent, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'UMG_SoundTrackLabel_C_OnPlaybackPercent::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlaybackPercent, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'UMG_SoundTrackLabel_C_OnPlaybackPercent::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function UMG_SoundTrackLabel.UMG_SoundTrackLabel_C.OnPlayingSoundChanged
// 0x0008 (0x0008 - 0x0000)
struct UMG_SoundTrackLabel_C_OnPlayingSoundChanged final
{
public:
	int32                                         InSoundIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SoundTrackLabel_C_OnPlayingSoundChanged) == 0x000004, "Wrong alignment on UMG_SoundTrackLabel_C_OnPlayingSoundChanged");
static_assert(sizeof(UMG_SoundTrackLabel_C_OnPlayingSoundChanged) == 0x000008, "Wrong size on UMG_SoundTrackLabel_C_OnPlayingSoundChanged");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlayingSoundChanged, InSoundIndex) == 0x000000, "Member 'UMG_SoundTrackLabel_C_OnPlayingSoundChanged::InSoundIndex' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlayingSoundChanged, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_SoundTrackLabel_C_OnPlayingSoundChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnPlayingSoundChanged, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'UMG_SoundTrackLabel_C_OnPlayingSoundChanged::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function UMG_SoundTrackLabel.UMG_SoundTrackLabel_C.ConvertTime
// 0x001C (0x001C - 0x0000)
struct UMG_SoundTrackLabel_C_ConvertTime final
{
public:
	float                                         InSeconds;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutMinutes;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutSeconds;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SoundTrackLabel_C_ConvertTime) == 0x000004, "Wrong alignment on UMG_SoundTrackLabel_C_ConvertTime");
static_assert(sizeof(UMG_SoundTrackLabel_C_ConvertTime) == 0x00001C, "Wrong size on UMG_SoundTrackLabel_C_ConvertTime");
static_assert(offsetof(UMG_SoundTrackLabel_C_ConvertTime, InSeconds) == 0x000000, "Member 'UMG_SoundTrackLabel_C_ConvertTime::InSeconds' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_ConvertTime, OutMinutes) == 0x000004, "Member 'UMG_SoundTrackLabel_C_ConvertTime::OutMinutes' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_ConvertTime, OutSeconds) == 0x000008, "Member 'UMG_SoundTrackLabel_C_ConvertTime::OutSeconds' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_ConvertTime, CallFunc_FCeil_ReturnValue) == 0x00000C, "Member 'UMG_SoundTrackLabel_C_ConvertTime::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_ConvertTime, CallFunc_Divide_IntInt_ReturnValue) == 0x000010, "Member 'UMG_SoundTrackLabel_C_ConvertTime::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_ConvertTime, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'UMG_SoundTrackLabel_C_ConvertTime::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_ConvertTime, CallFunc_Percent_IntInt_ReturnValue) == 0x000018, "Member 'UMG_SoundTrackLabel_C_ConvertTime::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_SoundTrackLabel.UMG_SoundTrackLabel_C.Play Next Sound
// 0x0058 (0x0058 - 0x0000)
struct UMG_SoundTrackLabel_C_Play_Next_Sound final
{
public:
	int32                                         CallFunc_ConvertTime_OutMinutes;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertTime_OutSeconds;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SoundTrackLabel_C_Play_Next_Sound) == 0x000008, "Wrong alignment on UMG_SoundTrackLabel_C_Play_Next_Sound");
static_assert(sizeof(UMG_SoundTrackLabel_C_Play_Next_Sound) == 0x000058, "Wrong size on UMG_SoundTrackLabel_C_Play_Next_Sound");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, CallFunc_ConvertTime_OutMinutes) == 0x000000, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::CallFunc_ConvertTime_OutMinutes' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, CallFunc_ConvertTime_OutSeconds) == 0x000004, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::CallFunc_ConvertTime_OutSeconds' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, Temp_int_Variable) == 0x000044, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SoundTrackLabel_C_Play_Next_Sound, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'UMG_SoundTrackLabel_C_Play_Next_Sound::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_SoundTrackLabel.UMG_SoundTrackLabel_C.OnFinishPlaying
// 0x0001 (0x0001 - 0x0000)
struct UMG_SoundTrackLabel_C_OnFinishPlaying final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SoundTrackLabel_C_OnFinishPlaying) == 0x000001, "Wrong alignment on UMG_SoundTrackLabel_C_OnFinishPlaying");
static_assert(sizeof(UMG_SoundTrackLabel_C_OnFinishPlaying) == 0x000001, "Wrong size on UMG_SoundTrackLabel_C_OnFinishPlaying");
static_assert(offsetof(UMG_SoundTrackLabel_C_OnFinishPlaying, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_SoundTrackLabel_C_OnFinishPlaying::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

