#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_UnlockTips

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_UnlockTips.UMG_UnlockTips_C
// 0x0048 (0x02A8 - 0x0260)
class UUMG_UnlockTips_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_LeavePage;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_FaildUnlock;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_TipS;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Notify;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              LeavePageDelegate;                                 // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool bYES)>     ConfirmPageCallBack;                               // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_UnlockTips(int32 EntryPoint);
	void ComfirmPageCallBack(bool bYES);
	void BndEvt__Button_LeavePage_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void ShowTipsAboutCantUnlockDueToChallenge(class FName InUnlockID, const TDelegate<void()>& Event);
	void ShowAskWetherUnlockItem(const TDelegate<void(bool bYES)>& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_UnlockTips_C">();
	}
	static class UUMG_UnlockTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_UnlockTips_C>();
	}
};
static_assert(alignof(UUMG_UnlockTips_C) == 0x000008, "Wrong alignment on UUMG_UnlockTips_C");
static_assert(sizeof(UUMG_UnlockTips_C) == 0x0002A8, "Wrong size on UUMG_UnlockTips_C");
static_assert(offsetof(UUMG_UnlockTips_C, UberGraphFrame) == 0x000260, "Member 'UUMG_UnlockTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_UnlockTips_C, Button_LeavePage) == 0x000268, "Member 'UUMG_UnlockTips_C::Button_LeavePage' has a wrong offset!");
static_assert(offsetof(UUMG_UnlockTips_C, CanvasPanel_FaildUnlock) == 0x000270, "Member 'UUMG_UnlockTips_C::CanvasPanel_FaildUnlock' has a wrong offset!");
static_assert(offsetof(UUMG_UnlockTips_C, CanvasPanel_TipS) == 0x000278, "Member 'UUMG_UnlockTips_C::CanvasPanel_TipS' has a wrong offset!");
static_assert(offsetof(UUMG_UnlockTips_C, WidgetSwitcher_Notify) == 0x000280, "Member 'UUMG_UnlockTips_C::WidgetSwitcher_Notify' has a wrong offset!");
static_assert(offsetof(UUMG_UnlockTips_C, LeavePageDelegate) == 0x000288, "Member 'UUMG_UnlockTips_C::LeavePageDelegate' has a wrong offset!");
static_assert(offsetof(UUMG_UnlockTips_C, ConfirmPageCallBack) == 0x000298, "Member 'UUMG_UnlockTips_C::ConfirmPageCallBack' has a wrong offset!");

}

