#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameScrollBoxItemWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_EndGameScrollBoxItemWidget.UMG_EndGameScrollBoxItemWidget_C.ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget
// 0x0028 (0x0028 - 0x0000)
struct UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget) == 0x000008, "Wrong alignment on UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget");
static_assert(sizeof(UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget) == 0x000028, "Wrong size on UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget");
static_assert(offsetof(UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget, EntryPoint) == 0x000000, "Member 'UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'UMG_EndGameScrollBoxItemWidget_C_ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function UMG_EndGameScrollBoxItemWidget.UMG_EndGameScrollBoxItemWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_EndGameScrollBoxItemWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EndGameScrollBoxItemWidget_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_EndGameScrollBoxItemWidget_C_PreConstruct");
static_assert(sizeof(UMG_EndGameScrollBoxItemWidget_C_PreConstruct) == 0x000001, "Wrong size on UMG_EndGameScrollBoxItemWidget_C_PreConstruct");
static_assert(offsetof(UMG_EndGameScrollBoxItemWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_EndGameScrollBoxItemWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_EndGameScrollBoxItemWidget.UMG_EndGameScrollBoxItemWidget_C.RefreshWidget
// 0x0001 (0x0001 - 0x0000)
struct UMG_EndGameScrollBoxItemWidget_C_RefreshWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EndGameScrollBoxItemWidget_C_RefreshWidget) == 0x000001, "Wrong alignment on UMG_EndGameScrollBoxItemWidget_C_RefreshWidget");
static_assert(sizeof(UMG_EndGameScrollBoxItemWidget_C_RefreshWidget) == 0x000001, "Wrong size on UMG_EndGameScrollBoxItemWidget_C_RefreshWidget");
static_assert(offsetof(UMG_EndGameScrollBoxItemWidget_C_RefreshWidget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_EndGameScrollBoxItemWidget_C_RefreshWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

