#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_LoginGate

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_LoginGate.UMG_LoginGate_C
// 0x0080 (0x03D0 - 0x0350)
class UUMG_LoginGate_C final : public UPBLoginGateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                CancelQueueBtn;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ConfirmCancelPanel;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ConfirmCanelBtn;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FailText;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_1;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_TryAgin;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Waiting;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LoginGateSwitcher;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                QueueExitGameBtn;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QueueIndex;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           QueueingPanel;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        QueueSwitcher;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ActionName;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PrerequisiteButton_C*              TryAgin;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                UndoCancelBtn;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_LoginGate(int32 EntryPoint);
	void BndEvt__UMG_LoginGate_TryAgin_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void K2_TryLoginGate();
	void Construct();
	void K2_LoginGateFail(int32 InErrorCode);
	void BndEvt__UMG_LoginGate_ConfirmCanelBtn_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_LoginGate_CancelQueueBtn_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_LoginGate_UndoCancelBtn_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void K2_RefreshQueueStatus(const class FText& InQueueIndex);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_LoginGate_C">();
	}
	static class UUMG_LoginGate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_LoginGate_C>();
	}
};
static_assert(alignof(UUMG_LoginGate_C) == 0x000008, "Wrong alignment on UUMG_LoginGate_C");
static_assert(sizeof(UUMG_LoginGate_C) == 0x0003D0, "Wrong size on UUMG_LoginGate_C");
static_assert(offsetof(UUMG_LoginGate_C, UberGraphFrame) == 0x000350, "Member 'UUMG_LoginGate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, CancelQueueBtn) == 0x000358, "Member 'UUMG_LoginGate_C::CancelQueueBtn' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, ConfirmCancelPanel) == 0x000360, "Member 'UUMG_LoginGate_C::ConfirmCancelPanel' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, ConfirmCanelBtn) == 0x000368, "Member 'UUMG_LoginGate_C::ConfirmCanelBtn' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, FailText) == 0x000370, "Member 'UUMG_LoginGate_C::FailText' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, HorizontalBox_1) == 0x000378, "Member 'UUMG_LoginGate_C::HorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, HorizontalBox_TryAgin) == 0x000380, "Member 'UUMG_LoginGate_C::HorizontalBox_TryAgin' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, Image_Waiting) == 0x000388, "Member 'UUMG_LoginGate_C::Image_Waiting' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, LoginGateSwitcher) == 0x000390, "Member 'UUMG_LoginGate_C::LoginGateSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, QueueExitGameBtn) == 0x000398, "Member 'UUMG_LoginGate_C::QueueExitGameBtn' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, QueueIndex) == 0x0003A0, "Member 'UUMG_LoginGate_C::QueueIndex' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, QueueingPanel) == 0x0003A8, "Member 'UUMG_LoginGate_C::QueueingPanel' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, QueueSwitcher) == 0x0003B0, "Member 'UUMG_LoginGate_C::QueueSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, Text_ActionName) == 0x0003B8, "Member 'UUMG_LoginGate_C::Text_ActionName' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, TryAgin) == 0x0003C0, "Member 'UUMG_LoginGate_C::TryAgin' has a wrong offset!");
static_assert(offsetof(UUMG_LoginGate_C, UndoCancelBtn) == 0x0003C8, "Member 'UUMG_LoginGate_C::UndoCancelBtn' has a wrong offset!");

}

