#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FriendEntrance

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_FriendEntrance.UMG_FriendEntrance_C
// 0x0038 (0x0380 - 0x0348)
class UUMG_FriendEntrance_C final : public UPBFriendsListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_36;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_124;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_253;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Focus;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerNumber;                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsInFriendPage;                                   // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_FriendEntrance(int32 EntryPoint);
	void K2_RefreshFriendsListCompleted();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetIsInSocialPage(bool IsInSocialPage);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_FriendEntrance_C">();
	}
	static class UUMG_FriendEntrance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_FriendEntrance_C>();
	}
};
static_assert(alignof(UUMG_FriendEntrance_C) == 0x000008, "Wrong alignment on UUMG_FriendEntrance_C");
static_assert(sizeof(UUMG_FriendEntrance_C) == 0x000380, "Wrong size on UUMG_FriendEntrance_C");
static_assert(offsetof(UUMG_FriendEntrance_C, UberGraphFrame) == 0x000348, "Member 'UUMG_FriendEntrance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_FriendEntrance_C, Image_36) == 0x000350, "Member 'UUMG_FriendEntrance_C::Image_36' has a wrong offset!");
static_assert(offsetof(UUMG_FriendEntrance_C, Image_124) == 0x000358, "Member 'UUMG_FriendEntrance_C::Image_124' has a wrong offset!");
static_assert(offsetof(UUMG_FriendEntrance_C, Image_253) == 0x000360, "Member 'UUMG_FriendEntrance_C::Image_253' has a wrong offset!");
static_assert(offsetof(UUMG_FriendEntrance_C, Image_Focus) == 0x000368, "Member 'UUMG_FriendEntrance_C::Image_Focus' has a wrong offset!");
static_assert(offsetof(UUMG_FriendEntrance_C, TextBlock_PlayerNumber) == 0x000370, "Member 'UUMG_FriendEntrance_C::TextBlock_PlayerNumber' has a wrong offset!");
static_assert(offsetof(UUMG_FriendEntrance_C, bIsInFriendPage) == 0x000378, "Member 'UUMG_FriendEntrance_C::bIsInFriendPage' has a wrong offset!");

}

