#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MainMenuLayout

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.ExecuteUbergraph_UMG_MainMenuLayout
// 0x01F8 (0x01F8 - 0x0000)
struct UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBAuthManager_BP_C*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBMatchmakingStatus                          K2Node_CustomEvent_NewState;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBSendInvitationResult                       K2Node_Event_Result_1;                             // 0x0031(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBAcceptInvitationResult                     K2Node_Event_Result;                               // 0x0032(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_RejecterName;                         // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_MemberName_1;                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_MemberName;                           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EInputDevice CurrentDevice)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_Event_SenderName;                           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_InvitationTip_Widget_C*            CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	EInputDevice                                  K2Node_CustomEvent_CurrentDevice;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F8(0x0018)()
	TDelegate<void(EPBMatchmakingStatus NewState)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0140(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0158(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0190(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01E0(0x0018)()
};
static_assert(alignof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout");
static_assert(sizeof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout) == 0x0001F8, "Wrong size on UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, EntryPoint) == 0x000000, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000028, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_CustomEvent_NewState) == 0x000030, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_Event_Result_1) == 0x000031, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_Event_Result_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_Event_Result) == 0x000032, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_SwitchEnum_CmpSuccess) == 0x000033, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_SwitchEnum_CmpSuccess_1) == 0x000034, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_Event_RejecterName) == 0x000038, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_Event_RejecterName' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_Event_MemberName_1) == 0x000048, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_Event_MemberName_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_Event_MemberName) == 0x000058, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_Event_MemberName' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_Event_SenderName) == 0x000078, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_Event_SenderName' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000088, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Create_ReturnValue) == 0x000090, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000098, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000099, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00009A, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_CreateDelegate_OutputDelegate_2) == 0x00009C, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000B0, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000B8, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C0, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_CustomEvent_CurrentDevice) == 0x0000D0, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_CustomEvent_CurrentDevice' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0000D8, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000E0, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_MakeLiteralName_ReturnValue) == 0x0000E4, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000EC, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F8, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, K2Node_CreateDelegate_OutputDelegate_4) == 0x000110, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Conv_TextToString_ReturnValue) == 0x000120, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Concat_StrStr_ReturnValue) == 0x000130, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000140, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Conv_StringToText_ReturnValue) == 0x000158, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000170, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000180, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000190, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001A8, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0001C0, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001D0, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001E0, "Member 'UMG_MainMenuLayout_C_ExecuteUbergraph_UMG_MainMenuLayout::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.CustomEvent_2
// 0x0001 (0x0001 - 0x0000)
struct UMG_MainMenuLayout_C_CustomEvent_2 final
{
public:
	EInputDevice                                  CurrentDevice;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_CustomEvent_2) == 0x000001, "Wrong alignment on UMG_MainMenuLayout_C_CustomEvent_2");
static_assert(sizeof(UMG_MainMenuLayout_C_CustomEvent_2) == 0x000001, "Wrong size on UMG_MainMenuLayout_C_CustomEvent_2");
static_assert(offsetof(UMG_MainMenuLayout_C_CustomEvent_2, CurrentDevice) == 0x000000, "Member 'UMG_MainMenuLayout_C_CustomEvent_2::CurrentDevice' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.K2_OnInvitationReceived
// 0x0010 (0x0010 - 0x0000)
struct UMG_MainMenuLayout_C_K2_OnInvitationReceived final
{
public:
	class FString                                 SenderName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_K2_OnInvitationReceived) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_K2_OnInvitationReceived");
static_assert(sizeof(UMG_MainMenuLayout_C_K2_OnInvitationReceived) == 0x000010, "Wrong size on UMG_MainMenuLayout_C_K2_OnInvitationReceived");
static_assert(offsetof(UMG_MainMenuLayout_C_K2_OnInvitationReceived, SenderName) == 0x000000, "Member 'UMG_MainMenuLayout_C_K2_OnInvitationReceived::SenderName' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.K2_OnPartyMemberExited
// 0x0010 (0x0010 - 0x0000)
struct UMG_MainMenuLayout_C_K2_OnPartyMemberExited final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_K2_OnPartyMemberExited) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_K2_OnPartyMemberExited");
static_assert(sizeof(UMG_MainMenuLayout_C_K2_OnPartyMemberExited) == 0x000010, "Wrong size on UMG_MainMenuLayout_C_K2_OnPartyMemberExited");
static_assert(offsetof(UMG_MainMenuLayout_C_K2_OnPartyMemberExited, MemberName) == 0x000000, "Member 'UMG_MainMenuLayout_C_K2_OnPartyMemberExited::MemberName' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.K2_OnPartyMemberJoined
// 0x0010 (0x0010 - 0x0000)
struct UMG_MainMenuLayout_C_K2_OnPartyMemberJoined final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_K2_OnPartyMemberJoined) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_K2_OnPartyMemberJoined");
static_assert(sizeof(UMG_MainMenuLayout_C_K2_OnPartyMemberJoined) == 0x000010, "Wrong size on UMG_MainMenuLayout_C_K2_OnPartyMemberJoined");
static_assert(offsetof(UMG_MainMenuLayout_C_K2_OnPartyMemberJoined, MemberName) == 0x000000, "Member 'UMG_MainMenuLayout_C_K2_OnPartyMemberJoined::MemberName' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.K2_OnInvitationRejected
// 0x0010 (0x0010 - 0x0000)
struct UMG_MainMenuLayout_C_K2_OnInvitationRejected final
{
public:
	class FString                                 RejecterName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_K2_OnInvitationRejected) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_K2_OnInvitationRejected");
static_assert(sizeof(UMG_MainMenuLayout_C_K2_OnInvitationRejected) == 0x000010, "Wrong size on UMG_MainMenuLayout_C_K2_OnInvitationRejected");
static_assert(offsetof(UMG_MainMenuLayout_C_K2_OnInvitationRejected, RejecterName) == 0x000000, "Member 'UMG_MainMenuLayout_C_K2_OnInvitationRejected::RejecterName' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.K2_OnAcceptInvitationComplete
// 0x0001 (0x0001 - 0x0000)
struct UMG_MainMenuLayout_C_K2_OnAcceptInvitationComplete final
{
public:
	EPBAcceptInvitationResult                     Result;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_K2_OnAcceptInvitationComplete) == 0x000001, "Wrong alignment on UMG_MainMenuLayout_C_K2_OnAcceptInvitationComplete");
static_assert(sizeof(UMG_MainMenuLayout_C_K2_OnAcceptInvitationComplete) == 0x000001, "Wrong size on UMG_MainMenuLayout_C_K2_OnAcceptInvitationComplete");
static_assert(offsetof(UMG_MainMenuLayout_C_K2_OnAcceptInvitationComplete, Result) == 0x000000, "Member 'UMG_MainMenuLayout_C_K2_OnAcceptInvitationComplete::Result' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.K2_SendInvitationComplete
// 0x0001 (0x0001 - 0x0000)
struct UMG_MainMenuLayout_C_K2_SendInvitationComplete final
{
public:
	EPBSendInvitationResult                       Result;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_K2_SendInvitationComplete) == 0x000001, "Wrong alignment on UMG_MainMenuLayout_C_K2_SendInvitationComplete");
static_assert(sizeof(UMG_MainMenuLayout_C_K2_SendInvitationComplete) == 0x000001, "Wrong size on UMG_MainMenuLayout_C_K2_SendInvitationComplete");
static_assert(offsetof(UMG_MainMenuLayout_C_K2_SendInvitationComplete, Result) == 0x000000, "Member 'UMG_MainMenuLayout_C_K2_SendInvitationComplete::Result' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.OnMatchmakingStateChangedDelegateEvent
// 0x0001 (0x0001 - 0x0000)
struct UMG_MainMenuLayout_C_OnMatchmakingStateChangedDelegateEvent final
{
public:
	EPBMatchmakingStatus                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_OnMatchmakingStateChangedDelegateEvent) == 0x000001, "Wrong alignment on UMG_MainMenuLayout_C_OnMatchmakingStateChangedDelegateEvent");
static_assert(sizeof(UMG_MainMenuLayout_C_OnMatchmakingStateChangedDelegateEvent) == 0x000001, "Wrong size on UMG_MainMenuLayout_C_OnMatchmakingStateChangedDelegateEvent");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChangedDelegateEvent, NewState) == 0x000000, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChangedDelegateEvent::NewState' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.OnMatchmakingStateChanged
// 0x0048 (0x0048 - 0x0000)
struct UMG_MainMenuLayout_C_OnMatchmakingStateChanged final
{
public:
	EPBMatchmakingStatus                          InMatchmakingStatus;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBPartyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPartyLeader_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_OnMatchmakingStateChanged");
static_assert(sizeof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged) == 0x000048, "Wrong size on UMG_MainMenuLayout_C_OnMatchmakingStateChanged");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged, InMatchmakingStatus) == 0x000000, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChanged::InMatchmakingStatus' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChanged::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged, CallFunc_IsPartyLeader_ReturnValue) == 0x000011, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChanged::CallFunc_IsPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChanged::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChanged::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000038, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChanged::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_OnMatchmakingStateChanged, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000040, "Member 'UMG_MainMenuLayout_C_OnMatchmakingStateChanged::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.HideCancelTips
// 0x0008 (0x0008 - 0x0000)
struct UMG_MainMenuLayout_C_HideCancelTips final
{
public:
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_HideCancelTips) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_HideCancelTips");
static_assert(sizeof(UMG_MainMenuLayout_C_HideCancelTips) == 0x000008, "Wrong size on UMG_MainMenuLayout_C_HideCancelTips");
static_assert(offsetof(UMG_MainMenuLayout_C_HideCancelTips, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_MainMenuLayout_C_HideCancelTips::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.CancelSearching
// 0x0020 (0x0020 - 0x0000)
struct UMG_MainMenuLayout_C_CancelSearching final
{
public:
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_CancelSearching) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_CancelSearching");
static_assert(sizeof(UMG_MainMenuLayout_C_CancelSearching) == 0x000020, "Wrong size on UMG_MainMenuLayout_C_CancelSearching");
static_assert(offsetof(UMG_MainMenuLayout_C_CancelSearching, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_MainMenuLayout_C_CancelSearching::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_CancelSearching, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UMG_MainMenuLayout_C_CancelSearching::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuLayout_C_CancelSearching, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'UMG_MainMenuLayout_C_CancelSearching::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.ConnectMatchServerFailed
// 0x0008 (0x0008 - 0x0000)
struct UMG_MainMenuLayout_C_ConnectMatchServerFailed final
{
public:
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_ConnectMatchServerFailed) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_ConnectMatchServerFailed");
static_assert(sizeof(UMG_MainMenuLayout_C_ConnectMatchServerFailed) == 0x000008, "Wrong size on UMG_MainMenuLayout_C_ConnectMatchServerFailed");
static_assert(offsetof(UMG_MainMenuLayout_C_ConnectMatchServerFailed, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_MainMenuLayout_C_ConnectMatchServerFailed::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_MainMenuLayout.UMG_MainMenuLayout_C.OnConnectMatchServerTimeOut
// 0x0008 (0x0008 - 0x0000)
struct UMG_MainMenuLayout_C_OnConnectMatchServerTimeOut final
{
public:
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuLayout_C_OnConnectMatchServerTimeOut) == 0x000008, "Wrong alignment on UMG_MainMenuLayout_C_OnConnectMatchServerTimeOut");
static_assert(sizeof(UMG_MainMenuLayout_C_OnConnectMatchServerTimeOut) == 0x000008, "Wrong size on UMG_MainMenuLayout_C_OnConnectMatchServerTimeOut");
static_assert(offsetof(UMG_MainMenuLayout_C_OnConnectMatchServerTimeOut, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_MainMenuLayout_C_OnConnectMatchServerTimeOut::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

}

