#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SimpleDisplayMode

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_SimpleDisplayMode.UMG_SimpleDisplayMode_C.ExecuteUbergraph_UMG_SimpleDisplayMode
// 0x0120 (0x0120 - 0x0000)
struct UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBGameModeDefinitionRow               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0110)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode) == 0x000008, "Wrong alignment on UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode");
static_assert(sizeof(UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode) == 0x000120, "Wrong size on UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode");
static_assert(offsetof(UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode, EntryPoint) == 0x000000, "Member 'UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000118, "Member 'UMG_SimpleDisplayMode_C_ExecuteUbergraph_UMG_SimpleDisplayMode::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function UMG_SimpleDisplayMode.UMG_SimpleDisplayMode_C.Refresh Mode Status
// 0x0018 (0x0018 - 0x0000)
struct UMG_SimpleDisplayMode_C_Refresh_Mode_Status final
{
public:
	bool                                          IsInModeToMatchList;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status) == 0x000004, "Wrong alignment on UMG_SimpleDisplayMode_C_Refresh_Mode_Status");
static_assert(sizeof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status) == 0x000018, "Wrong size on UMG_SimpleDisplayMode_C_Refresh_Mode_Status");
static_assert(offsetof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status, IsInModeToMatchList) == 0x000000, "Member 'UMG_SimpleDisplayMode_C_Refresh_Mode_Status::IsInModeToMatchList' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status, Temp_bool_Variable) == 0x000001, "Member 'UMG_SimpleDisplayMode_C_Refresh_Mode_Status::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status, Temp_float_Variable) == 0x000004, "Member 'UMG_SimpleDisplayMode_C_Refresh_Mode_Status::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status, Temp_float_Variable_1) == 0x000008, "Member 'UMG_SimpleDisplayMode_C_Refresh_Mode_Status::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status, Temp_bool_Variable_1) == 0x00000C, "Member 'UMG_SimpleDisplayMode_C_Refresh_Mode_Status::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status, K2Node_Select_Default) == 0x000010, "Member 'UMG_SimpleDisplayMode_C_Refresh_Mode_Status::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status, Temp_byte_Variable) == 0x000014, "Member 'UMG_SimpleDisplayMode_C_Refresh_Mode_Status::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status, Temp_byte_Variable_1) == 0x000015, "Member 'UMG_SimpleDisplayMode_C_Refresh_Mode_Status::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SimpleDisplayMode_C_Refresh_Mode_Status, K2Node_Select_Default_1) == 0x000016, "Member 'UMG_SimpleDisplayMode_C_Refresh_Mode_Status::K2Node_Select_Default_1' has a wrong offset!");

}

