#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PlayerState_Tip

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_PlayerState_Tip.UMG_PlayerState_Tip_C
// 0x0040 (0x02A0 - 0x0260)
class UUMG_PlayerState_Tip_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Icon;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0278(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             RoleIcon;                                          // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsImage;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_PlayerState_Tip(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void SetTextInfo(const class FText& InName);
	void SetImageInfo(TSoftObjectPtr<class UTexture2D> InImage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_PlayerState_Tip_C">();
	}
	static class UUMG_PlayerState_Tip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_PlayerState_Tip_C>();
	}
};
static_assert(alignof(UUMG_PlayerState_Tip_C) == 0x000008, "Wrong alignment on UUMG_PlayerState_Tip_C");
static_assert(sizeof(UUMG_PlayerState_Tip_C) == 0x0002A0, "Wrong size on UUMG_PlayerState_Tip_C");
static_assert(offsetof(UUMG_PlayerState_Tip_C, UberGraphFrame) == 0x000260, "Member 'UUMG_PlayerState_Tip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerState_Tip_C, Image_Icon) == 0x000268, "Member 'UUMG_PlayerState_Tip_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerState_Tip_C, Text_Name) == 0x000270, "Member 'UUMG_PlayerState_Tip_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerState_Tip_C, Name_0) == 0x000278, "Member 'UUMG_PlayerState_Tip_C::Name_0' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerState_Tip_C, RoleIcon) == 0x000290, "Member 'UUMG_PlayerState_Tip_C::RoleIcon' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerState_Tip_C, bIsImage) == 0x000298, "Member 'UUMG_PlayerState_Tip_C::bIsImage' has a wrong offset!");

}

