#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_IngameHUD_AmmoWarning

#include "Basic.hpp"

#include "Enum_HUD_AmmoWarningState_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_IngameHUD_AmmoWarning.UMG_IngameHUD_AmmoWarning_C.ExecuteUbergraph_UMG_IngameHUD_AmmoWarning
// 0x0004 (0x0004 - 0x0000)
struct UMG_IngameHUD_AmmoWarning_C_ExecuteUbergraph_UMG_IngameHUD_AmmoWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_IngameHUD_AmmoWarning_C_ExecuteUbergraph_UMG_IngameHUD_AmmoWarning) == 0x000004, "Wrong alignment on UMG_IngameHUD_AmmoWarning_C_ExecuteUbergraph_UMG_IngameHUD_AmmoWarning");
static_assert(sizeof(UMG_IngameHUD_AmmoWarning_C_ExecuteUbergraph_UMG_IngameHUD_AmmoWarning) == 0x000004, "Wrong size on UMG_IngameHUD_AmmoWarning_C_ExecuteUbergraph_UMG_IngameHUD_AmmoWarning");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_ExecuteUbergraph_UMG_IngameHUD_AmmoWarning, EntryPoint) == 0x000000, "Member 'UMG_IngameHUD_AmmoWarning_C_ExecuteUbergraph_UMG_IngameHUD_AmmoWarning::EntryPoint' has a wrong offset!");

// Function UMG_IngameHUD_AmmoWarning.UMG_IngameHUD_AmmoWarning_C.OnAmmoNeedReload
// 0x0040 (0x0040 - 0x0000)
struct UMG_IngameHUD_AmmoWarning_C_OnAmmoNeedReload final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
};
static_assert(alignof(UMG_IngameHUD_AmmoWarning_C_OnAmmoNeedReload) == 0x000008, "Wrong alignment on UMG_IngameHUD_AmmoWarning_C_OnAmmoNeedReload");
static_assert(sizeof(UMG_IngameHUD_AmmoWarning_C_OnAmmoNeedReload) == 0x000040, "Wrong size on UMG_IngameHUD_AmmoWarning_C_OnAmmoNeedReload");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_OnAmmoNeedReload, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'UMG_IngameHUD_AmmoWarning_C_OnAmmoNeedReload::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_OnAmmoNeedReload, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'UMG_IngameHUD_AmmoWarning_C_OnAmmoNeedReload::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function UMG_IngameHUD_AmmoWarning.UMG_IngameHUD_AmmoWarning_C.OnNoAmmo
// 0x0040 (0x0040 - 0x0000)
struct UMG_IngameHUD_AmmoWarning_C_OnNoAmmo final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0028(0x0018)()
};
static_assert(alignof(UMG_IngameHUD_AmmoWarning_C_OnNoAmmo) == 0x000008, "Wrong alignment on UMG_IngameHUD_AmmoWarning_C_OnNoAmmo");
static_assert(sizeof(UMG_IngameHUD_AmmoWarning_C_OnNoAmmo) == 0x000040, "Wrong size on UMG_IngameHUD_AmmoWarning_C_OnNoAmmo");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_OnNoAmmo, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UMG_IngameHUD_AmmoWarning_C_OnNoAmmo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_OnNoAmmo, CallFunc_MakeLiteralText_ReturnValue) == 0x000028, "Member 'UMG_IngameHUD_AmmoWarning_C_OnNoAmmo::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function UMG_IngameHUD_AmmoWarning.UMG_IngameHUD_AmmoWarning_C.OnLowAmmo
// 0x0040 (0x0040 - 0x0000)
struct UMG_IngameHUD_AmmoWarning_C_OnLowAmmo final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
};
static_assert(alignof(UMG_IngameHUD_AmmoWarning_C_OnLowAmmo) == 0x000008, "Wrong alignment on UMG_IngameHUD_AmmoWarning_C_OnLowAmmo");
static_assert(sizeof(UMG_IngameHUD_AmmoWarning_C_OnLowAmmo) == 0x000040, "Wrong size on UMG_IngameHUD_AmmoWarning_C_OnLowAmmo");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_OnLowAmmo, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'UMG_IngameHUD_AmmoWarning_C_OnLowAmmo::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_OnLowAmmo, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'UMG_IngameHUD_AmmoWarning_C_OnLowAmmo::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function UMG_IngameHUD_AmmoWarning.UMG_IngameHUD_AmmoWarning_C.RefreshInfo
// 0x0002 (0x0002 - 0x0000)
struct UMG_IngameHUD_AmmoWarning_C_RefreshInfo final
{
public:
	Enum_HUD_AmmoWarningState                     CallFunc_GetAmmoState_AmmoState;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_IngameHUD_AmmoWarning_C_RefreshInfo) == 0x000001, "Wrong alignment on UMG_IngameHUD_AmmoWarning_C_RefreshInfo");
static_assert(sizeof(UMG_IngameHUD_AmmoWarning_C_RefreshInfo) == 0x000002, "Wrong size on UMG_IngameHUD_AmmoWarning_C_RefreshInfo");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_RefreshInfo, CallFunc_GetAmmoState_AmmoState) == 0x000000, "Member 'UMG_IngameHUD_AmmoWarning_C_RefreshInfo::CallFunc_GetAmmoState_AmmoState' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_RefreshInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UMG_IngameHUD_AmmoWarning_C_RefreshInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_IngameHUD_AmmoWarning.UMG_IngameHUD_AmmoWarning_C.GetAmmoState
// 0x0028 (0x0028 - 0x0000)
struct UMG_IngameHUD_AmmoWarning_C_GetAmmoState final
{
public:
	Enum_HUD_AmmoWarningState                     AmmoState;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalAmmoPerClip;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalAmmoInClip;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalTotalAmmo;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_HUD_AmmoWarningState                     LocalAmmoState;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentAmmo_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState) == 0x000004, "Wrong alignment on UMG_IngameHUD_AmmoWarning_C_GetAmmoState");
static_assert(sizeof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState) == 0x000028, "Wrong size on UMG_IngameHUD_AmmoWarning_C_GetAmmoState");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, AmmoState) == 0x000000, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::AmmoState' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, LocalAmmoPerClip) == 0x000004, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::LocalAmmoPerClip' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, LocalAmmoInClip) == 0x000008, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::LocalAmmoInClip' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, LocalTotalAmmo) == 0x00000C, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::LocalTotalAmmo' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, LocalAmmoState) == 0x000010, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::LocalAmmoState' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000012, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000014, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00001D, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, CallFunc_GetCurrentAmmoInClip_ReturnValue) == 0x000020, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::CallFunc_GetCurrentAmmoInClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_AmmoWarning_C_GetAmmoState, CallFunc_GetCurrentAmmo_ReturnValue) == 0x000024, "Member 'UMG_IngameHUD_AmmoWarning_C_GetAmmoState::CallFunc_GetCurrentAmmo_ReturnValue' has a wrong offset!");

}

