#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MessagePanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_MessagePanel.UMG_MessagePanel_C.ExecuteUbergraph_UMG_MessagePanel
// 0x0004 (0x0004 - 0x0000)
struct UMG_MessagePanel_C_ExecuteUbergraph_UMG_MessagePanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MessagePanel_C_ExecuteUbergraph_UMG_MessagePanel) == 0x000004, "Wrong alignment on UMG_MessagePanel_C_ExecuteUbergraph_UMG_MessagePanel");
static_assert(sizeof(UMG_MessagePanel_C_ExecuteUbergraph_UMG_MessagePanel) == 0x000004, "Wrong size on UMG_MessagePanel_C_ExecuteUbergraph_UMG_MessagePanel");
static_assert(offsetof(UMG_MessagePanel_C_ExecuteUbergraph_UMG_MessagePanel, EntryPoint) == 0x000000, "Member 'UMG_MessagePanel_C_ExecuteUbergraph_UMG_MessagePanel::EntryPoint' has a wrong offset!");

// Function UMG_MessagePanel.UMG_MessagePanel_C.AddMessage
// 0x0048 (0x0048 - 0x0000)
struct UMG_MessagePanel_C_AddMessage final
{
public:
	class UClass*                                 MessageClass;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InMessage;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bUnique;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Message_C*                         CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MessagePanel_C_AddMessage) == 0x000008, "Wrong alignment on UMG_MessagePanel_C_AddMessage");
static_assert(sizeof(UMG_MessagePanel_C_AddMessage) == 0x000048, "Wrong size on UMG_MessagePanel_C_AddMessage");
static_assert(offsetof(UMG_MessagePanel_C_AddMessage, MessageClass) == 0x000000, "Member 'UMG_MessagePanel_C_AddMessage::MessageClass' has a wrong offset!");
static_assert(offsetof(UMG_MessagePanel_C_AddMessage, InMessage) == 0x000008, "Member 'UMG_MessagePanel_C_AddMessage::InMessage' has a wrong offset!");
static_assert(offsetof(UMG_MessagePanel_C_AddMessage, bUnique) == 0x000020, "Member 'UMG_MessagePanel_C_AddMessage::bUnique' has a wrong offset!");
static_assert(offsetof(UMG_MessagePanel_C_AddMessage, Temp_bool_Variable) == 0x000021, "Member 'UMG_MessagePanel_C_AddMessage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MessagePanel_C_AddMessage, CallFunc_IsValidClass_ReturnValue) == 0x000022, "Member 'UMG_MessagePanel_C_AddMessage::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MessagePanel_C_AddMessage, Temp_class_Variable) == 0x000028, "Member 'UMG_MessagePanel_C_AddMessage::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MessagePanel_C_AddMessage, K2Node_Select_Default) == 0x000030, "Member 'UMG_MessagePanel_C_AddMessage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_MessagePanel_C_AddMessage, CallFunc_Create_ReturnValue) == 0x000038, "Member 'UMG_MessagePanel_C_AddMessage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MessagePanel_C_AddMessage, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000040, "Member 'UMG_MessagePanel_C_AddMessage::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

}

