#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_OptionGroup

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_OptionGroup.UMG_OptionGroup_C.ExecuteUbergraph_UMG_OptionGroup
// 0x0008 (0x0008 - 0x0000)
struct UMG_OptionGroup_C_ExecuteUbergraph_UMG_OptionGroup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_OptionGroup_C_ExecuteUbergraph_UMG_OptionGroup) == 0x000004, "Wrong alignment on UMG_OptionGroup_C_ExecuteUbergraph_UMG_OptionGroup");
static_assert(sizeof(UMG_OptionGroup_C_ExecuteUbergraph_UMG_OptionGroup) == 0x000008, "Wrong size on UMG_OptionGroup_C_ExecuteUbergraph_UMG_OptionGroup");
static_assert(offsetof(UMG_OptionGroup_C_ExecuteUbergraph_UMG_OptionGroup, EntryPoint) == 0x000000, "Member 'UMG_OptionGroup_C_ExecuteUbergraph_UMG_OptionGroup::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_OptionGroup_C_ExecuteUbergraph_UMG_OptionGroup, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_OptionGroup_C_ExecuteUbergraph_UMG_OptionGroup::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_OptionGroup.UMG_OptionGroup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_OptionGroup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_OptionGroup_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_OptionGroup_C_PreConstruct");
static_assert(sizeof(UMG_OptionGroup_C_PreConstruct) == 0x000001, "Wrong size on UMG_OptionGroup_C_PreConstruct");
static_assert(offsetof(UMG_OptionGroup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_OptionGroup_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

