#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Art_ImageBox_5

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_STD_Art_ImageBox_5.UMG_STD_Art_ImageBox_5_C
// 0x0060 (0x02C0 - 0x0260)
class UUMG_STD_Art_ImageBox_5_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverOn;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Select;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_140;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_685;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_754;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Character;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Logo;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Lock;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Content;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Level;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_STD_Art_ImageBox_5(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetSelect(bool IsSelecting);
	void SetLock(bool IsLocking);
	void UpdateWidget(const struct FVector2D& Size, TSoftObjectPtr<class UTexture2D> CharacterIcon, TSoftObjectPtr<class UTexture2D> CharacterAbilityIcon, const class FText& Name_0, const class FText& Level);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_STD_Art_ImageBox_5_C">();
	}
	static class UUMG_STD_Art_ImageBox_5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_STD_Art_ImageBox_5_C>();
	}
};
static_assert(alignof(UUMG_STD_Art_ImageBox_5_C) == 0x000008, "Wrong alignment on UUMG_STD_Art_ImageBox_5_C");
static_assert(sizeof(UUMG_STD_Art_ImageBox_5_C) == 0x0002C0, "Wrong size on UUMG_STD_Art_ImageBox_5_C");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, UberGraphFrame) == 0x000260, "Member 'UUMG_STD_Art_ImageBox_5_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, HoverOn) == 0x000268, "Member 'UUMG_STD_Art_ImageBox_5_C::HoverOn' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, Border_Select) == 0x000270, "Member 'UUMG_STD_Art_ImageBox_5_C::Border_Select' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, Image_140) == 0x000278, "Member 'UUMG_STD_Art_ImageBox_5_C::Image_140' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, Image_685) == 0x000280, "Member 'UUMG_STD_Art_ImageBox_5_C::Image_685' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, Image_754) == 0x000288, "Member 'UUMG_STD_Art_ImageBox_5_C::Image_754' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, Image_Character) == 0x000290, "Member 'UUMG_STD_Art_ImageBox_5_C::Image_Character' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, Image_Logo) == 0x000298, "Member 'UUMG_STD_Art_ImageBox_5_C::Image_Logo' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, Overlay_Lock) == 0x0002A0, "Member 'UUMG_STD_Art_ImageBox_5_C::Overlay_Lock' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, SizeBox_Content) == 0x0002A8, "Member 'UUMG_STD_Art_ImageBox_5_C::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, TextBlock_Level) == 0x0002B0, "Member 'UUMG_STD_Art_ImageBox_5_C::TextBlock_Level' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_5_C, TextBlock_Name) == 0x0002B8, "Member 'UUMG_STD_Art_ImageBox_5_C::TextBlock_Name' has a wrong offset!");

}

