#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MenuConnectionStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_MenuConnectionStatus.UMG_MenuConnectionStatus_C.ExecuteUbergraph_UMG_MenuConnectionStatus
// 0x0010 (0x0010 - 0x0000)
struct UMG_MenuConnectionStatus_C_ExecuteUbergraph_UMG_MenuConnectionStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MenuConnectionStatus_C_ExecuteUbergraph_UMG_MenuConnectionStatus) == 0x000008, "Wrong alignment on UMG_MenuConnectionStatus_C_ExecuteUbergraph_UMG_MenuConnectionStatus");
static_assert(sizeof(UMG_MenuConnectionStatus_C_ExecuteUbergraph_UMG_MenuConnectionStatus) == 0x000010, "Wrong size on UMG_MenuConnectionStatus_C_ExecuteUbergraph_UMG_MenuConnectionStatus");
static_assert(offsetof(UMG_MenuConnectionStatus_C_ExecuteUbergraph_UMG_MenuConnectionStatus, EntryPoint) == 0x000000, "Member 'UMG_MenuConnectionStatus_C_ExecuteUbergraph_UMG_MenuConnectionStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MenuConnectionStatus_C_ExecuteUbergraph_UMG_MenuConnectionStatus, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'UMG_MenuConnectionStatus_C_ExecuteUbergraph_UMG_MenuConnectionStatus::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function UMG_MenuConnectionStatus.UMG_MenuConnectionStatus_C.BndEvt__UMG_MenuConnectionStatus_UMG_ReconnectionButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_MenuConnectionStatus_C_BndEvt__UMG_MenuConnectionStatus_UMG_ReconnectionButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MenuConnectionStatus_C_BndEvt__UMG_MenuConnectionStatus_UMG_ReconnectionButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_MenuConnectionStatus_C_BndEvt__UMG_MenuConnectionStatus_UMG_ReconnectionButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_MenuConnectionStatus_C_BndEvt__UMG_MenuConnectionStatus_UMG_ReconnectionButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_MenuConnectionStatus_C_BndEvt__UMG_MenuConnectionStatus_UMG_ReconnectionButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_MenuConnectionStatus_C_BndEvt__UMG_MenuConnectionStatus_UMG_ReconnectionButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_MenuConnectionStatus_C_BndEvt__UMG_MenuConnectionStatus_UMG_ReconnectionButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_MenuConnectionStatus.UMG_MenuConnectionStatus_C.Set Connection Dropped
// 0x0008 (0x0008 - 0x0000)
struct UMG_MenuConnectionStatus_C_Set_Connection_Dropped final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MenuConnectionStatus_C_Set_Connection_Dropped) == 0x000008, "Wrong alignment on UMG_MenuConnectionStatus_C_Set_Connection_Dropped");
static_assert(sizeof(UMG_MenuConnectionStatus_C_Set_Connection_Dropped) == 0x000008, "Wrong size on UMG_MenuConnectionStatus_C_Set_Connection_Dropped");
static_assert(offsetof(UMG_MenuConnectionStatus_C_Set_Connection_Dropped, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_MenuConnectionStatus_C_Set_Connection_Dropped::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_MenuConnectionStatus.UMG_MenuConnectionStatus_C.Set Connected
// 0x0010 (0x0010 - 0x0000)
struct UMG_MenuConnectionStatus_C_Set_Connected final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MenuConnectionStatus_C_Set_Connected) == 0x000008, "Wrong alignment on UMG_MenuConnectionStatus_C_Set_Connected");
static_assert(sizeof(UMG_MenuConnectionStatus_C_Set_Connected) == 0x000010, "Wrong size on UMG_MenuConnectionStatus_C_Set_Connected");
static_assert(offsetof(UMG_MenuConnectionStatus_C_Set_Connected, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'UMG_MenuConnectionStatus_C_Set_Connected::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MenuConnectionStatus_C_Set_Connected, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UMG_MenuConnectionStatus_C_Set_Connected::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_MenuConnectionStatus.UMG_MenuConnectionStatus_C.Set Reconnecting
// 0x0008 (0x0008 - 0x0000)
struct UMG_MenuConnectionStatus_C_Set_Reconnecting final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MenuConnectionStatus_C_Set_Reconnecting) == 0x000008, "Wrong alignment on UMG_MenuConnectionStatus_C_Set_Reconnecting");
static_assert(sizeof(UMG_MenuConnectionStatus_C_Set_Reconnecting) == 0x000008, "Wrong size on UMG_MenuConnectionStatus_C_Set_Reconnecting");
static_assert(offsetof(UMG_MenuConnectionStatus_C_Set_Reconnecting, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_MenuConnectionStatus_C_Set_Reconnecting::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_MenuConnectionStatus.UMG_MenuConnectionStatus_C.Hide Connection Status
// 0x0008 (0x0008 - 0x0000)
struct UMG_MenuConnectionStatus_C_Hide_Connection_Status final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MenuConnectionStatus_C_Hide_Connection_Status) == 0x000008, "Wrong alignment on UMG_MenuConnectionStatus_C_Hide_Connection_Status");
static_assert(sizeof(UMG_MenuConnectionStatus_C_Hide_Connection_Status) == 0x000008, "Wrong size on UMG_MenuConnectionStatus_C_Hide_Connection_Status");
static_assert(offsetof(UMG_MenuConnectionStatus_C_Hide_Connection_Status, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'UMG_MenuConnectionStatus_C_Hide_Connection_Status::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function UMG_MenuConnectionStatus.UMG_MenuConnectionStatus_C.OnMouseButtonUp_0
// 0x0218 (0x0218 - 0x0000)
struct UMG_MenuConnectionStatus_C_OnMouseButtonUp_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_MenuConnectionStatus_C_OnMouseButtonUp_0) == 0x000008, "Wrong alignment on UMG_MenuConnectionStatus_C_OnMouseButtonUp_0");
static_assert(sizeof(UMG_MenuConnectionStatus_C_OnMouseButtonUp_0) == 0x000218, "Wrong size on UMG_MenuConnectionStatus_C_OnMouseButtonUp_0");
static_assert(offsetof(UMG_MenuConnectionStatus_C_OnMouseButtonUp_0, MyGeometry) == 0x000000, "Member 'UMG_MenuConnectionStatus_C_OnMouseButtonUp_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_MenuConnectionStatus_C_OnMouseButtonUp_0, MouseEvent) == 0x000038, "Member 'UMG_MenuConnectionStatus_C_OnMouseButtonUp_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_MenuConnectionStatus_C_OnMouseButtonUp_0, ReturnValue) == 0x0000A8, "Member 'UMG_MenuConnectionStatus_C_OnMouseButtonUp_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MenuConnectionStatus_C_OnMouseButtonUp_0, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_MenuConnectionStatus_C_OnMouseButtonUp_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

