#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FeedbackWidget

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.ExecuteUbergraph_UMG_FeedbackWidget
// 0x0340 (0x0340 - 0x0000)
struct UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bConfirm)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FConfirmInfo                           K2Node_MakeStruct_ConfirmInfo;                     // 0x0028(0x0078)(ContainsInstancedReference)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x00A0(0x0018)(ConstParm)
	bool                                          CallFunc_LimitMultiLineEditableTextLength_ReturnValue; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTextLength_ReturnValue;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C0(0x0018)()
	bool                                          CallFunc_LimitMultiLineEditableTextLength_ReturnValue_1; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CreateFeedback_ReturnValue;               // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasSuccessful;                       // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_ErrorCode;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00F0(0x0018)(ConstParm)
	int32                                         CallFunc_GetTextLength_ReturnValue_1;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0110(0x0018)()
	bool                                          K2Node_CustomEvent_bConfirm_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bConfirm;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBLocalPlayer*                         K2Node_DynamicCast_AsPBLocal_Player;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bConfirm)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x014C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConfirmInfo                           K2Node_MakeStruct_ConfirmInfo_1;                   // 0x0160(0x0078)(ContainsInstancedReference)
	struct FConfirmInfo                           K2Node_MakeStruct_ConfirmInfo_2;                   // 0x01D8(0x0078)(ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FConfirmInfo                           K2Node_Select_Default;                             // 0x0258(0x0078)(ContainsInstancedReference)
	class APBPlayerController*                    K2Node_DynamicCast_AsPBPlayer_Controller;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerController*                    K2Node_DynamicCast_AsPBPlayer_Controller_1;        // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue_1;       // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBLocalPlayer*                         K2Node_DynamicCast_AsPBLocal_Player_1;             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPBUserObject*                    CallFunc_GetLocalUserObject_ReturnValue;           // 0x0310(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0328(0x0018)()
};
static_assert(alignof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget) == 0x000008, "Wrong alignment on UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget");
static_assert(sizeof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget) == 0x000340, "Wrong size on UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, EntryPoint) == 0x000000, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, Temp_bool_Variable) == 0x000004, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000020, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_MakeStruct_ConfirmInfo) == 0x000028, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_MakeStruct_ConfirmInfo' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_ComponentBoundEvent_Text_1) == 0x0000A0, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_LimitMultiLineEditableTextLength_ReturnValue) == 0x0000B8, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_LimitMultiLineEditableTextLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetTextLength_ReturnValue) == 0x0000BC, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetTextLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x0000C0, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_LimitMultiLineEditableTextLength_ReturnValue_1) == 0x0000D8, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_LimitMultiLineEditableTextLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_CreateFeedback_ReturnValue) == 0x0000D9, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_CreateFeedback_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_Event_bWasSuccessful) == 0x0000DA, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_Event_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_Event_ErrorCode) == 0x0000DC, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_Event_ErrorCode' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E8, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_ComponentBoundEvent_Text) == 0x0000F0, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetTextLength_ReturnValue_1) == 0x000108, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetTextLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000110, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_CustomEvent_bConfirm_1) == 0x000128, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_CustomEvent_bConfirm_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000130, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_CustomEvent_bConfirm) == 0x000138, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_CustomEvent_bConfirm' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_DynamicCast_AsPBLocal_Player) == 0x000140, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_DynamicCast_AsPBLocal_Player' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x00014C, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_MakeStruct_ConfirmInfo_1) == 0x000160, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_MakeStruct_ConfirmInfo_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_MakeStruct_ConfirmInfo_2) == 0x0001D8, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_MakeStruct_ConfirmInfo_2' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000250, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_Select_Default) == 0x000258, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_DynamicCast_AsPBPlayer_Controller) == 0x0002D0, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_DynamicCast_AsPBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_DynamicCast_bSuccess_1) == 0x0002D8, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0002E0, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_DynamicCast_AsPBPlayer_Controller_1) == 0x0002E8, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_DynamicCast_AsPBPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_DynamicCast_bSuccess_2) == 0x0002F0, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetOwningLocalPlayer_ReturnValue_1) == 0x0002F8, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetOwningLocalPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_DynamicCast_AsPBLocal_Player_1) == 0x000300, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_DynamicCast_AsPBLocal_Player_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, K2Node_DynamicCast_bSuccess_3) == 0x000308, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetLocalUserObject_ReturnValue) == 0x000310, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetLocalUserObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_GetDisplayName_ReturnValue) == 0x000318, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000328, "Member 'UMG_FeedbackWidget_C_ExecuteUbergraph_UMG_FeedbackWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.CustomEvent_0
// 0x0001 (0x0001 - 0x0000)
struct UMG_FeedbackWidget_C_CustomEvent_0 final
{
public:
	bool                                          bConfirm;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FeedbackWidget_C_CustomEvent_0) == 0x000001, "Wrong alignment on UMG_FeedbackWidget_C_CustomEvent_0");
static_assert(sizeof(UMG_FeedbackWidget_C_CustomEvent_0) == 0x000001, "Wrong size on UMG_FeedbackWidget_C_CustomEvent_0");
static_assert(offsetof(UMG_FeedbackWidget_C_CustomEvent_0, bConfirm) == 0x000000, "Member 'UMG_FeedbackWidget_C_CustomEvent_0::bConfirm' has a wrong offset!");

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.ConfirmPopMenu
// 0x0001 (0x0001 - 0x0000)
struct UMG_FeedbackWidget_C_ConfirmPopMenu final
{
public:
	bool                                          bConfirm;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FeedbackWidget_C_ConfirmPopMenu) == 0x000001, "Wrong alignment on UMG_FeedbackWidget_C_ConfirmPopMenu");
static_assert(sizeof(UMG_FeedbackWidget_C_ConfirmPopMenu) == 0x000001, "Wrong size on UMG_FeedbackWidget_C_ConfirmPopMenu");
static_assert(offsetof(UMG_FeedbackWidget_C_ConfirmPopMenu, bConfirm) == 0x000000, "Member 'UMG_FeedbackWidget_C_ConfirmPopMenu::bConfirm' has a wrong offset!");

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.BndEvt__UMG_FeedbackWidget_Title_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_Title_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_Title_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_Title_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_Title_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_Title_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_Title_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_Title_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.K2_OnCreateFeedbackComplete
// 0x0008 (0x0008 - 0x0000)
struct UMG_FeedbackWidget_C_K2_OnCreateFeedbackComplete final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ErrorCode;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FeedbackWidget_C_K2_OnCreateFeedbackComplete) == 0x000004, "Wrong alignment on UMG_FeedbackWidget_C_K2_OnCreateFeedbackComplete");
static_assert(sizeof(UMG_FeedbackWidget_C_K2_OnCreateFeedbackComplete) == 0x000008, "Wrong size on UMG_FeedbackWidget_C_K2_OnCreateFeedbackComplete");
static_assert(offsetof(UMG_FeedbackWidget_C_K2_OnCreateFeedbackComplete, bWasSuccessful) == 0x000000, "Member 'UMG_FeedbackWidget_C_K2_OnCreateFeedbackComplete::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_K2_OnCreateFeedbackComplete, ErrorCode) == 0x000004, "Member 'UMG_FeedbackWidget_C_K2_OnCreateFeedbackComplete::ErrorCode' has a wrong offset!");

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.BndEvt__UMG_FeedbackWidget_ContentWidget_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_ContentWidget_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_ContentWidget_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_ContentWidget_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_ContentWidget_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_ContentWidget_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_ContentWidget_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'UMG_FeedbackWidget_C_BndEvt__UMG_FeedbackWidget_ContentWidget_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UMG_FeedbackWidget_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_FeedbackWidget_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UMG_FeedbackWidget_C_OnMouseButtonDown");
static_assert(sizeof(UMG_FeedbackWidget_C_OnMouseButtonDown) == 0x000218, "Wrong size on UMG_FeedbackWidget_C_OnMouseButtonDown");
static_assert(offsetof(UMG_FeedbackWidget_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UMG_FeedbackWidget_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UMG_FeedbackWidget_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UMG_FeedbackWidget_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_FeedbackWidget_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.OnKeyDown
// 0x02D0 (0x02D0 - 0x0000)
struct UMG_FeedbackWidget_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	class APBPlayerController*                    K2Node_DynamicCast_AsPBPlayer_Controller;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0218(0x00B8)()
};
static_assert(alignof(UMG_FeedbackWidget_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_FeedbackWidget_C_OnKeyDown");
static_assert(sizeof(UMG_FeedbackWidget_C_OnKeyDown) == 0x0002D0, "Wrong size on UMG_FeedbackWidget_C_OnKeyDown");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_FeedbackWidget_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_FeedbackWidget_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_FeedbackWidget_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, CallFunc_GetOwningPlayer_ReturnValue) == 0x000128, "Member 'UMG_FeedbackWidget_C_OnKeyDown::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'UMG_FeedbackWidget_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, K2Node_DynamicCast_AsPBPlayer_Controller) == 0x000148, "Member 'UMG_FeedbackWidget_C_OnKeyDown::K2Node_DynamicCast_AsPBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'UMG_FeedbackWidget_C_OnKeyDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000151, "Member 'UMG_FeedbackWidget_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000152, "Member 'UMG_FeedbackWidget_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, CallFunc_BooleanOR_ReturnValue) == 0x000153, "Member 'UMG_FeedbackWidget_C_OnKeyDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000158, "Member 'UMG_FeedbackWidget_C_OnKeyDown::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'UMG_FeedbackWidget_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000218, "Member 'UMG_FeedbackWidget_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.OnMouseMove
// 0x0218 (0x0218 - 0x0000)
struct UMG_FeedbackWidget_C_OnMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_FeedbackWidget_C_OnMouseMove) == 0x000008, "Wrong alignment on UMG_FeedbackWidget_C_OnMouseMove");
static_assert(sizeof(UMG_FeedbackWidget_C_OnMouseMove) == 0x000218, "Wrong size on UMG_FeedbackWidget_C_OnMouseMove");
static_assert(offsetof(UMG_FeedbackWidget_C_OnMouseMove, MyGeometry) == 0x000000, "Member 'UMG_FeedbackWidget_C_OnMouseMove::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnMouseMove, MouseEvent) == 0x000038, "Member 'UMG_FeedbackWidget_C_OnMouseMove::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnMouseMove, ReturnValue) == 0x0000A8, "Member 'UMG_FeedbackWidget_C_OnMouseMove::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnMouseMove, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_FeedbackWidget_C_OnMouseMove::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_FeedbackWidget.UMG_FeedbackWidget_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_FeedbackWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_FeedbackWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_FeedbackWidget_C_OnFocusReceived");
static_assert(sizeof(UMG_FeedbackWidget_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_FeedbackWidget_C_OnFocusReceived");
static_assert(offsetof(UMG_FeedbackWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_FeedbackWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_FeedbackWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_FeedbackWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FeedbackWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_FeedbackWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}
