#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_LoginDateCard

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_LoginDateCard.UMG_LoginDateCard_C
// 0x0080 (0x02F0 - 0x0270)
class UUMG_LoginDateCard_C final : public UPBLoginActivityDateCardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Glowing;                                           // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_455;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dark;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Light;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ReceivableState;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Title;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        Text_Date;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        Text_State;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem;                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_3;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_NewItemPage_C*                     NewItemPage;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FPBRewardItem& RewardItem)> OnFinishedAnimationEvent;                          // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bPlayGlowingAnimation;                             // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_LoginDateCard(int32 EntryPoint);
	void K2_RefreshCard();
	void RefreshCardInfo();
	void PlayGlowingAnimation();
	void ShowNewItemPage();
	void RefreshCardWithAnimation(const struct FPBLoginActivityRecord& LoginActivityRecord, int32 InDate, int32 CurrentDate, bool bInPlayGlowingAnimation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_LoginDateCard_C">();
	}
	static class UUMG_LoginDateCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_LoginDateCard_C>();
	}
};
static_assert(alignof(UUMG_LoginDateCard_C) == 0x000008, "Wrong alignment on UUMG_LoginDateCard_C");
static_assert(sizeof(UUMG_LoginDateCard_C) == 0x0002F0, "Wrong size on UUMG_LoginDateCard_C");
static_assert(offsetof(UUMG_LoginDateCard_C, UberGraphFrame) == 0x000270, "Member 'UUMG_LoginDateCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, Glowing) == 0x000278, "Member 'UUMG_LoginDateCard_C::Glowing' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, Image_455) == 0x000280, "Member 'UUMG_LoginDateCard_C::Image_455' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, Image_Dark) == 0x000288, "Member 'UUMG_LoginDateCard_C::Image_Dark' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, Image_Light) == 0x000290, "Member 'UUMG_LoginDateCard_C::Image_Light' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, Image_ReceivableState) == 0x000298, "Member 'UUMG_LoginDateCard_C::Image_ReceivableState' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, SizeBox_Title) == 0x0002A0, "Member 'UUMG_LoginDateCard_C::SizeBox_Title' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, Text_Date) == 0x0002A8, "Member 'UUMG_LoginDateCard_C::Text_Date' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, Text_State) == 0x0002B0, "Member 'UUMG_LoginDateCard_C::Text_State' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, UMG_ProgressionRewardItem) == 0x0002B8, "Member 'UUMG_LoginDateCard_C::UMG_ProgressionRewardItem' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, UMG_STD_Text_3) == 0x0002C0, "Member 'UUMG_LoginDateCard_C::UMG_STD_Text_3' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, Texture) == 0x0002C8, "Member 'UUMG_LoginDateCard_C::Texture' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, NewItemPage) == 0x0002D0, "Member 'UUMG_LoginDateCard_C::NewItemPage' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, OnFinishedAnimationEvent) == 0x0002D8, "Member 'UUMG_LoginDateCard_C::OnFinishedAnimationEvent' has a wrong offset!");
static_assert(offsetof(UUMG_LoginDateCard_C, bPlayGlowingAnimation) == 0x0002E8, "Member 'UUMG_LoginDateCard_C::bPlayGlowingAnimation' has a wrong offset!");

}

