#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_KillerInfo

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_KillerInfo.UMG_KillerInfo_C
// 0x0030 (0x0320 - 0x02F0)
class UUMG_KillerInfo_C final : public UPBKillerInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Card;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DogTag;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Level;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Level;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerName;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_KillerInfo(int32 EntryPoint);
	void K2_RefreshKillerInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_KillerInfo_C">();
	}
	static class UUMG_KillerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_KillerInfo_C>();
	}
};
static_assert(alignof(UUMG_KillerInfo_C) == 0x000008, "Wrong alignment on UUMG_KillerInfo_C");
static_assert(sizeof(UUMG_KillerInfo_C) == 0x000320, "Wrong size on UUMG_KillerInfo_C");
static_assert(offsetof(UUMG_KillerInfo_C, UberGraphFrame) == 0x0002F0, "Member 'UUMG_KillerInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_KillerInfo_C, Image_Card) == 0x0002F8, "Member 'UUMG_KillerInfo_C::Image_Card' has a wrong offset!");
static_assert(offsetof(UUMG_KillerInfo_C, Image_DogTag) == 0x000300, "Member 'UUMG_KillerInfo_C::Image_DogTag' has a wrong offset!");
static_assert(offsetof(UUMG_KillerInfo_C, Image_Level) == 0x000308, "Member 'UUMG_KillerInfo_C::Image_Level' has a wrong offset!");
static_assert(offsetof(UUMG_KillerInfo_C, TextBlock_Level) == 0x000310, "Member 'UUMG_KillerInfo_C::TextBlock_Level' has a wrong offset!");
static_assert(offsetof(UUMG_KillerInfo_C, TextBlock_PlayerName) == 0x000318, "Member 'UUMG_KillerInfo_C::TextBlock_PlayerName' has a wrong offset!");

}

