#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGamePerformancePage

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EndGamePerformancePage.UMG_EndGamePerformancePage_C
// 0x0030 (0x0368 - 0x0338)
class UUMG_EndGamePerformancePage_C final : public UPBEndGamePerformancePage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ProgressBar;                                       // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUMG_MatchMedal_C*                      UMG_MatchMedal;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SpaceCoinAdditional_C*             UMG_SpaceCoinAdditional;                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShouldStartPregressBarAnimation;                   // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartPercent;                                      // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndPercent;                                        // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ALPHA;                                             // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_EndGamePerformancePage(int32 EntryPoint);
	void K2_RefreshPage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EndGamePerformancePage_C">();
	}
	static class UUMG_EndGamePerformancePage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EndGamePerformancePage_C>();
	}
};
static_assert(alignof(UUMG_EndGamePerformancePage_C) == 0x000008, "Wrong alignment on UUMG_EndGamePerformancePage_C");
static_assert(sizeof(UUMG_EndGamePerformancePage_C) == 0x000368, "Wrong size on UUMG_EndGamePerformancePage_C");
static_assert(offsetof(UUMG_EndGamePerformancePage_C, UberGraphFrame) == 0x000338, "Member 'UUMG_EndGamePerformancePage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePerformancePage_C, ProgressBar) == 0x000340, "Member 'UUMG_EndGamePerformancePage_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePerformancePage_C, UMG_MatchMedal) == 0x000348, "Member 'UUMG_EndGamePerformancePage_C::UMG_MatchMedal' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePerformancePage_C, UMG_SpaceCoinAdditional) == 0x000350, "Member 'UUMG_EndGamePerformancePage_C::UMG_SpaceCoinAdditional' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePerformancePage_C, ShouldStartPregressBarAnimation) == 0x000358, "Member 'UUMG_EndGamePerformancePage_C::ShouldStartPregressBarAnimation' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePerformancePage_C, StartPercent) == 0x00035C, "Member 'UUMG_EndGamePerformancePage_C::StartPercent' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePerformancePage_C, EndPercent) == 0x000360, "Member 'UUMG_EndGamePerformancePage_C::EndPercent' has a wrong offset!");
static_assert(offsetof(UUMG_EndGamePerformancePage_C, ALPHA) == 0x000364, "Member 'UUMG_EndGamePerformancePage_C::ALPHA' has a wrong offset!");

}

