#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameUI_ScoreIcon

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_InGameUI_ScoreIcon.UMG_InGameUI_ScoreIcon_C
// 0x00E8 (0x0348 - 0x0260)
class UUMG_InGameUI_ScoreIcon_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       KilledPanel_Disappear;                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       KilledPanel_Show;                                  // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ZoneScore;                                         // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       KillType_Up;                                       // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       KIlltype_Disappear;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Disappear;                                    // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_276;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Kill_range;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           KilledPanel;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           killnamekilltype;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             killtype;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollText_C*                          ScrollText;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Score;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentScore;                                      // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetScore;                                       // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AddScoreTimer;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DisappearTimer;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DisappearDelay;                                    // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         score_increse_time;                                // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         multi_kill;                                        // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ShowTextArray;                                     // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           KillTypeTime;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           MedalsQueue;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_InGameUI_ScoreIcon(int32 EntryPoint);
	void WidgetAnimationEvt_KillType_Up_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_KIlltype_Disappear_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_Anim_Disappear_K2Node_WidgetAnimationEvent_0();
	void AddKillScore(float Kill_Distance, const class FText& kill_name);
	void AddScoreImpl();
	void FinishAddScore();
	void Disappear();
	void KilltypeDisappear();
	void AddScore(int32 AddedScore, const class FText& EventID);
	void KillInfoShow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_InGameUI_ScoreIcon_C">();
	}
	static class UUMG_InGameUI_ScoreIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_InGameUI_ScoreIcon_C>();
	}
};
static_assert(alignof(UUMG_InGameUI_ScoreIcon_C) == 0x000008, "Wrong alignment on UUMG_InGameUI_ScoreIcon_C");
static_assert(sizeof(UUMG_InGameUI_ScoreIcon_C) == 0x000348, "Wrong size on UUMG_InGameUI_ScoreIcon_C");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, UberGraphFrame) == 0x000260, "Member 'UUMG_InGameUI_ScoreIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, KilledPanel_Disappear) == 0x000268, "Member 'UUMG_InGameUI_ScoreIcon_C::KilledPanel_Disappear' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, KilledPanel_Show) == 0x000270, "Member 'UUMG_InGameUI_ScoreIcon_C::KilledPanel_Show' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, ZoneScore) == 0x000278, "Member 'UUMG_InGameUI_ScoreIcon_C::ZoneScore' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, KillType_Up) == 0x000280, "Member 'UUMG_InGameUI_ScoreIcon_C::KillType_Up' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, KIlltype_Disappear) == 0x000288, "Member 'UUMG_InGameUI_ScoreIcon_C::KIlltype_Disappear' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, Anim_Disappear) == 0x000290, "Member 'UUMG_InGameUI_ScoreIcon_C::Anim_Disappear' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, HorizontalBox_0) == 0x000298, "Member 'UUMG_InGameUI_ScoreIcon_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, Image) == 0x0002A0, "Member 'UUMG_InGameUI_ScoreIcon_C::Image' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, Image_1) == 0x0002A8, "Member 'UUMG_InGameUI_ScoreIcon_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, Image_2) == 0x0002B0, "Member 'UUMG_InGameUI_ScoreIcon_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, Image_276) == 0x0002B8, "Member 'UUMG_InGameUI_ScoreIcon_C::Image_276' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, InvalidationBox_0) == 0x0002C0, "Member 'UUMG_InGameUI_ScoreIcon_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, Kill_range) == 0x0002C8, "Member 'UUMG_InGameUI_ScoreIcon_C::Kill_range' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, KilledPanel) == 0x0002D0, "Member 'UUMG_InGameUI_ScoreIcon_C::KilledPanel' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, killnamekilltype) == 0x0002D8, "Member 'UUMG_InGameUI_ScoreIcon_C::killnamekilltype' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, killtype) == 0x0002E0, "Member 'UUMG_InGameUI_ScoreIcon_C::killtype' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, ScrollText) == 0x0002E8, "Member 'UUMG_InGameUI_ScoreIcon_C::ScrollText' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, TextBlock_Score) == 0x0002F0, "Member 'UUMG_InGameUI_ScoreIcon_C::TextBlock_Score' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, CurrentScore) == 0x0002F8, "Member 'UUMG_InGameUI_ScoreIcon_C::CurrentScore' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, TargetScore) == 0x0002FC, "Member 'UUMG_InGameUI_ScoreIcon_C::TargetScore' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, AddScoreTimer) == 0x000300, "Member 'UUMG_InGameUI_ScoreIcon_C::AddScoreTimer' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, DisappearTimer) == 0x000308, "Member 'UUMG_InGameUI_ScoreIcon_C::DisappearTimer' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, DisappearDelay) == 0x000310, "Member 'UUMG_InGameUI_ScoreIcon_C::DisappearDelay' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, score_increse_time) == 0x000314, "Member 'UUMG_InGameUI_ScoreIcon_C::score_increse_time' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, multi_kill) == 0x000318, "Member 'UUMG_InGameUI_ScoreIcon_C::multi_kill' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, ShowTextArray) == 0x000320, "Member 'UUMG_InGameUI_ScoreIcon_C::ShowTextArray' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, KillTypeTime) == 0x000330, "Member 'UUMG_InGameUI_ScoreIcon_C::KillTypeTime' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_ScoreIcon_C, MedalsQueue) == 0x000338, "Member 'UUMG_InGameUI_ScoreIcon_C::MedalsQueue' has a wrong offset!");

}

