#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_QuestInfoSeasonEXP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_QuestInfoSeasonEXP.UMG_QuestInfoSeasonEXP_C
// 0x0058 (0x02B8 - 0x0260)
class UUMG_QuestInfoSeasonEXP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BorderImage;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Btn;                                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ChallengeTextBlock;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentProgressText;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_330;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusImage;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Exp;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalProgressText;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_QuestInfoSeasonEXP(int32 EntryPoint);
	void BndEvt__UMG_QuestInfoSeasonEXP_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_QuestInfoSeasonEXP_Btn_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void RefreshInfo(const class FString& InActivityID, class FName InQuestID, int32 ExpPoint, EPBQuestModuleState QuestState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_QuestInfoSeasonEXP_C">();
	}
	static class UUMG_QuestInfoSeasonEXP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_QuestInfoSeasonEXP_C>();
	}
};
static_assert(alignof(UUMG_QuestInfoSeasonEXP_C) == 0x000008, "Wrong alignment on UUMG_QuestInfoSeasonEXP_C");
static_assert(sizeof(UUMG_QuestInfoSeasonEXP_C) == 0x0002B8, "Wrong size on UUMG_QuestInfoSeasonEXP_C");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, UberGraphFrame) == 0x000260, "Member 'UUMG_QuestInfoSeasonEXP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, BG) == 0x000268, "Member 'UUMG_QuestInfoSeasonEXP_C::BG' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, BorderImage) == 0x000270, "Member 'UUMG_QuestInfoSeasonEXP_C::BorderImage' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, Btn) == 0x000278, "Member 'UUMG_QuestInfoSeasonEXP_C::Btn' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, ChallengeTextBlock) == 0x000280, "Member 'UUMG_QuestInfoSeasonEXP_C::ChallengeTextBlock' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, CurrentProgressText) == 0x000288, "Member 'UUMG_QuestInfoSeasonEXP_C::CurrentProgressText' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, Image_330) == 0x000290, "Member 'UUMG_QuestInfoSeasonEXP_C::Image_330' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, ProgressBar) == 0x000298, "Member 'UUMG_QuestInfoSeasonEXP_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, StatusImage) == 0x0002A0, "Member 'UUMG_QuestInfoSeasonEXP_C::StatusImage' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, TextBlock_Exp) == 0x0002A8, "Member 'UUMG_QuestInfoSeasonEXP_C::TextBlock_Exp' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoSeasonEXP_C, TotalProgressText) == 0x0002B0, "Member 'UUMG_QuestInfoSeasonEXP_C::TotalProgressText' has a wrong offset!");

}

