#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_RedemptationPrompt

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_RedemptationPrompt.UMG_RedemptationPrompt_C.ExecuteUbergraph_UMG_RedemptationPrompt
// 0x0088 (0x0088 - 0x0000)
struct UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfirmPageButton_C*                   CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0068(0x0018)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt) == 0x000008, "Wrong alignment on UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt");
static_assert(sizeof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt) == 0x000088, "Wrong size on UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, EntryPoint) == 0x000000, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, Temp_struct_Variable) == 0x000004, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, Temp_struct_Variable_1) == 0x000014, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, Temp_struct_Variable_2) == 0x000024, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, CallFunc_Create_ReturnValue) == 0x000038, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000040, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, Temp_text_Variable) == 0x000068, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt, K2Node_Event_IsDesignTime) == 0x000080, "Member 'UMG_RedemptationPrompt_C_ExecuteUbergraph_UMG_RedemptationPrompt::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_RedemptationPrompt.UMG_RedemptationPrompt_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_RedemptationPrompt_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_RedemptationPrompt_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_RedemptationPrompt_C_PreConstruct");
static_assert(sizeof(UMG_RedemptationPrompt_C_PreConstruct) == 0x000001, "Wrong size on UMG_RedemptationPrompt_C_PreConstruct");
static_assert(offsetof(UMG_RedemptationPrompt_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_RedemptationPrompt_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_RedemptationPrompt.UMG_RedemptationPrompt_C.SetErrorReason
// 0x0018 (0x0018 - 0x0000)
struct UMG_RedemptationPrompt_C_SetErrorReason final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_RedemptationPrompt_C_SetErrorReason) == 0x000008, "Wrong alignment on UMG_RedemptationPrompt_C_SetErrorReason");
static_assert(sizeof(UMG_RedemptationPrompt_C_SetErrorReason) == 0x000018, "Wrong size on UMG_RedemptationPrompt_C_SetErrorReason");
static_assert(offsetof(UMG_RedemptationPrompt_C_SetErrorReason, InText) == 0x000000, "Member 'UMG_RedemptationPrompt_C_SetErrorReason::InText' has a wrong offset!");

}

