#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NewUnLockedItems

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.ExecuteUbergraph_UMG_NewUnLockedItems
// 0x0018 (0x0018 - 0x0000)
struct UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBArmoryManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems) == 0x000008, "Wrong alignment on UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems");
static_assert(sizeof(UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems) == 0x000018, "Wrong size on UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems");
static_assert(offsetof(UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems, EntryPoint) == 0x000000, "Member 'UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UMG_NewUnLockedItems_C_ExecuteUbergraph_UMG_NewUnLockedItems::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.GetMedalsCount
// 0x0008 (0x0008 - 0x0000)
struct UMG_NewUnLockedItems_C_GetMedalsCount final
{
public:
	class FName                                   MedalID;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NewUnLockedItems_C_GetMedalsCount) == 0x000004, "Wrong alignment on UMG_NewUnLockedItems_C_GetMedalsCount");
static_assert(sizeof(UMG_NewUnLockedItems_C_GetMedalsCount) == 0x000008, "Wrong size on UMG_NewUnLockedItems_C_GetMedalsCount");
static_assert(offsetof(UMG_NewUnLockedItems_C_GetMedalsCount, MedalID) == 0x000000, "Member 'UMG_NewUnLockedItems_C_GetMedalsCount::MedalID' has a wrong offset!");

// Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.SetDefaultFocus
// 0x0018 (0x0018 - 0x0000)
struct UMG_NewUnLockedItems_C_SetDefaultFocus final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChallengeGroupItem_C*                  K2Node_DynamicCast_AsChallenge_Group_Item;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NewUnLockedItems_C_SetDefaultFocus) == 0x000008, "Wrong alignment on UMG_NewUnLockedItems_C_SetDefaultFocus");
static_assert(sizeof(UMG_NewUnLockedItems_C_SetDefaultFocus) == 0x000018, "Wrong size on UMG_NewUnLockedItems_C_SetDefaultFocus");
static_assert(offsetof(UMG_NewUnLockedItems_C_SetDefaultFocus, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'UMG_NewUnLockedItems_C_SetDefaultFocus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewUnLockedItems_C_SetDefaultFocus, K2Node_DynamicCast_AsChallenge_Group_Item) == 0x000008, "Member 'UMG_NewUnLockedItems_C_SetDefaultFocus::K2Node_DynamicCast_AsChallenge_Group_Item' has a wrong offset!");
static_assert(offsetof(UMG_NewUnLockedItems_C_SetDefaultFocus, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UMG_NewUnLockedItems_C_SetDefaultFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_NewUnLockedItems_C_SetDefaultFocus, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'UMG_NewUnLockedItems_C_SetDefaultFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.ShowMedalDetails
// 0x0008 (0x0008 - 0x0000)
struct UMG_NewUnLockedItems_C_ShowMedalDetails final
{
public:
	class FName                                   InMedalID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NewUnLockedItems_C_ShowMedalDetails) == 0x000004, "Wrong alignment on UMG_NewUnLockedItems_C_ShowMedalDetails");
static_assert(sizeof(UMG_NewUnLockedItems_C_ShowMedalDetails) == 0x000008, "Wrong size on UMG_NewUnLockedItems_C_ShowMedalDetails");
static_assert(offsetof(UMG_NewUnLockedItems_C_ShowMedalDetails, InMedalID) == 0x000000, "Member 'UMG_NewUnLockedItems_C_ShowMedalDetails::InMedalID' has a wrong offset!");

// Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.SetCurrentIndex
// 0x0020 (0x0020 - 0x0000)
struct UMG_NewUnLockedItems_C_SetCurrentIndex final
{
public:
	int32                                         InSerialNumber;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(UMG_NewUnLockedItems_C_SetCurrentIndex) == 0x000008, "Wrong alignment on UMG_NewUnLockedItems_C_SetCurrentIndex");
static_assert(sizeof(UMG_NewUnLockedItems_C_SetCurrentIndex) == 0x000020, "Wrong size on UMG_NewUnLockedItems_C_SetCurrentIndex");
static_assert(offsetof(UMG_NewUnLockedItems_C_SetCurrentIndex, InSerialNumber) == 0x000000, "Member 'UMG_NewUnLockedItems_C_SetCurrentIndex::InSerialNumber' has a wrong offset!");
static_assert(offsetof(UMG_NewUnLockedItems_C_SetCurrentIndex, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_NewUnLockedItems_C_SetCurrentIndex::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.SetMaxCount
// 0x0020 (0x0020 - 0x0000)
struct UMG_NewUnLockedItems_C_SetMaxCount final
{
public:
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(UMG_NewUnLockedItems_C_SetMaxCount) == 0x000008, "Wrong alignment on UMG_NewUnLockedItems_C_SetMaxCount");
static_assert(sizeof(UMG_NewUnLockedItems_C_SetMaxCount) == 0x000020, "Wrong size on UMG_NewUnLockedItems_C_SetMaxCount");
static_assert(offsetof(UMG_NewUnLockedItems_C_SetMaxCount, CallFunc_Map_Length_ReturnValue) == 0x000000, "Member 'UMG_NewUnLockedItems_C_SetMaxCount::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewUnLockedItems_C_SetMaxCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_NewUnLockedItems_C_SetMaxCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

