#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_LocalPlayerDetail_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_LocalPlayerDetail_Widget.UMG_LocalPlayerDetail_Widget_C.ExecuteUbergraph_UMG_LocalPlayerDetail_Widget
// 0x0040 (0x0040 - 0x0000)
struct UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPBUserObject* UserObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBUserObject*                          K2Node_CustomEvent_UserObject;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBLocalPlayer*                         K2Node_DynamicCast_AsPBLocal_Player;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPBUserObject*                    CallFunc_GetLocalUserObject_ReturnValue;           // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget) == 0x000008, "Wrong alignment on UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget");
static_assert(sizeof(UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget) == 0x000040, "Wrong size on UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget");
static_assert(offsetof(UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget, EntryPoint) == 0x000000, "Member 'UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget, K2Node_CustomEvent_UserObject) == 0x000018, "Member 'UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget::K2Node_CustomEvent_UserObject' has a wrong offset!");
static_assert(offsetof(UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000020, "Member 'UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget, K2Node_DynamicCast_AsPBLocal_Player) == 0x000028, "Member 'UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget::K2Node_DynamicCast_AsPBLocal_Player' has a wrong offset!");
static_assert(offsetof(UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget, CallFunc_GetLocalUserObject_ReturnValue) == 0x000038, "Member 'UMG_LocalPlayerDetail_Widget_C_ExecuteUbergraph_UMG_LocalPlayerDetail_Widget::CallFunc_GetLocalUserObject_ReturnValue' has a wrong offset!");

// Function UMG_LocalPlayerDetail_Widget.UMG_LocalPlayerDetail_Widget_C.OnUserDataUpdate
// 0x0008 (0x0008 - 0x0000)
struct UMG_LocalPlayerDetail_Widget_C_OnUserDataUpdate final
{
public:
	class UPBUserObject*                          UserObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LocalPlayerDetail_Widget_C_OnUserDataUpdate) == 0x000008, "Wrong alignment on UMG_LocalPlayerDetail_Widget_C_OnUserDataUpdate");
static_assert(sizeof(UMG_LocalPlayerDetail_Widget_C_OnUserDataUpdate) == 0x000008, "Wrong size on UMG_LocalPlayerDetail_Widget_C_OnUserDataUpdate");
static_assert(offsetof(UMG_LocalPlayerDetail_Widget_C_OnUserDataUpdate, UserObject) == 0x000000, "Member 'UMG_LocalPlayerDetail_Widget_C_OnUserDataUpdate::UserObject' has a wrong offset!");

}

