#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FloatOptionItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.ExecuteUbergraph_UMG_FloatOptionItem
// 0x0078 (0x0078 - 0x0000)
struct UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Value)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText& Text, ETextCommit CommitMethod)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0058(0x0008)(NoDestructor)
	TDelegate<void(class FText& Text)>            K2Node_CreateDelegate_OutputDelegate_4;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bIsValid;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem) == 0x000008, "Wrong alignment on UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem");
static_assert(sizeof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem) == 0x000078, "Wrong size on UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, EntryPoint) == 0x000000, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, K2Node_Event_InFocusEvent) == 0x000058, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, K2Node_CreateDelegate_OutputDelegate_4) == 0x000060, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, K2Node_Event_bIsValid) == 0x000070, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::K2Node_Event_bIsValid' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem, K2Node_Event_IsDesignTime) == 0x000071, "Member 'UMG_FloatOptionItem_C_ExecuteUbergraph_UMG_FloatOptionItem::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_FloatOptionItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FloatOptionItem_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_FloatOptionItem_C_PreConstruct");
static_assert(sizeof(UMG_FloatOptionItem_C_PreConstruct) == 0x000001, "Wrong size on UMG_FloatOptionItem_C_PreConstruct");
static_assert(offsetof(UMG_FloatOptionItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_FloatOptionItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.K2_SetValid
// 0x0001 (0x0001 - 0x0000)
struct UMG_FloatOptionItem_C_K2_SetValid final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FloatOptionItem_C_K2_SetValid) == 0x000001, "Wrong alignment on UMG_FloatOptionItem_C_K2_SetValid");
static_assert(sizeof(UMG_FloatOptionItem_C_K2_SetValid) == 0x000001, "Wrong size on UMG_FloatOptionItem_C_K2_SetValid");
static_assert(offsetof(UMG_FloatOptionItem_C_K2_SetValid, bIsValid) == 0x000000, "Member 'UMG_FloatOptionItem_C_K2_SetValid::bIsValid' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_FloatOptionItem_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_FloatOptionItem_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_FloatOptionItem_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_FloatOptionItem_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_FloatOptionItem_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_FloatOptionItem_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_FloatOptionItem_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.OnPercentageValueChange
// 0x0004 (0x0004 - 0x0000)
struct UMG_FloatOptionItem_C_OnPercentageValueChange final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FloatOptionItem_C_OnPercentageValueChange) == 0x000004, "Wrong alignment on UMG_FloatOptionItem_C_OnPercentageValueChange");
static_assert(sizeof(UMG_FloatOptionItem_C_OnPercentageValueChange) == 0x000004, "Wrong size on UMG_FloatOptionItem_C_OnPercentageValueChange");
static_assert(offsetof(UMG_FloatOptionItem_C_OnPercentageValueChange, InValue) == 0x000000, "Member 'UMG_FloatOptionItem_C_OnPercentageValueChange::InValue' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.RefreshValueStyle
// 0x0040 (0x0040 - 0x0000)
struct UMG_FloatOptionItem_C_RefreshValueStyle final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0008(0x0018)()
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ValueToPercent_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FloatOptionItem_C_RefreshValueStyle) == 0x000008, "Wrong alignment on UMG_FloatOptionItem_C_RefreshValueStyle");
static_assert(sizeof(UMG_FloatOptionItem_C_RefreshValueStyle) == 0x000040, "Wrong size on UMG_FloatOptionItem_C_RefreshValueStyle");
static_assert(offsetof(UMG_FloatOptionItem_C_RefreshValueStyle, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_FloatOptionItem_C_RefreshValueStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_RefreshValueStyle, CallFunc_Conv_FloatToText_ReturnValue) == 0x000008, "Member 'UMG_FloatOptionItem_C_RefreshValueStyle::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_RefreshValueStyle, CallFunc_GetValue_ReturnValue) == 0x000020, "Member 'UMG_FloatOptionItem_C_RefreshValueStyle::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_RefreshValueStyle, CallFunc_ValueToPercent_ReturnValue) == 0x000024, "Member 'UMG_FloatOptionItem_C_RefreshValueStyle::CallFunc_ValueToPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_RefreshValueStyle, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'UMG_FloatOptionItem_C_RefreshValueStyle::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_RefreshValueStyle, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'UMG_FloatOptionItem_C_RefreshValueStyle::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_RefreshValueStyle, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000038, "Member 'UMG_FloatOptionItem_C_RefreshValueStyle::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.OnTextCommitted
// 0x0038 (0x0038 - 0x0000)
struct UMG_FloatOptionItem_C_OnTextCommitted final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FloatOptionItem_C_OnTextCommitted) == 0x000008, "Wrong alignment on UMG_FloatOptionItem_C_OnTextCommitted");
static_assert(sizeof(UMG_FloatOptionItem_C_OnTextCommitted) == 0x000038, "Wrong size on UMG_FloatOptionItem_C_OnTextCommitted");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextCommitted, Text) == 0x000000, "Member 'UMG_FloatOptionItem_C_OnTextCommitted::Text' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextCommitted, CommitMethod) == 0x000018, "Member 'UMG_FloatOptionItem_C_OnTextCommitted::CommitMethod' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextCommitted, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'UMG_FloatOptionItem_C_OnTextCommitted::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextCommitted, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'UMG_FloatOptionItem_C_OnTextCommitted::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextCommitted, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000030, "Member 'UMG_FloatOptionItem_C_OnTextCommitted::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextCommitted, CallFunc_GetValue_ReturnValue) == 0x000034, "Member 'UMG_FloatOptionItem_C_OnTextCommitted::CallFunc_GetValue_ReturnValue' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.OnTextChanged
// 0x0060 (0x0060 - 0x0000)
struct UMG_FloatOptionItem_C_OnTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 InputString;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NewInputChar;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidInput_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTextLength_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TruncateText_ReturnValue;                 // 0x0048(0x0018)()
};
static_assert(alignof(UMG_FloatOptionItem_C_OnTextChanged) == 0x000008, "Wrong alignment on UMG_FloatOptionItem_C_OnTextChanged");
static_assert(sizeof(UMG_FloatOptionItem_C_OnTextChanged) == 0x000060, "Wrong size on UMG_FloatOptionItem_C_OnTextChanged");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextChanged, Text) == 0x000000, "Member 'UMG_FloatOptionItem_C_OnTextChanged::Text' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextChanged, InputString) == 0x000018, "Member 'UMG_FloatOptionItem_C_OnTextChanged::InputString' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextChanged, NewInputChar) == 0x000028, "Member 'UMG_FloatOptionItem_C_OnTextChanged::NewInputChar' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextChanged, CallFunc_IsValidInput_ReturnValue) == 0x000038, "Member 'UMG_FloatOptionItem_C_OnTextChanged::CallFunc_IsValidInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextChanged, CallFunc_GetTextLength_ReturnValue) == 0x00003C, "Member 'UMG_FloatOptionItem_C_OnTextChanged::CallFunc_GetTextLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextChanged, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'UMG_FloatOptionItem_C_OnTextChanged::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnTextChanged, CallFunc_TruncateText_ReturnValue) == 0x000048, "Member 'UMG_FloatOptionItem_C_OnTextChanged::CallFunc_TruncateText_ReturnValue' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.OnKeyDown
// 0x0460 (0x0460 - 0x0000)
struct UMG_FloatOptionItem_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   InKey;                                             // 0x0128(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0140(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_4;          // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15F[0x1];                                      // 0x015F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChangeValue_ReturnValue;               // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChangeValue_ReturnValue_1;             // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0238(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_2;                    // 0x02F0(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x03A8(0x00B8)()
};
static_assert(alignof(UMG_FloatOptionItem_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_FloatOptionItem_C_OnKeyDown");
static_assert(sizeof(UMG_FloatOptionItem_C_OnKeyDown) == 0x000460, "Wrong size on UMG_FloatOptionItem_C_OnKeyDown");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_FloatOptionItem_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_FloatOptionItem_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_FloatOptionItem_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, InKey) == 0x000128, "Member 'UMG_FloatOptionItem_C_OnKeyDown::InKey' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000140, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000158, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000159, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_BooleanOR_ReturnValue) == 0x00015A, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x00015B, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x00015C, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_BooleanOR_ReturnValue_1) == 0x00015D, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_4) == 0x00015E, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_GetTimeSeconds_ReturnValue) == 0x000160, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000220, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_GetChangeValue_ReturnValue) == 0x000224, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_GetChangeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_GetChangeValue_ReturnValue_1) == 0x000228, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_GetChangeValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00022C, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_Add_FloatFloat_ReturnValue) == 0x000230, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_Handled_ReturnValue_1) == 0x000238, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_Handled_ReturnValue_2) == 0x0002F0, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_Handled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x0003A8, "Member 'UMG_FloatOptionItem_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.OnKeyUp
// 0x02E0 (0x02E0 - 0x0000)
struct UMG_FloatOptionItem_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   InKey;                                             // 0x0128(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0140(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0220(0x00B8)()
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FloatOptionItem_C_OnKeyUp) == 0x000008, "Wrong alignment on UMG_FloatOptionItem_C_OnKeyUp");
static_assert(sizeof(UMG_FloatOptionItem_C_OnKeyUp) == 0x0002E0, "Wrong size on UMG_FloatOptionItem_C_OnKeyUp");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'UMG_FloatOptionItem_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'UMG_FloatOptionItem_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, ReturnValue) == 0x000070, "Member 'UMG_FloatOptionItem_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, InKey) == 0x000128, "Member 'UMG_FloatOptionItem_C_OnKeyUp::InKey' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x000140, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000158, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000159, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x00015A, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x00015B, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue) == 0x000218, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue_1) == 0x000219, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x000220, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue_2) == 0x0002D8, "Member 'UMG_FloatOptionItem_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function UMG_FloatOptionItem.UMG_FloatOptionItem_C.GetChangeValue
// 0x0028 (0x0028 - 0x0000)
struct UMG_FloatOptionItem_C_GetChangeValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FloatOptionItem_C_GetChangeValue) == 0x000008, "Wrong alignment on UMG_FloatOptionItem_C_GetChangeValue");
static_assert(sizeof(UMG_FloatOptionItem_C_GetChangeValue) == 0x000028, "Wrong size on UMG_FloatOptionItem_C_GetChangeValue");
static_assert(offsetof(UMG_FloatOptionItem_C_GetChangeValue, ReturnValue) == 0x000000, "Member 'UMG_FloatOptionItem_C_GetChangeValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_GetChangeValue, CallFunc_GetTimeSeconds_ReturnValue) == 0x000004, "Member 'UMG_FloatOptionItem_C_GetChangeValue::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FloatOptionItem_C_GetChangeValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'UMG_FloatOptionItem_C_GetChangeValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
