#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Benchmark_Start

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_Benchmark_Start.UMG_Benchmark_Start_C.ExecuteUbergraph_UMG_Benchmark_Start
// 0x0038 (0x0038 - 0x0000)
struct UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBGameInstance*                        K2Node_DynamicCast_AsPBGame_Instance;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBLocalPlayer*                         K2Node_DynamicCast_AsPBLocal_Player;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start) == 0x000008, "Wrong alignment on UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start");
static_assert(sizeof(UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start) == 0x000038, "Wrong size on UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start");
static_assert(offsetof(UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start, EntryPoint) == 0x000000, "Member 'UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000010, "Member 'UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start, K2Node_DynamicCast_AsPBGame_Instance) == 0x000018, "Member 'UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start::K2Node_DynamicCast_AsPBGame_Instance' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start, K2Node_DynamicCast_AsPBLocal_Player) == 0x000028, "Member 'UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start::K2Node_DynamicCast_AsPBLocal_Player' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'UMG_Benchmark_Start_C_ExecuteUbergraph_UMG_Benchmark_Start::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

