#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_StoreBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_StoreBase.UMG_StoreBase_C.ExecuteUbergraph_UMG_StoreBase
// 0x0004 (0x0004 - 0x0000)
struct UMG_StoreBase_C_ExecuteUbergraph_UMG_StoreBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_StoreBase_C_ExecuteUbergraph_UMG_StoreBase) == 0x000004, "Wrong alignment on UMG_StoreBase_C_ExecuteUbergraph_UMG_StoreBase");
static_assert(sizeof(UMG_StoreBase_C_ExecuteUbergraph_UMG_StoreBase) == 0x000004, "Wrong size on UMG_StoreBase_C_ExecuteUbergraph_UMG_StoreBase");
static_assert(offsetof(UMG_StoreBase_C_ExecuteUbergraph_UMG_StoreBase, EntryPoint) == 0x000000, "Member 'UMG_StoreBase_C_ExecuteUbergraph_UMG_StoreBase::EntryPoint' has a wrong offset!");

// Function UMG_StoreBase.UMG_StoreBase_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_StoreBase_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_StoreBase_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_StoreBase_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_StoreBase_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_StoreBase_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_StoreBase_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_StoreBase_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

