#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PurchaseInBlackMarketPrompt

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_PurchaseInBlackMarketPrompt.UMG_PurchaseInBlackMarketPrompt_C.ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt
// 0x0030 (0x0030 - 0x0000)
struct UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBStoreManagerV2*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBStoreManagerV2*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasSuccessful, EPBStoreResponse StoreException)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt) == 0x000008, "Wrong alignment on UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt");
static_assert(sizeof(UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt) == 0x000030, "Wrong size on UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt, EntryPoint) == 0x000000, "Member 'UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000028, "Member 'UMG_PurchaseInBlackMarketPrompt_C_ExecuteUbergraph_UMG_PurchaseInBlackMarketPrompt::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_PurchaseInBlackMarketPrompt.UMG_PurchaseInBlackMarketPrompt_C.UMG Purchase Prompt Auto Gen Func
// 0x0060 (0x0060 - 0x0000)
struct UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBStoreResponse                              StoreException;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_StorePurchasePromptFailed_C*       K2Node_DynamicCast_AsUMG_Store_Purchase_Prompt_Failed; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_StorePurchasePromptFailed_C*       K2Node_DynamicCast_AsUMG_Store_Purchase_Prompt_Failed_1; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue_2;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSoundManager_BP_C*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func) == 0x000008, "Wrong alignment on UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func");
static_assert(sizeof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func) == 0x000060, "Wrong size on UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, bWasSuccessful) == 0x000000, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, StoreException) == 0x000001, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::StoreException' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000018, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, CallFunc_PushNormalPrompt_ReturnValue) == 0x000020, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::CallFunc_PushNormalPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, K2Node_DynamicCast_AsUMG_Store_Purchase_Prompt_Failed) == 0x000028, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::K2Node_DynamicCast_AsUMG_Store_Purchase_Prompt_Failed' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, CallFunc_PushNormalPrompt_ReturnValue_1) == 0x000038, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::CallFunc_PushNormalPrompt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, K2Node_DynamicCast_AsUMG_Store_Purchase_Prompt_Failed_1) == 0x000040, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::K2Node_DynamicCast_AsUMG_Store_Purchase_Prompt_Failed_1' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, CallFunc_PushNormalPrompt_ReturnValue_2) == 0x000050, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::CallFunc_PushNormalPrompt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UMG_Purchase_Prompt_Auto_Gen_Func::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_PurchaseInBlackMarketPrompt.UMG_PurchaseInBlackMarketPrompt_C.UpdateWidget
// 0x0090 (0x0090 - 0x0000)
struct UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget final
{
public:
	class FText                                   ItemName;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   BoudaryCoin;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   SpaceCoin;                                         // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EPBItemType                                   ItemType;                                          // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              InTexture;                                         // 0x0050(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EPBItemGradeType                              InGradeType;                                       // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget) == 0x000008, "Wrong alignment on UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget");
static_assert(sizeof(UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget) == 0x000090, "Wrong size on UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget, ItemName) == 0x000000, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget::ItemName' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget, BoudaryCoin) == 0x000018, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget::BoudaryCoin' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget, SpaceCoin) == 0x000030, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget::SpaceCoin' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget, ItemType) == 0x000048, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget::ItemType' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget, InTexture) == 0x000050, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget::InTexture' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget, InGradeType) == 0x000078, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget::InGradeType' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'UMG_PurchaseInBlackMarketPrompt_C_UpdateWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function UMG_PurchaseInBlackMarketPrompt.UMG_PurchaseInBlackMarketPrompt_C.TriggerUISound
// 0x0010 (0x0010 - 0x0000)
struct UMG_PurchaseInBlackMarketPrompt_C_TriggerUISound final
{
public:
	class UPBSoundManager_BP_C*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PurchaseInBlackMarketPrompt_C_TriggerUISound) == 0x000008, "Wrong alignment on UMG_PurchaseInBlackMarketPrompt_C_TriggerUISound");
static_assert(sizeof(UMG_PurchaseInBlackMarketPrompt_C_TriggerUISound) == 0x000010, "Wrong size on UMG_PurchaseInBlackMarketPrompt_C_TriggerUISound");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_TriggerUISound, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_PurchaseInBlackMarketPrompt_C_TriggerUISound::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_TriggerUISound, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'UMG_PurchaseInBlackMarketPrompt_C_TriggerUISound::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_PurchaseInBlackMarketPrompt.UMG_PurchaseInBlackMarketPrompt_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_PurchaseInBlackMarketPrompt_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PurchaseInBlackMarketPrompt_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_PurchaseInBlackMarketPrompt_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_PurchaseInBlackMarketPrompt_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_PurchaseInBlackMarketPrompt_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_PurchaseInBlackMarketPrompt_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_PurchaseInBlackMarketPrompt_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

