#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_IngameHUD_Heat

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_IngameHUD_Heat.UMG_IngameHUD_Heat_C.ExecuteUbergraph_UMG_IngameHUD_Heat
// 0x0090 (0x0090 - 0x0000)
struct UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon*                              CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBVehicle*                             CallFunc_GetCurrentVehicle_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABasicPackBP_C*                         K2Node_DynamicCast_AsBasic_Pack_BP;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat) == 0x000008, "Wrong alignment on UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat");
static_assert(sizeof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat) == 0x000090, "Wrong size on UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, EntryPoint) == 0x000000, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, K2Node_DynamicCast_AsPBCharacter) == 0x000020, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::K2Node_DynamicCast_AsPBCharacter' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, K2Node_Event_MyGeometry) == 0x00002C, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, K2Node_Event_InDeltaTime) == 0x000064, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000068, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_GetCurrentVehicle_ReturnValue) == 0x000070, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_GetCurrentVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, K2Node_DynamicCast_AsBasic_Pack_BP) == 0x000078, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::K2Node_DynamicCast_AsBasic_Pack_BP' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_IsValid_ReturnValue_2) == 0x000082, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000084, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000088, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00008C, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_IsVisible_ReturnValue) == 0x00008D, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat, CallFunc_IsVisible_ReturnValue_1) == 0x00008E, "Member 'UMG_IngameHUD_Heat_C_ExecuteUbergraph_UMG_IngameHUD_Heat::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");

// Function UMG_IngameHUD_Heat.UMG_IngameHUD_Heat_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_IngameHUD_Heat_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_IngameHUD_Heat_C_Tick) == 0x000004, "Wrong alignment on UMG_IngameHUD_Heat_C_Tick");
static_assert(sizeof(UMG_IngameHUD_Heat_C_Tick) == 0x00003C, "Wrong size on UMG_IngameHUD_Heat_C_Tick");
static_assert(offsetof(UMG_IngameHUD_Heat_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_IngameHUD_Heat_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_IngameHUD_Heat_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_IngameHUD_Heat.UMG_IngameHUD_Heat_C.GetBigestHeat
// 0x0030 (0x0030 - 0x0000)
struct UMG_IngameHUD_Heat_C_GetBigestHeat final
{
public:
	float                                         LocalMaxHeat;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_IngameHUD_Heat_C_GetBigestHeat) == 0x000008, "Wrong alignment on UMG_IngameHUD_Heat_C_GetBigestHeat");
static_assert(sizeof(UMG_IngameHUD_Heat_C_GetBigestHeat) == 0x000030, "Wrong size on UMG_IngameHUD_Heat_C_GetBigestHeat");
static_assert(offsetof(UMG_IngameHUD_Heat_C_GetBigestHeat, LocalMaxHeat) == 0x000000, "Member 'UMG_IngameHUD_Heat_C_GetBigestHeat::LocalMaxHeat' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_GetBigestHeat, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_IngameHUD_Heat_C_GetBigestHeat::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_GetBigestHeat, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_IngameHUD_Heat_C_GetBigestHeat::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_GetBigestHeat, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_IngameHUD_Heat_C_GetBigestHeat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_GetBigestHeat, K2Node_MakeArray_Array) == 0x000010, "Member 'UMG_IngameHUD_Heat_C_GetBigestHeat::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_GetBigestHeat, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'UMG_IngameHUD_Heat_C_GetBigestHeat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_GetBigestHeat, CallFunc_Array_Get_Item) == 0x000024, "Member 'UMG_IngameHUD_Heat_C_GetBigestHeat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_GetBigestHeat, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'UMG_IngameHUD_Heat_C_GetBigestHeat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_GetBigestHeat, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000029, "Member 'UMG_IngameHUD_Heat_C_GetBigestHeat::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function UMG_IngameHUD_Heat.UMG_IngameHUD_Heat_C.SetBarColor
// 0x0024 (0x0024 - 0x0000)
struct UMG_IngameHUD_Heat_C_SetBarColor final
{
public:
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_IngameHUD_Heat_C_SetBarColor) == 0x000004, "Wrong alignment on UMG_IngameHUD_Heat_C_SetBarColor");
static_assert(sizeof(UMG_IngameHUD_Heat_C_SetBarColor) == 0x000024, "Wrong size on UMG_IngameHUD_Heat_C_SetBarColor");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetBarColor, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000000, "Member 'UMG_IngameHUD_Heat_C_SetBarColor::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetBarColor, CallFunc_LinearColorLerp_ReturnValue) == 0x000004, "Member 'UMG_IngameHUD_Heat_C_SetBarColor::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetBarColor, K2Node_MakeStruct_LinearColor) == 0x000014, "Member 'UMG_IngameHUD_Heat_C_SetBarColor::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function UMG_IngameHUD_Heat.UMG_IngameHUD_Heat_C.SetHeatCircleSize
// 0x0028 (0x0028 - 0x0000)
struct UMG_IngameHUD_Heat_C_SetHeatCircleSize final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_IngameHUD_Heat_C_SetHeatCircleSize) == 0x000008, "Wrong alignment on UMG_IngameHUD_Heat_C_SetHeatCircleSize");
static_assert(sizeof(UMG_IngameHUD_Heat_C_SetHeatCircleSize) == 0x000028, "Wrong size on UMG_IngameHUD_Heat_C_SetHeatCircleSize");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetHeatCircleSize, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_IngameHUD_Heat_C_SetHeatCircleSize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetHeatCircleSize, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'UMG_IngameHUD_Heat_C_SetHeatCircleSize::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetHeatCircleSize, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'UMG_IngameHUD_Heat_C_SetHeatCircleSize::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetHeatCircleSize, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'UMG_IngameHUD_Heat_C_SetHeatCircleSize::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetHeatCircleSize, CallFunc_GetFloatValue_ReturnValue) == 0x000018, "Member 'UMG_IngameHUD_Heat_C_SetHeatCircleSize::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetHeatCircleSize, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'UMG_IngameHUD_Heat_C_SetHeatCircleSize::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_Heat_C_SetHeatCircleSize, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000020, "Member 'UMG_IngameHUD_Heat_C_SetHeatCircleSize::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");

}

