#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_RedemptionCodeRewardItem

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_RedemptionCodeRewardItem.UMG_RedemptionCodeRewardItem_C.DisplayItem
// 0x00D8 (0x00D8 - 0x0000)
struct UMG_RedemptionCodeRewardItem_C_DisplayItem final
{
public:
	class FName                                   InItemID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBDataTableManager*                    CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemDescription                     CallFunc_GetItemDescription_ReturnValue;           // 0x0010(0x00B0)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_RedemptionCodeRewardItem_C_DisplayItem) == 0x000008, "Wrong alignment on UMG_RedemptionCodeRewardItem_C_DisplayItem");
static_assert(sizeof(UMG_RedemptionCodeRewardItem_C_DisplayItem) == 0x0000D8, "Wrong size on UMG_RedemptionCodeRewardItem_C_DisplayItem");
static_assert(offsetof(UMG_RedemptionCodeRewardItem_C_DisplayItem, InItemID) == 0x000000, "Member 'UMG_RedemptionCodeRewardItem_C_DisplayItem::InItemID' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeRewardItem_C_DisplayItem, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'UMG_RedemptionCodeRewardItem_C_DisplayItem::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeRewardItem_C_DisplayItem, CallFunc_GetItemDescription_ReturnValue) == 0x000010, "Member 'UMG_RedemptionCodeRewardItem_C_DisplayItem::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeRewardItem_C_DisplayItem, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000C0, "Member 'UMG_RedemptionCodeRewardItem_C_DisplayItem::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeRewardItem_C_DisplayItem, K2Node_DynamicCast_AsTexture_2D) == 0x0000C8, "Member 'UMG_RedemptionCodeRewardItem_C_DisplayItem::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeRewardItem_C_DisplayItem, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'UMG_RedemptionCodeRewardItem_C_DisplayItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

