#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_BlackMarketCountDown

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_BlackMarketCountDown.UMG_BlackMarketCountDown_C.ExecuteUbergraph_UMG_BlackMarketCountDown
// 0x0004 (0x0004 - 0x0000)
struct UMG_BlackMarketCountDown_C_ExecuteUbergraph_UMG_BlackMarketCountDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_BlackMarketCountDown_C_ExecuteUbergraph_UMG_BlackMarketCountDown) == 0x000004, "Wrong alignment on UMG_BlackMarketCountDown_C_ExecuteUbergraph_UMG_BlackMarketCountDown");
static_assert(sizeof(UMG_BlackMarketCountDown_C_ExecuteUbergraph_UMG_BlackMarketCountDown) == 0x000004, "Wrong size on UMG_BlackMarketCountDown_C_ExecuteUbergraph_UMG_BlackMarketCountDown");
static_assert(offsetof(UMG_BlackMarketCountDown_C_ExecuteUbergraph_UMG_BlackMarketCountDown, EntryPoint) == 0x000000, "Member 'UMG_BlackMarketCountDown_C_ExecuteUbergraph_UMG_BlackMarketCountDown::EntryPoint' has a wrong offset!");

// Function UMG_BlackMarketCountDown.UMG_BlackMarketCountDown_C.DisplayDay
// 0x0038 (0x0038 - 0x0000)
struct UMG_BlackMarketCountDown_C_DisplayDay final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0020(0x0018)()
};
static_assert(alignof(UMG_BlackMarketCountDown_C_DisplayDay) == 0x000008, "Wrong alignment on UMG_BlackMarketCountDown_C_DisplayDay");
static_assert(sizeof(UMG_BlackMarketCountDown_C_DisplayDay) == 0x000038, "Wrong size on UMG_BlackMarketCountDown_C_DisplayDay");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplayDay, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'UMG_BlackMarketCountDown_C_DisplayDay::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplayDay, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'UMG_BlackMarketCountDown_C_DisplayDay::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplayDay, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000020, "Member 'UMG_BlackMarketCountDown_C_DisplayDay::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function UMG_BlackMarketCountDown.UMG_BlackMarketCountDown_C.DisplaySecond
// 0x00C8 (0x00C8 - 0x0000)
struct UMG_BlackMarketCountDown_C_DisplaySecond final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0058(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00B0(0x0018)()
};
static_assert(alignof(UMG_BlackMarketCountDown_C_DisplaySecond) == 0x000008, "Wrong alignment on UMG_BlackMarketCountDown_C_DisplaySecond");
static_assert(sizeof(UMG_BlackMarketCountDown_C_DisplaySecond) == 0x0000C8, "Wrong size on UMG_BlackMarketCountDown_C_DisplaySecond");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000058, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000070, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_BlackMarketCountDown_C_DisplaySecond, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0000B0, "Member 'UMG_BlackMarketCountDown_C_DisplaySecond::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");

}

