#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameTeamScoreWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_EndGameTeamScoreWidget.UMG_EndGameTeamScoreWidget_C.ExecuteUbergraph_UMG_EndGameTeamScoreWidget
// 0x0008 (0x0008 - 0x0000)
struct UMG_EndGameTeamScoreWidget_C_ExecuteUbergraph_UMG_EndGameTeamScoreWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EndGameTeamScoreWidget_C_ExecuteUbergraph_UMG_EndGameTeamScoreWidget) == 0x000004, "Wrong alignment on UMG_EndGameTeamScoreWidget_C_ExecuteUbergraph_UMG_EndGameTeamScoreWidget");
static_assert(sizeof(UMG_EndGameTeamScoreWidget_C_ExecuteUbergraph_UMG_EndGameTeamScoreWidget) == 0x000008, "Wrong size on UMG_EndGameTeamScoreWidget_C_ExecuteUbergraph_UMG_EndGameTeamScoreWidget");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_ExecuteUbergraph_UMG_EndGameTeamScoreWidget, EntryPoint) == 0x000000, "Member 'UMG_EndGameTeamScoreWidget_C_ExecuteUbergraph_UMG_EndGameTeamScoreWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_ExecuteUbergraph_UMG_EndGameTeamScoreWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_EndGameTeamScoreWidget_C_ExecuteUbergraph_UMG_EndGameTeamScoreWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_EndGameTeamScoreWidget.UMG_EndGameTeamScoreWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_EndGameTeamScoreWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EndGameTeamScoreWidget_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_EndGameTeamScoreWidget_C_PreConstruct");
static_assert(sizeof(UMG_EndGameTeamScoreWidget_C_PreConstruct) == 0x000001, "Wrong size on UMG_EndGameTeamScoreWidget_C_PreConstruct");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_EndGameTeamScoreWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_EndGameTeamScoreWidget.UMG_EndGameTeamScoreWidget_C.RefreshWidget
// 0x0170 (0x0170 - 0x0000)
struct UMG_EndGameTeamScoreWidget_C_RefreshWidget final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0060(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00B8(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value;                           // 0x00E8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0118(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0130(0x0018)()
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_1;                           // 0x0148(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EndGameTeamScoreWidget_C_RefreshWidget) == 0x000008, "Wrong alignment on UMG_EndGameTeamScoreWidget_C_RefreshWidget");
static_assert(sizeof(UMG_EndGameTeamScoreWidget_C_RefreshWidget) == 0x000170, "Wrong size on UMG_EndGameTeamScoreWidget_C_RefreshWidget");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, Temp_text_Variable) == 0x000000, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, Temp_text_Variable_1) == 0x000018, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, Temp_bool_Variable) == 0x000030, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, Temp_softobject_Variable) == 0x000038, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, Temp_softobject_Variable_1) == 0x000060, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, Temp_bool_Variable_1) == 0x000088, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, K2Node_SwitchInteger_CmpSuccess) == 0x000089, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, K2Node_MakeStruct_SlateColor_1) == 0x0000B8, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, K2Node_SwitchEnum_CmpSuccess) == 0x0000E0, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, CallFunc_Map_Find_Value) == 0x0000E8, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, CallFunc_Map_Find_ReturnValue) == 0x000110, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, K2Node_Select_Default) == 0x000118, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000130, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameTeamScoreWidget_C_RefreshWidget, K2Node_Select_Default_1) == 0x000148, "Member 'UMG_EndGameTeamScoreWidget_C_RefreshWidget::K2Node_Select_Default_1' has a wrong offset!");

}

