#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NotificationPage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_NotificationPage.UMG_NotificationPage_C.ExecuteUbergraph_UMG_NotificationPage
// 0x0030 (0x0030 - 0x0000)
struct UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 CurrentSelectIndex, int32 LastSelectIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SelectItemByIndex_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CurrentSelectIndex;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LastSelectIndex;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage) == 0x000008, "Wrong alignment on UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage");
static_assert(sizeof(UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage) == 0x000030, "Wrong size on UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage");
static_assert(offsetof(UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage, EntryPoint) == 0x000000, "Member 'UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage, CallFunc_SelectItemByIndex_ReturnValue) == 0x000014, "Member 'UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage::CallFunc_SelectItemByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage, K2Node_CustomEvent_CurrentSelectIndex) == 0x000018, "Member 'UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage::K2Node_CustomEvent_CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage, K2Node_CustomEvent_LastSelectIndex) == 0x00001C, "Member 'UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage::K2Node_CustomEvent_LastSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'UMG_NotificationPage_C_ExecuteUbergraph_UMG_NotificationPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_NotificationPage.UMG_NotificationPage_C.OnItemChange
// 0x0008 (0x0008 - 0x0000)
struct UMG_NotificationPage_C_OnItemChange final
{
public:
	int32                                         CurrentSelectIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSelectIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NotificationPage_C_OnItemChange) == 0x000004, "Wrong alignment on UMG_NotificationPage_C_OnItemChange");
static_assert(sizeof(UMG_NotificationPage_C_OnItemChange) == 0x000008, "Wrong size on UMG_NotificationPage_C_OnItemChange");
static_assert(offsetof(UMG_NotificationPage_C_OnItemChange, CurrentSelectIndex) == 0x000000, "Member 'UMG_NotificationPage_C_OnItemChange::CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnItemChange, LastSelectIndex) == 0x000004, "Member 'UMG_NotificationPage_C_OnItemChange::LastSelectIndex' has a wrong offset!");

// Function UMG_NotificationPage.UMG_NotificationPage_C.RefreshPageInfo
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_NotificationPage_C_RefreshPageInfo final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBNotification                        Notification;                                      // 0x0008(0x0038)(Edit, BlueprintVisible)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUMG_NotificationBanner_C* Notification)> K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00D0(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_NotificationCard_C*                CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_NotificationBanner_C*              CallFunc_Create_ReturnValue_1;                     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBNotification                        CallFunc_Array_Get_Item;                           // 0x0130(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot_1;            // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x018C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x019C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NotificationPage_C_RefreshPageInfo) == 0x000008, "Wrong alignment on UMG_NotificationPage_C_RefreshPageInfo");
static_assert(sizeof(UMG_NotificationPage_C_RefreshPageInfo) == 0x0001B0, "Wrong size on UMG_NotificationPage_C_RefreshPageInfo");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, Index_0) == 0x000000, "Member 'UMG_NotificationPage_C_RefreshPageInfo::Index_0' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, Notification) == 0x000008, "Member 'UMG_NotificationPage_C_RefreshPageInfo::Notification' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, Temp_byte_Variable) == 0x000040, "Member 'UMG_NotificationPage_C_RefreshPageInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_MakeStruct_Margin) == 0x000044, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_MakeStruct_Margin_1) == 0x000054, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, Temp_int_Array_Index_Variable) == 0x000064, "Member 'UMG_NotificationPage_C_RefreshPageInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'UMG_NotificationPage_C_RefreshPageInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, Temp_byte_Variable_1) == 0x000070, "Member 'UMG_NotificationPage_C_RefreshPageInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000090, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000094, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000098, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000099, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B8, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000D0, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E8, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, Temp_bool_Variable) == 0x0000F0, "Member 'UMG_NotificationPage_C_RefreshPageInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_AddChild_ReturnValue) == 0x000100, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_Select_Default) == 0x000108, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000110, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000120, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Create_ReturnValue_1) == 0x000128, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Array_Get_Item) == 0x000130, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Array_Length_ReturnValue_2) == 0x000168, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Less_IntInt_ReturnValue) == 0x00016C, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_AddChild_ReturnValue_1) == 0x000170, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_DynamicCast_AsScroll_Box_Slot_1) == 0x000178, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_DynamicCast_AsScroll_Box_Slot_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Add_FloatFloat_ReturnValue) == 0x000184, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000188, "Member 'UMG_NotificationPage_C_RefreshPageInfo::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_MakeStruct_Margin_2) == 0x00018C, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_RefreshPageInfo, K2Node_MakeStruct_Margin_3) == 0x00019C, "Member 'UMG_NotificationPage_C_RefreshPageInfo::K2Node_MakeStruct_Margin_3' has a wrong offset!");

// Function UMG_NotificationPage.UMG_NotificationPage_C.OnKeyDown
// 0x0490 (0x0490 - 0x0000)
struct UMG_NotificationPage_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   Key;                                               // 0x0128(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0140(0x0018)(HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue;  // 0x0218(0x0010)(ReferenceParm)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0230(0x00B8)()
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_1; // 0x02E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_2;         // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0308(0x00B8)()
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_2; // 0x03C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue_2;                    // 0x03D8(0x00B8)()
};
static_assert(alignof(UMG_NotificationPage_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_NotificationPage_C_OnKeyDown");
static_assert(sizeof(UMG_NotificationPage_C_OnKeyDown) == 0x000490, "Wrong size on UMG_NotificationPage_C_OnKeyDown");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_NotificationPage_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_NotificationPage_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_NotificationPage_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, Key) == 0x000128, "Member 'UMG_NotificationPage_C_OnKeyDown::Key' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000140, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000158, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue) == 0x000218, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000228, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_Handled_ReturnValue_1) == 0x000230, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_1) == 0x0002E8, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue) == 0x0002F8, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue_1) == 0x0002F9, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue_2) == 0x000300, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000308, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_2) == 0x0003C0, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue_2) == 0x0003D0, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_OnKeyDown, CallFunc_Handled_ReturnValue_2) == 0x0003D8, "Member 'UMG_NotificationPage_C_OnKeyDown::CallFunc_Handled_ReturnValue_2' has a wrong offset!");

// Function UMG_NotificationPage.UMG_NotificationPage_C.GetBannerPadding
// 0x0010 (0x0010 - 0x0000)
struct UMG_NotificationPage_C_GetBannerPadding final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BasePadding;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutPadding;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NotificationPage_C_GetBannerPadding) == 0x000004, "Wrong alignment on UMG_NotificationPage_C_GetBannerPadding");
static_assert(sizeof(UMG_NotificationPage_C_GetBannerPadding) == 0x000010, "Wrong size on UMG_NotificationPage_C_GetBannerPadding");
static_assert(offsetof(UMG_NotificationPage_C_GetBannerPadding, Index_0) == 0x000000, "Member 'UMG_NotificationPage_C_GetBannerPadding::Index_0' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_GetBannerPadding, BasePadding) == 0x000004, "Member 'UMG_NotificationPage_C_GetBannerPadding::BasePadding' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_GetBannerPadding, OutPadding) == 0x000008, "Member 'UMG_NotificationPage_C_GetBannerPadding::OutPadding' has a wrong offset!");
static_assert(offsetof(UMG_NotificationPage_C_GetBannerPadding, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_NotificationPage_C_GetBannerPadding::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_NotificationPage.UMG_NotificationPage_C.GotoActivityPage
// 0x0008 (0x0008 - 0x0000)
struct UMG_NotificationPage_C_GotoActivityPage final
{
public:
	class UUMG_NotificationBanner_C*              Notification;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NotificationPage_C_GotoActivityPage) == 0x000008, "Wrong alignment on UMG_NotificationPage_C_GotoActivityPage");
static_assert(sizeof(UMG_NotificationPage_C_GotoActivityPage) == 0x000008, "Wrong size on UMG_NotificationPage_C_GotoActivityPage");
static_assert(offsetof(UMG_NotificationPage_C_GotoActivityPage, Notification) == 0x000000, "Member 'UMG_NotificationPage_C_GotoActivityPage::Notification' has a wrong offset!");

}

