#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Widget_TabBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_Widget_TabBar.UMG_Widget_TabBar_C.ExecuteUbergraph_UMG_Widget_TabBar
// 0x0018 (0x0018 - 0x0000)
struct UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar) == 0x000008, "Wrong alignment on UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar");
static_assert(sizeof(UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar) == 0x000018, "Wrong size on UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar");
static_assert(offsetof(UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar, EntryPoint) == 0x000000, "Member 'UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'UMG_Widget_TabBar_C_ExecuteUbergraph_UMG_Widget_TabBar::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function UMG_Widget_TabBar.UMG_Widget_TabBar_C.BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Right_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Right_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Right_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Right_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Right_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Right_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Right_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Right_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_Widget_TabBar.UMG_Widget_TabBar_C.BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Left_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Left_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Left_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Left_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Left_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Left_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Left_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_Widget_TabBar_C_BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Left_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

}

