#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_QuestInfoReward

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_QuestInfoReward.UMG_QuestInfoReward_C
// 0x0068 (0x02C8 - 0x0260)
class UUMG_QuestInfoReward_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BorderImage;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ChallengeTextBlock;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentProgressText;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Reward;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusImage;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalProgressText;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem_1;                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUMG_ProgressionReward_C* Widget)> SwitchRewardEvent;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_QuestInfoReward(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RefreshInfo(EPBQuestModuleState State, const class FText& Desc, int32 CurrentProgress, int32 TotalProgress, TArray<struct FPBRewardItem>& RewardArray);
	void RefreshState(EPBQuestModuleState State);
	void RefreshReward(TArray<struct FPBRewardItem>& RewardArray);
	void RefreshProgress(int32 Current, int32 Total);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_QuestInfoReward_C">();
	}
	static class UUMG_QuestInfoReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_QuestInfoReward_C>();
	}
};
static_assert(alignof(UUMG_QuestInfoReward_C) == 0x000008, "Wrong alignment on UUMG_QuestInfoReward_C");
static_assert(sizeof(UUMG_QuestInfoReward_C) == 0x0002C8, "Wrong size on UUMG_QuestInfoReward_C");
static_assert(offsetof(UUMG_QuestInfoReward_C, UberGraphFrame) == 0x000260, "Member 'UUMG_QuestInfoReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, BG) == 0x000268, "Member 'UUMG_QuestInfoReward_C::BG' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, BorderImage) == 0x000270, "Member 'UUMG_QuestInfoReward_C::BorderImage' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, ChallengeTextBlock) == 0x000278, "Member 'UUMG_QuestInfoReward_C::ChallengeTextBlock' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, CurrentProgressText) == 0x000280, "Member 'UUMG_QuestInfoReward_C::CurrentProgressText' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, ProgressBar) == 0x000288, "Member 'UUMG_QuestInfoReward_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, ScrollBox_Reward) == 0x000290, "Member 'UUMG_QuestInfoReward_C::ScrollBox_Reward' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, StatusImage) == 0x000298, "Member 'UUMG_QuestInfoReward_C::StatusImage' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, TotalProgressText) == 0x0002A0, "Member 'UUMG_QuestInfoReward_C::TotalProgressText' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, UMG_ProgressionRewardItem) == 0x0002A8, "Member 'UUMG_QuestInfoReward_C::UMG_ProgressionRewardItem' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, UMG_ProgressionRewardItem_1) == 0x0002B0, "Member 'UUMG_QuestInfoReward_C::UMG_ProgressionRewardItem_1' has a wrong offset!");
static_assert(offsetof(UUMG_QuestInfoReward_C, SwitchRewardEvent) == 0x0002B8, "Member 'UUMG_QuestInfoReward_C::SwitchRewardEvent' has a wrong offset!");

}

