#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityCenter_Daily

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_ActivityCenter_Daily.UMG_ActivityCenter_Daily_C.ExecuteUbergraph_UMG_ActivityCenter_Daily
// 0x0070 (0x0070 - 0x0000)
struct UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_RefreshableActivityQuest_C*        CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBActivityQuestBaseInfo               CallFunc_Array_Get_Item;                           // 0x0038(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily) == 0x000008, "Wrong alignment on UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily");
static_assert(sizeof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily) == 0x000070, "Wrong size on UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, EntryPoint) == 0x000000, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, K2Node_MakeStruct_Margin) == 0x000014, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, CallFunc_Create_ReturnValue) == 0x000030, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, CallFunc_Array_Get_Item) == 0x000038, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000060, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UMG_ActivityCenter_Daily_C_ExecuteUbergraph_UMG_ActivityCenter_Daily::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

