#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SingleMedal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FPB_MedalDetailsConfig_BP_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_SingleMedal.UMG_SingleMedal_C.ExecuteUbergraph_UMG_SingleMedal
// 0x0030 (0x0030 - 0x0000)
struct UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0010(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0018(0x0008)(NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal) == 0x000008, "Wrong alignment on UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal");
static_assert(sizeof(UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal) == 0x000030, "Wrong size on UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal");
static_assert(offsetof(UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal, EntryPoint) == 0x000000, "Member 'UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal, K2Node_Event_InFocusEvent_1) == 0x000010, "Member 'UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal, K2Node_Event_InFocusEvent) == 0x000018, "Member 'UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'UMG_SingleMedal_C_ExecuteUbergraph_UMG_SingleMedal::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_SingleMedal.UMG_SingleMedal_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_SingleMedal_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_SingleMedal_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_SingleMedal_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_SingleMedal_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_SingleMedal_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_SingleMedal_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_SingleMedal_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_SingleMedal.UMG_SingleMedal_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_SingleMedal_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_SingleMedal_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_SingleMedal_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_SingleMedal_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_SingleMedal_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_SingleMedal_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_SingleMedal_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_SingleMedal.UMG_SingleMedal_C.SetInfo
// 0x0068 (0x0068 - 0x0000)
struct UMG_SingleMedal_C_SetInfo final
{
public:
	class FName                                   InMedalID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCount;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSerialNumber;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFPB_MedalDetailsConfig_BP             InMedalDetailsConfig;                              // 0x0010(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0050(0x0018)()
};
static_assert(alignof(UMG_SingleMedal_C_SetInfo) == 0x000008, "Wrong alignment on UMG_SingleMedal_C_SetInfo");
static_assert(sizeof(UMG_SingleMedal_C_SetInfo) == 0x000068, "Wrong size on UMG_SingleMedal_C_SetInfo");
static_assert(offsetof(UMG_SingleMedal_C_SetInfo, InMedalID) == 0x000000, "Member 'UMG_SingleMedal_C_SetInfo::InMedalID' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetInfo, InCount) == 0x000008, "Member 'UMG_SingleMedal_C_SetInfo::InCount' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetInfo, InSerialNumber) == 0x00000C, "Member 'UMG_SingleMedal_C_SetInfo::InSerialNumber' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetInfo, InMedalDetailsConfig) == 0x000010, "Member 'UMG_SingleMedal_C_SetInfo::InMedalDetailsConfig' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetInfo, CallFunc_TextToUpper_ReturnValue) == 0x000050, "Member 'UMG_SingleMedal_C_SetInfo::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function UMG_SingleMedal.UMG_SingleMedal_C.SetNewItemInfo
// 0x0128 (0x0128 - 0x0000)
struct UMG_SingleMedal_C_SetNewItemInfo final
{
public:
	uint8                                         Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	uint8                                         Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00A0(0x0018)()
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SingleMedal_C_SetNewItemInfo) == 0x000008, "Wrong alignment on UMG_SingleMedal_C_SetNewItemInfo");
static_assert(sizeof(UMG_SingleMedal_C_SetNewItemInfo) == 0x000128, "Wrong size on UMG_SingleMedal_C_SetNewItemInfo");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_byte_Variable) == 0x000000, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_text_Variable) == 0x000008, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_text_Variable_1) == 0x000020, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_text_Variable_2) == 0x000038, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_text_Variable_3) == 0x000050, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_text_Variable_4) == 0x000068, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_text_Variable_5) == 0x000080, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_byte_Variable_1) == 0x000098, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, K2Node_Select_Default) == 0x0000A0, "Member 'UMG_SingleMedal_C_SetNewItemInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_struct_Variable) == 0x0000B8, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_struct_Variable_1) == 0x0000C8, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_struct_Variable_2) == 0x0000D8, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_struct_Variable_3) == 0x0000E8, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_struct_Variable_4) == 0x0000F8, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, Temp_struct_Variable_5) == 0x000108, "Member 'UMG_SingleMedal_C_SetNewItemInfo::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_SingleMedal_C_SetNewItemInfo, K2Node_Select_Default_1) == 0x000118, "Member 'UMG_SingleMedal_C_SetNewItemInfo::K2Node_Select_Default_1' has a wrong offset!");

}

