#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityCenter

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ActivityCenter.UMG_ActivityCenter_C
// 0x00C8 (0x0348 - 0x0280)
class UUMG_ActivityCenter_C final : public UPBActivityCenterPageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBAdvancedSwitcher*                    AdvancedSwitcher;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Event;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_News;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_65;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_EventContent;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_News_Content;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Events;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_News;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_Normal_C*           UMG_ActivityCenter_Daily;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_NewsContent_C*      UMG_ActivityCenter_NewsContent;                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_Progress_C*         UMG_ActivityCenter_Progress;                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        UMG_ActivityCenter_TitleCard;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        UMG_ActivityCenter_TitleCard_1;                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        UMG_ActivityCenter_TitleCard_2;                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        UMG_ActivityCenter_TitleCard_3;                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        UMG_ActivityCenter_TitleCard_4;                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        UMG_ActivityCenter_TitleCard_5;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        UMG_ActivityCenter_TitleCard_6;                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        UMG_ActivityCenter_TitleCard_150;                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DailyLoginPage_Base_C*             UMG_DailyLoginPage_Base;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RedemptionCodeWidget_C*            UMG_RedemptionCodeWidget;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_TitleCard_C*        SelectedWidget;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanQueryActivityData;                             // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_ActivityCenter(int32 EntryPoint);
	void RefreshNewsEvent();
	void BP_OnActivated_1();
	void BndEvt__UMG_ActivityCenter_PBAdvancedSwitcher_99_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature(int32 CurrentSelectIndex, int32 LastSelectIndex);
	void K2_RefreshActivityInfo();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void RefreshCardList();
	void OnSelectedNewsCard(class UUMG_ActivityCenter_TitleCard_C* ClickedWidget);
	void OnSelectedEventCard(class UUMG_ActivityCenter_TitleCard_C* ClickedWidget);
	void RefreshNewsContent();
	void RefreshSelectedCard(class UUMG_ActivityCenter_TitleCard_C* SelectedWidget_0, bool* bUpdated);
	void RefreshEventContent();
	void SetDefaultSelect(class UUMG_ActivityCenter_TitleCard_C* SelectedWidget_0);
	void SelectNewDefaultSelect(int32 SelectedIntex);
	void SelectEventDefaultSelect(int32 SelectedIndex);
	void DailyActivityPage(const class FString& ActivityID);
	void NormalActivityPage(const class FString& ActivityID);
	void ProgressActivityPage(const class FString& ActivityID);
	void DailyLoginPage();
	void CumylativeLoginPage();
	void LimitedTimeLoginPage();
	void Goto_Activity(const class FString& ActivityID, bool News_0);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void InitializeFocus();
	void QueryActivityData();
	void SetCanQueryActivityData();
	void SelectDefaultIndex();
	void IsActivityValid(const class FString& ActivityID, bool* Out);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ActivityCenter_C">();
	}
	static class UUMG_ActivityCenter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ActivityCenter_C>();
	}
};
static_assert(alignof(UUMG_ActivityCenter_C) == 0x000008, "Wrong alignment on UUMG_ActivityCenter_C");
static_assert(sizeof(UUMG_ActivityCenter_C) == 0x000348, "Wrong size on UUMG_ActivityCenter_C");
static_assert(offsetof(UUMG_ActivityCenter_C, UberGraphFrame) == 0x000280, "Member 'UUMG_ActivityCenter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, AdvancedSwitcher) == 0x000288, "Member 'UUMG_ActivityCenter_C::AdvancedSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, HorizontalBox_Event) == 0x000290, "Member 'UUMG_ActivityCenter_C::HorizontalBox_Event' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, HorizontalBox_News) == 0x000298, "Member 'UUMG_ActivityCenter_C::HorizontalBox_News' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, Image_65) == 0x0002A0, "Member 'UUMG_ActivityCenter_C::Image_65' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, Overlay_EventContent) == 0x0002A8, "Member 'UUMG_ActivityCenter_C::Overlay_EventContent' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, Overlay_News_Content) == 0x0002B0, "Member 'UUMG_ActivityCenter_C::Overlay_News_Content' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, ScrollBox_Events) == 0x0002B8, "Member 'UUMG_ActivityCenter_C::ScrollBox_Events' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, ScrollBox_News) == 0x0002C0, "Member 'UUMG_ActivityCenter_C::ScrollBox_News' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_Daily) == 0x0002C8, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_Daily' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_NewsContent) == 0x0002D0, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_NewsContent' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_Progress) == 0x0002D8, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_Progress' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_TitleCard) == 0x0002E0, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_TitleCard' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_TitleCard_1) == 0x0002E8, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_TitleCard_1' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_TitleCard_2) == 0x0002F0, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_TitleCard_2' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_TitleCard_3) == 0x0002F8, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_TitleCard_3' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_TitleCard_4) == 0x000300, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_TitleCard_4' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_TitleCard_5) == 0x000308, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_TitleCard_5' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_TitleCard_6) == 0x000310, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_TitleCard_6' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_ActivityCenter_TitleCard_150) == 0x000318, "Member 'UUMG_ActivityCenter_C::UMG_ActivityCenter_TitleCard_150' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_DailyLoginPage_Base) == 0x000320, "Member 'UUMG_ActivityCenter_C::UMG_DailyLoginPage_Base' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_RedemptionCodeWidget) == 0x000328, "Member 'UUMG_ActivityCenter_C::UMG_RedemptionCodeWidget' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, UMG_STD_Text) == 0x000330, "Member 'UUMG_ActivityCenter_C::UMG_STD_Text' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, SelectedWidget) == 0x000338, "Member 'UUMG_ActivityCenter_C::SelectedWidget' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_C, bCanQueryActivityData) == 0x000340, "Member 'UUMG_ActivityCenter_C::bCanQueryActivityData' has a wrong offset!");

}

