#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MatchmakingRegion

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_MatchmakingRegion.UMG_MatchmakingRegion_C.ExecuteUbergraph_UMG_MatchmakingRegion
// 0x0068 (0x0068 - 0x0000)
struct UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion) == 0x000008, "Wrong alignment on UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion");
static_assert(sizeof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion) == 0x000068, "Wrong size on UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion");
static_assert(offsetof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion, EntryPoint) == 0x000000, "Member 'UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000020, "Member 'UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion, CallFunc_Conv_NameToString_ReturnValue) == 0x000038, "Member 'UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000048, "Member 'UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion, CallFunc_Array_Contains_ReturnValue) == 0x000061, "Member 'UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion, CallFunc_Array_Contains_ReturnValue_1) == 0x000062, "Member 'UMG_MatchmakingRegion_C_ExecuteUbergraph_UMG_MatchmakingRegion::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");

// Function UMG_MatchmakingRegion.UMG_MatchmakingRegion_C.SetPingStyle
// 0x00C8 (0x00C8 - 0x0000)
struct UMG_MatchmakingRegion_C_SetPingStyle final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0080(0x0028)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B0(0x0018)()
};
static_assert(alignof(UMG_MatchmakingRegion_C_SetPingStyle) == 0x000008, "Wrong alignment on UMG_MatchmakingRegion_C_SetPingStyle");
static_assert(sizeof(UMG_MatchmakingRegion_C_SetPingStyle) == 0x0000C8, "Wrong size on UMG_MatchmakingRegion_C_SetPingStyle");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, K2Node_MakeStruct_SlateColor_2) == 0x000058, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, K2Node_MakeStruct_SlateColor_3) == 0x000080, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000A9, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000AA, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000AB, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetPingStyle, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B0, "Member 'UMG_MatchmakingRegion_C_SetPingStyle::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UMG_MatchmakingRegion.UMG_MatchmakingRegion_C.QueryPingState
// 0x0001 (0x0001 - 0x0000)
struct UMG_MatchmakingRegion_C_QueryPingState final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MatchmakingRegion_C_QueryPingState) == 0x000001, "Wrong alignment on UMG_MatchmakingRegion_C_QueryPingState");
static_assert(sizeof(UMG_MatchmakingRegion_C_QueryPingState) == 0x000001, "Wrong size on UMG_MatchmakingRegion_C_QueryPingState");
static_assert(offsetof(UMG_MatchmakingRegion_C_QueryPingState, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'UMG_MatchmakingRegion_C_QueryPingState::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_MatchmakingRegion.UMG_MatchmakingRegion_C.SetRegions
// 0x0008 (0x0008 - 0x0000)
struct UMG_MatchmakingRegion_C_SetRegions final
{
public:
	class UUMG_MatchmakingRegions_C*              InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchmakingRegion_C_SetRegions) == 0x000008, "Wrong alignment on UMG_MatchmakingRegion_C_SetRegions");
static_assert(sizeof(UMG_MatchmakingRegion_C_SetRegions) == 0x000008, "Wrong size on UMG_MatchmakingRegion_C_SetRegions");
static_assert(offsetof(UMG_MatchmakingRegion_C_SetRegions, InWidget) == 0x000000, "Member 'UMG_MatchmakingRegion_C_SetRegions::InWidget' has a wrong offset!");

// Function UMG_MatchmakingRegion.UMG_MatchmakingRegion_C.StartQos
// 0x0008 (0x0008 - 0x0000)
struct UMG_MatchmakingRegion_C_StartQos final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchmakingRegion_C_StartQos) == 0x000008, "Wrong alignment on UMG_MatchmakingRegion_C_StartQos");
static_assert(sizeof(UMG_MatchmakingRegion_C_StartQos) == 0x000008, "Wrong size on UMG_MatchmakingRegion_C_StartQos");
static_assert(offsetof(UMG_MatchmakingRegion_C_StartQos, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_MatchmakingRegion_C_StartQos::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

