#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ArtBook

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ArtBook.UMG_ArtBook_C
// 0x0080 (0x0400 - 0x0380)
class UUMG_ArtBook_C final : public UPBArtBookWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Next;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PrePage;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PrePage_1;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Previous;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentPageNum;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PrerequisiteButton_C*              GamepadButton_Next;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PrerequisiteButton_C*              GamepadButton_Pre;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Page;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Next;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Previous;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NextPage;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBAdvancedSwitcher*                    PBAdvancedSwitcher_ArtBook;                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PrePage;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SoundTrackLabel_C*                 UMG_SoundTrack;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentActivePageIndex;                            // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUIHidden;                                        // 0x03FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_ArtBook(int32 EntryPoint);
	void K2_BackToFirstPage();
	void BndEvt__UMG_ArtBook_Button_PrePage_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_PrePage_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_PrePage_1_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_PrePage_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnInitialized();
	void BP_OnDeactivated();
	void K2_ShowUI();
	void K2_HideUI();
	void BP_OnActivated();
	void BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_12_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_11_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Previous_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Previous_K2Node_ComponentBoundEvent_6_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Previous_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Previous_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Previous_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UMG_ArtBook_Button_Pre_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Init_Art_Book();
	void SwitchToFirstPage();
	void SwitchToPreviousPage();
	void SwitchToNextPage();
	void RefreshCurrentPageInfo();
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ArtBook_C">();
	}
	static class UUMG_ArtBook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ArtBook_C>();
	}
};
static_assert(alignof(UUMG_ArtBook_C) == 0x000008, "Wrong alignment on UUMG_ArtBook_C");
static_assert(sizeof(UUMG_ArtBook_C) == 0x000400, "Wrong size on UUMG_ArtBook_C");
static_assert(offsetof(UUMG_ArtBook_C, UberGraphFrame) == 0x000380, "Member 'UUMG_ArtBook_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, Button_Next) == 0x000388, "Member 'UUMG_ArtBook_C::Button_Next' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, Button_PrePage) == 0x000390, "Member 'UUMG_ArtBook_C::Button_PrePage' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, Button_PrePage_1) == 0x000398, "Member 'UUMG_ArtBook_C::Button_PrePage_1' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, Button_Previous) == 0x0003A0, "Member 'UUMG_ArtBook_C::Button_Previous' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, CurrentPageNum) == 0x0003A8, "Member 'UUMG_ArtBook_C::CurrentPageNum' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, GamepadButton_Next) == 0x0003B0, "Member 'UUMG_ArtBook_C::GamepadButton_Next' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, GamepadButton_Pre) == 0x0003B8, "Member 'UUMG_ArtBook_C::GamepadButton_Pre' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, HorizontalBox_Page) == 0x0003C0, "Member 'UUMG_ArtBook_C::HorizontalBox_Page' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, Image_Next) == 0x0003C8, "Member 'UUMG_ArtBook_C::Image_Next' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, Image_Previous) == 0x0003D0, "Member 'UUMG_ArtBook_C::Image_Previous' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, NextPage) == 0x0003D8, "Member 'UUMG_ArtBook_C::NextPage' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, PBAdvancedSwitcher_ArtBook) == 0x0003E0, "Member 'UUMG_ArtBook_C::PBAdvancedSwitcher_ArtBook' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, PrePage) == 0x0003E8, "Member 'UUMG_ArtBook_C::PrePage' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, UMG_SoundTrack) == 0x0003F0, "Member 'UUMG_ArtBook_C::UMG_SoundTrack' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, CurrentActivePageIndex) == 0x0003F8, "Member 'UUMG_ArtBook_C::CurrentActivePageIndex' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBook_C, IsUIHidden) == 0x0003FC, "Member 'UUMG_ArtBook_C::IsUIHidden' has a wrong offset!");

}

