#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ProfileCharacterInfo

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_ProfileCharacterInfo.UMG_ProfileCharacterInfo_C.ExecuteUbergraph_UMG_ProfileCharacterInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_ProfileCharacterInfo_C_ExecuteUbergraph_UMG_ProfileCharacterInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProfileCharacterInfo_C_ExecuteUbergraph_UMG_ProfileCharacterInfo) == 0x000004, "Wrong alignment on UMG_ProfileCharacterInfo_C_ExecuteUbergraph_UMG_ProfileCharacterInfo");
static_assert(sizeof(UMG_ProfileCharacterInfo_C_ExecuteUbergraph_UMG_ProfileCharacterInfo) == 0x000004, "Wrong size on UMG_ProfileCharacterInfo_C_ExecuteUbergraph_UMG_ProfileCharacterInfo");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_ExecuteUbergraph_UMG_ProfileCharacterInfo, EntryPoint) == 0x000000, "Member 'UMG_ProfileCharacterInfo_C_ExecuteUbergraph_UMG_ProfileCharacterInfo::EntryPoint' has a wrong offset!");

// Function UMG_ProfileCharacterInfo.UMG_ProfileCharacterInfo_C.SetInfoVisible
// 0x0001 (0x0001 - 0x0000)
struct UMG_ProfileCharacterInfo_C_SetInfoVisible final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProfileCharacterInfo_C_SetInfoVisible) == 0x000001, "Wrong alignment on UMG_ProfileCharacterInfo_C_SetInfoVisible");
static_assert(sizeof(UMG_ProfileCharacterInfo_C_SetInfoVisible) == 0x000001, "Wrong size on UMG_ProfileCharacterInfo_C_SetInfoVisible");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetInfoVisible, bIsVisible) == 0x000000, "Member 'UMG_ProfileCharacterInfo_C_SetInfoVisible::bIsVisible' has a wrong offset!");

// Function UMG_ProfileCharacterInfo.UMG_ProfileCharacterInfo_C.SetCharacterDataInfo
// 0x0238 (0x0238 - 0x0000)
struct UMG_ProfileCharacterInfo_C_SetCharacterDataInfo final
{
public:
	struct FPBCharacterProfileData                CharacterProfileData;                              // 0x0000(0x0078)(Edit, BlueprintVisible)
	class UPBCareerManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCareerManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBCharacterProfileData                CallFunc_Map_Find_Value;                           // 0x0088(0x0078)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0108(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0120(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0138(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0150(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0168(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0180(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringFromUsageTime_UsageTimeString;   // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x01D0(0x0018)()
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x01F0(0x0018)()
	float                                         CallFunc_GetCharacterLevelUpExp_ReturnValue;       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x0210(0x0018)()
	class UPBCareerManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterMaxLevel_ReturnValue;          // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo) == 0x000008, "Wrong alignment on UMG_ProfileCharacterInfo_C_SetCharacterDataInfo");
static_assert(sizeof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo) == 0x000238, "Wrong size on UMG_ProfileCharacterInfo_C_SetCharacterDataInfo");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CharacterProfileData) == 0x000000, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CharacterProfileData' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000078, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000080, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Map_Find_Value) == 0x000088, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Map_Find_ReturnValue) == 0x000100, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000108, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_FloatToText_ReturnValue) == 0x000120, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000138, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000150, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000168, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000180, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000198, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_GetStringFromUsageTime_UsageTimeString) == 0x0001A0, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_GetStringFromUsageTime_UsageTimeString' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001B0, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B8, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_IntToText_ReturnValue_4) == 0x0001D0, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_IntToByte_ReturnValue) == 0x0001E8, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_IntToText_ReturnValue_5) == 0x0001F0, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_GetCharacterLevelUpExp_ReturnValue) == 0x000208, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_GetCharacterLevelUpExp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_SafeDivide_ReturnValue) == 0x00020C, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_Conv_FloatToText_ReturnValue_2) == 0x000210, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_Conv_FloatToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000228, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_SetCharacterDataInfo, CallFunc_IsCharacterMaxLevel_ReturnValue) == 0x000230, "Member 'UMG_ProfileCharacterInfo_C_SetCharacterDataInfo::CallFunc_IsCharacterMaxLevel_ReturnValue' has a wrong offset!");

// Function UMG_ProfileCharacterInfo.UMG_ProfileCharacterInfo_C.GetStringFromUsageTime
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_ProfileCharacterInfo_C_GetStringFromUsageTime final
{
public:
	float                                         UsageTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UsageTimeString;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime) == 0x000008, "Wrong alignment on UMG_ProfileCharacterInfo_C_GetStringFromUsageTime");
static_assert(sizeof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime) == 0x0000A8, "Wrong size on UMG_ProfileCharacterInfo_C_GetStringFromUsageTime");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, UsageTime) == 0x000000, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::UsageTime' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, UsageTimeString) == 0x000008, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::UsageTimeString' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Percent_FloatFloat_ReturnValue) == 0x00001C, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_FFloor_ReturnValue) == 0x000020, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000024, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_FFloor_ReturnValue_1) == 0x000038, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000050, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_SelectString_ReturnValue) == 0x000078, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProfileCharacterInfo_C_GetStringFromUsageTime, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000098, "Member 'UMG_ProfileCharacterInfo_C_GetStringFromUsageTime::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

}

