#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityCenter_Normal

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ActivityCenter_Normal.UMG_ActivityCenter_Normal_C
// 0x0050 (0x02D8 - 0x0288)
class UUMG_ActivityCenter_Normal_C final : public UPBNormalActivityWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Line;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_QuestList;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Countdown_C*                       UMG_Countdown;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RefreshableActivityQuest_C*        UMG_RefreshableActivityQuest;                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RefreshableActivityQuest_C*        UMG_RefreshableActivityQuest_1;                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RefreshableActivityQuest_C*        UMG_RefreshableActivityQuest_2;                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_1;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_3;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_73;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ActivityCenter_Normal(int32 EntryPoint);
	void K2_RefreshInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ActivityCenter_Normal_C">();
	}
	static class UUMG_ActivityCenter_Normal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ActivityCenter_Normal_C>();
	}
};
static_assert(alignof(UUMG_ActivityCenter_Normal_C) == 0x000008, "Wrong alignment on UUMG_ActivityCenter_Normal_C");
static_assert(sizeof(UUMG_ActivityCenter_Normal_C) == 0x0002D8, "Wrong size on UUMG_ActivityCenter_Normal_C");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, UberGraphFrame) == 0x000288, "Member 'UUMG_ActivityCenter_Normal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, Image_Line) == 0x000290, "Member 'UUMG_ActivityCenter_Normal_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, ScrollBox_QuestList) == 0x000298, "Member 'UUMG_ActivityCenter_Normal_C::ScrollBox_QuestList' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, UMG_Countdown) == 0x0002A0, "Member 'UUMG_ActivityCenter_Normal_C::UMG_Countdown' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, UMG_RefreshableActivityQuest) == 0x0002A8, "Member 'UUMG_ActivityCenter_Normal_C::UMG_RefreshableActivityQuest' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, UMG_RefreshableActivityQuest_1) == 0x0002B0, "Member 'UUMG_ActivityCenter_Normal_C::UMG_RefreshableActivityQuest_1' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, UMG_RefreshableActivityQuest_2) == 0x0002B8, "Member 'UUMG_ActivityCenter_Normal_C::UMG_RefreshableActivityQuest_2' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, UMG_STD_Text_1) == 0x0002C0, "Member 'UUMG_ActivityCenter_Normal_C::UMG_STD_Text_1' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, UMG_STD_Text_3) == 0x0002C8, "Member 'UUMG_ActivityCenter_Normal_C::UMG_STD_Text_3' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_Normal_C, UMG_STD_Text_73) == 0x0002D0, "Member 'UUMG_ActivityCenter_Normal_C::UMG_STD_Text_73' has a wrong offset!");

}

