#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PlayerWidget_Friend

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_PlayerWidget_Friend.UMG_PlayerWidget_Friend_C
// 0x0020 (0x0280 - 0x0260)
class UUMG_PlayerWidget_Friend_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_FriendSocial_Tips_C*               UMG_FriendSocial_Tips;                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Widget_PlayerInfo_C*               UMG_PlayerInfo_Widget;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBFriendObject_C*                      FriendObject;                                      // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_PlayerWidget_Friend(int32 EntryPoint);
	void BndEvt__UMG_PlayerWidget_Friend_UMG_PlayerInfo_Widget_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__UMG_PlayerWidget_Friend_UMG_PlayerInfo_Widget_K2Node_ComponentBoundEvent_2_OnUnfocused__DelegateSignature();
	void BndEvt__UMG_PlayerWidget_Friend_UMG_PlayerInfo_Widget_K2Node_ComponentBoundEvent_1_OnFocused__DelegateSignature();
	void K2_OnItemObjectSet(class UObject* ItemObject);
	void K2_OnItemSelectionChanged(bool bIsSelected);
	void K2_OnItemExpansionChanged(bool bIsExpanded);
	void K2_OnEntryReleased();
	void SetDefaultFocus();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_PlayerWidget_Friend_C">();
	}
	static class UUMG_PlayerWidget_Friend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_PlayerWidget_Friend_C>();
	}
};
static_assert(alignof(UUMG_PlayerWidget_Friend_C) == 0x000008, "Wrong alignment on UUMG_PlayerWidget_Friend_C");
static_assert(sizeof(UUMG_PlayerWidget_Friend_C) == 0x000280, "Wrong size on UUMG_PlayerWidget_Friend_C");
static_assert(offsetof(UUMG_PlayerWidget_Friend_C, UberGraphFrame) == 0x000260, "Member 'UUMG_PlayerWidget_Friend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerWidget_Friend_C, UMG_FriendSocial_Tips) == 0x000268, "Member 'UUMG_PlayerWidget_Friend_C::UMG_FriendSocial_Tips' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerWidget_Friend_C, UMG_PlayerInfo_Widget) == 0x000270, "Member 'UUMG_PlayerWidget_Friend_C::UMG_PlayerInfo_Widget' has a wrong offset!");
static_assert(offsetof(UUMG_PlayerWidget_Friend_C, FriendObject) == 0x000278, "Member 'UUMG_PlayerWidget_Friend_C::FriendObject' has a wrong offset!");

}

