#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CareerPage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_CareerPage.UMG_CareerPage_C.ExecuteUbergraph_UMG_CareerPage
// 0x0068 (0x0068 - 0x0000)
struct UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_CurrentSelectIndex;     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LastSelectIndex;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage) == 0x000008, "Wrong alignment on UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage");
static_assert(sizeof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage) == 0x000068, "Wrong size on UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, EntryPoint) == 0x000000, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, K2Node_ComponentBoundEvent_CurrentSelectIndex) == 0x000020, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::K2Node_ComponentBoundEvent_CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, K2Node_ComponentBoundEvent_LastSelectIndex) == 0x000024, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::K2Node_ComponentBoundEvent_LastSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000028, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00002C, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, CallFunc_GetDisplayName_ReturnValue_1) == 0x000030, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000040, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, CallFunc_GetDisplayName_ReturnValue_2) == 0x000048, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage, CallFunc_GetDisplayName_ReturnValue_3) == 0x000058, "Member 'UMG_CareerPage_C_ExecuteUbergraph_UMG_CareerPage::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");

// Function UMG_CareerPage.UMG_CareerPage_C.BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_CareerPage_C_BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature final
{
public:
	int32                                         CurrentSelectIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSelectIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CareerPage_C_BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000004, "Wrong alignment on UMG_CareerPage_C_BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(sizeof(UMG_CareerPage_C_BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000008, "Wrong size on UMG_CareerPage_C_BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(offsetof(UMG_CareerPage_C_BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, CurrentSelectIndex) == 0x000000, "Member 'UMG_CareerPage_C_BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, LastSelectIndex) == 0x000004, "Member 'UMG_CareerPage_C_BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::LastSelectIndex' has a wrong offset!");

// Function UMG_CareerPage.UMG_CareerPage_C.OnKeyDown
// 0x02F0 (0x02F0 - 0x0000)
struct UMG_CareerPage_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue;  // 0x0148(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_1; // 0x0168(0x0010)(ReferenceParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0178(0x00B8)()
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0238(0x00B8)()
};
static_assert(alignof(UMG_CareerPage_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_CareerPage_C_OnKeyDown");
static_assert(sizeof(UMG_CareerPage_C_OnKeyDown) == 0x0002F0, "Wrong size on UMG_CareerPage_C_OnKeyDown");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_CareerPage_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_CareerPage_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_CareerPage_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'UMG_CareerPage_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000140, "Member 'UMG_CareerPage_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue) == 0x000148, "Member 'UMG_CareerPage_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue) == 0x000158, "Member 'UMG_CareerPage_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000160, "Member 'UMG_CareerPage_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_1) == 0x000168, "Member 'UMG_CareerPage_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000178, "Member 'UMG_CareerPage_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue_1) == 0x000230, "Member 'UMG_CareerPage_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000238, "Member 'UMG_CareerPage_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_CareerPage.UMG_CareerPage_C.RestoreFocus
// 0x0008 (0x0008 - 0x0000)
struct UMG_CareerPage_C_RestoreFocus final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerPage_C_RestoreFocus) == 0x000004, "Wrong alignment on UMG_CareerPage_C_RestoreFocus");
static_assert(sizeof(UMG_CareerPage_C_RestoreFocus) == 0x000008, "Wrong size on UMG_CareerPage_C_RestoreFocus");
static_assert(offsetof(UMG_CareerPage_C_RestoreFocus, Selection) == 0x000000, "Member 'UMG_CareerPage_C_RestoreFocus::Selection' has a wrong offset!");
static_assert(offsetof(UMG_CareerPage_C_RestoreFocus, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'UMG_CareerPage_C_RestoreFocus::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

