#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_LoginDateCard

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_LoginDateCard.UMG_LoginDateCard_C.ExecuteUbergraph_UMG_LoginDateCard
// 0x0008 (0x0008 - 0x0000)
struct UMG_LoginDateCard_C_ExecuteUbergraph_UMG_LoginDateCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LoginDateCard_C_ExecuteUbergraph_UMG_LoginDateCard) == 0x000004, "Wrong alignment on UMG_LoginDateCard_C_ExecuteUbergraph_UMG_LoginDateCard");
static_assert(sizeof(UMG_LoginDateCard_C_ExecuteUbergraph_UMG_LoginDateCard) == 0x000008, "Wrong size on UMG_LoginDateCard_C_ExecuteUbergraph_UMG_LoginDateCard");
static_assert(offsetof(UMG_LoginDateCard_C_ExecuteUbergraph_UMG_LoginDateCard, EntryPoint) == 0x000000, "Member 'UMG_LoginDateCard_C_ExecuteUbergraph_UMG_LoginDateCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_ExecuteUbergraph_UMG_LoginDateCard, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'UMG_LoginDateCard_C_ExecuteUbergraph_UMG_LoginDateCard::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UMG_LoginDateCard.UMG_LoginDateCard_C.RefreshCardInfo
// 0x00C0 (0x00C0 - 0x0000)
struct UMG_LoginDateCard_C_RefreshCardInfo final
{
public:
	EPBProgressionRewardItemStatus                Status;                                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBLoginActivityRewardState                   Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0088(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A8(0x0018)()
};
static_assert(alignof(UMG_LoginDateCard_C_RefreshCardInfo) == 0x000008, "Wrong alignment on UMG_LoginDateCard_C_RefreshCardInfo");
static_assert(sizeof(UMG_LoginDateCard_C_RefreshCardInfo) == 0x0000C0, "Wrong size on UMG_LoginDateCard_C_RefreshCardInfo");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, Status) == 0x000000, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::Status' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, Temp_byte_Variable) == 0x000001, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, Temp_text_Variable) == 0x000008, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, Temp_text_Variable_1) == 0x000020, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, Temp_text_Variable_2) == 0x000038, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, Temp_text_Variable_3) == 0x000050, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, Temp_text_Variable_4) == 0x000068, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, K2Node_SwitchEnum_CmpSuccess_1) == 0x000081, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000082, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, K2Node_SwitchEnum_CmpSuccess_2) == 0x000083, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, K2Node_SwitchEnum_CmpSuccess_3) == 0x000084, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, CallFunc_Add_ByteByte_ReturnValue) == 0x000085, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, K2Node_Select_Default) == 0x000088, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000A0, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A8, "Member 'UMG_LoginDateCard_C_RefreshCardInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UMG_LoginDateCard.UMG_LoginDateCard_C.PlayGlowingAnimation
// 0x0018 (0x0018 - 0x0000)
struct UMG_LoginDateCard_C_PlayGlowingAnimation final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LoginDateCard_C_PlayGlowingAnimation) == 0x000008, "Wrong alignment on UMG_LoginDateCard_C_PlayGlowingAnimation");
static_assert(sizeof(UMG_LoginDateCard_C_PlayGlowingAnimation) == 0x000018, "Wrong size on UMG_LoginDateCard_C_PlayGlowingAnimation");
static_assert(offsetof(UMG_LoginDateCard_C_PlayGlowingAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_LoginDateCard_C_PlayGlowingAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_PlayGlowingAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'UMG_LoginDateCard_C_PlayGlowingAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_LoginDateCard.UMG_LoginDateCard_C.ShowNewItemPage
// 0x0001 (0x0001 - 0x0000)
struct UMG_LoginDateCard_C_ShowNewItemPage final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LoginDateCard_C_ShowNewItemPage) == 0x000001, "Wrong alignment on UMG_LoginDateCard_C_ShowNewItemPage");
static_assert(sizeof(UMG_LoginDateCard_C_ShowNewItemPage) == 0x000001, "Wrong size on UMG_LoginDateCard_C_ShowNewItemPage");
static_assert(offsetof(UMG_LoginDateCard_C_ShowNewItemPage, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'UMG_LoginDateCard_C_ShowNewItemPage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_LoginDateCard.UMG_LoginDateCard_C.RefreshCardWithAnimation
// 0x001C (0x001C - 0x0000)
struct UMG_LoginDateCard_C_RefreshCardWithAnimation final
{
public:
	struct FPBLoginActivityRecord                 LoginActivityRecord;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         InDate;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentDate;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInPlayGlowingAnimation;                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LoginDateCard_C_RefreshCardWithAnimation) == 0x000004, "Wrong alignment on UMG_LoginDateCard_C_RefreshCardWithAnimation");
static_assert(sizeof(UMG_LoginDateCard_C_RefreshCardWithAnimation) == 0x00001C, "Wrong size on UMG_LoginDateCard_C_RefreshCardWithAnimation");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardWithAnimation, LoginActivityRecord) == 0x000000, "Member 'UMG_LoginDateCard_C_RefreshCardWithAnimation::LoginActivityRecord' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardWithAnimation, InDate) == 0x000010, "Member 'UMG_LoginDateCard_C_RefreshCardWithAnimation::InDate' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardWithAnimation, CurrentDate) == 0x000014, "Member 'UMG_LoginDateCard_C_RefreshCardWithAnimation::CurrentDate' has a wrong offset!");
static_assert(offsetof(UMG_LoginDateCard_C_RefreshCardWithAnimation, bInPlayGlowingAnimation) == 0x000018, "Member 'UMG_LoginDateCard_C_RefreshCardWithAnimation::bInPlayGlowingAnimation' has a wrong offset!");

}

