#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_IngameHUD_AllowedClimb

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_IngameHUD_AllowedClimb.UMG_IngameHUD_AllowedClimb_C
// 0x0040 (0x02A0 - 0x0260)
class UUMG_IngameHUD_AllowedClimb_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_106;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_242;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_AmmoWarring;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_IngameHUD_AllowedClimb(int32 EntryPoint);
	void Construct();
	void AllowedClimbStateChange();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_IngameHUD_AllowedClimb_C">();
	}
	static class UUMG_IngameHUD_AllowedClimb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_IngameHUD_AllowedClimb_C>();
	}
};
static_assert(alignof(UUMG_IngameHUD_AllowedClimb_C) == 0x000008, "Wrong alignment on UUMG_IngameHUD_AllowedClimb_C");
static_assert(sizeof(UUMG_IngameHUD_AllowedClimb_C) == 0x0002A0, "Wrong size on UUMG_IngameHUD_AllowedClimb_C");
static_assert(offsetof(UUMG_IngameHUD_AllowedClimb_C, UberGraphFrame) == 0x000260, "Member 'UUMG_IngameHUD_AllowedClimb_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_AllowedClimb_C, Flash) == 0x000268, "Member 'UUMG_IngameHUD_AllowedClimb_C::Flash' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_AllowedClimb_C, Border_0) == 0x000270, "Member 'UUMG_IngameHUD_AllowedClimb_C::Border_0' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_AllowedClimb_C, Image_106) == 0x000278, "Member 'UUMG_IngameHUD_AllowedClimb_C::Image_106' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_AllowedClimb_C, Image_242) == 0x000280, "Member 'UUMG_IngameHUD_AllowedClimb_C::Image_242' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_AllowedClimb_C, InvalidationBox_0) == 0x000288, "Member 'UUMG_IngameHUD_AllowedClimb_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_AllowedClimb_C, Overlay_0) == 0x000290, "Member 'UUMG_IngameHUD_AllowedClimb_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_AllowedClimb_C, Tex_AmmoWarring) == 0x000298, "Member 'UUMG_IngameHUD_AllowedClimb_C::Tex_AmmoWarring' has a wrong offset!");

}

