#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NotificationCard

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_NotificationCard.UMG_NotificationCard_C.ExecuteUbergraph_UMG_NotificationCard
// 0x0018 (0x0018 - 0x0000)
struct UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCarouselPanelWidget*                 K2Node_Event_InCarouselPanelWidget;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectItemByButton_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard) == 0x000008, "Wrong alignment on UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard");
static_assert(sizeof(UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard) == 0x000018, "Wrong size on UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard");
static_assert(offsetof(UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard, EntryPoint) == 0x000000, "Member 'UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard, K2Node_Event_InCarouselPanelWidget) == 0x000008, "Member 'UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard::K2Node_Event_InCarouselPanelWidget' has a wrong offset!");
static_assert(offsetof(UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard, CallFunc_SelectItemByButton_ReturnValue) == 0x000010, "Member 'UMG_NotificationCard_C_ExecuteUbergraph_UMG_NotificationCard::CallFunc_SelectItemByButton_ReturnValue' has a wrong offset!");

// Function UMG_NotificationCard.UMG_NotificationCard_C.SetCarouselPanel
// 0x0008 (0x0008 - 0x0000)
struct UMG_NotificationCard_C_SetCarouselPanel final
{
public:
	class UPBCarouselPanelWidget*                 InCarouselPanelWidget;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NotificationCard_C_SetCarouselPanel) == 0x000008, "Wrong alignment on UMG_NotificationCard_C_SetCarouselPanel");
static_assert(sizeof(UMG_NotificationCard_C_SetCarouselPanel) == 0x000008, "Wrong size on UMG_NotificationCard_C_SetCarouselPanel");
static_assert(offsetof(UMG_NotificationCard_C_SetCarouselPanel, InCarouselPanelWidget) == 0x000000, "Member 'UMG_NotificationCard_C_SetCarouselPanel::InCarouselPanelWidget' has a wrong offset!");

// Function UMG_NotificationCard.UMG_NotificationCard_C.RefreshSelectedStyle
// 0x0001 (0x0001 - 0x0000)
struct UMG_NotificationCard_C_RefreshSelectedStyle final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NotificationCard_C_RefreshSelectedStyle) == 0x000001, "Wrong alignment on UMG_NotificationCard_C_RefreshSelectedStyle");
static_assert(sizeof(UMG_NotificationCard_C_RefreshSelectedStyle) == 0x000001, "Wrong size on UMG_NotificationCard_C_RefreshSelectedStyle");
static_assert(offsetof(UMG_NotificationCard_C_RefreshSelectedStyle, bIsSelected) == 0x000000, "Member 'UMG_NotificationCard_C_RefreshSelectedStyle::bIsSelected' has a wrong offset!");

}

