#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_OperationInstruction

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"
#include "FPBGameEventConfig_BP_structs.hpp"


namespace SDK::Params
{

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.ExecuteUbergraph_UMG_InGameHUD_OperationInstruction
// 0x0068 (0x0068 - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_InGameHUD_Mother_C*                K2Node_CustomEvent_Parient;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBInteractionManager*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBInteractionConfig*                   CallFunc_GetPrimaryInteraction_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction) == 0x000008, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction) == 0x000068, "Wrong size on UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction, EntryPoint) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction, K2Node_CustomEvent_Parient) == 0x000008, "Member 'UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction::K2Node_CustomEvent_Parient' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction, K2Node_Event_MyGeometry) == 0x000010, "Member 'UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction, K2Node_Event_InDeltaTime) == 0x000048, "Member 'UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000050, "Member 'UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction, CallFunc_GetPrimaryInteraction_ReturnValue) == 0x000058, "Member 'UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction::CallFunc_GetPrimaryInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000061, "Member 'UMG_InGameHUD_OperationInstruction_C_ExecuteUbergraph_UMG_InGameHUD_OperationInstruction::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_Tick) == 0x000004, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_Tick");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_Tick) == 0x00003C, "Wrong size on UMG_InGameHUD_OperationInstruction_C_Tick");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_InGameHUD_OperationInstruction_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.Event_ParientPreConstruct
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_Event_ParientPreConstruct final
{
public:
	class UUMG_InGameHUD_Mother_C*                Parient;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_Event_ParientPreConstruct) == 0x000008, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_Event_ParientPreConstruct");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_Event_ParientPreConstruct) == 0x000008, "Wrong size on UMG_InGameHUD_OperationInstruction_C_Event_ParientPreConstruct");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_Event_ParientPreConstruct, Parient) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_Event_ParientPreConstruct::Parient' has a wrong offset!");

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.RefreshPerefrence
// 0x0028 (0x0028 - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   InputName;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInputName_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence) == 0x000008, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence) == 0x000028, "Wrong size on UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence, InText) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence::InText' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence, InputName) == 0x000018, "Member 'UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence::InputName' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence, CallFunc_SetInputName_ReturnValue) == 0x000020, "Member 'UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence::CallFunc_SetInputName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence, CallFunc_IsVisible_ReturnValue) == 0x000021, "Member 'UMG_InGameHUD_OperationInstruction_C_RefreshPerefrence::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.UpdateProgressBarProgress
// 0x0100 (0x0100 - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress final
{
public:
	class FText                                   LocalRemainTime;                                   // 0x0000(0x0018)(Edit, BlueprintVisible)
	class APBCharacter*                           LocalCharacterPtr;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalPercentage;                                   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRescueOtherPercent_ReturnValue;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0038(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0070(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentReplenishPercentage_ReturnValue; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E8(0x0018)()
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress) == 0x000008, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress) == 0x000100, "Wrong size on UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, LocalRemainTime) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::LocalRemainTime' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, LocalCharacterPtr) == 0x000018, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::LocalCharacterPtr' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, LocalPercentage) == 0x000020, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::LocalPercentage' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_IsValid_ReturnValue_1) == 0x000025, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_IsValid_ReturnValue_2) == 0x000026, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, K2Node_SwitchEnum_CmpSuccess) == 0x000027, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_GetRescueOtherPercent_ReturnValue) == 0x00002C, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_GetRescueOtherPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Conv_FloatToText_ReturnValue) == 0x000038, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_IsValid_ReturnValue_3) == 0x000050, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000058, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_IsValid_ReturnValue_4) == 0x000061, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000064, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000068, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00006C, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000070, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000098, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Conv_FloatToText_ReturnValue_2) == 0x0000B8, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Conv_FloatToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000D0, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_GetCurrentReplenishPercentage_ReturnValue) == 0x0000E0, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_GetCurrentReplenishPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E8, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateProgressBarProgress::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.StopProgressBarTimer
// 0x0001 (0x0001 - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_StopProgressBarTimer final
{
public:
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_StopProgressBarTimer) == 0x000001, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_StopProgressBarTimer");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_StopProgressBarTimer) == 0x000001, "Wrong size on UMG_InGameHUD_OperationInstruction_C_StopProgressBarTimer");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_StopProgressBarTimer, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_StopProgressBarTimer::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.GetPickUPWeaponName
// 0x0280 (0x0280 - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName final
{
public:
	class FText                                   WeaponName;                                        // 0x0000(0x0018)(Parm, OutParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBWeapon*                              CallFunc_FindBestPickupWeapon_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponNetworkConfig                 CallFunc_GetPBWeaponPartSaveConfig_ReturnValue;    // 0x0030(0x0038)()
	struct FPBWeaponDefinitionRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0210)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName) == 0x000008, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName) == 0x000280, "Wrong size on UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName, WeaponName) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName::WeaponName' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName, CallFunc_FindBestPickupWeapon_ReturnValue) == 0x000020, "Member 'UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName::CallFunc_FindBestPickupWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName, CallFunc_IsValid_ReturnValue_2) == 0x000028, "Member 'UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName, CallFunc_GetPBWeaponPartSaveConfig_ReturnValue) == 0x000030, "Member 'UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName::CallFunc_GetPBWeaponPartSaveConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000278, "Member 'UMG_InGameHUD_OperationInstruction_C_GetPickUPWeaponName::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.ShowGameEventHint
// 0x00F0 (0x00F0 - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint final
{
public:
	EPBInteractionEventType                       InGamePlayEventType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TmpEventText;                                      // 0x0008(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetPickUPWeaponName_WeaponName;           // 0x0050(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_5;          // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPBGameEventConfig_BP                 CallFunc_Map_Find_Value;                           // 0x00C0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint) == 0x000008, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint) == 0x0000F0, "Wrong size on UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, InGamePlayEventType) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::InGamePlayEventType' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, TmpEventText) == 0x000008, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::TmpEventText' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000020, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_GetPickUPWeaponName_WeaponName) == 0x000050, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_GetPickUPWeaponName_WeaponName' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000068, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000A0, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000A1, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x0000A2, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x0000A3, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x0000A4, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_NotEqual_ByteByte_ReturnValue_5) == 0x0000A5, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_NotEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_BooleanAND_ReturnValue) == 0x0000A6, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A7, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000A8, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_BooleanAND_ReturnValue_2) == 0x0000AC, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_BooleanAND_ReturnValue_3) == 0x0000AD, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_K2_SetTimer_ReturnValue) == 0x0000B0, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_BooleanAND_ReturnValue_4) == 0x0000B8, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000B9, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_Map_Find_Value) == 0x0000C0, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_Map_Find_ReturnValue) == 0x0000E8, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000E9, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint, CallFunc_BooleanOR_ReturnValue) == 0x0000EA, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowGameEventHint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.ShowMechUAVHint
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_ShowMechUAVHint final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_ShowMechUAVHint) == 0x000008, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_ShowMechUAVHint");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_ShowMechUAVHint) == 0x000010, "Wrong size on UMG_InGameHUD_OperationInstruction_C_ShowMechUAVHint");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowMechUAVHint, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowMechUAVHint::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_ShowMechUAVHint, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_OperationInstruction_C_ShowMechUAVHint::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_OperationInstruction.UMG_InGameHUD_OperationInstruction_C.UpdateMechUAVProgressBar
// 0x0048 (0x0048 - 0x0000)
struct UMG_InGameHUD_OperationInstruction_C_UpdateMechUAVProgressBar final
{
public:
	class FText                                   LocalRemainTime;                                   // 0x0000(0x0018)(Edit, BlueprintVisible)
	float                                         LocalPercent;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           LocalCharacterPtr;                                 // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0030(0x0018)()
};
static_assert(alignof(UMG_InGameHUD_OperationInstruction_C_UpdateMechUAVProgressBar) == 0x000008, "Wrong alignment on UMG_InGameHUD_OperationInstruction_C_UpdateMechUAVProgressBar");
static_assert(sizeof(UMG_InGameHUD_OperationInstruction_C_UpdateMechUAVProgressBar) == 0x000048, "Wrong size on UMG_InGameHUD_OperationInstruction_C_UpdateMechUAVProgressBar");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateMechUAVProgressBar, LocalRemainTime) == 0x000000, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateMechUAVProgressBar::LocalRemainTime' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_OperationInstruction_C_UpdateMechUAVProgressBar, LocalPercent) == 0x000018, "Member 'UMG_InGameHUD_OperationInstruction_C_UpdateMechUAVProgressBar::LocalPercent' has a wrong offset!");
