#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_advancedScrollBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_advancedScrollBox.UMG_AdvancedScrollBox_C.ExecuteUbergraph_UMG_AdvancedScrollBox
// 0x0030 (0x0030 - 0x0000)
struct UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InScrollDistance;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_CurrentOffset;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue_2;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox) == 0x000004, "Wrong alignment on UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox");
static_assert(sizeof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox) == 0x000030, "Wrong size on UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, EntryPoint) == 0x000000, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, CallFunc_GetScrollOffset_ReturnValue) == 0x000004, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000008, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, K2Node_Event_IsDesignTime) == 0x000010, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, K2Node_Event_InScrollDistance) == 0x000014, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::K2Node_Event_InScrollDistance' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, K2Node_ComponentBoundEvent_CurrentOffset) == 0x000018, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::K2Node_ComponentBoundEvent_CurrentOffset' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, CallFunc_GetScrollOffset_ReturnValue_1) == 0x00001C, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::CallFunc_GetScrollOffset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, CallFunc_GetScrollOffsetOfEnd_ReturnValue_1) == 0x000020, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::CallFunc_GetScrollOffsetOfEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, CallFunc_GetScrollOffset_ReturnValue_2) == 0x000024, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::CallFunc_GetScrollOffset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000028, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'UMG_AdvancedScrollBox_C_ExecuteUbergraph_UMG_AdvancedScrollBox::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function UMG_advancedScrollBox.UMG_AdvancedScrollBox_C.BndEvt__UMG_AdvancedScrollBox_ScrollBox_Advanced_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_AdvancedScrollBox_C_BndEvt__UMG_AdvancedScrollBox_ScrollBox_Advanced_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_AdvancedScrollBox_C_BndEvt__UMG_AdvancedScrollBox_ScrollBox_Advanced_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong alignment on UMG_AdvancedScrollBox_C_BndEvt__UMG_AdvancedScrollBox_ScrollBox_Advanced_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature");
static_assert(sizeof(UMG_AdvancedScrollBox_C_BndEvt__UMG_AdvancedScrollBox_ScrollBox_Advanced_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong size on UMG_AdvancedScrollBox_C_BndEvt__UMG_AdvancedScrollBox_ScrollBox_Advanced_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature");
static_assert(offsetof(UMG_AdvancedScrollBox_C_BndEvt__UMG_AdvancedScrollBox_ScrollBox_Advanced_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature, CurrentOffset) == 0x000000, "Member 'UMG_AdvancedScrollBox_C_BndEvt__UMG_AdvancedScrollBox_ScrollBox_Advanced_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature::CurrentOffset' has a wrong offset!");

// Function UMG_advancedScrollBox.UMG_AdvancedScrollBox_C.K2_Scroll
// 0x0004 (0x0004 - 0x0000)
struct UMG_AdvancedScrollBox_C_K2_Scroll final
{
public:
	float                                         InScrollDistance;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_AdvancedScrollBox_C_K2_Scroll) == 0x000004, "Wrong alignment on UMG_AdvancedScrollBox_C_K2_Scroll");
static_assert(sizeof(UMG_AdvancedScrollBox_C_K2_Scroll) == 0x000004, "Wrong size on UMG_AdvancedScrollBox_C_K2_Scroll");
static_assert(offsetof(UMG_AdvancedScrollBox_C_K2_Scroll, InScrollDistance) == 0x000000, "Member 'UMG_AdvancedScrollBox_C_K2_Scroll::InScrollDistance' has a wrong offset!");

// Function UMG_advancedScrollBox.UMG_AdvancedScrollBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_AdvancedScrollBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_AdvancedScrollBox_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_AdvancedScrollBox_C_PreConstruct");
static_assert(sizeof(UMG_AdvancedScrollBox_C_PreConstruct) == 0x000001, "Wrong size on UMG_AdvancedScrollBox_C_PreConstruct");
static_assert(offsetof(UMG_AdvancedScrollBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_AdvancedScrollBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_advancedScrollBox.UMG_AdvancedScrollBox_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_AdvancedScrollBox_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_AdvancedScrollBox_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_AdvancedScrollBox_C_OnFocusReceived");
static_assert(sizeof(UMG_AdvancedScrollBox_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_AdvancedScrollBox_C_OnFocusReceived");
static_assert(offsetof(UMG_AdvancedScrollBox_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_AdvancedScrollBox_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_AdvancedScrollBox_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_AdvancedScrollBox_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AdvancedScrollBox_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_AdvancedScrollBox_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

