#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EnterGame

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EnterGame.UMG_EnterGame_C
// 0x0020 (0x0358 - 0x0338)
class UUMG_EnterGame_C final : public UPBEnterGameWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Zoom;                                              // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUMG_PrerequisiteButton_C*              UMG_PrerequisiteButton;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FinishZoom;                                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_EnterGame(int32 EntryPoint);
	void BndEvt__UMG_EnterGame_UMG_PrerequisiteButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void CustomEvent_0();
	void Construct();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EnterGame_C">();
	}
	static class UUMG_EnterGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EnterGame_C>();
	}
};
static_assert(alignof(UUMG_EnterGame_C) == 0x000008, "Wrong alignment on UUMG_EnterGame_C");
static_assert(sizeof(UUMG_EnterGame_C) == 0x000358, "Wrong size on UUMG_EnterGame_C");
static_assert(offsetof(UUMG_EnterGame_C, UberGraphFrame) == 0x000338, "Member 'UUMG_EnterGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EnterGame_C, Zoom) == 0x000340, "Member 'UUMG_EnterGame_C::Zoom' has a wrong offset!");
static_assert(offsetof(UUMG_EnterGame_C, UMG_PrerequisiteButton) == 0x000348, "Member 'UUMG_EnterGame_C::UMG_PrerequisiteButton' has a wrong offset!");
static_assert(offsetof(UUMG_EnterGame_C, FinishZoom) == 0x000350, "Member 'UUMG_EnterGame_C::FinishZoom' has a wrong offset!");

}

