#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DailyLoginPage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_DailyLoginPage.UMG_DailyLoginPage_C.ExecuteUbergraph_UMG_DailyLoginPage
// 0x0004 (0x0004 - 0x0000)
struct UMG_DailyLoginPage_C_ExecuteUbergraph_UMG_DailyLoginPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_DailyLoginPage_C_ExecuteUbergraph_UMG_DailyLoginPage) == 0x000004, "Wrong alignment on UMG_DailyLoginPage_C_ExecuteUbergraph_UMG_DailyLoginPage");
static_assert(sizeof(UMG_DailyLoginPage_C_ExecuteUbergraph_UMG_DailyLoginPage) == 0x000004, "Wrong size on UMG_DailyLoginPage_C_ExecuteUbergraph_UMG_DailyLoginPage");
static_assert(offsetof(UMG_DailyLoginPage_C_ExecuteUbergraph_UMG_DailyLoginPage, EntryPoint) == 0x000000, "Member 'UMG_DailyLoginPage_C_ExecuteUbergraph_UMG_DailyLoginPage::EntryPoint' has a wrong offset!");

// Function UMG_DailyLoginPage.UMG_DailyLoginPage_C.RefreshDateCardList
// 0x0080 (0x0080 - 0x0000)
struct UMG_DailyLoginPage_C_RefreshDateCardList final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPBRewardItem& RewardItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBLoginActivityRecord                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_LoginDateCard_C*                   CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_DailyLoginPage_C_RefreshDateCardList) == 0x000008, "Wrong alignment on UMG_DailyLoginPage_C_RefreshDateCardList");
static_assert(sizeof(UMG_DailyLoginPage_C_RefreshDateCardList) == 0x000080, "Wrong size on UMG_DailyLoginPage_C_RefreshDateCardList");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, CallFunc_Array_Get_Item) == 0x000028, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, CallFunc_Create_ReturnValue) == 0x000050, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, K2Node_MakeStruct_Margin) == 0x000060, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000070, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_RefreshDateCardList, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'UMG_DailyLoginPage_C_RefreshDateCardList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_DailyLoginPage.UMG_DailyLoginPage_C.OnKeyDown
// 0x02E8 (0x02E8 - 0x0000)
struct UMG_DailyLoginPage_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   Key;                                               // 0x0128(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0140(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0158(0x00B8)()
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue;  // 0x0218(0x0010)(ReferenceParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0228(0x00B8)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_DailyLoginPage_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_DailyLoginPage_C_OnKeyDown");
static_assert(sizeof(UMG_DailyLoginPage_C_OnKeyDown) == 0x0002E8, "Wrong size on UMG_DailyLoginPage_C_OnKeyDown");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_DailyLoginPage_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_DailyLoginPage_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_DailyLoginPage_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, Key) == 0x000128, "Member 'UMG_DailyLoginPage_C_OnKeyDown::Key' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000140, "Member 'UMG_DailyLoginPage_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000158, "Member 'UMG_DailyLoginPage_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000210, "Member 'UMG_DailyLoginPage_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue) == 0x000218, "Member 'UMG_DailyLoginPage_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000228, "Member 'UMG_DailyLoginPage_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue) == 0x0002E0, "Member 'UMG_DailyLoginPage_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function UMG_DailyLoginPage.UMG_DailyLoginPage_C.OnFinishAnimation
// 0x0068 (0x0068 - 0x0000)
struct UMG_DailyLoginPage_C_OnFinishAnimation final
{
public:
	struct FPBRewardItem                          RewardItem;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBRewardItem>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0038(0x0010)(NoDestructor)
	class UUMG_NewItemPage_C*                     CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_DailyLoginPage_C_OnFinishAnimation) == 0x000008, "Wrong alignment on UMG_DailyLoginPage_C_OnFinishAnimation");
static_assert(sizeof(UMG_DailyLoginPage_C_OnFinishAnimation) == 0x000068, "Wrong size on UMG_DailyLoginPage_C_OnFinishAnimation");
static_assert(offsetof(UMG_DailyLoginPage_C_OnFinishAnimation, RewardItem) == 0x000000, "Member 'UMG_DailyLoginPage_C_OnFinishAnimation::RewardItem' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnFinishAnimation, K2Node_MakeArray_Array) == 0x000010, "Member 'UMG_DailyLoginPage_C_OnFinishAnimation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnFinishAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UMG_DailyLoginPage_C_OnFinishAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnFinishAnimation, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'UMG_DailyLoginPage_C_OnFinishAnimation::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnFinishAnimation, K2Node_MakeStruct_Anchors) == 0x000038, "Member 'UMG_DailyLoginPage_C_OnFinishAnimation::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnFinishAnimation, CallFunc_Create_ReturnValue) == 0x000048, "Member 'UMG_DailyLoginPage_C_OnFinishAnimation::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnFinishAnimation, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'UMG_DailyLoginPage_C_OnFinishAnimation::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnFinishAnimation, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000058, "Member 'UMG_DailyLoginPage_C_OnFinishAnimation::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_C_OnFinishAnimation, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UMG_DailyLoginPage_C_OnFinishAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

