#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_DashHint

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_HelmetHUD_DashHint.UMG_HelmetHUD_DashHint_C.ExecuteUbergraph_UMG_HelmetHUD_DashHint
// 0x0008 (0x0008 - 0x0000)
struct UMG_HelmetHUD_DashHint_C_ExecuteUbergraph_UMG_HelmetHUD_DashHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsMinus;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_HelmetHUD_DashHint_C_ExecuteUbergraph_UMG_HelmetHUD_DashHint) == 0x000004, "Wrong alignment on UMG_HelmetHUD_DashHint_C_ExecuteUbergraph_UMG_HelmetHUD_DashHint");
static_assert(sizeof(UMG_HelmetHUD_DashHint_C_ExecuteUbergraph_UMG_HelmetHUD_DashHint) == 0x000008, "Wrong size on UMG_HelmetHUD_DashHint_C_ExecuteUbergraph_UMG_HelmetHUD_DashHint");
static_assert(offsetof(UMG_HelmetHUD_DashHint_C_ExecuteUbergraph_UMG_HelmetHUD_DashHint, EntryPoint) == 0x000000, "Member 'UMG_HelmetHUD_DashHint_C_ExecuteUbergraph_UMG_HelmetHUD_DashHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_DashHint_C_ExecuteUbergraph_UMG_HelmetHUD_DashHint, K2Node_Event_bIsMinus) == 0x000004, "Member 'UMG_HelmetHUD_DashHint_C_ExecuteUbergraph_UMG_HelmetHUD_DashHint::K2Node_Event_bIsMinus' has a wrong offset!");

// Function UMG_HelmetHUD_DashHint.UMG_HelmetHUD_DashHint_C.K2_RefreshUseTimesInfo
// 0x0001 (0x0001 - 0x0000)
struct UMG_HelmetHUD_DashHint_C_K2_RefreshUseTimesInfo final
{
public:
	bool                                          bIsMinus;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_HelmetHUD_DashHint_C_K2_RefreshUseTimesInfo) == 0x000001, "Wrong alignment on UMG_HelmetHUD_DashHint_C_K2_RefreshUseTimesInfo");
static_assert(sizeof(UMG_HelmetHUD_DashHint_C_K2_RefreshUseTimesInfo) == 0x000001, "Wrong size on UMG_HelmetHUD_DashHint_C_K2_RefreshUseTimesInfo");
static_assert(offsetof(UMG_HelmetHUD_DashHint_C_K2_RefreshUseTimesInfo, bIsMinus) == 0x000000, "Member 'UMG_HelmetHUD_DashHint_C_K2_RefreshUseTimesInfo::bIsMinus' has a wrong offset!");

// Function UMG_HelmetHUD_DashHint.UMG_HelmetHUD_DashHint_C.RefreshUseTimesInfo
// 0x0020 (0x0020 - 0x0000)
struct UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo final
{
public:
	bool                                          bIsMinus;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo) == 0x000008, "Wrong alignment on UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo");
static_assert(sizeof(UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo) == 0x000020, "Wrong size on UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo");
static_assert(offsetof(UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo, bIsMinus) == 0x000000, "Member 'UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo::bIsMinus' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo, K2Node_SwitchInteger_CmpSuccess) == 0x000002, "Member 'UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000018, "Member 'UMG_HelmetHUD_DashHint_C_RefreshUseTimesInfo::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");

}

