#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Indicator_Missile

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_Indicator_Missile.UMG_Indicator_Missile_C.ExecuteUbergraph_UMG_Indicator_Missile
// 0x00D8 (0x00D8 - 0x0000)
struct UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0088)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0094(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCamp                                       K2Node_Event_NewCamp;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile) == 0x000008, "Wrong alignment on UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile");
static_assert(sizeof(UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile) == 0x0000D8, "Wrong size on UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile");
static_assert(offsetof(UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile, EntryPoint) == 0x000000, "Member 'UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile, K2Node_Event_IsDesignTime) == 0x000090, "Member 'UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile, K2Node_Event_MyGeometry) == 0x000094, "Member 'UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile, K2Node_Event_InDeltaTime) == 0x0000CC, "Member 'UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile, K2Node_Event_NewCamp) == 0x0000D0, "Member 'UMG_Indicator_Missile_C_ExecuteUbergraph_UMG_Indicator_Missile::K2Node_Event_NewCamp' has a wrong offset!");

// Function UMG_Indicator_Missile.UMG_Indicator_Missile_C.K2_UpdateCamp
// 0x0001 (0x0001 - 0x0000)
struct UMG_Indicator_Missile_C_K2_UpdateCamp final
{
public:
	EPBCamp                                       NewCamp;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Missile_C_K2_UpdateCamp) == 0x000001, "Wrong alignment on UMG_Indicator_Missile_C_K2_UpdateCamp");
static_assert(sizeof(UMG_Indicator_Missile_C_K2_UpdateCamp) == 0x000001, "Wrong size on UMG_Indicator_Missile_C_K2_UpdateCamp");
static_assert(offsetof(UMG_Indicator_Missile_C_K2_UpdateCamp, NewCamp) == 0x000000, "Member 'UMG_Indicator_Missile_C_K2_UpdateCamp::NewCamp' has a wrong offset!");

// Function UMG_Indicator_Missile.UMG_Indicator_Missile_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_Indicator_Missile_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Missile_C_Tick) == 0x000004, "Wrong alignment on UMG_Indicator_Missile_C_Tick");
static_assert(sizeof(UMG_Indicator_Missile_C_Tick) == 0x00003C, "Wrong size on UMG_Indicator_Missile_C_Tick");
static_assert(offsetof(UMG_Indicator_Missile_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_Indicator_Missile_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Missile_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_Indicator_Missile_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_Indicator_Missile.UMG_Indicator_Missile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_Indicator_Missile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Indicator_Missile_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_Indicator_Missile_C_PreConstruct");
static_assert(sizeof(UMG_Indicator_Missile_C_PreConstruct) == 0x000001, "Wrong size on UMG_Indicator_Missile_C_PreConstruct");
static_assert(offsetof(UMG_Indicator_Missile_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_Indicator_Missile_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

