#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Widget_TabBar

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Widget_TabBar.UMG_Widget_TabBar_C
// 0x0018 (0x02B0 - 0x0298)
class UUMG_Widget_TabBar_C final : public UPBAdvancedSwitcherTabBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_Widget_Button06_C*                 UMG_Widget_Button06_Left;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Widget_Button06_C*                 UMG_Widget_Button06_Right;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Widget_TabBar(int32 EntryPoint);
	void BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Right_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UMG_Widget_TabBar_UMG_Widget_Button06_Left_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Widget_TabBar_C">();
	}
	static class UUMG_Widget_TabBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Widget_TabBar_C>();
	}
};
static_assert(alignof(UUMG_Widget_TabBar_C) == 0x000008, "Wrong alignment on UUMG_Widget_TabBar_C");
static_assert(sizeof(UUMG_Widget_TabBar_C) == 0x0002B0, "Wrong size on UUMG_Widget_TabBar_C");
static_assert(offsetof(UUMG_Widget_TabBar_C, UberGraphFrame) == 0x000298, "Member 'UUMG_Widget_TabBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_TabBar_C, UMG_Widget_Button06_Left) == 0x0002A0, "Member 'UUMG_Widget_TabBar_C::UMG_Widget_Button06_Left' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_TabBar_C, UMG_Widget_Button06_Right) == 0x0002A8, "Member 'UUMG_Widget_TabBar_C::UMG_Widget_Button06_Right' has a wrong offset!");

}

