#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ArtBookPage

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_ArtBookPage.UMG_ArtBookPage_C.Init
// 0x0060 (0x0060 - 0x0000)
struct UMG_ArtBookPage_C_Init final
{
public:
	class FText                                   InLabel;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UTexture2D>              InImage;                                           // 0x0018(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0040(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ArtBookPage_C_Init) == 0x000008, "Wrong alignment on UMG_ArtBookPage_C_Init");
static_assert(sizeof(UMG_ArtBookPage_C_Init) == 0x000060, "Wrong size on UMG_ArtBookPage_C_Init");
static_assert(offsetof(UMG_ArtBookPage_C_Init, InLabel) == 0x000000, "Member 'UMG_ArtBookPage_C_Init::InLabel' has a wrong offset!");
static_assert(offsetof(UMG_ArtBookPage_C_Init, InImage) == 0x000018, "Member 'UMG_ArtBookPage_C_Init::InImage' has a wrong offset!");
static_assert(offsetof(UMG_ArtBookPage_C_Init, CallFunc_GetText_ReturnValue) == 0x000040, "Member 'UMG_ArtBookPage_C_Init::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBookPage_C_Init, CallFunc_TextIsEmpty_ReturnValue) == 0x000058, "Member 'UMG_ArtBookPage_C_Init::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

}

