#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Version

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_Version.UMG_Version_C.ExecuteUbergraph_UMG_Version
// 0x0038 (0x0038 - 0x0000)
struct UMG_Version_C_ExecuteUbergraph_UMG_Version final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetProjectVersion_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(UMG_Version_C_ExecuteUbergraph_UMG_Version) == 0x000008, "Wrong alignment on UMG_Version_C_ExecuteUbergraph_UMG_Version");
static_assert(sizeof(UMG_Version_C_ExecuteUbergraph_UMG_Version) == 0x000038, "Wrong size on UMG_Version_C_ExecuteUbergraph_UMG_Version");
static_assert(offsetof(UMG_Version_C_ExecuteUbergraph_UMG_Version, EntryPoint) == 0x000000, "Member 'UMG_Version_C_ExecuteUbergraph_UMG_Version::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Version_C_ExecuteUbergraph_UMG_Version, CallFunc_GetProjectVersion_ReturnValue) == 0x000008, "Member 'UMG_Version_C_ExecuteUbergraph_UMG_Version::CallFunc_GetProjectVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Version_C_ExecuteUbergraph_UMG_Version, K2Node_Event_IsDesignTime) == 0x000018, "Member 'UMG_Version_C_ExecuteUbergraph_UMG_Version::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_Version_C_ExecuteUbergraph_UMG_Version, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'UMG_Version_C_ExecuteUbergraph_UMG_Version::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UMG_Version.UMG_Version_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_Version_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Version_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_Version_C_PreConstruct");
static_assert(sizeof(UMG_Version_C_PreConstruct) == 0x000001, "Wrong size on UMG_Version_C_PreConstruct");
static_assert(offsetof(UMG_Version_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_Version_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

