#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CumulativeLoginPage

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CumulativeLoginPage.UMG_CumulativeLoginPage_C
// 0x00A8 (0x0408 - 0x0360)
class UUMG_CumulativeLoginPage_C final : public UPBCumulativeLoginActivityPageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Close;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_117;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Right;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      PBInputTipsImage_74;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_DateCard;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Countdown_C*                       UMG_Countdown;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoginDateCard_C*                   UMG_LoginDateCard_1;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoginDateCard_C*                   UMG_LoginDateCard_2;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoginDateCard_C*                   UMG_LoginDateCard_3;                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoginDateCard_C*                   UMG_LoginDateCard_4;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoginDateCard_C*                   UMG_LoginDateCard_5;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoginDateCard_C*                   UMG_LoginDateCard_6;                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoginDateCard_C*                   UMG_LoginDateCard_7;                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_1;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text_2;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bCanClosePage;                                     // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_CumulativeLoginPage(int32 EntryPoint);
	void K2_RefreshLoginActivityInfo();
	void BndEvt__UMG_CumulativeLoginPage_Button_Close_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void RefreshDateCardList();
	void OnCloseNewItemPage();
	void OnFinishAnimation(const struct FPBRewardItem& RewardItem);
	void TryToClosePage();
	void GetCurrentDate(int32* OutCurrentDate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CumulativeLoginPage_C">();
	}
	static class UUMG_CumulativeLoginPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CumulativeLoginPage_C>();
	}
};
static_assert(alignof(UUMG_CumulativeLoginPage_C) == 0x000008, "Wrong alignment on UUMG_CumulativeLoginPage_C");
static_assert(sizeof(UUMG_CumulativeLoginPage_C) == 0x000408, "Wrong size on UUMG_CumulativeLoginPage_C");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UberGraphFrame) == 0x000360, "Member 'UUMG_CumulativeLoginPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, Button_Close) == 0x000368, "Member 'UUMG_CumulativeLoginPage_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, CanvasPanel_0) == 0x000370, "Member 'UUMG_CumulativeLoginPage_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, Image_117) == 0x000378, "Member 'UUMG_CumulativeLoginPage_C::Image_117' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, Image_BG) == 0x000380, "Member 'UUMG_CumulativeLoginPage_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, Image_Line) == 0x000388, "Member 'UUMG_CumulativeLoginPage_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, Image_Right) == 0x000390, "Member 'UUMG_CumulativeLoginPage_C::Image_Right' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, PBInputTipsImage_74) == 0x000398, "Member 'UUMG_CumulativeLoginPage_C::PBInputTipsImage_74' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, SafeZone_0) == 0x0003A0, "Member 'UUMG_CumulativeLoginPage_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, ScrollBox_DateCard) == 0x0003A8, "Member 'UUMG_CumulativeLoginPage_C::ScrollBox_DateCard' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_Countdown) == 0x0003B0, "Member 'UUMG_CumulativeLoginPage_C::UMG_Countdown' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_LoginDateCard_1) == 0x0003B8, "Member 'UUMG_CumulativeLoginPage_C::UMG_LoginDateCard_1' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_LoginDateCard_2) == 0x0003C0, "Member 'UUMG_CumulativeLoginPage_C::UMG_LoginDateCard_2' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_LoginDateCard_3) == 0x0003C8, "Member 'UUMG_CumulativeLoginPage_C::UMG_LoginDateCard_3' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_LoginDateCard_4) == 0x0003D0, "Member 'UUMG_CumulativeLoginPage_C::UMG_LoginDateCard_4' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_LoginDateCard_5) == 0x0003D8, "Member 'UUMG_CumulativeLoginPage_C::UMG_LoginDateCard_5' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_LoginDateCard_6) == 0x0003E0, "Member 'UUMG_CumulativeLoginPage_C::UMG_LoginDateCard_6' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_LoginDateCard_7) == 0x0003E8, "Member 'UUMG_CumulativeLoginPage_C::UMG_LoginDateCard_7' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_STD_Text_1) == 0x0003F0, "Member 'UUMG_CumulativeLoginPage_C::UMG_STD_Text_1' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, UMG_STD_Text_2) == 0x0003F8, "Member 'UUMG_CumulativeLoginPage_C::UMG_STD_Text_2' has a wrong offset!");
static_assert(offsetof(UUMG_CumulativeLoginPage_C, bCanClosePage) == 0x000400, "Member 'UUMG_CumulativeLoginPage_C::bCanClosePage' has a wrong offset!");

}

