#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Progression_SubPage_Weapon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C
// 0x0060 (0x02C0 - 0x0260)
class UUMG_Progression_SubPage_Weapon_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_73;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_87;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             RewardContainer;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBWidgetSwitcher*                      RewardSwitcher;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WeaponName;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_ProgressionList;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_WeaponList;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             WeaponItemsContainer;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   WeaponID;                                          // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionWeaponItem_C*           CurrentSelectedWeapon;                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionReward_C*               CurrentSelectedRewardWidget;                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Progression_SubPage_Weapon(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void InitWeaponList();
	void RefreshWeaponName();
	void RefreshProgressionList();
	void RefreshWeaponInfo();
	void OnSelectedWeapon(class FName WeaponID_0, class UUMG_ProgressionWeaponItem_C* ClickedWidget);
	void OnRewardSwitch(class UUMG_ProgressionReward_C* Widget);
	class UWidget* NavigationToFirstReward(EUINavigation Navigation_0);
	class UWidget* NavigationToSelectedWeapon(EUINavigation Navigation_0);
	void FocusOnFirstWeapon();
	void UnfocusCurrentWeapon();
	void OnPageSwitch();
	void RefreshWeaponNewFlag();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Progression_SubPage_Weapon_C">();
	}
	static class UUMG_Progression_SubPage_Weapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Progression_SubPage_Weapon_C>();
	}
};
static_assert(alignof(UUMG_Progression_SubPage_Weapon_C) == 0x000008, "Wrong alignment on UUMG_Progression_SubPage_Weapon_C");
static_assert(sizeof(UUMG_Progression_SubPage_Weapon_C) == 0x0002C0, "Wrong size on UUMG_Progression_SubPage_Weapon_C");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, UberGraphFrame) == 0x000260, "Member 'UUMG_Progression_SubPage_Weapon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, Image_73) == 0x000268, "Member 'UUMG_Progression_SubPage_Weapon_C::Image_73' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, Image_87) == 0x000270, "Member 'UUMG_Progression_SubPage_Weapon_C::Image_87' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, RewardContainer) == 0x000278, "Member 'UUMG_Progression_SubPage_Weapon_C::RewardContainer' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, RewardSwitcher) == 0x000280, "Member 'UUMG_Progression_SubPage_Weapon_C::RewardSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, TextBlock_WeaponName) == 0x000288, "Member 'UUMG_Progression_SubPage_Weapon_C::TextBlock_WeaponName' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, VerticalBox_ProgressionList) == 0x000290, "Member 'UUMG_Progression_SubPage_Weapon_C::VerticalBox_ProgressionList' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, VerticalBox_WeaponList) == 0x000298, "Member 'UUMG_Progression_SubPage_Weapon_C::VerticalBox_WeaponList' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, WeaponItemsContainer) == 0x0002A0, "Member 'UUMG_Progression_SubPage_Weapon_C::WeaponItemsContainer' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, WeaponID) == 0x0002A8, "Member 'UUMG_Progression_SubPage_Weapon_C::WeaponID' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, CurrentSelectedWeapon) == 0x0002B0, "Member 'UUMG_Progression_SubPage_Weapon_C::CurrentSelectedWeapon' has a wrong offset!");
static_assert(offsetof(UUMG_Progression_SubPage_Weapon_C, CurrentSelectedRewardWidget) == 0x0002B8, "Member 'UUMG_Progression_SubPage_Weapon_C::CurrentSelectedRewardWidget' has a wrong offset!");

}

