#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ContentFilter

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_ContentFilter.UMG_ContentFilter_C.ExecuteUbergraph_UMG_ContentFilter
// 0x0038 (0x0038 - 0x0000)
struct UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter) == 0x000008, "Wrong alignment on UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter");
static_assert(sizeof(UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter) == 0x000038, "Wrong size on UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter");
static_assert(offsetof(UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter, EntryPoint) == 0x000000, "Member 'UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter, K2Node_ComponentBoundEvent_Index) == 0x000010, "Member 'UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter, CallFunc_GetDisplayName_ReturnValue_1) == 0x000028, "Member 'UMG_ContentFilter_C_ExecuteUbergraph_UMG_ContentFilter::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");

// Function UMG_ContentFilter.UMG_ContentFilter_C.BndEvt__UMG_SettingMouseKeyboard_Card_Gameplay_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_ContentFilter_C_BndEvt__UMG_SettingMouseKeyboard_Card_Gameplay_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ContentFilter_C_BndEvt__UMG_SettingMouseKeyboard_Card_Gameplay_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature) == 0x000004, "Wrong alignment on UMG_ContentFilter_C_BndEvt__UMG_SettingMouseKeyboard_Card_Gameplay_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature");
static_assert(sizeof(UMG_ContentFilter_C_BndEvt__UMG_SettingMouseKeyboard_Card_Gameplay_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature) == 0x000004, "Wrong size on UMG_ContentFilter_C_BndEvt__UMG_SettingMouseKeyboard_Card_Gameplay_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature");
static_assert(offsetof(UMG_ContentFilter_C_BndEvt__UMG_SettingMouseKeyboard_Card_Gameplay_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature, Index_0) == 0x000000, "Member 'UMG_ContentFilter_C_BndEvt__UMG_SettingMouseKeyboard_Card_Gameplay_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature::Index_0' has a wrong offset!");

// Function UMG_ContentFilter.UMG_ContentFilter_C.SwitchOptionList
// 0x0004 (0x0004 - 0x0000)
struct UMG_ContentFilter_C_SwitchOptionList final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ContentFilter_C_SwitchOptionList) == 0x000004, "Wrong alignment on UMG_ContentFilter_C_SwitchOptionList");
static_assert(sizeof(UMG_ContentFilter_C_SwitchOptionList) == 0x000004, "Wrong size on UMG_ContentFilter_C_SwitchOptionList");
static_assert(offsetof(UMG_ContentFilter_C_SwitchOptionList, Index_0) == 0x000000, "Member 'UMG_ContentFilter_C_SwitchOptionList::Index_0' has a wrong offset!");

// Function UMG_ContentFilter.UMG_ContentFilter_C.BP_GetDesiredFocusTarget
// 0x0050 (0x0050 - 0x0000)
struct UMG_ContentFilter_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Option_C*                          K2Node_DynamicCast_AsUMG_Option;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_ContentFilter_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget) == 0x000050, "Wrong size on UMG_ContentFilter_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, CallFunc_Array_Get_Item) == 0x000030, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsUMG_Option) == 0x000040, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsUMG_Option' has a wrong offset!");
static_assert(offsetof(UMG_ContentFilter_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'UMG_ContentFilter_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

