#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_LeftPod

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.ExecuteUbergraph_UMG_InGameHUD_LeftPod
// 0x0020 (0x0020 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeployDuration;                     // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InReloadDuration;                     // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod) == 0x000008, "Wrong alignment on UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod) == 0x000020, "Wrong size on UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod, EntryPoint) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod, K2Node_Event_InDeployDuration) == 0x000014, "Member 'UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod::K2Node_Event_InDeployDuration' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod, K2Node_Event_InReloadDuration) == 0x000018, "Member 'UMG_InGameHUD_LeftPod_C_ExecuteUbergraph_UMG_InGameHUD_LeftPod::K2Node_Event_InReloadDuration' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.K2_RefreshPodReloadInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_K2_RefreshPodReloadInfo final
{
public:
	float                                         InReloadDuration;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_K2_RefreshPodReloadInfo) == 0x000004, "Wrong alignment on UMG_InGameHUD_LeftPod_C_K2_RefreshPodReloadInfo");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_K2_RefreshPodReloadInfo) == 0x000004, "Wrong size on UMG_InGameHUD_LeftPod_C_K2_RefreshPodReloadInfo");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_K2_RefreshPodReloadInfo, InReloadDuration) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_K2_RefreshPodReloadInfo::InReloadDuration' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.K2_RefreshPodDeployInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_K2_RefreshPodDeployInfo final
{
public:
	float                                         InDeployDuration;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_K2_RefreshPodDeployInfo) == 0x000004, "Wrong alignment on UMG_InGameHUD_LeftPod_C_K2_RefreshPodDeployInfo");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_K2_RefreshPodDeployInfo) == 0x000004, "Wrong size on UMG_InGameHUD_LeftPod_C_K2_RefreshPodDeployInfo");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_K2_RefreshPodDeployInfo, InDeployDuration) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_K2_RefreshPodDeployInfo::InDeployDuration' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.RefreshIcon
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_RefreshIcon final
{
public:
	struct FPBPodDefinitionRedirectionRow         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBPodDefinitionRow                    CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0018(0x0190)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_RefreshIcon) == 0x000008, "Wrong alignment on UMG_InGameHUD_LeftPod_C_RefreshIcon");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_RefreshIcon) == 0x0001B0, "Wrong size on UMG_InGameHUD_LeftPod_C_RefreshIcon");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshIcon, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_RefreshIcon::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshIcon, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000010, "Member 'UMG_InGameHUD_LeftPod_C_RefreshIcon::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshIcon, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000018, "Member 'UMG_InGameHUD_LeftPod_C_RefreshIcon::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshIcon, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0001A8, "Member 'UMG_InGameHUD_LeftPod_C_RefreshIcon::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.RefreshTotalAmmoInfo
// 0x0038 (0x0038 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo) == 0x000038, "Wrong size on UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000029, "Member 'UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000030, "Member 'UMG_InGameHUD_LeftPod_C_RefreshTotalAmmoInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.RefreshAmmoInCilpInfo
// 0x0080 (0x0080 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo final
{
public:
	int32                                         LocalAmmoInClip;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0028)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0028)()
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo) == 0x000080, "Wrong size on UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo, LocalAmmoInClip) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo::LocalAmmoInClip' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo, K2Node_MakeStruct_SlateColor_1) == 0x000058, "Member 'UMG_InGameHUD_LeftPod_C_RefreshAmmoInCilpInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.RefreshRemainingAmmoInfo
// 0x0078 (0x0078 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo final
{
public:
	int32                                         LocalRemainingAmmo;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0048(0x0028)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo) == 0x000078, "Wrong size on UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo, LocalRemainingAmmo) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo::LocalRemainingAmmo' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo, K2Node_MakeStruct_SlateColor_1) == 0x000048, "Member 'UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'UMG_InGameHUD_LeftPod_C_RefreshRemainingAmmoInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.RefreshDeployInfo
// 0x0028 (0x0028 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_RefreshDeployInfo final
{
public:
	float                                         InReloadRuration;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_RefreshDeployInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_LeftPod_C_RefreshDeployInfo");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_RefreshDeployInfo) == 0x000028, "Wrong size on UMG_InGameHUD_LeftPod_C_RefreshDeployInfo");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshDeployInfo, InReloadRuration) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_RefreshDeployInfo::InReloadRuration' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshDeployInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_InGameHUD_LeftPod_C_RefreshDeployInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshDeployInfo, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'UMG_InGameHUD_LeftPod_C_RefreshDeployInfo::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshDeployInfo, CallFunc_GetEndTime_ReturnValue) == 0x000018, "Member 'UMG_InGameHUD_LeftPod_C_RefreshDeployInfo::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshDeployInfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'UMG_InGameHUD_LeftPod_C_RefreshDeployInfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshDeployInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'UMG_InGameHUD_LeftPod_C_RefreshDeployInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.RefreshUndeployInfo
// 0x0040 (0x0040 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo) == 0x000040, "Wrong size on UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'UMG_InGameHUD_LeftPod_C_RefreshUndeployInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.RefreshReloadInfo
// 0x0018 (0x0018 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_RefreshReloadInfo final
{
public:
	float                                         InReloadDuration;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_RefreshReloadInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_LeftPod_C_RefreshReloadInfo");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_RefreshReloadInfo) == 0x000018, "Wrong size on UMG_InGameHUD_LeftPod_C_RefreshReloadInfo");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshReloadInfo, InReloadDuration) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_RefreshReloadInfo::InReloadDuration' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshReloadInfo, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'UMG_InGameHUD_LeftPod_C_RefreshReloadInfo::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshReloadInfo, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000005, "Member 'UMG_InGameHUD_LeftPod_C_RefreshReloadInfo::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshReloadInfo, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_LeftPod_C_RefreshReloadInfo::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshReloadInfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'UMG_InGameHUD_LeftPod_C_RefreshReloadInfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshReloadInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'UMG_InGameHUD_LeftPod_C_RefreshReloadInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_LeftPod.UMG_InGameHUD_LeftPod_C.RefreshReadyInfo
// 0x0030 (0x0030 - 0x0000)
struct UMG_InGameHUD_LeftPod_C_RefreshReadyInfo final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_LeftPod_C_RefreshReadyInfo) == 0x000008, "Wrong alignment on UMG_InGameHUD_LeftPod_C_RefreshReadyInfo");
static_assert(sizeof(UMG_InGameHUD_LeftPod_C_RefreshReadyInfo) == 0x000030, "Wrong size on UMG_InGameHUD_LeftPod_C_RefreshReadyInfo");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshReadyInfo, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UMG_InGameHUD_LeftPod_C_RefreshReadyInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_LeftPod_C_RefreshReadyInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'UMG_InGameHUD_LeftPod_C_RefreshReadyInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

