#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Missile_Count

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Missile_Count.UMG_Missile_Count_C
// 0x0120 (0x0380 - 0x0260)
class UUMG_Missile_Count_C final : public UPBUserWidget
{
public:
	class UImage*                                 Image_0;                                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            MslOn;                                             // 0x0268(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            MslOff;                                            // 0x02F0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ID;                                                // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UseAmmo();
	void GiveAmmo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Missile_Count_C">();
	}
	static class UUMG_Missile_Count_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Missile_Count_C>();
	}
};
static_assert(alignof(UUMG_Missile_Count_C) == 0x000008, "Wrong alignment on UUMG_Missile_Count_C");
static_assert(sizeof(UUMG_Missile_Count_C) == 0x000380, "Wrong size on UUMG_Missile_Count_C");
static_assert(offsetof(UUMG_Missile_Count_C, Image_0) == 0x000260, "Member 'UUMG_Missile_Count_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUMG_Missile_Count_C, MslOn) == 0x000268, "Member 'UUMG_Missile_Count_C::MslOn' has a wrong offset!");
static_assert(offsetof(UUMG_Missile_Count_C, MslOff) == 0x0002F0, "Member 'UUMG_Missile_Count_C::MslOff' has a wrong offset!");
static_assert(offsetof(UUMG_Missile_Count_C, ID) == 0x000378, "Member 'UUMG_Missile_Count_C::ID' has a wrong offset!");

}

