#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PromptSetting

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_PromptSetting.UMG_PromptSetting_C.ExecuteUbergraph_UMG_PromptSetting
// 0x0088 (0x0088 - 0x0000)
struct UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_GetTopMenuWidget_OutTopMenuWidget;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_MainMenuBase_C*                    K2Node_DynamicCast_AsUMG_Main_Menu_Base;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_GetTopMenuWidget_OutTopMenuWidget_1;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Assignment_C*                      K2Node_DynamicCast_AsUMG_Assignment;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue_2;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushMenu_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting) == 0x000008, "Wrong alignment on UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting");
static_assert(sizeof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting) == 0x000088, "Wrong size on UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, EntryPoint) == 0x000000, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_PushNormalPrompt_ReturnValue) == 0x000010, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_PushNormalPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000018, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_GetTopMenuWidget_OutTopMenuWidget) == 0x000020, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_GetTopMenuWidget_OutTopMenuWidget' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, K2Node_DynamicCast_AsUMG_Main_Menu_Base) == 0x000028, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::K2Node_DynamicCast_AsUMG_Main_Menu_Base' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000038, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_GetTopMenuWidget_OutTopMenuWidget_1) == 0x000040, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_GetTopMenuWidget_OutTopMenuWidget_1' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000048, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, K2Node_DynamicCast_AsUMG_Assignment) == 0x000050, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::K2Node_DynamicCast_AsUMG_Assignment' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_PushNormalPrompt_ReturnValue_1) == 0x000060, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_PushNormalPrompt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_GetLocalPlayerSubsystem_ReturnValue_4) == 0x000068, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_GetLocalPlayerSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_PushNormalPrompt_ReturnValue_2) == 0x000070, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_PushNormalPrompt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_GetLocalPlayerSubsystem_ReturnValue_5) == 0x000078, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_GetLocalPlayerSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting, CallFunc_PushMenu_ReturnValue) == 0x000080, "Member 'UMG_PromptSetting_C_ExecuteUbergraph_UMG_PromptSetting::CallFunc_PushMenu_ReturnValue' has a wrong offset!");

// Function UMG_PromptSetting.UMG_PromptSetting_C.OnKeyDown
// 0x02C0 (0x02C0 - 0x0000)
struct UMG_PromptSetting_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0150(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0208(0x00B8)()
};
static_assert(alignof(UMG_PromptSetting_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_PromptSetting_C_OnKeyDown");
static_assert(sizeof(UMG_PromptSetting_C_OnKeyDown) == 0x0002C0, "Wrong size on UMG_PromptSetting_C_OnKeyDown");
static_assert(offsetof(UMG_PromptSetting_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_PromptSetting_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_PromptSetting_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_PromptSetting_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'UMG_PromptSetting_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_OnKeyDown, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000140, "Member 'UMG_PromptSetting_C_OnKeyDown::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000148, "Member 'UMG_PromptSetting_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000150, "Member 'UMG_PromptSetting_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PromptSetting_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000208, "Member 'UMG_PromptSetting_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function UMG_PromptSetting.UMG_PromptSetting_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_PromptSetting_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PromptSetting_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_PromptSetting_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_PromptSetting_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_PromptSetting_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_PromptSetting_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_PromptSetting_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

