#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameChallengeCard

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EndGameChallengeCard.UMG_EndGameChallengeCard_C
// 0x0080 (0x0340 - 0x02C0)
class UUMG_EndGameChallengeCard_C final : public UPBEndGameChallengeCardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               ChallengeComplete;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ChallengeTextBlock_Master_1;                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentProgressText;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_127;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_204;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_384;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Master;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TopLine;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Weapon;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemNameText;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxProgressText;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_465;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           RewardItemCard;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             RewardScrollBox;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TargetText;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_EndGameChallengeCard(int32 EntryPoint);
	void K2_UpdateProgression();
	void PreConstruct(bool IsDesignTime);
	void UpdateStyle();
	void UpdateProgressBar();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EndGameChallengeCard_C">();
	}
	static class UUMG_EndGameChallengeCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EndGameChallengeCard_C>();
	}
};
static_assert(alignof(UUMG_EndGameChallengeCard_C) == 0x000008, "Wrong alignment on UUMG_EndGameChallengeCard_C");
static_assert(sizeof(UUMG_EndGameChallengeCard_C) == 0x000340, "Wrong size on UUMG_EndGameChallengeCard_C");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, UberGraphFrame) == 0x0002C0, "Member 'UUMG_EndGameChallengeCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, ChallengeComplete) == 0x0002C8, "Member 'UUMG_EndGameChallengeCard_C::ChallengeComplete' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, ChallengeTextBlock_Master_1) == 0x0002D0, "Member 'UUMG_EndGameChallengeCard_C::ChallengeTextBlock_Master_1' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, CurrentProgressText) == 0x0002D8, "Member 'UUMG_EndGameChallengeCard_C::CurrentProgressText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, Image_127) == 0x0002E0, "Member 'UUMG_EndGameChallengeCard_C::Image_127' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, Image_204) == 0x0002E8, "Member 'UUMG_EndGameChallengeCard_C::Image_204' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, Image_384) == 0x0002F0, "Member 'UUMG_EndGameChallengeCard_C::Image_384' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, Image_Master) == 0x0002F8, "Member 'UUMG_EndGameChallengeCard_C::Image_Master' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, Image_TopLine) == 0x000300, "Member 'UUMG_EndGameChallengeCard_C::Image_TopLine' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, Image_Weapon) == 0x000308, "Member 'UUMG_EndGameChallengeCard_C::Image_Weapon' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, ItemNameText) == 0x000310, "Member 'UUMG_EndGameChallengeCard_C::ItemNameText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, MaxProgressText) == 0x000318, "Member 'UUMG_EndGameChallengeCard_C::MaxProgressText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, ProgressBar_465) == 0x000320, "Member 'UUMG_EndGameChallengeCard_C::ProgressBar_465' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, RewardItemCard) == 0x000328, "Member 'UUMG_EndGameChallengeCard_C::RewardItemCard' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, RewardScrollBox) == 0x000330, "Member 'UUMG_EndGameChallengeCard_C::RewardScrollBox' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengeCard_C, TargetText) == 0x000338, "Member 'UUMG_EndGameChallengeCard_C::TargetText' has a wrong offset!");

}

