#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MainMenuBase

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_MainMenuBase.UMG_MainMenuBase_C
// 0x00C0 (0x0420 - 0x0360)
class UUMG_MainMenuBase_C final : public UPBMainMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopNetworkConnectionTip;                           // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_NetworkStatus;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BoundaryCoin;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Customize_C*                       Customization;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBG;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBAdvancedSwitcher*                    MainSwitcher;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MainMenu_C*                        Play;                                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBottomTips_C*                          ReconnectTips;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_98;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpaceCoin;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ActivityCenter_C*                  UMG_ActivityCenter;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CareerPage_C*                      UMG_CareerPage_;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ChatWidget_C*                      UMG_ChatWidget_Matching;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Gallery_C*                         UMG_Gallery;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MessagePanel_C*                    UMG_MessagePanel;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Overview_C*                        UMG_Overview;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_StoreBase_C*                       UMG_StoreBase;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_NetworkStatus;                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PartyLeaderInMatchmaking_C*        LeaderSearching;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_PartyMemberInMatchmaking_C*        MemberSearching;                                   // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_FinishMatchmaking_C*               FinishSearching;                                   // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstActivated;                                    // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldQueryCurrency;                               // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldCheckVC;                                     // 0x041A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B[0x1];                                      // 0x041B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreBoundaryCoin;                                   // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_MainMenuBase(int32 EntryPoint);
	void CustomEvent_2();
	void CustomEvent_0();
	void BndEvt__UMG_MainMenuBase_UMG_StoreBase_K2Node_ComponentBoundEvent_2_OnWidgetActivationChanged__DelegateSignature();
	void BndEvt__UMG_MainMenuBase_UMG_StoreBase_K2Node_ComponentBoundEvent_1_OnWidgetActivationChanged__DelegateSignature();
	void K2_UpdateUnlockPoint(const class FText& InPoint);
	void BP_OnActivated();
	void K2_HandleFeedBack();
	void Construct();
	void K2_RefreshEscapeText();
	void BndEvt__UMG_MainMenuBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature(int32 CurrentSelectIndex, int32 LastSelectIndex);
	void K2_RestoreFocus();
	void OnMatchmakingStateChangedDelegateEvent(EPBMatchmakingStatus NewState);
	void OnInitialized();
	void BndEvt__UMG_MainMenuBase_UMG_Gallery_K2Node_ComponentBoundEvent_5_CardHovered__DelegateSignature();
	void BndEvt__UMG_MainMenuBase_UMG_Overview_K2Node_ComponentBoundEvent_4_StoreBtnClicked__DelegateSignature();
	void BndEvt__UMG_MainMenuBase_UMG_Overview_K2Node_ComponentBoundEvent_3_CardHovered__DelegateSignature();
	void BndEvt__UMG_MainMenuBase_UMG_CareerPage_104_K2Node_ComponentBoundEvent_2_OnWidgetActivationChanged__DelegateSignature();
	void BndEvt__UMG_MainMenuBase_OVERVIEW_K2Node_ComponentBoundEvent_0_CardHovered__DelegateSignature();
	void BndEvt__UMG_MainMenuBase_CUSTOMIZATION_K2Node_ComponentBoundEvent_1_CardHovered__DelegateSignature();
	void OnMatchFound();
	void OnMatchNotFound();
	void On_Matchmaking_State_Changed_V2(EPBMatchmakingStatus NewParam);
	void OnPromoteMemberInMatchmaking();
	void OnSavePageEvent(class FName PageName);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	bool BP_OnHandleBackAction();
	void ShowActivityPopPage();
	void SwitchPage(int32 PageIndex, class UWidget** ActiveWidget);
	void NotifyStreamerMode();
	void OnCurrencyUpdate();
	void SetCurrencyText();
	void InitializeCurrency();
	void UMG_MainMenuBase_AutoGenFunc(int32 Index_0);
	void HideStorePage();
	void RecordInteractInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_MainMenuBase_C">();
	}
	static class UUMG_MainMenuBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_MainMenuBase_C>();
	}
};
static_assert(alignof(UUMG_MainMenuBase_C) == 0x000008, "Wrong alignment on UUMG_MainMenuBase_C");
static_assert(sizeof(UUMG_MainMenuBase_C) == 0x000420, "Wrong size on UUMG_MainMenuBase_C");
static_assert(offsetof(UUMG_MainMenuBase_C, UberGraphFrame) == 0x000360, "Member 'UUMG_MainMenuBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, PopNetworkConnectionTip) == 0x000368, "Member 'UUMG_MainMenuBase_C::PopNetworkConnectionTip' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, NewAnimation) == 0x000370, "Member 'UUMG_MainMenuBase_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, Border_NetworkStatus) == 0x000378, "Member 'UUMG_MainMenuBase_C::Border_NetworkStatus' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, BoundaryCoin) == 0x000380, "Member 'UUMG_MainMenuBase_C::BoundaryCoin' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, Customization) == 0x000388, "Member 'UUMG_MainMenuBase_C::Customization' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, ImageBG) == 0x000390, "Member 'UUMG_MainMenuBase_C::ImageBG' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, MainSwitcher) == 0x000398, "Member 'UUMG_MainMenuBase_C::MainSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, Play) == 0x0003A0, "Member 'UUMG_MainMenuBase_C::Play' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, ReconnectTips) == 0x0003A8, "Member 'UUMG_MainMenuBase_C::ReconnectTips' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, SafeZone_98) == 0x0003B0, "Member 'UUMG_MainMenuBase_C::SafeZone_98' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, SpaceCoin) == 0x0003B8, "Member 'UUMG_MainMenuBase_C::SpaceCoin' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, UMG_ActivityCenter) == 0x0003C0, "Member 'UUMG_MainMenuBase_C::UMG_ActivityCenter' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, UMG_CareerPage_) == 0x0003C8, "Member 'UUMG_MainMenuBase_C::UMG_CareerPage_' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, UMG_ChatWidget_Matching) == 0x0003D0, "Member 'UUMG_MainMenuBase_C::UMG_ChatWidget_Matching' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, UMG_Gallery) == 0x0003D8, "Member 'UUMG_MainMenuBase_C::UMG_Gallery' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, UMG_MessagePanel) == 0x0003E0, "Member 'UUMG_MainMenuBase_C::UMG_MessagePanel' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, UMG_Overview) == 0x0003E8, "Member 'UUMG_MainMenuBase_C::UMG_Overview' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, UMG_StoreBase) == 0x0003F0, "Member 'UUMG_MainMenuBase_C::UMG_StoreBase' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, WidgetSwitcher_NetworkStatus) == 0x0003F8, "Member 'UUMG_MainMenuBase_C::WidgetSwitcher_NetworkStatus' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, LeaderSearching) == 0x000400, "Member 'UUMG_MainMenuBase_C::LeaderSearching' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, MemberSearching) == 0x000408, "Member 'UUMG_MainMenuBase_C::MemberSearching' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, FinishSearching) == 0x000410, "Member 'UUMG_MainMenuBase_C::FinishSearching' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, FirstActivated) == 0x000418, "Member 'UUMG_MainMenuBase_C::FirstActivated' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, ShouldQueryCurrency) == 0x000419, "Member 'UUMG_MainMenuBase_C::ShouldQueryCurrency' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, ShouldCheckVC) == 0x00041A, "Member 'UUMG_MainMenuBase_C::ShouldCheckVC' has a wrong offset!");
static_assert(offsetof(UUMG_MainMenuBase_C, PreBoundaryCoin) == 0x00041C, "Member 'UUMG_MainMenuBase_C::PreBoundaryCoin' has a wrong offset!");

}

