#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Store

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_Store.UMG_Store_C.ExecuteUbergraph_UMG_Store
// 0x0028 (0x0028 - 0x0000)
struct UMG_Store_C_ExecuteUbergraph_UMG_Store final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_CurrentSelectIndex;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LastSelectIndex;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBStoreManagerV2*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Store_C_ExecuteUbergraph_UMG_Store) == 0x000008, "Wrong alignment on UMG_Store_C_ExecuteUbergraph_UMG_Store");
static_assert(sizeof(UMG_Store_C_ExecuteUbergraph_UMG_Store) == 0x000028, "Wrong size on UMG_Store_C_ExecuteUbergraph_UMG_Store");
static_assert(offsetof(UMG_Store_C_ExecuteUbergraph_UMG_Store, EntryPoint) == 0x000000, "Member 'UMG_Store_C_ExecuteUbergraph_UMG_Store::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Store_C_ExecuteUbergraph_UMG_Store, K2Node_ComponentBoundEvent_CurrentSelectIndex) == 0x000004, "Member 'UMG_Store_C_ExecuteUbergraph_UMG_Store::K2Node_ComponentBoundEvent_CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_Store_C_ExecuteUbergraph_UMG_Store, K2Node_ComponentBoundEvent_LastSelectIndex) == 0x000008, "Member 'UMG_Store_C_ExecuteUbergraph_UMG_Store::K2Node_ComponentBoundEvent_LastSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_Store_C_ExecuteUbergraph_UMG_Store, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'UMG_Store_C_ExecuteUbergraph_UMG_Store::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(UMG_Store_C_ExecuteUbergraph_UMG_Store, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'UMG_Store_C_ExecuteUbergraph_UMG_Store::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(UMG_Store_C_ExecuteUbergraph_UMG_Store, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'UMG_Store_C_ExecuteUbergraph_UMG_Store::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_Store.UMG_Store_C.BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_Store.UMG_Store_C.BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_Store_C_BndEvt__UMG_Store_UMG_ChargeButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_Store.UMG_Store_C.BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_Store_C_BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature final
{
public:
	int32                                         CurrentSelectIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSelectIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Store_C_BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000004, "Wrong alignment on UMG_Store_C_BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(sizeof(UMG_Store_C_BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000008, "Wrong size on UMG_Store_C_BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(offsetof(UMG_Store_C_BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, CurrentSelectIndex) == 0x000000, "Member 'UMG_Store_C_BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_Store_C_BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, LastSelectIndex) == 0x000004, "Member 'UMG_Store_C_BndEvt__UMG_Store_Switcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::LastSelectIndex' has a wrong offset!");

// Function UMG_Store.UMG_Store_C.RecordInteractInfo
// 0x0010 (0x0010 - 0x0000)
struct UMG_Store_C_RecordInteractInfo final
{
public:
	class UPBEventTrackingManager*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Store_C_RecordInteractInfo) == 0x000008, "Wrong alignment on UMG_Store_C_RecordInteractInfo");
static_assert(sizeof(UMG_Store_C_RecordInteractInfo) == 0x000010, "Wrong size on UMG_Store_C_RecordInteractInfo");
static_assert(offsetof(UMG_Store_C_RecordInteractInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_Store_C_RecordInteractInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Store_C_RecordInteractInfo, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'UMG_Store_C_RecordInteractInfo::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function UMG_Store.UMG_Store_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_Store_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Store_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_Store_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_Store_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_Store_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_Store_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_Store_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

