#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Card_GamepadKeyBinding

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.ExecuteUbergraph_UMG_Card_GamepadKeyBinding
// 0x0268 (0x0268 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0068(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0090(0x0028)()
	bool                                          CallFunc_IsKeyAvaliable_bReady;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsChanged_ReturnValue;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00C0(0x0028)()
	bool                                          K2Node_CustomEvent_bSelected;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EInputDevice CurrentDevice)>   K2Node_CreateDelegate_OutputDelegate;              // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0100(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x011C(0x0008)(NoDestructor)
	struct FBPFocusEvent                          CallFunc_ConvertToBPFocusEvent_ReturnValue;        // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x012C(0x0008)(NoDestructor)
	struct FBPFocusEvent                          CallFunc_ConvertToBPFocusEvent_ReturnValue_1;      // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_2;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Cancel;                         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           K2Node_CustomEvent_RetKey;                         // 0x0160(0x0010)(ReferenceParm)
	bool                                          K2Node_CustomEvent_Shift;                          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Ctrl;                           // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Alt;                            // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_3;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_4;         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue_1; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue_2; // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetKeysOfInput_ReturnValue;               // 0x0190(0x0010)(ReferenceParm)
	TArray<struct FKey>                           CallFunc_GetKeysOfInput_ReturnValue_1;             // 0x01A0(0x0010)(ReferenceParm)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x01B0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   CallFunc_Array_Get_Item_1;                         // 0x01C8(0x0018)(HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_5;         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  K2Node_CustomEvent_CurrentDevice;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue_3; // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetKeysOfInput_ReturnValue_2;             // 0x01F0(0x0010)(ReferenceParm)
	struct FKey                                   CallFunc_Array_Get_Item_2;                         // 0x0200(0x0018)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array_1;                          // 0x0220(0x0010)(ReferenceParm)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_6;         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x0238(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FPBInputSecondMappingDataTableRowBase> K2Node_Event_ConflictRowArray;                     // 0x0248(0x0010)(ConstParm, ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_3;                          // 0x0258(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding) == 0x000008, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding) == 0x000268, "Wrong size on UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, EntryPoint) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x000010, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000011, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_SelectColor_ReturnValue) == 0x000040, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_MakeArray_Array) == 0x000058, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_MakeStruct_SlateColor_1) == 0x000068, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_MakeStruct_SlateColor_2) == 0x000090, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_IsKeyAvaliable_bReady) == 0x0000B8, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_IsKeyAvaliable_bReady' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetIsChanged_ReturnValue) == 0x0000B9, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetIsChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_MakeStruct_SlateColor_3) == 0x0000C0, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_CustomEvent_bSelected) == 0x0000E8, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_CustomEvent_bSelected' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_CreateDelegate_OutputDelegate) == 0x0000EC, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_CustomEvent_InText) == 0x000100, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_Event_IsDesignTime) == 0x000118, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_Event_InFocusEvent_1) == 0x00011C, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_ConvertToBPFocusEvent_ReturnValue) == 0x000124, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_ConvertToBPFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_Event_InFocusEvent) == 0x00012C, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_ConvertToBPFocusEvent_ReturnValue_1) == 0x000134, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_ConvertToBPFocusEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_SwitchEnum_CmpSuccess) == 0x00013C, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00013D, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetPlayerController_ReturnValue) == 0x000140, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000148, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue_2) == 0x000150, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_CustomEvent_Cancel) == 0x000158, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_CustomEvent_Cancel' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_CustomEvent_RetKey) == 0x000160, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_CustomEvent_RetKey' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_CustomEvent_Shift) == 0x000170, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_CustomEvent_Shift' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_CustomEvent_Ctrl) == 0x000171, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_CustomEvent_Ctrl' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_CustomEvent_Alt) == 0x000172, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_CustomEvent_Alt' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue_3) == 0x000178, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue_4) == 0x000180, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetCurrentActivateInputDevice_ReturnValue_1) == 0x000188, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetCurrentActivateInputDevice_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetCurrentActivateInputDevice_ReturnValue_2) == 0x000189, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetCurrentActivateInputDevice_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetKeysOfInput_ReturnValue) == 0x000190, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetKeysOfInput_ReturnValue_1) == 0x0001A0, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetKeysOfInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_Array_Get_Item) == 0x0001B0, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_Array_Get_Item_1) == 0x0001C8, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue_5) == 0x0001E0, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_CustomEvent_CurrentDevice) == 0x0001E8, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_CustomEvent_CurrentDevice' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetCurrentActivateInputDevice_ReturnValue_3) == 0x0001E9, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetCurrentActivateInputDevice_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetKeysOfInput_ReturnValue_2) == 0x0001F0, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetKeysOfInput_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_Array_Get_Item_2) == 0x000200, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_PlayAnimation_ReturnValue_1) == 0x000218, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_MakeArray_Array_1) == 0x000220, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue_6) == 0x000230, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_MakeArray_Array_2) == 0x000238, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_Event_ConflictRowArray) == 0x000248, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_Event_ConflictRowArray' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding, K2Node_MakeArray_Array_3) == 0x000258, "Member 'UMG_Card_GamepadKeyBinding_C_ExecuteUbergraph_UMG_Card_GamepadKeyBinding::K2Node_MakeArray_Array_3' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.K2_ShowConfirmReplaceConflictPage
// 0x0010 (0x0010 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_K2_ShowConfirmReplaceConflictPage final
{
public:
	TArray<struct FPBInputSecondMappingDataTableRowBase> ConflictRowArray;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_K2_ShowConfirmReplaceConflictPage) == 0x000008, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_K2_ShowConfirmReplaceConflictPage");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_K2_ShowConfirmReplaceConflictPage) == 0x000010, "Wrong size on UMG_Card_GamepadKeyBinding_C_K2_ShowConfirmReplaceConflictPage");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_K2_ShowConfirmReplaceConflictPage, ConflictRowArray) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_K2_ShowConfirmReplaceConflictPage::ConflictRowArray' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.OnSwitchInputDeviceEvent
// 0x0001 (0x0001 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_OnSwitchInputDeviceEvent final
{
public:
	EInputDevice                                  CurrentDevice;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_OnSwitchInputDeviceEvent) == 0x000001, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_OnSwitchInputDeviceEvent");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_OnSwitchInputDeviceEvent) == 0x000001, "Wrong size on UMG_Card_GamepadKeyBinding_C_OnSwitchInputDeviceEvent");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_OnSwitchInputDeviceEvent, CurrentDevice) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_OnSwitchInputDeviceEvent::CurrentDevice' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.OnKeysRecordReturn
// 0x0020 (0x0020 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn final
{
public:
	bool                                          Cancel;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           RetKey;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Shift;                                             // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Ctrl;                                              // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Alt;                                               // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn) == 0x000008, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn) == 0x000020, "Wrong size on UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn, Cancel) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn::Cancel' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn, RetKey) == 0x000008, "Member 'UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn::RetKey' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn, Shift) == 0x000018, "Member 'UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn::Shift' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn, Ctrl) == 0x000019, "Member 'UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn::Ctrl' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn, Alt) == 0x00001A, "Member 'UMG_Card_GamepadKeyBinding_C_OnKeysRecordReturn::Alt' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_Card_GamepadKeyBinding_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_Card_GamepadKeyBinding_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_PreConstruct");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_PreConstruct) == 0x000001, "Wrong size on UMG_Card_GamepadKeyBinding_C_PreConstruct");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.Designer_DoneWithSetting
// 0x0018 (0x0018 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_Designer_DoneWithSetting final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_Designer_DoneWithSetting) == 0x000008, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_Designer_DoneWithSetting");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_Designer_DoneWithSetting) == 0x000018, "Wrong size on UMG_Card_GamepadKeyBinding_C_Designer_DoneWithSetting");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_Designer_DoneWithSetting, InText) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_Designer_DoneWithSetting::InText' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.Designer_OnSelected
// 0x0001 (0x0001 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_Designer_OnSelected final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_Designer_OnSelected) == 0x000001, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_Designer_OnSelected");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_Designer_OnSelected) == 0x000001, "Wrong size on UMG_Card_GamepadKeyBinding_C_Designer_OnSelected");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_Designer_OnSelected, bSelected) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_Designer_OnSelected::bSelected' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.GetReadyToRecordKeys
// 0x0060 (0x0060 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Cancel, TArray<struct FKey>& RetKey, bool Shift, bool Ctrl, bool Alt)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class AInputConsumerForKeyBinding_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys) == 0x000010, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys) == 0x000060, "Wrong size on UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000030, "Member 'UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'UMG_Card_GamepadKeyBinding_C_GetReadyToRecordKeys::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.SetKeyBinding
// 0x0188 (0x0188 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_SetKeyBinding final
{
public:
	TArray<struct FKey>                           InKey;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Shift;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Ctrl;                                              // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Alt;                                               // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ViceKeyString;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_2;                            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_4;                            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x00B0(0x0018)(HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0018)(HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_Array_Get_Item_2;                         // 0x00F0(0x0018)(HasGetValueTypeHash)
	TArray<class UUMG_Card_GamepadKeyBinding_C*>  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUMG_Card_GamepadKeyBinding_C*          CallFunc_Array_Get_Item_3;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_1;                           // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_2;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue_1; // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_2;                           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding) == 0x000008, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_SetKeyBinding");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding) == 0x000188, "Wrong size on UMG_Card_GamepadKeyBinding_C_SetKeyBinding");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, InKey) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::InKey' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Shift) == 0x000010, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Shift' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Ctrl) == 0x000011, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Ctrl' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Alt) == 0x000012, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Alt' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, ViceKeyString) == 0x000018, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::ViceKeyString' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_string_Variable) == 0x000028, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_string_Variable_1) == 0x000038, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_bool_Variable) == 0x000048, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_string_Variable_2) == 0x000050, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_string_Variable_3) == 0x000060, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_bool_Variable_1) == 0x000070, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_string_Variable_4) == 0x000078, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_string_Variable_5) == 0x000088, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_int_Array_Index_Variable) == 0x000098, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, Temp_bool_Variable_2) == 0x0000A4, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue) == 0x0000A8, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x0000C8, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x0000E8, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_Array_Get_Item_2) == 0x0000F0, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000108, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_Array_Get_Item_3) == 0x000118, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_Less_IntInt_ReturnValue) == 0x000124, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, K2Node_Select_Default) == 0x000128, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, K2Node_Select_Default_1) == 0x000138, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_GetEngineSubsystem_ReturnValue_2) == 0x000148, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_GetEngineSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_GetCurrentActivateInputDevice_ReturnValue_1) == 0x000150, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_GetCurrentActivateInputDevice_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, K2Node_Select_Default_2) == 0x000158, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_Concat_StrStr_ReturnValue) == 0x000168, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_SetKeyBinding, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000178, "Member 'UMG_Card_GamepadKeyBinding_C_SetKeyBinding::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.MakeLiteralKey
// 0x0030 (0x0030 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_MakeLiteralKey final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FKey                                   OutKey;                                            // 0x0018(0x0018)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_MakeLiteralKey) == 0x000008, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_MakeLiteralKey");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_MakeLiteralKey) == 0x000030, "Wrong size on UMG_Card_GamepadKeyBinding_C_MakeLiteralKey");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_MakeLiteralKey, InKey) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_MakeLiteralKey::InKey' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_MakeLiteralKey, OutKey) == 0x000018, "Member 'UMG_Card_GamepadKeyBinding_C_MakeLiteralKey::OutKey' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.RefreshInfo
// 0x0070 (0x0070 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_RefreshInfo final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBInputSecondMappingDataTableRowBase  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0048)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInputName_ReturnValue;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInputName_ReturnValue_1;               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInputName_ReturnValue_2;               // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_RefreshInfo");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_RefreshInfo) == 0x000070, "Wrong size on UMG_Card_GamepadKeyBinding_C_RefreshInfo");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_RefreshInfo, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_RefreshInfo::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_RefreshInfo, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000018, "Member 'UMG_Card_GamepadKeyBinding_C_RefreshInfo::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_RefreshInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'UMG_Card_GamepadKeyBinding_C_RefreshInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_RefreshInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'UMG_Card_GamepadKeyBinding_C_RefreshInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_RefreshInfo, CallFunc_SetInputName_ReturnValue) == 0x000069, "Member 'UMG_Card_GamepadKeyBinding_C_RefreshInfo::CallFunc_SetInputName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_RefreshInfo, CallFunc_SetInputName_ReturnValue_1) == 0x00006A, "Member 'UMG_Card_GamepadKeyBinding_C_RefreshInfo::CallFunc_SetInputName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_RefreshInfo, CallFunc_SetInputName_ReturnValue_2) == 0x00006B, "Member 'UMG_Card_GamepadKeyBinding_C_RefreshInfo::CallFunc_SetInputName_ReturnValue_2' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.GetKeyDes
// 0x0088 (0x0088 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_GetKeyDes final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   Key_Des;                                           // 0x0018(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0030(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBKeyDes                              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_GetKeyDes) == 0x000008, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_GetKeyDes");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_GetKeyDes) == 0x000088, "Wrong size on UMG_Card_GamepadKeyBinding_C_GetKeyDes");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetKeyDes, Key) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_GetKeyDes::Key' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetKeyDes, Key_Des) == 0x000018, "Member 'UMG_Card_GamepadKeyBinding_C_GetKeyDes::Key_Des' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetKeyDes, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000030, "Member 'UMG_Card_GamepadKeyBinding_C_GetKeyDes::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetKeyDes, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'UMG_Card_GamepadKeyBinding_C_GetKeyDes::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetKeyDes, CallFunc_Conv_StringToName_ReturnValue) == 0x000058, "Member 'UMG_Card_GamepadKeyBinding_C_GetKeyDes::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetKeyDes, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'UMG_Card_GamepadKeyBinding_C_GetKeyDes::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_GetKeyDes, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000080, "Member 'UMG_Card_GamepadKeyBinding_C_GetKeyDes::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.EndRecordKeys
// 0x0008 (0x0008 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_EndRecordKeys final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Card_GamepadKeyBinding_C_EndRecordKeys) == 0x000008, "Wrong alignment on UMG_Card_GamepadKeyBinding_C_EndRecordKeys");
static_assert(sizeof(UMG_Card_GamepadKeyBinding_C_EndRecordKeys) == 0x000008, "Wrong size on UMG_Card_GamepadKeyBinding_C_EndRecordKeys");
static_assert(offsetof(UMG_Card_GamepadKeyBinding_C_EndRecordKeys, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'UMG_Card_GamepadKeyBinding_C_EndRecordKeys::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C.IsKeyAvaliable
// 0x0030 (0x0030 - 0x0000)
struct UMG_Card_GamepadKeyBinding_C_IsKeyAvaliable final
{
public:
	bool                                          bReady;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
