#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityCenter_TitleCard

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ActivityCenter_TitleCard.UMG_ActivityCenter_TitleCard_C
// 0x0040 (0x02C8 - 0x0288)
class UUMG_ActivityCenter_TitleCard_C final : public UPBTitleCardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       onhover;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Main;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Title;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UUMG_ActivityCenter_TitleCard_C* ClickedWidget)> OnClickedEvent;                                    // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_ActivityCenter_TitleCard(int32 EntryPoint);
	void BndEvt__UMG_ActivityCenter_TitleCard_Button_Main_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ActivityCenter_TitleCard_Button_Main_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void K2_RefreshCardInfo();
	void BndEvt__UMG_ActivityCenter_TitleCard_Button_Main_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Selected();
	void Unselected();
	void ActiveWidget();
	void InactiveWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ActivityCenter_TitleCard_C">();
	}
	static class UUMG_ActivityCenter_TitleCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ActivityCenter_TitleCard_C>();
	}
};
static_assert(alignof(UUMG_ActivityCenter_TitleCard_C) == 0x000008, "Wrong alignment on UUMG_ActivityCenter_TitleCard_C");
static_assert(sizeof(UUMG_ActivityCenter_TitleCard_C) == 0x0002C8, "Wrong size on UUMG_ActivityCenter_TitleCard_C");
static_assert(offsetof(UUMG_ActivityCenter_TitleCard_C, UberGraphFrame) == 0x000288, "Member 'UUMG_ActivityCenter_TitleCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_TitleCard_C, onhover) == 0x000290, "Member 'UUMG_ActivityCenter_TitleCard_C::onhover' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_TitleCard_C, Border) == 0x000298, "Member 'UUMG_ActivityCenter_TitleCard_C::Border' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_TitleCard_C, Button_Main) == 0x0002A0, "Member 'UUMG_ActivityCenter_TitleCard_C::Button_Main' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_TitleCard_C, TextBlock_Title) == 0x0002A8, "Member 'UUMG_ActivityCenter_TitleCard_C::TextBlock_Title' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_TitleCard_C, bIsSelected) == 0x0002B0, "Member 'UUMG_ActivityCenter_TitleCard_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UUMG_ActivityCenter_TitleCard_C, OnClickedEvent) == 0x0002B8, "Member 'UUMG_ActivityCenter_TitleCard_C::OnClickedEvent' has a wrong offset!");

}

