#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ChatWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ChatWidget.UMG_ChatWidget_C
// 0x00C0 (0x0390 - 0x02D0)
class UUMG_ChatWidget_C final : public UPBChatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowChatPanelAnim;                                 // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowMinMessageAnim;                                // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Party;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ChatPanel;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ChatTips;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          EditableText_Message;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Bottom;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MessageBG;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Message;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             MessageContainer;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RoomType;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Message;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         WordLimit;                                         // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SwitcherCount;                                     // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanChat;                                           // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditableText*                          Editable_Text_Message;                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DelayHideMessageTimeHandle;                        // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHideMessage;                                    // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsShowChatPanel;                                   // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35A[0x2];                                      // 0x035A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultMaxMessageHeight;                           // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultMinMessageHeight;                           // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MaskWidget;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InputText;                                         // 0x0370(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   State_Name;                                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ChatWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void CustomEvent_0();
	void OnInitialized();
	void OnStateNameChange(class FName StateName);
	void K2_CloseChatPanel();
	void K2_ToggleToChat();
	void Construct();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BndEvt__UMG_Chat_Widget_EditableText_Message_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__UMG_Chat_Widget_EditableText_Message_K2Node_ComponentBoundEvent_3_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void K2_RefreshSavedMessages(const TArray<struct FPBChatMessage>& SavedMessages);
	void K2_MessageReceived(const struct FPBChatMessage& NewMessage);
	void K2_MessageSent(bool bWasSuccessful, const struct FPBChatMessage& NewMessage);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Update_Current_Chat_Room();
	void SendMessage(bool bWasSuccessful, struct FPBChatMessage& NewMessage);
	void ReceiveMessage(struct FPBChatMessage& NewMessage);
	void RefreshSavedMessage(TArray<struct FPBChatMessage>& InSavedMessages);
	void ToggleToChat();
	void ShowChatPanel();
	void HiddenChatPanel();
	void SetChatEnable();
	void InitSwitchChatRoomHintText();
	void InitAwakeChatPanelText();
	void SetDelayHideMessageTimer();
	void HideMessage();
	void ClearDelayHideMessageTimer();
	void ShowMinMessage();
	void SetScrollEnd();
	void IsMainMenu(bool* IsMainMenu_0);
	void CommitMessage();
	void OnBackPreviousEvent(bool bQuitgame);
	void OnSavePageEvent(class FName PageName);
	void RefreshVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ChatWidget_C">();
	}
	static class UUMG_ChatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ChatWidget_C>();
	}
};
static_assert(alignof(UUMG_ChatWidget_C) == 0x000008, "Wrong alignment on UUMG_ChatWidget_C");
static_assert(sizeof(UUMG_ChatWidget_C) == 0x000390, "Wrong size on UUMG_ChatWidget_C");
static_assert(offsetof(UUMG_ChatWidget_C, UberGraphFrame) == 0x0002D0, "Member 'UUMG_ChatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, ShowChatPanelAnim) == 0x0002D8, "Member 'UUMG_ChatWidget_C::ShowChatPanelAnim' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, ShowMinMessageAnim) == 0x0002E0, "Member 'UUMG_ChatWidget_C::ShowMinMessageAnim' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, Border_Party) == 0x0002E8, "Member 'UUMG_ChatWidget_C::Border_Party' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, ChatPanel) == 0x0002F0, "Member 'UUMG_ChatWidget_C::ChatPanel' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, ChatTips) == 0x0002F8, "Member 'UUMG_ChatWidget_C::ChatTips' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, EditableText_Message) == 0x000300, "Member 'UUMG_ChatWidget_C::EditableText_Message' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, HorizontalBox_Bottom) == 0x000308, "Member 'UUMG_ChatWidget_C::HorizontalBox_Bottom' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, Image_MessageBG) == 0x000310, "Member 'UUMG_ChatWidget_C::Image_MessageBG' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, Message) == 0x000318, "Member 'UUMG_ChatWidget_C::Message' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, MessageContainer) == 0x000320, "Member 'UUMG_ChatWidget_C::MessageContainer' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, RoomType) == 0x000328, "Member 'UUMG_ChatWidget_C::RoomType' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, SizeBox_Message) == 0x000330, "Member 'UUMG_ChatWidget_C::SizeBox_Message' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, WordLimit) == 0x000338, "Member 'UUMG_ChatWidget_C::WordLimit' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, SwitcherCount) == 0x00033C, "Member 'UUMG_ChatWidget_C::SwitcherCount' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, CanChat) == 0x000340, "Member 'UUMG_ChatWidget_C::CanChat' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, Editable_Text_Message) == 0x000348, "Member 'UUMG_ChatWidget_C::Editable_Text_Message' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, DelayHideMessageTimeHandle) == 0x000350, "Member 'UUMG_ChatWidget_C::DelayHideMessageTimeHandle' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, bIsHideMessage) == 0x000358, "Member 'UUMG_ChatWidget_C::bIsHideMessage' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, IsShowChatPanel) == 0x000359, "Member 'UUMG_ChatWidget_C::IsShowChatPanel' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, DefaultMaxMessageHeight) == 0x00035C, "Member 'UUMG_ChatWidget_C::DefaultMaxMessageHeight' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, DefaultMinMessageHeight) == 0x000360, "Member 'UUMG_ChatWidget_C::DefaultMinMessageHeight' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, MaskWidget) == 0x000368, "Member 'UUMG_ChatWidget_C::MaskWidget' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, InputText) == 0x000370, "Member 'UUMG_ChatWidget_C::InputText' has a wrong offset!");
static_assert(offsetof(UUMG_ChatWidget_C, State_Name) == 0x000388, "Member 'UUMG_ChatWidget_C::State_Name' has a wrong offset!");

}

