#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameScrollBoxItemWidget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EndGameScrollBoxItemWidget.UMG_EndGameScrollBoxItemWidget_C
// 0x0040 (0x0300 - 0x02C0)
class UUMG_EndGameScrollBoxItemWidget_C final : public UPBEndGameScrollBoxWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             LevelText;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Exp;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressImage;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Progress;                                          // 0x02F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      BaseEffectMaterial;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_EndGameScrollBoxItemWidget(int32 EntryPoint);
	void K2_RefreshWidget();
	void PreConstruct(bool IsDesignTime);
	void RefreshWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EndGameScrollBoxItemWidget_C">();
	}
	static class UUMG_EndGameScrollBoxItemWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EndGameScrollBoxItemWidget_C>();
	}
};
static_assert(alignof(UUMG_EndGameScrollBoxItemWidget_C) == 0x000008, "Wrong alignment on UUMG_EndGameScrollBoxItemWidget_C");
static_assert(sizeof(UUMG_EndGameScrollBoxItemWidget_C) == 0x000300, "Wrong size on UUMG_EndGameScrollBoxItemWidget_C");
static_assert(offsetof(UUMG_EndGameScrollBoxItemWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UUMG_EndGameScrollBoxItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameScrollBoxItemWidget_C, LevelText) == 0x0002C8, "Member 'UUMG_EndGameScrollBoxItemWidget_C::LevelText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameScrollBoxItemWidget_C, ProgressBar_Exp) == 0x0002D0, "Member 'UUMG_EndGameScrollBoxItemWidget_C::ProgressBar_Exp' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameScrollBoxItemWidget_C, ProgressImage) == 0x0002D8, "Member 'UUMG_EndGameScrollBoxItemWidget_C::ProgressImage' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameScrollBoxItemWidget_C, RetainerBox_0) == 0x0002E0, "Member 'UUMG_EndGameScrollBoxItemWidget_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameScrollBoxItemWidget_C, UMG_ProgressionRewardItem) == 0x0002E8, "Member 'UUMG_EndGameScrollBoxItemWidget_C::UMG_ProgressionRewardItem' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameScrollBoxItemWidget_C, Progress) == 0x0002F0, "Member 'UUMG_EndGameScrollBoxItemWidget_C::Progress' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameScrollBoxItemWidget_C, BaseEffectMaterial) == 0x0002F8, "Member 'UUMG_EndGameScrollBoxItemWidget_C::BaseEffectMaterial' has a wrong offset!");

}

