#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DisplayLogo

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_DisplayLogo.UMG_DisplayLogo_C
// 0x0018 (0x0358 - 0x0340)
class UUMG_DisplayLogo_C final : public UPBDisplayLogoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Zoom;                                              // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                EscapeDisplayButton;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_DisplayLogo(int32 EntryPoint);
	void CustomEvent_0();
	void BndEvt__UMG_EnterGame_EnterGameButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_DisplayLogo_C">();
	}
	static class UUMG_DisplayLogo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_DisplayLogo_C>();
	}
};
static_assert(alignof(UUMG_DisplayLogo_C) == 0x000008, "Wrong alignment on UUMG_DisplayLogo_C");
static_assert(sizeof(UUMG_DisplayLogo_C) == 0x000358, "Wrong size on UUMG_DisplayLogo_C");
static_assert(offsetof(UUMG_DisplayLogo_C, UberGraphFrame) == 0x000340, "Member 'UUMG_DisplayLogo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayLogo_C, Zoom) == 0x000348, "Member 'UUMG_DisplayLogo_C::Zoom' has a wrong offset!");
static_assert(offsetof(UUMG_DisplayLogo_C, EscapeDisplayButton) == 0x000350, "Member 'UUMG_DisplayLogo_C::EscapeDisplayButton' has a wrong offset!");

}

