#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_CatchingHint

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_HelmetHUD_CatchingHint.UMG_HelmetHUD_CatchingHint_C
// 0x0048 (0x0378 - 0x0330)
class UUMG_HelmetHUD_CatchingHint_C final : public UPBHelmetHUD_Catching
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Locked;                                       // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Hint;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Grapple_LeftBottom;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Grapple_LeftTop;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Grapple_RightBottom;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Grapple_RightTop;                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              RenderTranslation;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationInterpSpeed;                               // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_HelmetHUD_CatchingHint(int32 EntryPoint);
	void K2_RefreshStartCoolDownInfo(const float InCoolDownDuration);
	void K2_RefreshEndCoolDownInfo();
	void K2_RefreshCatchingLockedInfo();
	void K2_RefreshCatchingUnlockInfo();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void K2_RefreshCatchingActivateInfo();
	void RefreshActivateInfo();
	void RefreshCoolDownInfo(float InCoolDownDuration);
	void RefreshLockedInfo();
	void RefreshUnlockInfo();
	void UpdateHintPosition();
	void EndCoolDown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_HelmetHUD_CatchingHint_C">();
	}
	static class UUMG_HelmetHUD_CatchingHint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_HelmetHUD_CatchingHint_C>();
	}
};
static_assert(alignof(UUMG_HelmetHUD_CatchingHint_C) == 0x000008, "Wrong alignment on UUMG_HelmetHUD_CatchingHint_C");
static_assert(sizeof(UUMG_HelmetHUD_CatchingHint_C) == 0x000378, "Wrong size on UUMG_HelmetHUD_CatchingHint_C");
static_assert(offsetof(UUMG_HelmetHUD_CatchingHint_C, UberGraphFrame) == 0x000330, "Member 'UUMG_HelmetHUD_CatchingHint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_CatchingHint_C, Anim_Locked) == 0x000338, "Member 'UUMG_HelmetHUD_CatchingHint_C::Anim_Locked' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_CatchingHint_C, CanvasPanel_Hint) == 0x000340, "Member 'UUMG_HelmetHUD_CatchingHint_C::CanvasPanel_Hint' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_CatchingHint_C, Image_Grapple_LeftBottom) == 0x000348, "Member 'UUMG_HelmetHUD_CatchingHint_C::Image_Grapple_LeftBottom' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_CatchingHint_C, Image_Grapple_LeftTop) == 0x000350, "Member 'UUMG_HelmetHUD_CatchingHint_C::Image_Grapple_LeftTop' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_CatchingHint_C, Image_Grapple_RightBottom) == 0x000358, "Member 'UUMG_HelmetHUD_CatchingHint_C::Image_Grapple_RightBottom' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_CatchingHint_C, Image_Grapple_RightTop) == 0x000360, "Member 'UUMG_HelmetHUD_CatchingHint_C::Image_Grapple_RightTop' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_CatchingHint_C, RenderTranslation) == 0x000368, "Member 'UUMG_HelmetHUD_CatchingHint_C::RenderTranslation' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_CatchingHint_C, LocationInterpSpeed) == 0x000370, "Member 'UUMG_HelmetHUD_CatchingHint_C::LocationInterpSpeed' has a wrong offset!");

}

