#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_Health

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_InGameHUD_Health.UMG_InGameHUD_Health_C.ExecuteUbergraph_UMG_InGameHUD_Health
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameHUD_Health_C_ExecuteUbergraph_UMG_InGameHUD_Health final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_InGameHUD_Mother_C*                K2Node_CustomEvent_Parient;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Health_C_ExecuteUbergraph_UMG_InGameHUD_Health) == 0x000008, "Wrong alignment on UMG_InGameHUD_Health_C_ExecuteUbergraph_UMG_InGameHUD_Health");
static_assert(sizeof(UMG_InGameHUD_Health_C_ExecuteUbergraph_UMG_InGameHUD_Health) == 0x000010, "Wrong size on UMG_InGameHUD_Health_C_ExecuteUbergraph_UMG_InGameHUD_Health");
static_assert(offsetof(UMG_InGameHUD_Health_C_ExecuteUbergraph_UMG_InGameHUD_Health, EntryPoint) == 0x000000, "Member 'UMG_InGameHUD_Health_C_ExecuteUbergraph_UMG_InGameHUD_Health::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Health_C_ExecuteUbergraph_UMG_InGameHUD_Health, K2Node_CustomEvent_Parient) == 0x000008, "Member 'UMG_InGameHUD_Health_C_ExecuteUbergraph_UMG_InGameHUD_Health::K2Node_CustomEvent_Parient' has a wrong offset!");

// Function UMG_InGameHUD_Health.UMG_InGameHUD_Health_C.Event_ParientPreConstruct
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameHUD_Health_C_Event_ParientPreConstruct final
{
public:
	class UUMG_InGameHUD_Mother_C*                Parient;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Health_C_Event_ParientPreConstruct) == 0x000008, "Wrong alignment on UMG_InGameHUD_Health_C_Event_ParientPreConstruct");
static_assert(sizeof(UMG_InGameHUD_Health_C_Event_ParientPreConstruct) == 0x000008, "Wrong size on UMG_InGameHUD_Health_C_Event_ParientPreConstruct");
static_assert(offsetof(UMG_InGameHUD_Health_C_Event_ParientPreConstruct, Parient) == 0x000000, "Member 'UMG_InGameHUD_Health_C_Event_ParientPreConstruct::Parient' has a wrong offset!");

// Function UMG_InGameHUD_Health.UMG_InGameHUD_Health_C.UpdateBarPerform
// 0x0018 (0x0018 - 0x0000)
struct UMG_InGameHUD_Health_C_UpdateBarPerform final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Health_C_UpdateBarPerform) == 0x000004, "Wrong alignment on UMG_InGameHUD_Health_C_UpdateBarPerform");
static_assert(sizeof(UMG_InGameHUD_Health_C_UpdateBarPerform) == 0x000018, "Wrong size on UMG_InGameHUD_Health_C_UpdateBarPerform");
static_assert(offsetof(UMG_InGameHUD_Health_C_UpdateBarPerform, Temp_bool_Variable) == 0x000000, "Member 'UMG_InGameHUD_Health_C_UpdateBarPerform::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Health_C_UpdateBarPerform, Temp_float_Variable) == 0x000004, "Member 'UMG_InGameHUD_Health_C_UpdateBarPerform::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Health_C_UpdateBarPerform, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_Health_C_UpdateBarPerform::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Health_C_UpdateBarPerform, CallFunc_FInterpTo_ReturnValue) == 0x00000C, "Member 'UMG_InGameHUD_Health_C_UpdateBarPerform::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Health_C_UpdateBarPerform, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'UMG_InGameHUD_Health_C_UpdateBarPerform::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Health_C_UpdateBarPerform, K2Node_Select_Default) == 0x000014, "Member 'UMG_InGameHUD_Health_C_UpdateBarPerform::K2Node_Select_Default' has a wrong offset!");

// Function UMG_InGameHUD_Health.UMG_InGameHUD_Health_C.SetBarShieldLine
// 0x0018 (0x0018 - 0x0000)
struct UMG_InGameHUD_Health_C_SetBarShieldLine final
{
public:
	class UProgressBar*                           InBarPtr;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Health_C_SetBarShieldLine) == 0x000008, "Wrong alignment on UMG_InGameHUD_Health_C_SetBarShieldLine");
static_assert(sizeof(UMG_InGameHUD_Health_C_SetBarShieldLine) == 0x000018, "Wrong size on UMG_InGameHUD_Health_C_SetBarShieldLine");
static_assert(offsetof(UMG_InGameHUD_Health_C_SetBarShieldLine, InBarPtr) == 0x000000, "Member 'UMG_InGameHUD_Health_C_SetBarShieldLine::InBarPtr' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Health_C_SetBarShieldLine, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_Health_C_SetBarShieldLine::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Health_C_SetBarShieldLine, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'UMG_InGameHUD_Health_C_SetBarShieldLine::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

