#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STORE_ARMORY

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_STORE_ARMORY.UMG_STORE_ARMORY_C.ExecuteUbergraph_UMG_STORE_ARMORY
// 0x0078 (0x0078 - 0x0000)
struct UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_StoreProduct_Armory_C*             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBStoreProductInfo                    CallFunc_Array_Get_Item;                           // 0x0020(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY) == 0x000008, "Wrong alignment on UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY");
static_assert(sizeof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY) == 0x000078, "Wrong size on UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, EntryPoint) == 0x000000, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, Temp_int_Array_Index_Variable) == 0x000010, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, CallFunc_Array_Get_Item) == 0x000020, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000068, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000070, "Member 'UMG_STORE_ARMORY_C_ExecuteUbergraph_UMG_STORE_ARMORY::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");

// Function UMG_STORE_ARMORY.UMG_STORE_ARMORY_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_STORE_ARMORY_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STORE_ARMORY_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_STORE_ARMORY_C_PreConstruct");
static_assert(sizeof(UMG_STORE_ARMORY_C_PreConstruct) == 0x000001, "Wrong size on UMG_STORE_ARMORY_C_PreConstruct");
static_assert(offsetof(UMG_STORE_ARMORY_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_STORE_ARMORY_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_STORE_ARMORY.UMG_STORE_ARMORY_C.BP_GetDesiredFocusTarget
// 0x0020 (0x0020 - 0x0000)
struct UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget) == 0x000020, "Wrong size on UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'UMG_STORE_ARMORY_C_BP_GetDesiredFocusTarget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

