#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_LeaveParty_Widget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_LeaveParty_Widget.UMG_LeaveParty_Widget_C
// 0x0028 (0x0288 - 0x0260)
class UUMG_LeaveParty_Widget_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_LeaveParty;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnLeavePartyButtonClicked;                         // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_LeaveParty_Widget(int32 EntryPoint);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__UMG_LeaveParty_Widget_Button_LeaveParty_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_LeaveParty_Widget_Button_LeaveParty_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_LeaveParty_Widget_C">();
	}
	static class UUMG_LeaveParty_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_LeaveParty_Widget_C>();
	}
};
static_assert(alignof(UUMG_LeaveParty_Widget_C) == 0x000008, "Wrong alignment on UUMG_LeaveParty_Widget_C");
static_assert(sizeof(UUMG_LeaveParty_Widget_C) == 0x000288, "Wrong size on UUMG_LeaveParty_Widget_C");
static_assert(offsetof(UUMG_LeaveParty_Widget_C, UberGraphFrame) == 0x000260, "Member 'UUMG_LeaveParty_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_LeaveParty_Widget_C, Button_LeaveParty) == 0x000268, "Member 'UUMG_LeaveParty_Widget_C::Button_LeaveParty' has a wrong offset!");
static_assert(offsetof(UUMG_LeaveParty_Widget_C, Image_BG) == 0x000270, "Member 'UUMG_LeaveParty_Widget_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UUMG_LeaveParty_Widget_C, OnLeavePartyButtonClicked) == 0x000278, "Member 'UUMG_LeaveParty_Widget_C::OnLeavePartyButtonClicked' has a wrong offset!");

}

