#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CommonSetting_InRange

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_CommonSetting_InRange.UMG_CommonSetting_InRange_C.ExecuteUbergraph_UMG_CommonSetting_InRange
// 0x0038 (0x0038 - 0x0000)
struct UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange) == 0x000008, "Wrong alignment on UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange");
static_assert(sizeof(UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange) == 0x000038, "Wrong size on UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange");
static_assert(offsetof(UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange, EntryPoint) == 0x000000, "Member 'UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange, CallFunc_GetDisplayName_ReturnValue_1) == 0x000028, "Member 'UMG_CommonSetting_InRange_C_ExecuteUbergraph_UMG_CommonSetting_InRange::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");

// Function UMG_CommonSetting_InRange.UMG_CommonSetting_InRange_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_CommonSetting_InRange_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CommonSetting_InRange_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_CommonSetting_InRange_C_PreConstruct");
static_assert(sizeof(UMG_CommonSetting_InRange_C_PreConstruct) == 0x000001, "Wrong size on UMG_CommonSetting_InRange_C_PreConstruct");
static_assert(offsetof(UMG_CommonSetting_InRange_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_CommonSetting_InRange_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_CommonSetting_InRange.UMG_CommonSetting_InRange_C.OnShowControllerButtonSetting
// 0x0001 (0x0001 - 0x0000)
struct UMG_CommonSetting_InRange_C_OnShowControllerButtonSetting final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CommonSetting_InRange_C_OnShowControllerButtonSetting) == 0x000001, "Wrong alignment on UMG_CommonSetting_InRange_C_OnShowControllerButtonSetting");
static_assert(sizeof(UMG_CommonSetting_InRange_C_OnShowControllerButtonSetting) == 0x000001, "Wrong size on UMG_CommonSetting_InRange_C_OnShowControllerButtonSetting");
static_assert(offsetof(UMG_CommonSetting_InRange_C_OnShowControllerButtonSetting, bShow) == 0x000000, "Member 'UMG_CommonSetting_InRange_C_OnShowControllerButtonSetting::bShow' has a wrong offset!");

// Function UMG_CommonSetting_InRange.UMG_CommonSetting_InRange_C.IsMainMenu
// 0x0020 (0x0020 - 0x0000)
struct UMG_CommonSetting_InRange_C_IsMainMenu final
{
public:
	bool                                          bIsMainMenu;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBGameMode_Menu*                       K2Node_DynamicCast_AsPBGame_Mode_Menu;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CommonSetting_InRange_C_IsMainMenu) == 0x000008, "Wrong alignment on UMG_CommonSetting_InRange_C_IsMainMenu");
static_assert(sizeof(UMG_CommonSetting_InRange_C_IsMainMenu) == 0x000020, "Wrong size on UMG_CommonSetting_InRange_C_IsMainMenu");
static_assert(offsetof(UMG_CommonSetting_InRange_C_IsMainMenu, bIsMainMenu) == 0x000000, "Member 'UMG_CommonSetting_InRange_C_IsMainMenu::bIsMainMenu' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_IsMainMenu, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'UMG_CommonSetting_InRange_C_IsMainMenu::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_IsMainMenu, K2Node_DynamicCast_AsPBGame_Mode_Menu) == 0x000010, "Member 'UMG_CommonSetting_InRange_C_IsMainMenu::K2Node_DynamicCast_AsPBGame_Mode_Menu' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_IsMainMenu, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_CommonSetting_InRange_C_IsMainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_CommonSetting_InRange.UMG_CommonSetting_InRange_C.RestoreFocus
// 0x0018 (0x0018 - 0x0000)
struct UMG_CommonSetting_InRange_C_RestoreFocus final
{
public:
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SettingPageBase_C*                 K2Node_DynamicCast_AsUMG_Setting_Page_Base;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CommonSetting_InRange_C_RestoreFocus) == 0x000008, "Wrong alignment on UMG_CommonSetting_InRange_C_RestoreFocus");
static_assert(sizeof(UMG_CommonSetting_InRange_C_RestoreFocus) == 0x000018, "Wrong size on UMG_CommonSetting_InRange_C_RestoreFocus");
static_assert(offsetof(UMG_CommonSetting_InRange_C_RestoreFocus, CallFunc_GetActiveWidget_ReturnValue) == 0x000000, "Member 'UMG_CommonSetting_InRange_C_RestoreFocus::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_RestoreFocus, K2Node_DynamicCast_AsUMG_Setting_Page_Base) == 0x000008, "Member 'UMG_CommonSetting_InRange_C_RestoreFocus::K2Node_DynamicCast_AsUMG_Setting_Page_Base' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_RestoreFocus, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UMG_CommonSetting_InRange_C_RestoreFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_RestoreFocus, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'UMG_CommonSetting_InRange_C_RestoreFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_RestoreFocus, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'UMG_CommonSetting_InRange_C_RestoreFocus::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function UMG_CommonSetting_InRange.UMG_CommonSetting_InRange_C.ReturnPrevious
// 0x0010 (0x0010 - 0x0000)
struct UMG_CommonSetting_InRange_C_ReturnPrevious final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CommonSetting_InRange_C_ReturnPrevious) == 0x000008, "Wrong alignment on UMG_CommonSetting_InRange_C_ReturnPrevious");
static_assert(sizeof(UMG_CommonSetting_InRange_C_ReturnPrevious) == 0x000010, "Wrong size on UMG_CommonSetting_InRange_C_ReturnPrevious");
static_assert(offsetof(UMG_CommonSetting_InRange_C_ReturnPrevious, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'UMG_CommonSetting_InRange_C_ReturnPrevious::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CommonSetting_InRange_C_ReturnPrevious, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'UMG_CommonSetting_InRange_C_ReturnPrevious::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_CommonSetting_InRange.UMG_CommonSetting_InRange_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct UMG_CommonSetting_InRange_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CommonSetting_InRange_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on UMG_CommonSetting_InRange_C_BP_OnHandleBackAction");
static_assert(sizeof(UMG_CommonSetting_InRange_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on UMG_CommonSetting_InRange_C_BP_OnHandleBackAction");
static_assert(offsetof(UMG_CommonSetting_InRange_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'UMG_CommonSetting_InRange_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function UMG_CommonSetting_InRange.UMG_CommonSetting_InRange_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_CommonSetting_InRange_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CommonSetting_InRange_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_CommonSetting_InRange_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_CommonSetting_InRange_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_CommonSetting_InRange_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_CommonSetting_InRange_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_CommonSetting_InRange_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

