#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_AssigmentMemberInfo

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_AssigmentMemberInfo.UMG_AssigmentMemberInfo_C
// 0x0030 (0x0308 - 0x02D8)
class UUMG_AssigmentMemberInfo_C final : public UPBMemberInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Member;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Avtar;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollText_C*                          ScrollText;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerName;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Member;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_AssigmentMemberInfo(int32 EntryPoint);
	void K2_RefreshMemberDisplayName();
	void K2_RefreshMemberInfo();
	void K2_RefreshMemberAvatar();
	void UpdateName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_AssigmentMemberInfo_C">();
	}
	static class UUMG_AssigmentMemberInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_AssigmentMemberInfo_C>();
	}
};
static_assert(alignof(UUMG_AssigmentMemberInfo_C) == 0x000008, "Wrong alignment on UUMG_AssigmentMemberInfo_C");
static_assert(sizeof(UUMG_AssigmentMemberInfo_C) == 0x000308, "Wrong size on UUMG_AssigmentMemberInfo_C");
static_assert(offsetof(UUMG_AssigmentMemberInfo_C, UberGraphFrame) == 0x0002D8, "Member 'UUMG_AssigmentMemberInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_AssigmentMemberInfo_C, Border_Member) == 0x0002E0, "Member 'UUMG_AssigmentMemberInfo_C::Border_Member' has a wrong offset!");
static_assert(offsetof(UUMG_AssigmentMemberInfo_C, Image_Avtar) == 0x0002E8, "Member 'UUMG_AssigmentMemberInfo_C::Image_Avtar' has a wrong offset!");
static_assert(offsetof(UUMG_AssigmentMemberInfo_C, ScrollText) == 0x0002F0, "Member 'UUMG_AssigmentMemberInfo_C::ScrollText' has a wrong offset!");
static_assert(offsetof(UUMG_AssigmentMemberInfo_C, TextBlock_PlayerName) == 0x0002F8, "Member 'UUMG_AssigmentMemberInfo_C::TextBlock_PlayerName' has a wrong offset!");
static_assert(offsetof(UUMG_AssigmentMemberInfo_C, WidgetSwitcher_Member) == 0x000300, "Member 'UUMG_AssigmentMemberInfo_C::WidgetSwitcher_Member' has a wrong offset!");

}

