#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PartyMember_Widget

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_PartyMember_Widget.UMG_PartyMember_Widget_C
// 0x0068 (0x02C8 - 0x0260)
class UUMG_PartyMember_Widget_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Main;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_235;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_cover;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Focus;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeaderIcon;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MemberInfo;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyMemberAvatar;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WaitForjoining;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EPBLeaderAuthType AuthorityType, const struct FUniqueNetIdRepl& TargetId)> OnButtonClicked;                                   // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsNull;                                           // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBUserObject*                          PartyMemberObject;                                 // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_PartyMember_Widget(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Reset();
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void RefreshPartyMemberInfo(class UPBUserObject* InPartyMemberObject);
	void On_User_Data_Update(class UPBUserObject* InUserObject);
	void OnAvatarRefreshed(class UTexture2D* InAvatar);
	void RefreshInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_PartyMember_Widget_C">();
	}
	static class UUMG_PartyMember_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_PartyMember_Widget_C>();
	}
};
static_assert(alignof(UUMG_PartyMember_Widget_C) == 0x000008, "Wrong alignment on UUMG_PartyMember_Widget_C");
static_assert(sizeof(UUMG_PartyMember_Widget_C) == 0x0002C8, "Wrong size on UUMG_PartyMember_Widget_C");
static_assert(offsetof(UUMG_PartyMember_Widget_C, UberGraphFrame) == 0x000260, "Member 'UUMG_PartyMember_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, Border_Main) == 0x000268, "Member 'UUMG_PartyMember_Widget_C::Border_Main' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, Image_235) == 0x000270, "Member 'UUMG_PartyMember_Widget_C::Image_235' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, Image_cover) == 0x000278, "Member 'UUMG_PartyMember_Widget_C::Image_cover' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, Image_Focus) == 0x000280, "Member 'UUMG_PartyMember_Widget_C::Image_Focus' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, LeaderIcon) == 0x000288, "Member 'UUMG_PartyMember_Widget_C::LeaderIcon' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, MemberInfo) == 0x000290, "Member 'UUMG_PartyMember_Widget_C::MemberInfo' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, PartyMemberAvatar) == 0x000298, "Member 'UUMG_PartyMember_Widget_C::PartyMemberAvatar' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, WaitForjoining) == 0x0002A0, "Member 'UUMG_PartyMember_Widget_C::WaitForjoining' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, OnButtonClicked) == 0x0002A8, "Member 'UUMG_PartyMember_Widget_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, bIsNull) == 0x0002B8, "Member 'UUMG_PartyMember_Widget_C::bIsNull' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMember_Widget_C, PartyMemberObject) == 0x0002C0, "Member 'UUMG_PartyMember_Widget_C::PartyMemberObject' has a wrong offset!");

}

