#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_RedemptionCodeWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_RedemptionCodeWidget.UMG_RedemptionCodeWidget_C.ExecuteUbergraph_UMG_RedemptionCodeWidget
// 0x00C8 (0x00C8 - 0x0000)
struct UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_OutText;                          // 0x0030(0x0018)()
	bool                                          K2Node_ComponentBoundEvent_IsUsableCode;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_RedemptationPrompt_C*              K2Node_DynamicCast_AsUMG_Redemptation_Prompt;      // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_RedemptationPrompt_C*              K2Node_DynamicCast_AsUMG_Redemptation_Prompt_1;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue_2;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_NewItemPageForRedemption_C*        K2Node_DynamicCast_AsUMG_New_Item_Page_for_Redemption; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget) == 0x000008, "Wrong alignment on UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget");
static_assert(sizeof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget) == 0x0000C8, "Wrong size on UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, EntryPoint) == 0x000000, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_Array_Get_Item) == 0x000010, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_Conv_StringToName_ReturnValue) == 0x000024, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_GetText_OutText) == 0x000030, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_GetText_OutText' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, K2Node_ComponentBoundEvent_IsUsableCode) == 0x000048, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::K2Node_ComponentBoundEvent_IsUsableCode' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000068, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_PushNormalPrompt_ReturnValue) == 0x000070, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_PushNormalPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, K2Node_DynamicCast_AsUMG_Redemptation_Prompt) == 0x000078, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::K2Node_DynamicCast_AsUMG_Redemptation_Prompt' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000088, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_PushNormalPrompt_ReturnValue_1) == 0x000090, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_PushNormalPrompt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000098, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, K2Node_DynamicCast_AsUMG_Redemptation_Prompt_1) == 0x0000A0, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::K2Node_DynamicCast_AsUMG_Redemptation_Prompt_1' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, CallFunc_PushNormalPrompt_ReturnValue_2) == 0x0000B0, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::CallFunc_PushNormalPrompt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, K2Node_DynamicCast_AsUMG_New_Item_Page_for_Redemption) == 0x0000B8, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::K2Node_DynamicCast_AsUMG_New_Item_Page_for_Redemption' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'UMG_RedemptionCodeWidget_C_ExecuteUbergraph_UMG_RedemptionCodeWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function UMG_RedemptionCodeWidget.UMG_RedemptionCodeWidget_C.BndEvt__UMG_RedemptionCodeWidget_UMG_RedemptionCodeTextBlock_K2Node_ComponentBoundEvent_1_OnCodeUsebleChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UMG_RedemptionCodeWidget_C_BndEvt__UMG_RedemptionCodeWidget_UMG_RedemptionCodeTextBlock_K2Node_ComponentBoundEvent_1_OnCodeUsebleChanged__DelegateSignature final
{
public:
	bool                                          IsUsableCode;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_RedemptionCodeWidget_C_BndEvt__UMG_RedemptionCodeWidget_UMG_RedemptionCodeTextBlock_K2Node_ComponentBoundEvent_1_OnCodeUsebleChanged__DelegateSignature) == 0x000001, "Wrong alignment on UMG_RedemptionCodeWidget_C_BndEvt__UMG_RedemptionCodeWidget_UMG_RedemptionCodeTextBlock_K2Node_ComponentBoundEvent_1_OnCodeUsebleChanged__DelegateSignature");
static_assert(sizeof(UMG_RedemptionCodeWidget_C_BndEvt__UMG_RedemptionCodeWidget_UMG_RedemptionCodeTextBlock_K2Node_ComponentBoundEvent_1_OnCodeUsebleChanged__DelegateSignature) == 0x000001, "Wrong size on UMG_RedemptionCodeWidget_C_BndEvt__UMG_RedemptionCodeWidget_UMG_RedemptionCodeTextBlock_K2Node_ComponentBoundEvent_1_OnCodeUsebleChanged__DelegateSignature");
static_assert(offsetof(UMG_RedemptionCodeWidget_C_BndEvt__UMG_RedemptionCodeWidget_UMG_RedemptionCodeTextBlock_K2Node_ComponentBoundEvent_1_OnCodeUsebleChanged__DelegateSignature, IsUsableCode) == 0x000000, "Member 'UMG_RedemptionCodeWidget_C_BndEvt__UMG_RedemptionCodeWidget_UMG_RedemptionCodeTextBlock_K2Node_ComponentBoundEvent_1_OnCodeUsebleChanged__DelegateSignature::IsUsableCode' has a wrong offset!");

}

