#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PlayerState_Tip

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_PlayerState_Tip.UMG_PlayerState_Tip_C.ExecuteUbergraph_UMG_PlayerState_Tip
// 0x0020 (0x0020 - 0x0000)
struct UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0008(0x0018)()
};
static_assert(alignof(UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip) == 0x000008, "Wrong alignment on UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip");
static_assert(sizeof(UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip) == 0x000020, "Wrong size on UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip");
static_assert(offsetof(UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip, EntryPoint) == 0x000000, "Member 'UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip, CallFunc_TextToUpper_ReturnValue) == 0x000008, "Member 'UMG_PlayerState_Tip_C_ExecuteUbergraph_UMG_PlayerState_Tip::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function UMG_PlayerState_Tip.UMG_PlayerState_Tip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_PlayerState_Tip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PlayerState_Tip_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_PlayerState_Tip_C_PreConstruct");
static_assert(sizeof(UMG_PlayerState_Tip_C_PreConstruct) == 0x000001, "Wrong size on UMG_PlayerState_Tip_C_PreConstruct");
static_assert(offsetof(UMG_PlayerState_Tip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_PlayerState_Tip_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_PlayerState_Tip.UMG_PlayerState_Tip_C.SetTextInfo
// 0x0030 (0x0030 - 0x0000)
struct UMG_PlayerState_Tip_C_SetTextInfo final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(UMG_PlayerState_Tip_C_SetTextInfo) == 0x000008, "Wrong alignment on UMG_PlayerState_Tip_C_SetTextInfo");
static_assert(sizeof(UMG_PlayerState_Tip_C_SetTextInfo) == 0x000030, "Wrong size on UMG_PlayerState_Tip_C_SetTextInfo");
static_assert(offsetof(UMG_PlayerState_Tip_C_SetTextInfo, InName) == 0x000000, "Member 'UMG_PlayerState_Tip_C_SetTextInfo::InName' has a wrong offset!");
static_assert(offsetof(UMG_PlayerState_Tip_C_SetTextInfo, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'UMG_PlayerState_Tip_C_SetTextInfo::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function UMG_PlayerState_Tip.UMG_PlayerState_Tip_C.SetImageInfo
// 0x0028 (0x0028 - 0x0000)
struct UMG_PlayerState_Tip_C_SetImageInfo final
{
public:
	TSoftObjectPtr<class UTexture2D>              InImage;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PlayerState_Tip_C_SetImageInfo) == 0x000008, "Wrong alignment on UMG_PlayerState_Tip_C_SetImageInfo");
static_assert(sizeof(UMG_PlayerState_Tip_C_SetImageInfo) == 0x000028, "Wrong size on UMG_PlayerState_Tip_C_SetImageInfo");
static_assert(offsetof(UMG_PlayerState_Tip_C_SetImageInfo, InImage) == 0x000000, "Member 'UMG_PlayerState_Tip_C_SetImageInfo::InImage' has a wrong offset!");

}

