#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_StoreProductInPurchasePage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_StoreProductInPurchasePage.UMG_StoreProductInPurchasePage_C
// 0x0038 (0x0298 - 0x0260)
class UUMG_StoreProductInPurchasePage_C final : public UPBUserWidget
{
public:
	class UImage*                                 ImageQuality;                                      // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineBG;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineDisplay;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextItemName;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextItemType;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName ItemId)> OnClickedEventDispatcher;                          // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateWidget(TSoftObjectPtr<class UTexture2D> InTexture, const class FText& InItemName, EPBItemType InItemType, EPBItemGradeType InGradeType);
	void SetItemType(EPBItemType InItemType);
	void SetGradeStyle(EPBItemGradeType InGrade);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_StoreProductInPurchasePage_C">();
	}
	static class UUMG_StoreProductInPurchasePage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_StoreProductInPurchasePage_C>();
	}
};
static_assert(alignof(UUMG_StoreProductInPurchasePage_C) == 0x000008, "Wrong alignment on UUMG_StoreProductInPurchasePage_C");
static_assert(sizeof(UUMG_StoreProductInPurchasePage_C) == 0x000298, "Wrong size on UUMG_StoreProductInPurchasePage_C");
static_assert(offsetof(UUMG_StoreProductInPurchasePage_C, ImageQuality) == 0x000260, "Member 'UUMG_StoreProductInPurchasePage_C::ImageQuality' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProductInPurchasePage_C, ImagineBG) == 0x000268, "Member 'UUMG_StoreProductInPurchasePage_C::ImagineBG' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProductInPurchasePage_C, ImagineDisplay) == 0x000270, "Member 'UUMG_StoreProductInPurchasePage_C::ImagineDisplay' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProductInPurchasePage_C, TextItemName) == 0x000278, "Member 'UUMG_StoreProductInPurchasePage_C::TextItemName' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProductInPurchasePage_C, TextItemType) == 0x000280, "Member 'UUMG_StoreProductInPurchasePage_C::TextItemType' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProductInPurchasePage_C, OnClickedEventDispatcher) == 0x000288, "Member 'UUMG_StoreProductInPurchasePage_C::OnClickedEventDispatcher' has a wrong offset!");

}

