#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CumulativeLoginPage_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_CumulativeLoginPage_Base.UMG_CumulativeLoginPage_Base_C.ExecuteUbergraph_UMG_CumulativeLoginPage_Base
// 0x0004 (0x0004 - 0x0000)
struct UMG_CumulativeLoginPage_Base_C_ExecuteUbergraph_UMG_CumulativeLoginPage_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CumulativeLoginPage_Base_C_ExecuteUbergraph_UMG_CumulativeLoginPage_Base) == 0x000004, "Wrong alignment on UMG_CumulativeLoginPage_Base_C_ExecuteUbergraph_UMG_CumulativeLoginPage_Base");
static_assert(sizeof(UMG_CumulativeLoginPage_Base_C_ExecuteUbergraph_UMG_CumulativeLoginPage_Base) == 0x000004, "Wrong size on UMG_CumulativeLoginPage_Base_C_ExecuteUbergraph_UMG_CumulativeLoginPage_Base");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_ExecuteUbergraph_UMG_CumulativeLoginPage_Base, EntryPoint) == 0x000000, "Member 'UMG_CumulativeLoginPage_Base_C_ExecuteUbergraph_UMG_CumulativeLoginPage_Base::EntryPoint' has a wrong offset!");

// Function UMG_CumulativeLoginPage_Base.UMG_CumulativeLoginPage_Base_C.RefreshDateCardList
// 0x0068 (0x0068 - 0x0000)
struct UMG_CumulativeLoginPage_Base_C_RefreshDateCardList final
{
public:
	bool                                          bIsCurrentDate;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentDate_OutCurrentDate;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBLoginActivityRecord                 CallFunc_Array_Get_Item;                           // 0x0014(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_LoginDateCard_C*                   CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList) == 0x000008, "Wrong alignment on UMG_CumulativeLoginPage_Base_C_RefreshDateCardList");
static_assert(sizeof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList) == 0x000068, "Wrong size on UMG_CumulativeLoginPage_Base_C_RefreshDateCardList");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, bIsCurrentDate) == 0x000000, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::bIsCurrentDate' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, CallFunc_GetCurrentDate_OutCurrentDate) == 0x000010, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::CallFunc_GetCurrentDate_OutCurrentDate' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, CallFunc_Array_Get_Item) == 0x000014, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, CallFunc_Create_ReturnValue) == 0x000038, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, K2Node_MakeStruct_Margin) == 0x000048, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000058, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_RefreshDateCardList, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UMG_CumulativeLoginPage_Base_C_RefreshDateCardList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_CumulativeLoginPage_Base.UMG_CumulativeLoginPage_Base_C.GetCurrentDate
// 0x0034 (0x0034 - 0x0000)
struct UMG_CumulativeLoginPage_Base_C_GetCurrentDate final
{
public:
	int32                                         OutCurrentDate;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBLoginActivityRecord                 CallFunc_Array_Get_Item;                           // 0x001C(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate) == 0x000004, "Wrong alignment on UMG_CumulativeLoginPage_Base_C_GetCurrentDate");
static_assert(sizeof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate) == 0x000034, "Wrong size on UMG_CumulativeLoginPage_Base_C_GetCurrentDate");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, OutCurrentDate) == 0x000000, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::OutCurrentDate' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, CallFunc_Array_Get_Item) == 0x00001C, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CumulativeLoginPage_Base_C_GetCurrentDate, CallFunc_BooleanAND_ReturnValue) == 0x000031, "Member 'UMG_CumulativeLoginPage_Base_C_GetCurrentDate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

