#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TabV2Secondary

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_TabV2Secondary.UMG_TabV2Secondary_C.ExecuteUbergraph_UMG_TabV2Secondary
// 0x0148 (0x0148 - 0x0000)
struct UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0068(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0070)(ConstParm)
};
static_assert(alignof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary) == 0x000008, "Wrong alignment on UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary");
static_assert(sizeof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary) == 0x000148, "Wrong size on UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary");
static_assert(offsetof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary, EntryPoint) == 0x000000, "Member 'UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary, CallFunc_PlayAnimation_ReturnValue_3) == 0x000020, "Member 'UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary, CallFunc_PlayAnimation_ReturnValue_4) == 0x000028, "Member 'UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary, K2Node_Event_MyGeometry) == 0x000030, "Member 'UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary, K2Node_Event_MouseEvent_1) == 0x000068, "Member 'UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'UMG_TabV2Secondary_C_ExecuteUbergraph_UMG_TabV2Secondary::K2Node_Event_MouseEvent' has a wrong offset!");

// Function UMG_TabV2Secondary.UMG_TabV2Secondary_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UMG_TabV2Secondary_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_TabV2Secondary_C_OnMouseLeave) == 0x000008, "Wrong alignment on UMG_TabV2Secondary_C_OnMouseLeave");
static_assert(sizeof(UMG_TabV2Secondary_C_OnMouseLeave) == 0x000070, "Wrong size on UMG_TabV2Secondary_C_OnMouseLeave");
static_assert(offsetof(UMG_TabV2Secondary_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UMG_TabV2Secondary_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UMG_TabV2Secondary.UMG_TabV2Secondary_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_TabV2Secondary_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_TabV2Secondary_C_OnMouseEnter) == 0x000008, "Wrong alignment on UMG_TabV2Secondary_C_OnMouseEnter");
static_assert(sizeof(UMG_TabV2Secondary_C_OnMouseEnter) == 0x0000A8, "Wrong size on UMG_TabV2Secondary_C_OnMouseEnter");
static_assert(offsetof(UMG_TabV2Secondary_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UMG_TabV2Secondary_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UMG_TabV2Secondary_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UMG_TabV2Secondary.UMG_TabV2Secondary_C.OnMouseButtonDown_0
// 0x0218 (0x0218 - 0x0000)
struct UMG_TabV2Secondary_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_TabV2Secondary_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on UMG_TabV2Secondary_C_OnMouseButtonDown_0");
static_assert(sizeof(UMG_TabV2Secondary_C_OnMouseButtonDown_0) == 0x000218, "Wrong size on UMG_TabV2Secondary_C_OnMouseButtonDown_0");
static_assert(offsetof(UMG_TabV2Secondary_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'UMG_TabV2Secondary_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'UMG_TabV2Secondary_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_OnMouseButtonDown_0, ReturnValue) == 0x0000A8, "Member 'UMG_TabV2Secondary_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TabV2Secondary_C_OnMouseButtonDown_0, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UMG_TabV2Secondary_C_OnMouseButtonDown_0::K2Node_MakeStruct_EventReply' has a wrong offset!");

}

