#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SettingController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_SettingPageBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SettingController.UMG_SettingController_C
// 0x00F8 (0x0470 - 0x0378)
class UUMG_SettingController_C final : public UUMG_SettingPageBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_SettingController_C;            // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             List_Controller;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_ADSHorizontalSensitivity;                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_ADSVerticalSensitivity;                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_AimAssist;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_AimMethod;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_ButtonSettings;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_EnableAutoAiming;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_EnableMotion;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_GamepadADSSpeed;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_GamepadSpeed;                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_HorizontalSensitivity;                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_InvertYAxis;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_LeftStickDeadZone;                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_MotionADSSpeed;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_MotionADSSpeedX;                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_MotionADSSpeedY;                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_MotionSpeed;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_MotionSpeedX;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_MotionSpeedY;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_RightStickDeadZone;                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_TriggerEffect;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_VerticalSensitivity;                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          Option_VIbration;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Controller;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 ButtonSettingWidgetClass;                          // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            ParentWidget;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ControllerButtonSettings_C*        ButtonSettingWidget;                               // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool bShow)>    OnShowButtonSettingEvent;                          // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPBMainMenuManager_BP_C*                NewVar_0;                                          // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SettingController(int32 EntryPoint);
	void OnInitialized();
	void BndEvt__UMG_SettingController_Option_ButtonSettings_K2Node_ComponentBoundEvent_0_OnClickEvent__DelegateSignature();
	void ShowControllerButtonSetting();
	void Reset();
	void InitializeFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SettingController_C">();
	}
	static class UUMG_SettingController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SettingController_C>();
	}
};
static_assert(alignof(UUMG_SettingController_C) == 0x000008, "Wrong alignment on UUMG_SettingController_C");
static_assert(sizeof(UUMG_SettingController_C) == 0x000470, "Wrong size on UUMG_SettingController_C");
static_assert(offsetof(UUMG_SettingController_C, UberGraphFrame_UMG_SettingController_C) == 0x000378, "Member 'UUMG_SettingController_C::UberGraphFrame_UMG_SettingController_C' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, List_Controller) == 0x000380, "Member 'UUMG_SettingController_C::List_Controller' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_ADSHorizontalSensitivity) == 0x000388, "Member 'UUMG_SettingController_C::Option_ADSHorizontalSensitivity' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_ADSVerticalSensitivity) == 0x000390, "Member 'UUMG_SettingController_C::Option_ADSVerticalSensitivity' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_AimAssist) == 0x000398, "Member 'UUMG_SettingController_C::Option_AimAssist' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_AimMethod) == 0x0003A0, "Member 'UUMG_SettingController_C::Option_AimMethod' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_ButtonSettings) == 0x0003A8, "Member 'UUMG_SettingController_C::Option_ButtonSettings' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_EnableAutoAiming) == 0x0003B0, "Member 'UUMG_SettingController_C::Option_EnableAutoAiming' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_EnableMotion) == 0x0003B8, "Member 'UUMG_SettingController_C::Option_EnableMotion' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_GamepadADSSpeed) == 0x0003C0, "Member 'UUMG_SettingController_C::Option_GamepadADSSpeed' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_GamepadSpeed) == 0x0003C8, "Member 'UUMG_SettingController_C::Option_GamepadSpeed' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_HorizontalSensitivity) == 0x0003D0, "Member 'UUMG_SettingController_C::Option_HorizontalSensitivity' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_InvertYAxis) == 0x0003D8, "Member 'UUMG_SettingController_C::Option_InvertYAxis' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_LeftStickDeadZone) == 0x0003E0, "Member 'UUMG_SettingController_C::Option_LeftStickDeadZone' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_MotionADSSpeed) == 0x0003E8, "Member 'UUMG_SettingController_C::Option_MotionADSSpeed' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_MotionADSSpeedX) == 0x0003F0, "Member 'UUMG_SettingController_C::Option_MotionADSSpeedX' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_MotionADSSpeedY) == 0x0003F8, "Member 'UUMG_SettingController_C::Option_MotionADSSpeedY' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_MotionSpeed) == 0x000400, "Member 'UUMG_SettingController_C::Option_MotionSpeed' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_MotionSpeedX) == 0x000408, "Member 'UUMG_SettingController_C::Option_MotionSpeedX' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_MotionSpeedY) == 0x000410, "Member 'UUMG_SettingController_C::Option_MotionSpeedY' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_RightStickDeadZone) == 0x000418, "Member 'UUMG_SettingController_C::Option_RightStickDeadZone' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_TriggerEffect) == 0x000420, "Member 'UUMG_SettingController_C::Option_TriggerEffect' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_VerticalSensitivity) == 0x000428, "Member 'UUMG_SettingController_C::Option_VerticalSensitivity' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Option_VIbration) == 0x000430, "Member 'UUMG_SettingController_C::Option_VIbration' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, Switcher_Controller) == 0x000438, "Member 'UUMG_SettingController_C::Switcher_Controller' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, ButtonSettingWidgetClass) == 0x000440, "Member 'UUMG_SettingController_C::ButtonSettingWidgetClass' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, ParentWidget) == 0x000448, "Member 'UUMG_SettingController_C::ParentWidget' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, ButtonSettingWidget) == 0x000450, "Member 'UUMG_SettingController_C::ButtonSettingWidget' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, OnShowButtonSettingEvent) == 0x000458, "Member 'UUMG_SettingController_C::OnShowButtonSettingEvent' has a wrong offset!");
static_assert(offsetof(UUMG_SettingController_C, NewVar_0) == 0x000468, "Member 'UUMG_SettingController_C::NewVar_0' has a wrong offset!");

}

