#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameUI_ScoreIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_InGameUI_ScoreIcon.UMG_InGameUI_ScoreIcon_C.ExecuteUbergraph_UMG_InGameUI_ScoreIcon
// 0x0050 (0x0050 - 0x0000)
struct UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0004(0x001C)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_1;               // 0x0024(0x001C)(NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon) == 0x000008, "Wrong alignment on UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon");
static_assert(sizeof(UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon) == 0x000050, "Wrong size on UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon, EntryPoint) == 0x000000, "Member 'UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon, K2Node_MakeStruct_WidgetTransform) == 0x000004, "Member 'UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon, K2Node_MakeStruct_WidgetTransform_1) == 0x000024, "Member 'UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon::K2Node_MakeStruct_WidgetTransform_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon, CallFunc_K2_SetTimer_ReturnValue) == 0x000040, "Member 'UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon, CallFunc_Greater_IntInt_ReturnValue) == 0x00004C, "Member 'UMG_InGameUI_ScoreIcon_C_ExecuteUbergraph_UMG_InGameUI_ScoreIcon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_ScoreIcon.UMG_InGameUI_ScoreIcon_C.AddKillScore
// 0x0058 (0x0058 - 0x0000)
struct UMG_InGameUI_ScoreIcon_C_AddKillScore final
{
public:
	float                                         Kill_Distance;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   kill_name;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class FText>                           Temp;                                              // 0x0020(0x0010)(Edit, BlueprintVisible)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0040(0x0018)()
};
static_assert(alignof(UMG_InGameUI_ScoreIcon_C_AddKillScore) == 0x000008, "Wrong alignment on UMG_InGameUI_ScoreIcon_C_AddKillScore");
static_assert(sizeof(UMG_InGameUI_ScoreIcon_C_AddKillScore) == 0x000058, "Wrong size on UMG_InGameUI_ScoreIcon_C_AddKillScore");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddKillScore, Kill_Distance) == 0x000000, "Member 'UMG_InGameUI_ScoreIcon_C_AddKillScore::Kill_Distance' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddKillScore, kill_name) == 0x000008, "Member 'UMG_InGameUI_ScoreIcon_C_AddKillScore::kill_name' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddKillScore, Temp) == 0x000020, "Member 'UMG_InGameUI_ScoreIcon_C_AddKillScore::Temp' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddKillScore, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'UMG_InGameUI_ScoreIcon_C_AddKillScore::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddKillScore, CallFunc_FFloor_ReturnValue) == 0x000034, "Member 'UMG_InGameUI_ScoreIcon_C_AddKillScore::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddKillScore, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000038, "Member 'UMG_InGameUI_ScoreIcon_C_AddKillScore::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddKillScore, CallFunc_Conv_FloatToText_ReturnValue) == 0x000040, "Member 'UMG_InGameUI_ScoreIcon_C_AddKillScore::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_ScoreIcon.UMG_InGameUI_ScoreIcon_C.AddScoreImpl
// 0x0028 (0x0028 - 0x0000)
struct UMG_InGameUI_ScoreIcon_C_AddScoreImpl final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_ScoreIcon_C_AddScoreImpl) == 0x000008, "Wrong alignment on UMG_InGameUI_ScoreIcon_C_AddScoreImpl");
static_assert(sizeof(UMG_InGameUI_ScoreIcon_C_AddScoreImpl) == 0x000028, "Wrong size on UMG_InGameUI_ScoreIcon_C_AddScoreImpl");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScoreImpl, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'UMG_InGameUI_ScoreIcon_C_AddScoreImpl::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScoreImpl, Temp_int_Variable) == 0x000018, "Member 'UMG_InGameUI_ScoreIcon_C_AddScoreImpl::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScoreImpl, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'UMG_InGameUI_ScoreIcon_C_AddScoreImpl::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScoreImpl, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UMG_InGameUI_ScoreIcon_C_AddScoreImpl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_ScoreIcon.UMG_InGameUI_ScoreIcon_C.FinishAddScore
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameUI_ScoreIcon_C_FinishAddScore final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_ScoreIcon_C_FinishAddScore) == 0x000008, "Wrong alignment on UMG_InGameUI_ScoreIcon_C_FinishAddScore");
static_assert(sizeof(UMG_InGameUI_ScoreIcon_C_FinishAddScore) == 0x000008, "Wrong size on UMG_InGameUI_ScoreIcon_C_FinishAddScore");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_FinishAddScore, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'UMG_InGameUI_ScoreIcon_C_FinishAddScore::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_ScoreIcon.UMG_InGameUI_ScoreIcon_C.Disappear
// 0x0018 (0x0018 - 0x0000)
struct UMG_InGameUI_ScoreIcon_C_Disappear final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_ScoreIcon_C_Disappear) == 0x000008, "Wrong alignment on UMG_InGameUI_ScoreIcon_C_Disappear");
static_assert(sizeof(UMG_InGameUI_ScoreIcon_C_Disappear) == 0x000018, "Wrong size on UMG_InGameUI_ScoreIcon_C_Disappear");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_Disappear, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_InGameUI_ScoreIcon_C_Disappear::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_Disappear, CallFunc_IsVisible_ReturnValue) == 0x000008, "Member 'UMG_InGameUI_ScoreIcon_C_Disappear::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_Disappear, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'UMG_InGameUI_ScoreIcon_C_Disappear::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_ScoreIcon.UMG_InGameUI_ScoreIcon_C.KilltypeDisappear
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameUI_ScoreIcon_C_KilltypeDisappear final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_ScoreIcon_C_KilltypeDisappear) == 0x000008, "Wrong alignment on UMG_InGameUI_ScoreIcon_C_KilltypeDisappear");
static_assert(sizeof(UMG_InGameUI_ScoreIcon_C_KilltypeDisappear) == 0x000010, "Wrong size on UMG_InGameUI_ScoreIcon_C_KilltypeDisappear");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_KilltypeDisappear, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_InGameUI_ScoreIcon_C_KilltypeDisappear::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_KilltypeDisappear, CallFunc_PlayAnimation_ReturnValue_1) == 0x000008, "Member 'UMG_InGameUI_ScoreIcon_C_KilltypeDisappear::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function UMG_InGameUI_ScoreIcon.UMG_InGameUI_ScoreIcon_C.AddScore
// 0x0050 (0x0050 - 0x0000)
struct UMG_InGameUI_ScoreIcon_C_AddScore final
{
public:
	int32                                         AddedScore;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   EventID;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_ScoreIcon_C_AddScore) == 0x000008, "Wrong alignment on UMG_InGameUI_ScoreIcon_C_AddScore");
static_assert(sizeof(UMG_InGameUI_ScoreIcon_C_AddScore) == 0x000050, "Wrong size on UMG_InGameUI_ScoreIcon_C_AddScore");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, AddedScore) == 0x000000, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::AddedScore' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, EventID) == 0x000008, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::EventID' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, CallFunc_Array_AddUnique_ReturnValue) == 0x000034, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00003C, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, CallFunc_FMax_ReturnValue) == 0x000044, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_AddScore, CallFunc_K2_SetTimer_ReturnValue) == 0x000048, "Member 'UMG_InGameUI_ScoreIcon_C_AddScore::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_ScoreIcon.UMG_InGameUI_ScoreIcon_C.KillInfoShow
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameUI_ScoreIcon_C_KillInfoShow final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_ScoreIcon_C_KillInfoShow) == 0x000008, "Wrong alignment on UMG_InGameUI_ScoreIcon_C_KillInfoShow");
static_assert(sizeof(UMG_InGameUI_ScoreIcon_C_KillInfoShow) == 0x000010, "Wrong size on UMG_InGameUI_ScoreIcon_C_KillInfoShow");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_KillInfoShow, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'UMG_InGameUI_ScoreIcon_C_KillInfoShow::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_ScoreIcon_C_KillInfoShow, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UMG_InGameUI_ScoreIcon_C_KillInfoShow::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

