#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Benchmark_Chart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Benchmark_Chart.UMG_Benchmark_Chart_C
// 0x00B0 (0x0310 - 0x0260)
class UUMG_Benchmark_Chart_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Inited;                                            // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      PointArray;                                        // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 DataArray;                                         // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MinDataValue;                                      // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDataValue;                                      // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              GeometrySize;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinVerticalLinePadding;                            // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinHorizontalLinePadding;                          // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HorizontalLinePadding;                             // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VerticalLinePadding;                               // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridMarginLeft;                                    // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridMarginBottom;                                  // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HorizontalLinesNum;                                // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VerticalLinesNum;                                  // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector4>                       VerticalLines;                                     // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector4>                       HorizontalLines;                                   // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector4>                       BorderLines;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           VerticalTexts;                                     // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           HorizontalTexts;                                   // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_Benchmark_Chart(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Init(const struct FGeometry& Geometry);
	void Reset();

	void OnPaint(struct FPaintContext& Context) const;
	void SetData(TArray<int32>& Data) const;
	void MyDrawLine(const struct FPaintContext& Context, const struct FVector4& PositionAB, const struct FLinearColor& Hint, bool AntiAlias, float Thickness) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Benchmark_Chart_C">();
	}
	static class UUMG_Benchmark_Chart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Benchmark_Chart_C>();
	}
};
static_assert(alignof(UUMG_Benchmark_Chart_C) == 0x000008, "Wrong alignment on UUMG_Benchmark_Chart_C");
static_assert(sizeof(UUMG_Benchmark_Chart_C) == 0x000310, "Wrong size on UUMG_Benchmark_Chart_C");
static_assert(offsetof(UUMG_Benchmark_Chart_C, UberGraphFrame) == 0x000260, "Member 'UUMG_Benchmark_Chart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, Inited) == 0x000268, "Member 'UUMG_Benchmark_Chart_C::Inited' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, PointArray) == 0x000270, "Member 'UUMG_Benchmark_Chart_C::PointArray' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, DataArray) == 0x000280, "Member 'UUMG_Benchmark_Chart_C::DataArray' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, MinDataValue) == 0x000290, "Member 'UUMG_Benchmark_Chart_C::MinDataValue' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, MaxDataValue) == 0x000294, "Member 'UUMG_Benchmark_Chart_C::MaxDataValue' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, GeometrySize) == 0x000298, "Member 'UUMG_Benchmark_Chart_C::GeometrySize' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, MinVerticalLinePadding) == 0x0002A0, "Member 'UUMG_Benchmark_Chart_C::MinVerticalLinePadding' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, MinHorizontalLinePadding) == 0x0002A4, "Member 'UUMG_Benchmark_Chart_C::MinHorizontalLinePadding' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, HorizontalLinePadding) == 0x0002A8, "Member 'UUMG_Benchmark_Chart_C::HorizontalLinePadding' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, VerticalLinePadding) == 0x0002AC, "Member 'UUMG_Benchmark_Chart_C::VerticalLinePadding' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, GridMarginLeft) == 0x0002B0, "Member 'UUMG_Benchmark_Chart_C::GridMarginLeft' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, GridMarginBottom) == 0x0002B4, "Member 'UUMG_Benchmark_Chart_C::GridMarginBottom' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, HorizontalLinesNum) == 0x0002B8, "Member 'UUMG_Benchmark_Chart_C::HorizontalLinesNum' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, VerticalLinesNum) == 0x0002BC, "Member 'UUMG_Benchmark_Chart_C::VerticalLinesNum' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, VerticalLines) == 0x0002C0, "Member 'UUMG_Benchmark_Chart_C::VerticalLines' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, HorizontalLines) == 0x0002D0, "Member 'UUMG_Benchmark_Chart_C::HorizontalLines' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, BorderLines) == 0x0002E0, "Member 'UUMG_Benchmark_Chart_C::BorderLines' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, VerticalTexts) == 0x0002F0, "Member 'UUMG_Benchmark_Chart_C::VerticalTexts' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Chart_C, HorizontalTexts) == 0x000300, "Member 'UUMG_Benchmark_Chart_C::HorizontalTexts' has a wrong offset!");

}

