#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_GamepadView

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_GamepadView.UMG_GamepadView_C
// 0x0140 (0x03A0 - 0x0260)
class UUMG_GamepadView_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 HighLight_Vice;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighLighter;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Main;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<struct FKey, class UTexture2D*>          DS4KeyMap;                                         // 0x0280(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FKey, class UTexture2D*>          XBOXKeyMap;                                        // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FKey                                   MainKey;                                           // 0x0320(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FKey                                   ViceKey;                                           // 0x0338(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<struct FKey, class UTexture2D*>          DualSenseMap;                                      // 0x0350(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_GamepadView(int32 EntryPoint);
	void OnSwitchInputDevice(EInputDevice CurrentDevice);
	void Construct();
	void HighLight(const struct FKey& InKey, const struct FKey& ViceKey_0);
	void GetCurrentGamepadKeymap(TMap<struct FKey, class UTexture2D*>* KeyMap);
	void RefreshMainIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_GamepadView_C">();
	}
	static class UUMG_GamepadView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_GamepadView_C>();
	}
};
static_assert(alignof(UUMG_GamepadView_C) == 0x000008, "Wrong alignment on UUMG_GamepadView_C");
static_assert(sizeof(UUMG_GamepadView_C) == 0x0003A0, "Wrong size on UUMG_GamepadView_C");
static_assert(offsetof(UUMG_GamepadView_C, UberGraphFrame) == 0x000260, "Member 'UUMG_GamepadView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_GamepadView_C, HighLight_Vice) == 0x000268, "Member 'UUMG_GamepadView_C::HighLight_Vice' has a wrong offset!");
static_assert(offsetof(UUMG_GamepadView_C, HighLighter) == 0x000270, "Member 'UUMG_GamepadView_C::HighLighter' has a wrong offset!");
static_assert(offsetof(UUMG_GamepadView_C, Main) == 0x000278, "Member 'UUMG_GamepadView_C::Main' has a wrong offset!");
static_assert(offsetof(UUMG_GamepadView_C, DS4KeyMap) == 0x000280, "Member 'UUMG_GamepadView_C::DS4KeyMap' has a wrong offset!");
static_assert(offsetof(UUMG_GamepadView_C, XBOXKeyMap) == 0x0002D0, "Member 'UUMG_GamepadView_C::XBOXKeyMap' has a wrong offset!");
static_assert(offsetof(UUMG_GamepadView_C, MainKey) == 0x000320, "Member 'UUMG_GamepadView_C::MainKey' has a wrong offset!");
static_assert(offsetof(UUMG_GamepadView_C, ViceKey) == 0x000338, "Member 'UUMG_GamepadView_C::ViceKey' has a wrong offset!");
static_assert(offsetof(UUMG_GamepadView_C, DualSenseMap) == 0x000350, "Member 'UUMG_GamepadView_C::DualSenseMap' has a wrong offset!");

}

