#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Art_NewLabel

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_STD_Art_NewLabel.UMG_STD_Art_NewLabel_C
// 0x0020 (0x0280 - 0x0260)
class UUMG_STD_Art_NewLabel_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Label;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedDot;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bNewAsLabel;                                       // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_STD_Art_NewLabel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateNewAsLabel(bool AsLabel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_STD_Art_NewLabel_C">();
	}
	static class UUMG_STD_Art_NewLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_STD_Art_NewLabel_C>();
	}
};
static_assert(alignof(UUMG_STD_Art_NewLabel_C) == 0x000008, "Wrong alignment on UUMG_STD_Art_NewLabel_C");
static_assert(sizeof(UUMG_STD_Art_NewLabel_C) == 0x000280, "Wrong size on UUMG_STD_Art_NewLabel_C");
static_assert(offsetof(UUMG_STD_Art_NewLabel_C, UberGraphFrame) == 0x000260, "Member 'UUMG_STD_Art_NewLabel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_NewLabel_C, Label) == 0x000268, "Member 'UUMG_STD_Art_NewLabel_C::Label' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_NewLabel_C, RedDot) == 0x000270, "Member 'UUMG_STD_Art_NewLabel_C::RedDot' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_NewLabel_C, bNewAsLabel) == 0x000278, "Member 'UUMG_STD_Art_NewLabel_C::bNewAsLabel' has a wrong offset!");

}

