#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DailyLoginPage_Base

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_DailyLoginPage_Base.UMG_DailyLoginPage_Base_C.ExecuteUbergraph_UMG_DailyLoginPage_Base
// 0x0004 (0x0004 - 0x0000)
struct UMG_DailyLoginPage_Base_C_ExecuteUbergraph_UMG_DailyLoginPage_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_DailyLoginPage_Base_C_ExecuteUbergraph_UMG_DailyLoginPage_Base) == 0x000004, "Wrong alignment on UMG_DailyLoginPage_Base_C_ExecuteUbergraph_UMG_DailyLoginPage_Base");
static_assert(sizeof(UMG_DailyLoginPage_Base_C_ExecuteUbergraph_UMG_DailyLoginPage_Base) == 0x000004, "Wrong size on UMG_DailyLoginPage_Base_C_ExecuteUbergraph_UMG_DailyLoginPage_Base");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_ExecuteUbergraph_UMG_DailyLoginPage_Base, EntryPoint) == 0x000000, "Member 'UMG_DailyLoginPage_Base_C_ExecuteUbergraph_UMG_DailyLoginPage_Base::EntryPoint' has a wrong offset!");

// Function UMG_DailyLoginPage_Base.UMG_DailyLoginPage_Base_C.RefreshPageInfo
// 0x0060 (0x0060 - 0x0000)
struct UMG_DailyLoginPage_Base_C_RefreshPageInfo final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBLoginActivityRecord                 CallFunc_Array_Get_Item;                           // 0x000C(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_LoginDateCard_C*                   CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_DailyLoginPage_Base_C_RefreshPageInfo) == 0x000008, "Wrong alignment on UMG_DailyLoginPage_Base_C_RefreshPageInfo");
static_assert(sizeof(UMG_DailyLoginPage_Base_C_RefreshPageInfo) == 0x000060, "Wrong size on UMG_DailyLoginPage_Base_C_RefreshPageInfo");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, CallFunc_Array_Get_Item) == 0x00000C, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, CallFunc_Create_ReturnValue) == 0x000030, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, K2Node_MakeStruct_Margin) == 0x000040, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000050, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_DailyLoginPage_Base_C_RefreshPageInfo, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'UMG_DailyLoginPage_Base_C_RefreshPageInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

