#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Tab_Social

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Tab_Social.UMG_Tab_Social_C
// 0x0020 (0x02B0 - 0x0290)
class UUMG_Tab_Social_C final : public UPBAdvancedSwitcherTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_BG;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_TabName;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Tab_Social(int32 EntryPoint);
	void BndEvt__UMG_Tab_Social_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void K2_RefreshText();
	void K2_UnSelect();
	void K2_Select();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Tab_Social_C">();
	}
	static class UUMG_Tab_Social_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Tab_Social_C>();
	}
};
static_assert(alignof(UUMG_Tab_Social_C) == 0x000008, "Wrong alignment on UUMG_Tab_Social_C");
static_assert(sizeof(UUMG_Tab_Social_C) == 0x0002B0, "Wrong size on UUMG_Tab_Social_C");
static_assert(offsetof(UUMG_Tab_Social_C, UberGraphFrame) == 0x000290, "Member 'UUMG_Tab_Social_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Tab_Social_C, Border_BG) == 0x000298, "Member 'UUMG_Tab_Social_C::Border_BG' has a wrong offset!");
static_assert(offsetof(UUMG_Tab_Social_C, Button_0) == 0x0002A0, "Member 'UUMG_Tab_Social_C::Button_0' has a wrong offset!");
static_assert(offsetof(UUMG_Tab_Social_C, CommonTextBlock_TabName) == 0x0002A8, "Member 'UUMG_Tab_Social_C::CommonTextBlock_TabName' has a wrong offset!");

}

