#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Art_ImageBox_2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_STD_Art_ImageBox_2.UMG_STD_Art_ImageBox_2_C
// 0x00B0 (0x0310 - 0x0260)
class UUMG_STD_Art_ImageBox_2_C final : public UUserWidget
{
public:
	class UImage*                                 Image_214;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_592;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Item;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectFlag;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Lock;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Content;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Title;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_QuotaNumber;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Title;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              TitleSize;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ContentSize;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Item;                                              // 0x02D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Quota;                                             // 0x02F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             Icon;                                              // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateWidget(const struct FVector2D& TitleSize_0, const struct FVector2D& ContentSize_0, const class FText& TitleName, const class FText& ItemName, const class FText& QuotaNumber, class UTexture2D* Icon_0, bool IsLock);
	void SetSelect(bool IsSelecting);
	void UpdateMaterialandTextureForWeaponCapture(class UTexture* Color, class UTexture* Depth, class UMaterialInstance* Material);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_STD_Art_ImageBox_2_C">();
	}
	static class UUMG_STD_Art_ImageBox_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_STD_Art_ImageBox_2_C>();
	}
};
static_assert(alignof(UUMG_STD_Art_ImageBox_2_C) == 0x000008, "Wrong alignment on UUMG_STD_Art_ImageBox_2_C");
static_assert(sizeof(UUMG_STD_Art_ImageBox_2_C) == 0x000310, "Wrong size on UUMG_STD_Art_ImageBox_2_C");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, Image_214) == 0x000260, "Member 'UUMG_STD_Art_ImageBox_2_C::Image_214' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, Image_592) == 0x000268, "Member 'UUMG_STD_Art_ImageBox_2_C::Image_592' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, Image_Item) == 0x000270, "Member 'UUMG_STD_Art_ImageBox_2_C::Image_Item' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, Image_SelectFlag) == 0x000278, "Member 'UUMG_STD_Art_ImageBox_2_C::Image_SelectFlag' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, Overlay_Lock) == 0x000280, "Member 'UUMG_STD_Art_ImageBox_2_C::Overlay_Lock' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, SizeBox_Content) == 0x000288, "Member 'UUMG_STD_Art_ImageBox_2_C::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, SizeBox_Title) == 0x000290, "Member 'UUMG_STD_Art_ImageBox_2_C::SizeBox_Title' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, TextBlock_ItemName) == 0x000298, "Member 'UUMG_STD_Art_ImageBox_2_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, TextBlock_QuotaNumber) == 0x0002A0, "Member 'UUMG_STD_Art_ImageBox_2_C::TextBlock_QuotaNumber' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, TextBlock_Title) == 0x0002A8, "Member 'UUMG_STD_Art_ImageBox_2_C::TextBlock_Title' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, TitleSize) == 0x0002B0, "Member 'UUMG_STD_Art_ImageBox_2_C::TitleSize' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, ContentSize) == 0x0002B8, "Member 'UUMG_STD_Art_ImageBox_2_C::ContentSize' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, Title) == 0x0002C0, "Member 'UUMG_STD_Art_ImageBox_2_C::Title' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, Item) == 0x0002D8, "Member 'UUMG_STD_Art_ImageBox_2_C::Item' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, Quota) == 0x0002F0, "Member 'UUMG_STD_Art_ImageBox_2_C::Quota' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_ImageBox_2_C, Icon) == 0x000308, "Member 'UUMG_STD_Art_ImageBox_2_C::Icon' has a wrong offset!");

}

