#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TabV2

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_TabV2.UMG_TabV2_C
// 0x0068 (0x02F8 - 0x0290)
class UUMG_TabV2_C final : public UPBAdvancedSwitcherTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnSelect;                                          // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverOn;                                           // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FocusBar;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FocusBoard;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusGradual;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusLine;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HoverBoard;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverGradual;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lattice;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MainBorder;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tab_Text;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnlockIcon_v3_C*                       UnlockIcon_v3;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_TabV2(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void K2_UnSelect();
	void K2_Select();
	void K2_RefreshText();
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_TabV2_C">();
	}
	static class UUMG_TabV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_TabV2_C>();
	}
};
static_assert(alignof(UUMG_TabV2_C) == 0x000008, "Wrong alignment on UUMG_TabV2_C");
static_assert(sizeof(UUMG_TabV2_C) == 0x0002F8, "Wrong size on UUMG_TabV2_C");
static_assert(offsetof(UUMG_TabV2_C, UberGraphFrame) == 0x000290, "Member 'UUMG_TabV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, OnSelect) == 0x000298, "Member 'UUMG_TabV2_C::OnSelect' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, HoverOn) == 0x0002A0, "Member 'UUMG_TabV2_C::HoverOn' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, FocusBar) == 0x0002A8, "Member 'UUMG_TabV2_C::FocusBar' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, FocusBoard) == 0x0002B0, "Member 'UUMG_TabV2_C::FocusBoard' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, FocusGradual) == 0x0002B8, "Member 'UUMG_TabV2_C::FocusGradual' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, FocusLine) == 0x0002C0, "Member 'UUMG_TabV2_C::FocusLine' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, HoverBoard) == 0x0002C8, "Member 'UUMG_TabV2_C::HoverBoard' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, HoverGradual) == 0x0002D0, "Member 'UUMG_TabV2_C::HoverGradual' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, Lattice) == 0x0002D8, "Member 'UUMG_TabV2_C::Lattice' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, MainBorder) == 0x0002E0, "Member 'UUMG_TabV2_C::MainBorder' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, Tab_Text) == 0x0002E8, "Member 'UUMG_TabV2_C::Tab_Text' has a wrong offset!");
static_assert(offsetof(UUMG_TabV2_C, UnlockIcon_v3) == 0x0002F0, "Member 'UUMG_TabV2_C::UnlockIcon_v3' has a wrong offset!");

}

