#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_StoreProduct_BlackMarketSub

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_StoreProduct_BlackMarketSub.UMG_StoreProduct_BlackMarketSub_C
// 0x0090 (0x0360 - 0x02D0)
class UUMG_StoreProduct_BlackMarketSub_C final : public UPBBlackStoreProductWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focus;                                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             BoundaryCoin;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonMain;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DisplayName;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineBG;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineFocus;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineProduct;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineQuality;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagineSoldOut;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgineNoProduct;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SoldOutTip;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpaceCoin;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextCategory;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextNoProduct;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         BoundaryCoinAmount;                                // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpcaeCoinAmount;                                   // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOnSold;                                          // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EPBProductPoolType                            PoolType;                                          // 0x0359(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_StoreProduct_BlackMarketSub(int32 EntryPoint);
	void BndEvt__UMG_StoreProduct_Armory_ButtonMain_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_StoreProduct_Armory_ButtonMain_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void K2_RefreshProduct();
	void Construct();
	void SetCategoryText();
	void SetProductName();
	void SetProductTexture();
	void SetPaymentMethod();
	void SetGradeStyle();
	void PromptPurchase();
	void SetNoProductStyle();
	void ShowSoldOutStyle();
	void HideSoldOutStyle();
	void HideNoProductStyle();
	void RecordInteractInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_StoreProduct_BlackMarketSub_C">();
	}
	static class UUMG_StoreProduct_BlackMarketSub_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_StoreProduct_BlackMarketSub_C>();
	}
};
static_assert(alignof(UUMG_StoreProduct_BlackMarketSub_C) == 0x000008, "Wrong alignment on UUMG_StoreProduct_BlackMarketSub_C");
static_assert(sizeof(UUMG_StoreProduct_BlackMarketSub_C) == 0x000360, "Wrong size on UUMG_StoreProduct_BlackMarketSub_C");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, UberGraphFrame) == 0x0002D0, "Member 'UUMG_StoreProduct_BlackMarketSub_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, Focus) == 0x0002D8, "Member 'UUMG_StoreProduct_BlackMarketSub_C::Focus' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, BoundaryCoin) == 0x0002E0, "Member 'UUMG_StoreProduct_BlackMarketSub_C::BoundaryCoin' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, ButtonMain) == 0x0002E8, "Member 'UUMG_StoreProduct_BlackMarketSub_C::ButtonMain' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, DisplayName) == 0x0002F0, "Member 'UUMG_StoreProduct_BlackMarketSub_C::DisplayName' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, ImagineBG) == 0x0002F8, "Member 'UUMG_StoreProduct_BlackMarketSub_C::ImagineBG' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, ImagineFocus) == 0x000300, "Member 'UUMG_StoreProduct_BlackMarketSub_C::ImagineFocus' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, ImagineProduct) == 0x000308, "Member 'UUMG_StoreProduct_BlackMarketSub_C::ImagineProduct' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, ImagineQuality) == 0x000310, "Member 'UUMG_StoreProduct_BlackMarketSub_C::ImagineQuality' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, ImagineSoldOut) == 0x000318, "Member 'UUMG_StoreProduct_BlackMarketSub_C::ImagineSoldOut' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, ImgineNoProduct) == 0x000320, "Member 'UUMG_StoreProduct_BlackMarketSub_C::ImgineNoProduct' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, Overlay_0) == 0x000328, "Member 'UUMG_StoreProduct_BlackMarketSub_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, SoldOutTip) == 0x000330, "Member 'UUMG_StoreProduct_BlackMarketSub_C::SoldOutTip' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, SpaceCoin) == 0x000338, "Member 'UUMG_StoreProduct_BlackMarketSub_C::SpaceCoin' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, TextCategory) == 0x000340, "Member 'UUMG_StoreProduct_BlackMarketSub_C::TextCategory' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, TextNoProduct) == 0x000348, "Member 'UUMG_StoreProduct_BlackMarketSub_C::TextNoProduct' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, BoundaryCoinAmount) == 0x000350, "Member 'UUMG_StoreProduct_BlackMarketSub_C::BoundaryCoinAmount' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, SpcaeCoinAmount) == 0x000354, "Member 'UUMG_StoreProduct_BlackMarketSub_C::SpcaeCoinAmount' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, IsOnSold) == 0x000358, "Member 'UUMG_StoreProduct_BlackMarketSub_C::IsOnSold' has a wrong offset!");
static_assert(offsetof(UUMG_StoreProduct_BlackMarketSub_C, PoolType) == 0x000359, "Member 'UUMG_StoreProduct_BlackMarketSub_C::PoolType' has a wrong offset!");

}

