#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Art_FX

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_STD_Art_FX.UMG_STD_Art_FX_C
// 0x0038 (0x0298 - 0x0260)
class UUMG_STD_Art_FX_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus;                                             // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FocusLine;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeForHighlight;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     FX_Material;                                       // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FX_PreviewFocus;                                   // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FX_PreviewSelected;                                // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FX_Height;                                         // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_STD_Art_FX(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void FX_Focus_On();
	void FX_Selected_On();
	void FX_Focus_Off();
	void FX_Selected_Off();
	void UpdateMaterial(class UMaterialInterface* FXMaterial);
	void UpdateHeight(float Height);
	void UpdateWidget(bool ____FX_Size, float Height, bool ____FX_FX_Mat, class UMaterialInterface* FX_Material_0, bool ____ForceHoverFX, float HoverValue, bool ____ForceSelectFX, float SelectValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_STD_Art_FX_C">();
	}
	static class UUMG_STD_Art_FX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_STD_Art_FX_C>();
	}
};
static_assert(alignof(UUMG_STD_Art_FX_C) == 0x000008, "Wrong alignment on UUMG_STD_Art_FX_C");
static_assert(sizeof(UUMG_STD_Art_FX_C) == 0x000298, "Wrong size on UUMG_STD_Art_FX_C");
static_assert(offsetof(UUMG_STD_Art_FX_C, UberGraphFrame) == 0x000260, "Member 'UUMG_STD_Art_FX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_FX_C, Selected) == 0x000268, "Member 'UUMG_STD_Art_FX_C::Selected' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_FX_C, Focus) == 0x000270, "Member 'UUMG_STD_Art_FX_C::Focus' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_FX_C, FocusLine) == 0x000278, "Member 'UUMG_STD_Art_FX_C::FocusLine' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_FX_C, SizeForHighlight) == 0x000280, "Member 'UUMG_STD_Art_FX_C::SizeForHighlight' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_FX_C, FX_Material) == 0x000288, "Member 'UUMG_STD_Art_FX_C::FX_Material' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_FX_C, FX_PreviewFocus) == 0x000290, "Member 'UUMG_STD_Art_FX_C::FX_PreviewFocus' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_FX_C, FX_PreviewSelected) == 0x000291, "Member 'UUMG_STD_Art_FX_C::FX_PreviewSelected' has a wrong offset!");
static_assert(offsetof(UUMG_STD_Art_FX_C, FX_Height) == 0x000294, "Member 'UUMG_STD_Art_FX_C::FX_Height' has a wrong offset!");

}

