#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SelectCharacterList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_SelectCharacterList.UMG_SelectCharacterList_C.ExecuteUbergraph_UMG_SelectCharacterList
// 0x0004 (0x0004 - 0x0000)
struct UMG_SelectCharacterList_C_ExecuteUbergraph_UMG_SelectCharacterList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SelectCharacterList_C_ExecuteUbergraph_UMG_SelectCharacterList) == 0x000004, "Wrong alignment on UMG_SelectCharacterList_C_ExecuteUbergraph_UMG_SelectCharacterList");
static_assert(sizeof(UMG_SelectCharacterList_C_ExecuteUbergraph_UMG_SelectCharacterList) == 0x000004, "Wrong size on UMG_SelectCharacterList_C_ExecuteUbergraph_UMG_SelectCharacterList");
static_assert(offsetof(UMG_SelectCharacterList_C_ExecuteUbergraph_UMG_SelectCharacterList, EntryPoint) == 0x000000, "Member 'UMG_SelectCharacterList_C_ExecuteUbergraph_UMG_SelectCharacterList::EntryPoint' has a wrong offset!");

// Function UMG_SelectCharacterList.UMG_SelectCharacterList_C.RefreshCharacterList
// 0x0058 (0x0058 - 0x0000)
struct UMG_SelectCharacterList_C_RefreshCharacterList final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_CharacterItem_C*                   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       K2Node_DynamicCast_AsUniform_Grid_Slot;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBFieldModManager_BP_C*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetCharacterDefinitionIDScopeInTheMatch_ReturnValue; // 0x0038(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SelectCharacterList_C_RefreshCharacterList) == 0x000008, "Wrong alignment on UMG_SelectCharacterList_C_RefreshCharacterList");
static_assert(sizeof(UMG_SelectCharacterList_C_RefreshCharacterList) == 0x000058, "Wrong size on UMG_SelectCharacterList_C_RefreshCharacterList");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, CallFunc_Create_ReturnValue) == 0x000010, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, K2Node_DynamicCast_AsUniform_Grid_Slot) == 0x000020, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::K2Node_DynamicCast_AsUniform_Grid_Slot' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000030, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, CallFunc_GetCharacterDefinitionIDScopeInTheMatch_ReturnValue) == 0x000038, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::CallFunc_GetCharacterDefinitionIDScopeInTheMatch_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, CallFunc_Array_Get_Item) == 0x00004C, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_RefreshCharacterList, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'UMG_SelectCharacterList_C_RefreshCharacterList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_SelectCharacterList.UMG_SelectCharacterList_C.InitFocus
// 0x00C0 (0x00C0 - 0x0000)
struct UMG_SelectCharacterList_C_InitFocus final
{
public:
	class UPBUserWidget*                          FocusedWidget;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentRoleID;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_CharacterItem_C*                   K2Node_DynamicCast_AsUMG_Character_Item;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController_BP_C*                 K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_CharacterItem_C*                   K2Node_DynamicCast_AsUMG_Character_Item_1;         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SelectCharacterList_C_InitFocus) == 0x000008, "Wrong alignment on UMG_SelectCharacterList_C_InitFocus");
static_assert(sizeof(UMG_SelectCharacterList_C_InitFocus) == 0x0000C0, "Wrong size on UMG_SelectCharacterList_C_InitFocus");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, FocusedWidget) == 0x000000, "Member 'UMG_SelectCharacterList_C_InitFocus::FocusedWidget' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CurrentRoleID) == 0x000008, "Member 'UMG_SelectCharacterList_C_InitFocus::CurrentRoleID' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'UMG_SelectCharacterList_C_InitFocus::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UMG_SelectCharacterList_C_InitFocus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UMG_SelectCharacterList_C_InitFocus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000024, "Member 'UMG_SelectCharacterList_C_InitFocus::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'UMG_SelectCharacterList_C_InitFocus::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002C, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'UMG_SelectCharacterList_C_InitFocus::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_GetChildAt_ReturnValue) == 0x000038, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_GetAllChildren_ReturnValue) == 0x000048, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Array_Get_Item) == 0x000058, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, K2Node_DynamicCast_AsUMG_Character_Item) == 0x000068, "Member 'UMG_SelectCharacterList_C_InitFocus::K2Node_DynamicCast_AsUMG_Character_Item' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'UMG_SelectCharacterList_C_InitFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Less_IntInt_ReturnValue) == 0x000071, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_BooleanAND_ReturnValue) == 0x000072, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_IsValid_ReturnValue_1) == 0x000073, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000074, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x000080, "Member 'UMG_SelectCharacterList_C_InitFocus::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'UMG_SelectCharacterList_C_InitFocus::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_GetAllChildren_ReturnValue_1) == 0x000090, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, K2Node_DynamicCast_AsUMG_Character_Item_1) == 0x0000A8, "Member 'UMG_SelectCharacterList_C_InitFocus::K2Node_DynamicCast_AsUMG_Character_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'UMG_SelectCharacterList_C_InitFocus::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000B1, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Array_Length_ReturnValue_1) == 0x0000B4, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B8, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_InitFocus, CallFunc_BooleanAND_ReturnValue_1) == 0x0000B9, "Member 'UMG_SelectCharacterList_C_InitFocus::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function UMG_SelectCharacterList.UMG_SelectCharacterList_C.SetRoleIdClicked
// 0x0008 (0x0008 - 0x0000)
struct UMG_SelectCharacterList_C_SetRoleIdClicked final
{
public:
	class UPBUserWidget*                          InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SelectCharacterList_C_SetRoleIdClicked) == 0x000008, "Wrong alignment on UMG_SelectCharacterList_C_SetRoleIdClicked");
static_assert(sizeof(UMG_SelectCharacterList_C_SetRoleIdClicked) == 0x000008, "Wrong size on UMG_SelectCharacterList_C_SetRoleIdClicked");
static_assert(offsetof(UMG_SelectCharacterList_C_SetRoleIdClicked, InWidget) == 0x000000, "Member 'UMG_SelectCharacterList_C_SetRoleIdClicked::InWidget' has a wrong offset!");

// Function UMG_SelectCharacterList.UMG_SelectCharacterList_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_SelectCharacterList_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_SelectCharacterList_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_SelectCharacterList_C_OnFocusReceived");
static_assert(sizeof(UMG_SelectCharacterList_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_SelectCharacterList_C_OnFocusReceived");
static_assert(offsetof(UMG_SelectCharacterList_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_SelectCharacterList_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_SelectCharacterList_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_SelectCharacterList_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_SelectCharacterList_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_SelectCharacterList.UMG_SelectCharacterList_C.BP_GetDesiredFocusTarget
// 0x0018 (0x0018 - 0x0000)
struct UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget) == 0x000018, "Wrong size on UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UMG_SelectCharacterList_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

