#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Launcher_CrossHair

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Launcher_CrossHair.UMG_Launcher_CrossHair_C
// 0x0040 (0x02C8 - 0x0288)
class UUMG_Launcher_CrossHair_C : public UPBLauncherWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector2D                              MovementOffset;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationOffsetScale;                               // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeed;                                       // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceLocation;                                     // 0x02A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LauncherDistance_Text;                             // 0x02B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_Launcher_CrossHair(int32 EntryPoint);
	void K2_Equiped();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ReloadLauncher();
	void NoAmmo(bool bNoAmmo);
	void UseAmmo();
	void NotifyEquippedRadar();
	void AimSightOffset();
	void SetRenderTrans(class UWidget* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Launcher_CrossHair_C">();
	}
	static class UUMG_Launcher_CrossHair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Launcher_CrossHair_C>();
	}
};
static_assert(alignof(UUMG_Launcher_CrossHair_C) == 0x000008, "Wrong alignment on UUMG_Launcher_CrossHair_C");
static_assert(sizeof(UUMG_Launcher_CrossHair_C) == 0x0002C8, "Wrong size on UUMG_Launcher_CrossHair_C");
static_assert(offsetof(UUMG_Launcher_CrossHair_C, UberGraphFrame) == 0x000288, "Member 'UUMG_Launcher_CrossHair_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Launcher_CrossHair_C, MovementOffset) == 0x000290, "Member 'UUMG_Launcher_CrossHair_C::MovementOffset' has a wrong offset!");
static_assert(offsetof(UUMG_Launcher_CrossHair_C, RotationOffsetScale) == 0x000298, "Member 'UUMG_Launcher_CrossHair_C::RotationOffsetScale' has a wrong offset!");
static_assert(offsetof(UUMG_Launcher_CrossHair_C, InterpSpeed) == 0x00029C, "Member 'UUMG_Launcher_CrossHair_C::InterpSpeed' has a wrong offset!");
static_assert(offsetof(UUMG_Launcher_CrossHair_C, TraceLocation) == 0x0002A0, "Member 'UUMG_Launcher_CrossHair_C::TraceLocation' has a wrong offset!");
static_assert(offsetof(UUMG_Launcher_CrossHair_C, LauncherDistance_Text) == 0x0002B0, "Member 'UUMG_Launcher_CrossHair_C::LauncherDistance_Text' has a wrong offset!");

}

