#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Art_FX

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_STD_Art_FX.UMG_STD_Art_FX_C.ExecuteUbergraph_UMG_STD_Art_FX
// 0x0010 (0x0010 - 0x0000)
struct UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX) == 0x000004, "Wrong alignment on UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX");
static_assert(sizeof(UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX) == 0x000010, "Wrong size on UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX");
static_assert(offsetof(UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX, EntryPoint) == 0x000000, "Member 'UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x00000C, "Member 'UMG_STD_Art_FX_C_ExecuteUbergraph_UMG_STD_Art_FX::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");

// Function UMG_STD_Art_FX.UMG_STD_Art_FX_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_STD_Art_FX_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_Art_FX_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_STD_Art_FX_C_PreConstruct");
static_assert(sizeof(UMG_STD_Art_FX_C_PreConstruct) == 0x000001, "Wrong size on UMG_STD_Art_FX_C_PreConstruct");
static_assert(offsetof(UMG_STD_Art_FX_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_STD_Art_FX_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_STD_Art_FX.UMG_STD_Art_FX_C.FX_Focus_On
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_Art_FX_C_FX_Focus_On final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_FX_C_FX_Focus_On) == 0x000008, "Wrong alignment on UMG_STD_Art_FX_C_FX_Focus_On");
static_assert(sizeof(UMG_STD_Art_FX_C_FX_Focus_On) == 0x000008, "Wrong size on UMG_STD_Art_FX_C_FX_Focus_On");
static_assert(offsetof(UMG_STD_Art_FX_C_FX_Focus_On, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_STD_Art_FX_C_FX_Focus_On::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_STD_Art_FX.UMG_STD_Art_FX_C.FX_Selected_On
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_Art_FX_C_FX_Selected_On final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_FX_C_FX_Selected_On) == 0x000008, "Wrong alignment on UMG_STD_Art_FX_C_FX_Selected_On");
static_assert(sizeof(UMG_STD_Art_FX_C_FX_Selected_On) == 0x000008, "Wrong size on UMG_STD_Art_FX_C_FX_Selected_On");
static_assert(offsetof(UMG_STD_Art_FX_C_FX_Selected_On, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_STD_Art_FX_C_FX_Selected_On::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_STD_Art_FX.UMG_STD_Art_FX_C.FX_Focus_Off
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_Art_FX_C_FX_Focus_Off final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_FX_C_FX_Focus_Off) == 0x000008, "Wrong alignment on UMG_STD_Art_FX_C_FX_Focus_Off");
static_assert(sizeof(UMG_STD_Art_FX_C_FX_Focus_Off) == 0x000008, "Wrong size on UMG_STD_Art_FX_C_FX_Focus_Off");
static_assert(offsetof(UMG_STD_Art_FX_C_FX_Focus_Off, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'UMG_STD_Art_FX_C_FX_Focus_Off::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function UMG_STD_Art_FX.UMG_STD_Art_FX_C.FX_Selected_Off
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_Art_FX_C_FX_Selected_Off final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_FX_C_FX_Selected_Off) == 0x000008, "Wrong alignment on UMG_STD_Art_FX_C_FX_Selected_Off");
static_assert(sizeof(UMG_STD_Art_FX_C_FX_Selected_Off) == 0x000008, "Wrong size on UMG_STD_Art_FX_C_FX_Selected_Off");
static_assert(offsetof(UMG_STD_Art_FX_C_FX_Selected_Off, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'UMG_STD_Art_FX_C_FX_Selected_Off::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function UMG_STD_Art_FX.UMG_STD_Art_FX_C.UpdateMaterial
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_Art_FX_C_UpdateMaterial final
{
public:
	class UMaterialInterface*                     FXMaterial;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_FX_C_UpdateMaterial) == 0x000008, "Wrong alignment on UMG_STD_Art_FX_C_UpdateMaterial");
static_assert(sizeof(UMG_STD_Art_FX_C_UpdateMaterial) == 0x000008, "Wrong size on UMG_STD_Art_FX_C_UpdateMaterial");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateMaterial, FXMaterial) == 0x000000, "Member 'UMG_STD_Art_FX_C_UpdateMaterial::FXMaterial' has a wrong offset!");

// Function UMG_STD_Art_FX.UMG_STD_Art_FX_C.UpdateHeight
// 0x0004 (0x0004 - 0x0000)
struct UMG_STD_Art_FX_C_UpdateHeight final
{
public:
	float                                         Height;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_FX_C_UpdateHeight) == 0x000004, "Wrong alignment on UMG_STD_Art_FX_C_UpdateHeight");
static_assert(sizeof(UMG_STD_Art_FX_C_UpdateHeight) == 0x000004, "Wrong size on UMG_STD_Art_FX_C_UpdateHeight");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateHeight, Height) == 0x000000, "Member 'UMG_STD_Art_FX_C_UpdateHeight::Height' has a wrong offset!");

// Function UMG_STD_Art_FX.UMG_STD_Art_FX_C.UpdateWidget
// 0x0038 (0x0038 - 0x0000)
struct UMG_STD_Art_FX_C_UpdateWidget final
{
public:
	bool                                          ____FX_Size;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Height;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ____FX_FX_Mat;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     FX_Material_0;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ____ForceHoverFX;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoverValue;                                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ____ForceSelectFX;                                 // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SelectValue;                                       // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_FX_C_UpdateWidget) == 0x000008, "Wrong alignment on UMG_STD_Art_FX_C_UpdateWidget");
static_assert(sizeof(UMG_STD_Art_FX_C_UpdateWidget) == 0x000038, "Wrong size on UMG_STD_Art_FX_C_UpdateWidget");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, ____FX_Size) == 0x000000, "Member 'UMG_STD_Art_FX_C_UpdateWidget::____FX_Size' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, Height) == 0x000004, "Member 'UMG_STD_Art_FX_C_UpdateWidget::Height' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, ____FX_FX_Mat) == 0x000008, "Member 'UMG_STD_Art_FX_C_UpdateWidget::____FX_FX_Mat' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, FX_Material_0) == 0x000010, "Member 'UMG_STD_Art_FX_C_UpdateWidget::FX_Material_0' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, ____ForceHoverFX) == 0x000018, "Member 'UMG_STD_Art_FX_C_UpdateWidget::____ForceHoverFX' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, HoverValue) == 0x00001C, "Member 'UMG_STD_Art_FX_C_UpdateWidget::HoverValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, ____ForceSelectFX) == 0x000020, "Member 'UMG_STD_Art_FX_C_UpdateWidget::____ForceSelectFX' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, SelectValue) == 0x000024, "Member 'UMG_STD_Art_FX_C_UpdateWidget::SelectValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'UMG_STD_Art_FX_C_UpdateWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_FX_C_UpdateWidget, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'UMG_STD_Art_FX_C_UpdateWidget::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

}

