#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SimpleDisplayMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SimpleDisplayMode.UMG_SimpleDisplayMode_C
// 0x0040 (0x02A0 - 0x0260)
class UUMG_SimpleDisplayMode_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_94;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ModeIcon;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectFlag;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ModeName;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ModeName;                                          // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SimpleDisplayMode(int32 EntryPoint);
	void Construct();
	void Refresh_Mode_Status(bool IsInModeToMatchList);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SimpleDisplayMode_C">();
	}
	static class UUMG_SimpleDisplayMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SimpleDisplayMode_C>();
	}
};
static_assert(alignof(UUMG_SimpleDisplayMode_C) == 0x000008, "Wrong alignment on UUMG_SimpleDisplayMode_C");
static_assert(sizeof(UUMG_SimpleDisplayMode_C) == 0x0002A0, "Wrong size on UUMG_SimpleDisplayMode_C");
static_assert(offsetof(UUMG_SimpleDisplayMode_C, UberGraphFrame) == 0x000260, "Member 'UUMG_SimpleDisplayMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SimpleDisplayMode_C, Image) == 0x000268, "Member 'UUMG_SimpleDisplayMode_C::Image' has a wrong offset!");
static_assert(offsetof(UUMG_SimpleDisplayMode_C, Image_94) == 0x000270, "Member 'UUMG_SimpleDisplayMode_C::Image_94' has a wrong offset!");
static_assert(offsetof(UUMG_SimpleDisplayMode_C, Image_ModeIcon) == 0x000278, "Member 'UUMG_SimpleDisplayMode_C::Image_ModeIcon' has a wrong offset!");
static_assert(offsetof(UUMG_SimpleDisplayMode_C, Image_SelectFlag) == 0x000280, "Member 'UUMG_SimpleDisplayMode_C::Image_SelectFlag' has a wrong offset!");
static_assert(offsetof(UUMG_SimpleDisplayMode_C, TextBlock_ModeName) == 0x000288, "Member 'UUMG_SimpleDisplayMode_C::TextBlock_ModeName' has a wrong offset!");
static_assert(offsetof(UUMG_SimpleDisplayMode_C, VerticalBox_0) == 0x000290, "Member 'UUMG_SimpleDisplayMode_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_SimpleDisplayMode_C, ModeName) == 0x000298, "Member 'UUMG_SimpleDisplayMode_C::ModeName' has a wrong offset!");

}

