#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CharacterOption

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CharacterOption.UMG_CharacterOption_C
// 0x0020 (0x03A0 - 0x0380)
class UUMG_CharacterOption_C final : public UPBItemWidget_Character
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_BackToCharacter;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ClickBackToCharacter;                              // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_CharacterOption(int32 EntryPoint);
	void BndEvt__UMG_CharacterOption_Button_BackToCharacter_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CharacterOption_C">();
	}
	static class UUMG_CharacterOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CharacterOption_C>();
	}
};
static_assert(alignof(UUMG_CharacterOption_C) == 0x000008, "Wrong alignment on UUMG_CharacterOption_C");
static_assert(sizeof(UUMG_CharacterOption_C) == 0x0003A0, "Wrong size on UUMG_CharacterOption_C");
static_assert(offsetof(UUMG_CharacterOption_C, UberGraphFrame) == 0x000380, "Member 'UUMG_CharacterOption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_CharacterOption_C, Button_BackToCharacter) == 0x000388, "Member 'UUMG_CharacterOption_C::Button_BackToCharacter' has a wrong offset!");
static_assert(offsetof(UUMG_CharacterOption_C, ClickBackToCharacter) == 0x000390, "Member 'UUMG_CharacterOption_C::ClickBackToCharacter' has a wrong offset!");

}

