#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_Velocity

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_HelmetHUD_Velocity.UMG_HelmetHUD_Velocity_C.ExecuteUbergraph_UMG_HelmetHUD_Velocity
// 0x0050 (0x0050 - 0x0000)
struct UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity) == 0x000008, "Wrong alignment on UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity");
static_assert(sizeof(UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity) == 0x000050, "Wrong size on UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity, EntryPoint) == 0x000000, "Member 'UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity, K2Node_Event_MyGeometry) == 0x000010, "Member 'UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity, K2Node_Event_InDeltaTime) == 0x000048, "Member 'UMG_HelmetHUD_Velocity_C_ExecuteUbergraph_UMG_HelmetHUD_Velocity::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function UMG_HelmetHUD_Velocity.UMG_HelmetHUD_Velocity_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_HelmetHUD_Velocity_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Velocity_C_Tick) == 0x000004, "Wrong alignment on UMG_HelmetHUD_Velocity_C_Tick");
static_assert(sizeof(UMG_HelmetHUD_Velocity_C_Tick) == 0x00003C, "Wrong size on UMG_HelmetHUD_Velocity_C_Tick");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_HelmetHUD_Velocity_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_HelmetHUD_Velocity_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_HelmetHUD_Velocity.UMG_HelmetHUD_Velocity_C.UpdateVelocity
// 0x0024 (0x0024 - 0x0000)
struct UMG_HelmetHUD_Velocity_C_UpdateVelocity final
{
public:
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Velocity_C_UpdateVelocity) == 0x000004, "Wrong alignment on UMG_HelmetHUD_Velocity_C_UpdateVelocity");
static_assert(sizeof(UMG_HelmetHUD_Velocity_C_UpdateVelocity) == 0x000024, "Wrong size on UMG_HelmetHUD_Velocity_C_UpdateVelocity");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_UpdateVelocity, CallFunc_RandomFloat_ReturnValue) == 0x000000, "Member 'UMG_HelmetHUD_Velocity_C_UpdateVelocity::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_UpdateVelocity, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_HelmetHUD_Velocity_C_UpdateVelocity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_UpdateVelocity, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_Velocity_C_UpdateVelocity::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_UpdateVelocity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'UMG_HelmetHUD_Velocity_C_UpdateVelocity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_UpdateVelocity, CallFunc_VSize_ReturnValue) == 0x000010, "Member 'UMG_HelmetHUD_Velocity_C_UpdateVelocity::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_UpdateVelocity, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000014, "Member 'UMG_HelmetHUD_Velocity_C_UpdateVelocity::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_UpdateVelocity, CallFunc_FMin_ReturnValue) == 0x000018, "Member 'UMG_HelmetHUD_Velocity_C_UpdateVelocity::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_UpdateVelocity, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'UMG_HelmetHUD_Velocity_C_UpdateVelocity::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Velocity_C_UpdateVelocity, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'UMG_HelmetHUD_Velocity_C_UpdateVelocity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

}

