#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_UnderConstructionSign

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_UnderConstructionSign.UMG_UnderConstructionSign_C
// 0x0018 (0x0278 - 0x0260)
class UUMG_UnderConstructionSign_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Slash;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             SlashTex;                                          // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_UnderConstructionSign(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_UnderConstructionSign_C">();
	}
	static class UUMG_UnderConstructionSign_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_UnderConstructionSign_C>();
	}
};
static_assert(alignof(UUMG_UnderConstructionSign_C) == 0x000008, "Wrong alignment on UUMG_UnderConstructionSign_C");
static_assert(sizeof(UUMG_UnderConstructionSign_C) == 0x000278, "Wrong size on UUMG_UnderConstructionSign_C");
static_assert(offsetof(UUMG_UnderConstructionSign_C, UberGraphFrame) == 0x000260, "Member 'UUMG_UnderConstructionSign_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_UnderConstructionSign_C, Slash) == 0x000268, "Member 'UUMG_UnderConstructionSign_C::Slash' has a wrong offset!");
static_assert(offsetof(UUMG_UnderConstructionSign_C, SlashTex) == 0x000270, "Member 'UUMG_UnderConstructionSign_C::SlashTex' has a wrong offset!");

}

