#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MatchMedal

#include "Basic.hpp"

#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_MatchMedal.UMG_MatchMedal_C
// 0x0030 (0x0350 - 0x0320)
class UUMG_MatchMedal_C final : public UCommonActivatableWidget
{
public:
	class UWrapBox*                               WrapBox_0;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FName>                           MedaNames;                                         // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 MedalIndex;                                        // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUMG_Medal_Small_C*                     SelectedMedal;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RefreshMedalInfos();
	void OnMedalSelected(const struct FPBMedalDetailsDataTableRowBase& InMedalDetail, int32 InCount, class UUMG_Medal_Small_C* InSelectedMedal);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_MatchMedal_C">();
	}
	static class UUMG_MatchMedal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_MatchMedal_C>();
	}
};
static_assert(alignof(UUMG_MatchMedal_C) == 0x000008, "Wrong alignment on UUMG_MatchMedal_C");
static_assert(sizeof(UUMG_MatchMedal_C) == 0x000350, "Wrong size on UUMG_MatchMedal_C");
static_assert(offsetof(UUMG_MatchMedal_C, WrapBox_0) == 0x000320, "Member 'UUMG_MatchMedal_C::WrapBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_MatchMedal_C, MedaNames) == 0x000328, "Member 'UUMG_MatchMedal_C::MedaNames' has a wrong offset!");
static_assert(offsetof(UUMG_MatchMedal_C, MedalIndex) == 0x000338, "Member 'UUMG_MatchMedal_C::MedalIndex' has a wrong offset!");
static_assert(offsetof(UUMG_MatchMedal_C, SelectedMedal) == 0x000348, "Member 'UUMG_MatchMedal_C::SelectedMedal' has a wrong offset!");

}

