#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Gallery

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_Gallery.UMG_Gallery_C.ExecuteUbergraph_UMG_Gallery
// 0x0020 (0x0020 - 0x0000)
struct UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBArmoryManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery) == 0x000008, "Wrong alignment on UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery");
static_assert(sizeof(UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery) == 0x000020, "Wrong size on UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery");
static_assert(offsetof(UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery, EntryPoint) == 0x000000, "Member 'UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery, CallFunc_HasItem_ReturnValue) == 0x000018, "Member 'UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery::CallFunc_HasItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'UMG_Gallery_C_ExecuteUbergraph_UMG_Gallery::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function UMG_Gallery.UMG_Gallery_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct UMG_Gallery_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Gallery_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_Gallery_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_Gallery_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on UMG_Gallery_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_Gallery_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_Gallery_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Gallery_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_Gallery_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

