#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_IngameHUD_WeaponInfo_WeaponName

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_IngameHUD_WeaponInfo_WeaponName.UMG_IngameHUD_WeaponInfo_WeaponName_C.ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName
// 0x00D8 (0x00D8 - 0x0000)
struct UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0050(0x0028)()
	float                                         K2Node_Event_ReloadDuration;                       // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EInputDevice CurrentDevice)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_2;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue_1; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue_2; // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName) == 0x000008, "Wrong alignment on UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName");
static_assert(sizeof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName) == 0x0000D8, "Wrong size on UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, EntryPoint) == 0x000000, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000020, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, K2Node_MakeStruct_SlateColor_1) == 0x000050, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, K2Node_Event_ReloadDuration) == 0x000078, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::K2Node_Event_ReloadDuration' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_GetEndTime_ReturnValue_1) == 0x00007C, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000080, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000088, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x000090, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_IsValid_ReturnValue_3) == 0x0000A8, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_GetEngineSubsystem_ReturnValue) == 0x0000B0, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x0000B8, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x0000C0, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_GetEngineSubsystem_ReturnValue_2) == 0x0000C8, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_GetEngineSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_GetCurrentActivateInputDevice_ReturnValue_1) == 0x0000D0, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_GetCurrentActivateInputDevice_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, CallFunc_GetCurrentActivateInputDevice_ReturnValue_2) == 0x0000D1, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::CallFunc_GetCurrentActivateInputDevice_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, K2Node_SwitchEnum_CmpSuccess) == 0x0000D2, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000D3, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function UMG_IngameHUD_WeaponInfo_WeaponName.UMG_IngameHUD_WeaponInfo_WeaponName_C.K2_RefreshDeployedWeaponReloadInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_IngameHUD_WeaponInfo_WeaponName_C_K2_RefreshDeployedWeaponReloadInfo final
{
public:
	float                                         ReloadDuration;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_IngameHUD_WeaponInfo_WeaponName_C_K2_RefreshDeployedWeaponReloadInfo) == 0x000004, "Wrong alignment on UMG_IngameHUD_WeaponInfo_WeaponName_C_K2_RefreshDeployedWeaponReloadInfo");
static_assert(sizeof(UMG_IngameHUD_WeaponInfo_WeaponName_C_K2_RefreshDeployedWeaponReloadInfo) == 0x000004, "Wrong size on UMG_IngameHUD_WeaponInfo_WeaponName_C_K2_RefreshDeployedWeaponReloadInfo");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_K2_RefreshDeployedWeaponReloadInfo, ReloadDuration) == 0x000000, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_K2_RefreshDeployedWeaponReloadInfo::ReloadDuration' has a wrong offset!");

// Function UMG_IngameHUD_WeaponInfo_WeaponName.UMG_IngameHUD_WeaponInfo_WeaponName_C.RefreshWeaponIcon
// 0x0268 (0x0268 - 0x0000)
struct UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon final
{
public:
	class FName                                   WeaponID;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponDefinitionRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0210)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetWeaponId_ReturnValue;                  // 0x0224(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponDefinitionRedirectionRow      CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0230(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon) == 0x000008, "Wrong alignment on UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon");
static_assert(sizeof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon) == 0x000268, "Wrong size on UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, WeaponID) == 0x000000, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::WeaponID' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000220, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, CallFunc_GetWeaponId_ReturnValue) == 0x000224, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::CallFunc_GetWeaponId_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000230, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000240, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000248, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, K2Node_DynamicCast_AsTexture_2D) == 0x000250, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, K2Node_DynamicCast_bSuccess) == 0x000258, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000260, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshWeaponIcon::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function UMG_IngameHUD_WeaponInfo_WeaponName.UMG_IngameHUD_WeaponInfo_WeaponName_C.OnInputDeviceSwitched
// 0x0004 (0x0004 - 0x0000)
struct UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched final
{
public:
	EInputDevice                                  CurrentDevice;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInputName_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInputName_ReturnValue_1;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched) == 0x000001, "Wrong alignment on UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched");
static_assert(sizeof(UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched) == 0x000004, "Wrong size on UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched, CurrentDevice) == 0x000000, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched::CurrentDevice' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched, CallFunc_SetInputName_ReturnValue) == 0x000002, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched::CallFunc_SetInputName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched, CallFunc_SetInputName_ReturnValue_1) == 0x000003, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_OnInputDeviceSwitched::CallFunc_SetInputName_ReturnValue_1' has a wrong offset!");

// Function UMG_IngameHUD_WeaponInfo_WeaponName.UMG_IngameHUD_WeaponInfo_WeaponName_C.RefreshAmmoInclipInfo
// 0x0028 (0x0028 - 0x0000)
struct UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo final
{
public:
	class UImage*                                 InImage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCriticalWarningAmmo_ReturnValue;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue_1;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWarningAmmo_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo) == 0x000008, "Wrong alignment on UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo");
static_assert(sizeof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo) == 0x000028, "Wrong size on UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo, InImage) == 0x000000, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo::InImage' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo, CallFunc_GetCriticalWarningAmmo_ReturnValue) == 0x00000C, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo::CallFunc_GetCriticalWarningAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo, CallFunc_GetCurrentAmmoInClip_ReturnValue) == 0x000010, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo::CallFunc_GetCurrentAmmoInClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo, CallFunc_GetCurrentAmmoInClip_ReturnValue_1) == 0x000018, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo::CallFunc_GetCurrentAmmoInClip_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo, CallFunc_GetWarningAmmo_ReturnValue) == 0x00001C, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo::CallFunc_GetWarningAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000020, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshAmmoInclipInfo::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function UMG_IngameHUD_WeaponInfo_WeaponName.UMG_IngameHUD_WeaponInfo_WeaponName_C.RefreshRemainingAmmoInfo
// 0x0030 (0x0030 - 0x0000)
struct UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshRemainingAmmoInfo final
{
public:
	class UImage*                                 InImage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentAmmo_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWarningAmmo_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentAmmo_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentAmmoInClip_ReturnValue_1;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshRemainingAmmoInfo) == 0x000008, "Wrong alignment on UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshRemainingAmmoInfo");
static_assert(sizeof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshRemainingAmmoInfo) == 0x000030, "Wrong size on UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshRemainingAmmoInfo");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshRemainingAmmoInfo, InImage) == 0x000000, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshRemainingAmmoInfo::InImage' has a wrong offset!");
static_assert(offsetof(UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshRemainingAmmoInfo, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_IngameHUD_WeaponInfo_WeaponName_C_RefreshRemainingAmmoInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
