#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_RightPod

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_InGameHUD_RightPod.UMG_InGameHUD_RightPod_C
// 0x0088 (0x03D0 - 0x0348)
class UUMG_InGameHUD_RightPod_C final : public UPBHelmetHUD_Pod
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_DeployFailed;                                 // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_NoAmmo;                                       // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Reloading;                                    // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Undeploying;                                  // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_NoAmmoInClip;                                 // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Ready;                                        // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Deploying111;                                 // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AmmoImage_Divide;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PodName;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Border;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IconBG;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NameBG;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Reloading;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CurrentAmmo;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_RemainingAmmo;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_InGameHUD_RightPod(int32 EntryPoint);
	void K2_OnPodDeployFailed();
	void K2_RefreshPodReloadInterruptInfo();
	void K2_RefreshPodReloadInfo(const float InReloadDuration);
	void K2_RefreshPodAmmoUpdateInfo();
	void K2_RefreshPodUndeployInfo();
	void K2_RefreshPodDeployInfo(const float InDeployDuration);
	void K2_RefreshPodInfo();
	void RefeshInfo();
	void RefreshName();
	void RefreshIcon();
	void RefreshAmmoInfo();
	void RefreshTotalAmmoInfo();
	void RefreshAmmoInCilpInfo();
	void RefreshRemainingAmmoInfo();
	void RefreshDeployInfo(float InReloadRuration);
	void RefreshUndeployInfo();
	void RefreshReloadInfo(float InReloadDuration);
	void RefreshReloadInterruptInfo();
	void RefreshReadyInfo();
	void OnPodDeployed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_InGameHUD_RightPod_C">();
	}
	static class UUMG_InGameHUD_RightPod_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_InGameHUD_RightPod_C>();
	}
};
static_assert(alignof(UUMG_InGameHUD_RightPod_C) == 0x000008, "Wrong alignment on UUMG_InGameHUD_RightPod_C");
static_assert(sizeof(UUMG_InGameHUD_RightPod_C) == 0x0003D0, "Wrong size on UUMG_InGameHUD_RightPod_C");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, UberGraphFrame) == 0x000348, "Member 'UUMG_InGameHUD_RightPod_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Anim_DeployFailed) == 0x000350, "Member 'UUMG_InGameHUD_RightPod_C::Anim_DeployFailed' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Anim_NoAmmo) == 0x000358, "Member 'UUMG_InGameHUD_RightPod_C::Anim_NoAmmo' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Anim_Reloading) == 0x000360, "Member 'UUMG_InGameHUD_RightPod_C::Anim_Reloading' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Anim_Undeploying) == 0x000368, "Member 'UUMG_InGameHUD_RightPod_C::Anim_Undeploying' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Anim_NoAmmoInClip) == 0x000370, "Member 'UUMG_InGameHUD_RightPod_C::Anim_NoAmmoInClip' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Anim_Ready) == 0x000378, "Member 'UUMG_InGameHUD_RightPod_C::Anim_Ready' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Anim_Deploying111) == 0x000380, "Member 'UUMG_InGameHUD_RightPod_C::Anim_Deploying111' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, AmmoImage_Divide) == 0x000388, "Member 'UUMG_InGameHUD_RightPod_C::AmmoImage_Divide' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, CommonTextBlock_PodName) == 0x000390, "Member 'UUMG_InGameHUD_RightPod_C::CommonTextBlock_PodName' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Image_Border) == 0x000398, "Member 'UUMG_InGameHUD_RightPod_C::Image_Border' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Image_Icon) == 0x0003A0, "Member 'UUMG_InGameHUD_RightPod_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Image_IconBG) == 0x0003A8, "Member 'UUMG_InGameHUD_RightPod_C::Image_IconBG' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Image_NameBG) == 0x0003B0, "Member 'UUMG_InGameHUD_RightPod_C::Image_NameBG' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Image_Reloading) == 0x0003B8, "Member 'UUMG_InGameHUD_RightPod_C::Image_Reloading' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Text_CurrentAmmo) == 0x0003C0, "Member 'UUMG_InGameHUD_RightPod_C::Text_CurrentAmmo' has a wrong offset!");
static_assert(offsetof(UUMG_InGameHUD_RightPod_C, Text_RemainingAmmo) == 0x0003C8, "Member 'UUMG_InGameHUD_RightPod_C::Text_RemainingAmmo' has a wrong offset!");

}

