#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Benchmark_Start_Button

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Benchmark_Start_Button.UMG_Benchmark_Start_Button_C
// 0x0028 (0x0428 - 0x0400)
class UUMG_Benchmark_Start_Button_C final : public UPBItemFieldModWidget_Character
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_STD_Text_C*                        BtnNameMain;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Start;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClick;                                           // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_Benchmark_Start_Button(int32 EntryPoint);
	void BndEvt__UMG_Benchmark_Start_Button_Button_Start_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Benchmark_Start_Button_C">();
	}
	static class UUMG_Benchmark_Start_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Benchmark_Start_Button_C>();
	}
};
static_assert(alignof(UUMG_Benchmark_Start_Button_C) == 0x000008, "Wrong alignment on UUMG_Benchmark_Start_Button_C");
static_assert(sizeof(UUMG_Benchmark_Start_Button_C) == 0x000428, "Wrong size on UUMG_Benchmark_Start_Button_C");
static_assert(offsetof(UUMG_Benchmark_Start_Button_C, UberGraphFrame) == 0x000400, "Member 'UUMG_Benchmark_Start_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Start_Button_C, BtnNameMain) == 0x000408, "Member 'UUMG_Benchmark_Start_Button_C::BtnNameMain' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Start_Button_C, Button_Start) == 0x000410, "Member 'UUMG_Benchmark_Start_Button_C::Button_Start' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Start_Button_C, OnClick) == 0x000418, "Member 'UUMG_Benchmark_Start_Button_C::OnClick' has a wrong offset!");

}

