#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CharacterItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_CharacterItem.UMG_CharacterItem_C.ExecuteUbergraph_UMG_CharacterItem
// 0x0020 (0x0020 - 0x0000)
struct UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBFieldModManager_BP_C*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSelectCharacterID_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem) == 0x000008, "Wrong alignment on UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem");
static_assert(sizeof(UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem) == 0x000020, "Wrong size on UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem");
static_assert(offsetof(UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem, EntryPoint) == 0x000000, "Member 'UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem, CallFunc_GetSelectCharacterID_ReturnValue) == 0x000010, "Member 'UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem::CallFunc_GetSelectCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000018, "Member 'UMG_CharacterItem_C_ExecuteUbergraph_UMG_CharacterItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function UMG_CharacterItem.UMG_CharacterItem_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_CharacterItem_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_CharacterItem_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_CharacterItem_C_OnFocusReceived");
static_assert(sizeof(UMG_CharacterItem_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_CharacterItem_C_OnFocusReceived");
static_assert(offsetof(UMG_CharacterItem_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_CharacterItem_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_CharacterItem_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_CharacterItem_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_CharacterItem_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_CharacterItem_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CharacterItem_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_CharacterItem_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

