#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_GameWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_GameWarning.UMG_GameWarning_C.ExecuteUbergraph_UMG_GameWarning
// 0x0050 (0x0050 - 0x0000)
struct UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning) == 0x000008, "Wrong alignment on UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning");
static_assert(sizeof(UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning) == 0x000050, "Wrong size on UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning");
static_assert(offsetof(UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning, EntryPoint) == 0x000000, "Member 'UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000048, "Member 'UMG_GameWarning_C_ExecuteUbergraph_UMG_GameWarning::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function UMG_GameWarning.UMG_GameWarning_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UMG_GameWarning_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_GameWarning_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UMG_GameWarning_C_OnMouseButtonDown");
static_assert(sizeof(UMG_GameWarning_C_OnMouseButtonDown) == 0x000218, "Wrong size on UMG_GameWarning_C_OnMouseButtonDown");
static_assert(offsetof(UMG_GameWarning_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UMG_GameWarning_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UMG_GameWarning_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UMG_GameWarning_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_GameWarning_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_GameWarning.UMG_GameWarning_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_GameWarning_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_GameWarning_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_GameWarning_C_OnFocusReceived");
static_assert(sizeof(UMG_GameWarning_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_GameWarning_C_OnFocusReceived");
static_assert(offsetof(UMG_GameWarning_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_GameWarning_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_GameWarning_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_GameWarning_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GameWarning_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_GameWarning_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

