#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_RedemptionCodeTextBlock

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_RedemptionCodeTextBlock.UMG_RedemptionCodeTextBlock_C.ExecuteUbergraph_UMG_RedemptionCodeTextBlock
// 0x0168 (0x0168 - 0x0000)
struct UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0070)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0120(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0140(0x0018)(ConstParm)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTextLength_ReturnValue;                // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock) == 0x000008, "Wrong alignment on UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock");
static_assert(sizeof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock) == 0x000168, "Wrong size on UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, EntryPoint) == 0x000000, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, K2Node_Event_MyGeometry) == 0x000004, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, K2Node_Event_MouseEvent) == 0x0000B0, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, K2Node_ComponentBoundEvent_Text_1) == 0x000120, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, K2Node_ComponentBoundEvent_CommitMethod) == 0x000138, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, K2Node_ComponentBoundEvent_Text) == 0x000140, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000158, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, CallFunc_GetTextLength_ReturnValue) == 0x00015C, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::CallFunc_GetTextLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000160, "Member 'UMG_RedemptionCodeTextBlock_C_ExecuteUbergraph_UMG_RedemptionCodeTextBlock::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_RedemptionCodeTextBlock.UMG_RedemptionCodeTextBlock_C.BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function UMG_RedemptionCodeTextBlock.UMG_RedemptionCodeTextBlock_C.BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'UMG_RedemptionCodeTextBlock_C_BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function UMG_RedemptionCodeTextBlock.UMG_RedemptionCodeTextBlock_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UMG_RedemptionCodeTextBlock_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_RedemptionCodeTextBlock_C_OnMouseLeave) == 0x000008, "Wrong alignment on UMG_RedemptionCodeTextBlock_C_OnMouseLeave");
static_assert(sizeof(UMG_RedemptionCodeTextBlock_C_OnMouseLeave) == 0x000070, "Wrong size on UMG_RedemptionCodeTextBlock_C_OnMouseLeave");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UMG_RedemptionCodeTextBlock_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UMG_RedemptionCodeTextBlock.UMG_RedemptionCodeTextBlock_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_RedemptionCodeTextBlock_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_RedemptionCodeTextBlock_C_OnMouseEnter) == 0x000008, "Wrong alignment on UMG_RedemptionCodeTextBlock_C_OnMouseEnter");
static_assert(sizeof(UMG_RedemptionCodeTextBlock_C_OnMouseEnter) == 0x0000A8, "Wrong size on UMG_RedemptionCodeTextBlock_C_OnMouseEnter");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UMG_RedemptionCodeTextBlock_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UMG_RedemptionCodeTextBlock_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UMG_RedemptionCodeTextBlock.UMG_RedemptionCodeTextBlock_C.GetText
// 0x0030 (0x0030 - 0x0000)
struct UMG_RedemptionCodeTextBlock_C_GetText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
};
static_assert(alignof(UMG_RedemptionCodeTextBlock_C_GetText) == 0x000008, "Wrong alignment on UMG_RedemptionCodeTextBlock_C_GetText");
static_assert(sizeof(UMG_RedemptionCodeTextBlock_C_GetText) == 0x000030, "Wrong size on UMG_RedemptionCodeTextBlock_C_GetText");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_GetText, OutText) == 0x000000, "Member 'UMG_RedemptionCodeTextBlock_C_GetText::OutText' has a wrong offset!");
static_assert(offsetof(UMG_RedemptionCodeTextBlock_C_GetText, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'UMG_RedemptionCodeTextBlock_C_GetText::CallFunc_GetText_ReturnValue' has a wrong offset!");

}

