#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DisplayLogo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_DisplayLogo.UMG_DisplayLogo_C.ExecuteUbergraph_UMG_DisplayLogo
// 0x0028 (0x0028 - 0x0000)
struct UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo) == 0x000008, "Wrong alignment on UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo");
static_assert(sizeof(UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo) == 0x000028, "Wrong size on UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo");
static_assert(offsetof(UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo, EntryPoint) == 0x000000, "Member 'UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo, Temp_bool_Variable) == 0x000004, "Member 'UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo, Temp_byte_Variable) == 0x000005, "Member 'UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo, Temp_byte_Variable_1) == 0x000006, "Member 'UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo, K2Node_Select_Default) == 0x000020, "Member 'UMG_DisplayLogo_C_ExecuteUbergraph_UMG_DisplayLogo::K2Node_Select_Default' has a wrong offset!");

// Function UMG_DisplayLogo.UMG_DisplayLogo_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UMG_DisplayLogo_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_DisplayLogo_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UMG_DisplayLogo_C_OnMouseButtonDown");
static_assert(sizeof(UMG_DisplayLogo_C_OnMouseButtonDown) == 0x000218, "Wrong size on UMG_DisplayLogo_C_OnMouseButtonDown");
static_assert(offsetof(UMG_DisplayLogo_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UMG_DisplayLogo_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UMG_DisplayLogo_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UMG_DisplayLogo_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_DisplayLogo_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_DisplayLogo.UMG_DisplayLogo_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_DisplayLogo_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_DisplayLogo_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_DisplayLogo_C_OnFocusReceived");
static_assert(sizeof(UMG_DisplayLogo_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_DisplayLogo_C_OnFocusReceived");
static_assert(offsetof(UMG_DisplayLogo_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_DisplayLogo_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_DisplayLogo_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_DisplayLogo_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DisplayLogo_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_DisplayLogo_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

