#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Card_GamepadKeyBinding

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Card_GamepadKeyBinding.UMG_Card_GamepadKeyBinding_C
// 0x0108 (0x03B8 - 0x02B0)
class UUMG_Card_GamepadKeyBinding_C final : public UPBKeyBindingOptionItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      Image_ButtonTips;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      Image_ButtonTips_2;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MainButton;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Tips2Box;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   KeyName;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         AxisScale_0;                                       // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReadyToRecord;                                     // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnKeySet;                                          // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateColor                            BlackSlate;                                        // 0x0310(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            WhiteSlate;                                        // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsSelected;                                       // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OverrideKeyName;                                   // 0x0368(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(const struct FKey& MainKey, const struct FKey& ViceKey)> OnFocus;                                           // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool StartRecord)> OnStartRecordKeys;                                 // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   ActualKey1;                                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   ActualKey2;                                        // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsDoubleKey;                                      // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UMG_Card_GamepadKeyBinding(int32 EntryPoint);
	void K2_ShowConfirmReplaceConflictPage(const TArray<struct FPBInputSecondMappingDataTableRowBase>& ConflictRowArray);
	void K2_EndRecordKey();
	void K2_ReadyToRecordKey();
	void SetCustomFocus_1();
	void OnSwitchInputDeviceEvent(EInputDevice CurrentDevice);
	void OnKeysRecordReturn(bool Cancel, TArray<struct FKey>& RetKey, bool Shift, bool Ctrl, bool Alt);
	void BndEvt__MainButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void ShowOut_1();
	void Designer_ReadyForInput();
	void Designer_DoneWithSetting(const class FText& InText);
	void Designer_OnSelected(bool bSelected);
	void Designer_RefreshTextColor();
	void Designer_Unfocus();
	void Designer_Focus();
	void GetReadyToRecordKeys();
	void SetKeyBinding(TArray<struct FKey>& InKey, bool Shift, bool Ctrl, bool Alt);
	void MakeLiteralKey(const struct FKey& InKey, struct FKey* OutKey);
	void RefreshInfo();
	void GetKeyDes(const struct FKey& Key, class FText* Key_Des);
	void EndRecordKeys();
	void IsKeyAvaliable(bool* bReady);
	bool GetIsChanged();
	void K2_Ready_To_Record_Key();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Card_GamepadKeyBinding_C">();
	}
	static class UUMG_Card_GamepadKeyBinding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Card_GamepadKeyBinding_C>();
	}
};
static_assert(alignof(UUMG_Card_GamepadKeyBinding_C) == 0x000008, "Wrong alignment on UUMG_Card_GamepadKeyBinding_C");
static_assert(sizeof(UUMG_Card_GamepadKeyBinding_C) == 0x0003B8, "Wrong size on UUMG_Card_GamepadKeyBinding_C");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, UberGraphFrame) == 0x0002B0, "Member 'UUMG_Card_GamepadKeyBinding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, Selected) == 0x0002B8, "Member 'UUMG_Card_GamepadKeyBinding_C::Selected' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, BG) == 0x0002C0, "Member 'UUMG_Card_GamepadKeyBinding_C::BG' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, Image_ButtonTips) == 0x0002C8, "Member 'UUMG_Card_GamepadKeyBinding_C::Image_ButtonTips' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, Image_ButtonTips_2) == 0x0002D0, "Member 'UUMG_Card_GamepadKeyBinding_C::Image_ButtonTips_2' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, MainButton) == 0x0002D8, "Member 'UUMG_Card_GamepadKeyBinding_C::MainButton' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, Text_Title) == 0x0002E0, "Member 'UUMG_Card_GamepadKeyBinding_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, Tips2Box) == 0x0002E8, "Member 'UUMG_Card_GamepadKeyBinding_C::Tips2Box' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, KeyName) == 0x0002F0, "Member 'UUMG_Card_GamepadKeyBinding_C::KeyName' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, AxisScale_0) == 0x0002F8, "Member 'UUMG_Card_GamepadKeyBinding_C::AxisScale_0' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, ReadyToRecord) == 0x0002FC, "Member 'UUMG_Card_GamepadKeyBinding_C::ReadyToRecord' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, OnKeySet) == 0x000300, "Member 'UUMG_Card_GamepadKeyBinding_C::OnKeySet' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, BlackSlate) == 0x000310, "Member 'UUMG_Card_GamepadKeyBinding_C::BlackSlate' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, WhiteSlate) == 0x000338, "Member 'UUMG_Card_GamepadKeyBinding_C::WhiteSlate' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, bIsSelected) == 0x000360, "Member 'UUMG_Card_GamepadKeyBinding_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, OverrideKeyName) == 0x000368, "Member 'UUMG_Card_GamepadKeyBinding_C::OverrideKeyName' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, OnFocus) == 0x000380, "Member 'UUMG_Card_GamepadKeyBinding_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, OnStartRecordKeys) == 0x000390, "Member 'UUMG_Card_GamepadKeyBinding_C::OnStartRecordKeys' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, ActualKey1) == 0x0003A0, "Member 'UUMG_Card_GamepadKeyBinding_C::ActualKey1' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, ActualKey2) == 0x0003A8, "Member 'UUMG_Card_GamepadKeyBinding_C::ActualKey2' has a wrong offset!");
static_assert(offsetof(UUMG_Card_GamepadKeyBinding_C, bIsDoubleKey) == 0x0003B0, "Member 'UUMG_Card_GamepadKeyBinding_C::bIsDoubleKey' has a wrong offset!");

}

