#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ArtBook

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "Struct_ArtBookPage_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_ArtBook.UMG_ArtBook_C.ExecuteUbergraph_UMG_ArtBook
// 0x0060 (0x0060 - 0x0000)
struct UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0018(0x0008)(NoDestructor)
	struct FBPFocusEvent                          CallFunc_ConvertToBPFocusEvent_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ArtBookPage_C*                     K2Node_DynamicCast_AsUMG_Art_Book_Page;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ArtBookPage_C*                     K2Node_DynamicCast_AsUMG_Art_Book_Page_1;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook) == 0x000008, "Wrong alignment on UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook");
static_assert(sizeof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook) == 0x000060, "Wrong size on UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, EntryPoint) == 0x000000, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, K2Node_Event_InFocusEvent) == 0x000018, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, CallFunc_ConvertToBPFocusEvent_ReturnValue) == 0x000020, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::CallFunc_ConvertToBPFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, CallFunc_GetActiveWidget_ReturnValue) == 0x000028, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000030, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, K2Node_DynamicCast_AsUMG_Art_Book_Page) == 0x000038, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::K2Node_DynamicCast_AsUMG_Art_Book_Page' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000048, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, K2Node_DynamicCast_AsUMG_Art_Book_Page_1) == 0x000050, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::K2Node_DynamicCast_AsUMG_Art_Book_Page_1' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'UMG_ArtBook_C_ExecuteUbergraph_UMG_ArtBook::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function UMG_ArtBook.UMG_ArtBook_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_ArtBook_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_ArtBook_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_ArtBook_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_ArtBook_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_ArtBook_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_ArtBook_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_ArtBook_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_ArtBook.UMG_ArtBook_C.BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Next_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_ArtBook.UMG_ArtBook_C.BndEvt__UMG_ArtBook_Button_Pre_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Pre_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Pre_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Pre_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Pre_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Pre_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Pre_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_ArtBook_C_BndEvt__UMG_ArtBook_Button_Pre_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_ArtBook.UMG_ArtBook_C.Init Art Book
// 0x0088 (0x0088 - 0x0000)
struct UMG_ArtBook_C_Init_Art_Book final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ArtBookPage_C*                     CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0018(0x0010)(ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_ArtBookPage                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ArtBook_C_Init_Art_Book) == 0x000008, "Wrong alignment on UMG_ArtBook_C_Init_Art_Book");
static_assert(sizeof(UMG_ArtBook_C_Init_Art_Book) == 0x000088, "Wrong size on UMG_ArtBook_C_Init_Art_Book");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_ArtBook_C_Init_Art_Book::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_ArtBook_C_Init_Art_Book::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_ArtBook_C_Init_Art_Book::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, CallFunc_Create_ReturnValue) == 0x000010, "Member 'UMG_ArtBook_C_Init_Art_Book::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000018, "Member 'UMG_ArtBook_C_Init_Art_Book::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'UMG_ArtBook_C_Init_Art_Book::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, CallFunc_Array_Get_Item) == 0x000030, "Member 'UMG_ArtBook_C_Init_Art_Book::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'UMG_ArtBook_C_Init_Art_Book::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'UMG_ArtBook_C_Init_Art_Book::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000080, "Member 'UMG_ArtBook_C_Init_Art_Book::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_Init_Art_Book, CallFunc_Less_IntInt_ReturnValue) == 0x000081, "Member 'UMG_ArtBook_C_Init_Art_Book::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_ArtBook.UMG_ArtBook_C.SwitchToPreviousPage
// 0x0014 (0x0014 - 0x0000)
struct UMG_ArtBook_C_SwitchToPreviousPage final
{
public:
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ArtBook_C_SwitchToPreviousPage) == 0x000004, "Wrong alignment on UMG_ArtBook_C_SwitchToPreviousPage");
static_assert(sizeof(UMG_ArtBook_C_SwitchToPreviousPage) == 0x000014, "Wrong size on UMG_ArtBook_C_SwitchToPreviousPage");
static_assert(offsetof(UMG_ArtBook_C_SwitchToPreviousPage, CallFunc_GetChildrenCount_ReturnValue) == 0x000000, "Member 'UMG_ArtBook_C_SwitchToPreviousPage::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_SwitchToPreviousPage, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'UMG_ArtBook_C_SwitchToPreviousPage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_SwitchToPreviousPage, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'UMG_ArtBook_C_SwitchToPreviousPage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_SwitchToPreviousPage, Temp_int_Variable) == 0x00000C, "Member 'UMG_ArtBook_C_SwitchToPreviousPage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_SwitchToPreviousPage, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000010, "Member 'UMG_ArtBook_C_SwitchToPreviousPage::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

// Function UMG_ArtBook.UMG_ArtBook_C.SwitchToNextPage
// 0x0010 (0x0010 - 0x0000)
struct UMG_ArtBook_C_SwitchToNextPage final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ArtBook_C_SwitchToNextPage) == 0x000004, "Wrong alignment on UMG_ArtBook_C_SwitchToNextPage");
static_assert(sizeof(UMG_ArtBook_C_SwitchToNextPage) == 0x000010, "Wrong size on UMG_ArtBook_C_SwitchToNextPage");
static_assert(offsetof(UMG_ArtBook_C_SwitchToNextPage, Temp_int_Variable) == 0x000000, "Member 'UMG_ArtBook_C_SwitchToNextPage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_SwitchToNextPage, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'UMG_ArtBook_C_SwitchToNextPage::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_SwitchToNextPage, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'UMG_ArtBook_C_SwitchToNextPage::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_SwitchToNextPage, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_ArtBook_C_SwitchToNextPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_ArtBook.UMG_ArtBook_C.RefreshCurrentPageInfo
// 0x0020 (0x0020 - 0x0000)
struct UMG_ArtBook_C_RefreshCurrentPageInfo final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(UMG_ArtBook_C_RefreshCurrentPageInfo) == 0x000008, "Wrong alignment on UMG_ArtBook_C_RefreshCurrentPageInfo");
static_assert(sizeof(UMG_ArtBook_C_RefreshCurrentPageInfo) == 0x000020, "Wrong size on UMG_ArtBook_C_RefreshCurrentPageInfo");
static_assert(offsetof(UMG_ArtBook_C_RefreshCurrentPageInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'UMG_ArtBook_C_RefreshCurrentPageInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_RefreshCurrentPageInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_ArtBook_C_RefreshCurrentPageInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UMG_ArtBook.UMG_ArtBook_C.OnKeyUp
// 0x0430 (0x0430 - 0x0000)
struct UMG_ArtBook_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0208(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x02C0(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_2;                    // 0x0378(0x00B8)()
};
static_assert(alignof(UMG_ArtBook_C_OnKeyUp) == 0x000008, "Wrong alignment on UMG_ArtBook_C_OnKeyUp");
static_assert(sizeof(UMG_ArtBook_C_OnKeyUp) == 0x000430, "Wrong size on UMG_ArtBook_C_OnKeyUp");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'UMG_ArtBook_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'UMG_ArtBook_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, ReturnValue) == 0x000070, "Member 'UMG_ArtBook_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000140, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000141, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x000142, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue) == 0x000143, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x000144, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x000148, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_Not_PreBool_ReturnValue) == 0x000200, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_BooleanAND_ReturnValue) == 0x000201, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000208, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_Handled_ReturnValue_1) == 0x0002C0, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ArtBook_C_OnKeyUp, CallFunc_Handled_ReturnValue_2) == 0x000378, "Member 'UMG_ArtBook_C_OnKeyUp::CallFunc_Handled_ReturnValue_2' has a wrong offset!");

}

