#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DisplayModeFilterButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_DisplayModeFilterButton.UMG_DisplayModeFilterButton_C.ExecuteUbergraph_UMG_DisplayModeFilterButton
// 0x0120 (0x0120 - 0x0000)
struct UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0070)(ConstParm)
};
static_assert(alignof(UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton) == 0x000008, "Wrong alignment on UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton");
static_assert(sizeof(UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton) == 0x000120, "Wrong size on UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton, EntryPoint) == 0x000000, "Member 'UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton, K2Node_Event_MyGeometry) == 0x000004, "Member 'UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton, K2Node_Event_MouseEvent) == 0x0000B0, "Member 'UMG_DisplayModeFilterButton_C_ExecuteUbergraph_UMG_DisplayModeFilterButton::K2Node_Event_MouseEvent' has a wrong offset!");

// Function UMG_DisplayModeFilterButton.UMG_DisplayModeFilterButton_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UMG_DisplayModeFilterButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_DisplayModeFilterButton_C_OnMouseLeave) == 0x000008, "Wrong alignment on UMG_DisplayModeFilterButton_C_OnMouseLeave");
static_assert(sizeof(UMG_DisplayModeFilterButton_C_OnMouseLeave) == 0x000070, "Wrong size on UMG_DisplayModeFilterButton_C_OnMouseLeave");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UMG_DisplayModeFilterButton_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UMG_DisplayModeFilterButton.UMG_DisplayModeFilterButton_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_DisplayModeFilterButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_DisplayModeFilterButton_C_OnMouseEnter) == 0x000008, "Wrong alignment on UMG_DisplayModeFilterButton_C_OnMouseEnter");
static_assert(sizeof(UMG_DisplayModeFilterButton_C_OnMouseEnter) == 0x0000A8, "Wrong size on UMG_DisplayModeFilterButton_C_OnMouseEnter");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UMG_DisplayModeFilterButton_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UMG_DisplayModeFilterButton_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UMG_DisplayModeFilterButton.UMG_DisplayModeFilterButton_C.On_Border_Filter_MouseButtonUp_0
// 0x0218 (0x0218 - 0x0000)
struct UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0) == 0x000008, "Wrong alignment on UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0");
static_assert(sizeof(UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0) == 0x000218, "Wrong size on UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0, MyGeometry) == 0x000000, "Member 'UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0, MouseEvent) == 0x000038, "Member 'UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0, ReturnValue) == 0x0000A8, "Member 'UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_DisplayModeFilterButton_C_On_Border_Filter_MouseButtonUp_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_DisplayModeFilterButton.UMG_DisplayModeFilterButton_C.Set Hide
// 0x0001 (0x0001 - 0x0000)
struct UMG_DisplayModeFilterButton_C_Set_Hide final
{
public:
	bool                                          bHide;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_DisplayModeFilterButton_C_Set_Hide) == 0x000001, "Wrong alignment on UMG_DisplayModeFilterButton_C_Set_Hide");
static_assert(sizeof(UMG_DisplayModeFilterButton_C_Set_Hide) == 0x000001, "Wrong size on UMG_DisplayModeFilterButton_C_Set_Hide");
static_assert(offsetof(UMG_DisplayModeFilterButton_C_Set_Hide, bHide) == 0x000000, "Member 'UMG_DisplayModeFilterButton_C_Set_Hide::bHide' has a wrong offset!");

}

