#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Art_ImageBox_5

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_STD_Art_ImageBox_5.UMG_STD_Art_ImageBox_5_C.ExecuteUbergraph_UMG_STD_Art_ImageBox_5
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_Art_ImageBox_5_C_ExecuteUbergraph_UMG_STD_Art_ImageBox_5 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_Art_ImageBox_5_C_ExecuteUbergraph_UMG_STD_Art_ImageBox_5) == 0x000004, "Wrong alignment on UMG_STD_Art_ImageBox_5_C_ExecuteUbergraph_UMG_STD_Art_ImageBox_5");
static_assert(sizeof(UMG_STD_Art_ImageBox_5_C_ExecuteUbergraph_UMG_STD_Art_ImageBox_5) == 0x000008, "Wrong size on UMG_STD_Art_ImageBox_5_C_ExecuteUbergraph_UMG_STD_Art_ImageBox_5");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_ExecuteUbergraph_UMG_STD_Art_ImageBox_5, EntryPoint) == 0x000000, "Member 'UMG_STD_Art_ImageBox_5_C_ExecuteUbergraph_UMG_STD_Art_ImageBox_5::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_ExecuteUbergraph_UMG_STD_Art_ImageBox_5, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_STD_Art_ImageBox_5_C_ExecuteUbergraph_UMG_STD_Art_ImageBox_5::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_STD_Art_ImageBox_5.UMG_STD_Art_ImageBox_5_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_STD_Art_ImageBox_5_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_Art_ImageBox_5_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_STD_Art_ImageBox_5_C_PreConstruct");
static_assert(sizeof(UMG_STD_Art_ImageBox_5_C_PreConstruct) == 0x000001, "Wrong size on UMG_STD_Art_ImageBox_5_C_PreConstruct");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_STD_Art_ImageBox_5_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_STD_Art_ImageBox_5.UMG_STD_Art_ImageBox_5_C.SetSelect
// 0x0098 (0x0098 - 0x0000)
struct UMG_STD_Art_ImageBox_5_C_SetSelect final
{
public:
	bool                                          IsSelecting;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x000C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_Art_ImageBox_5_C_SetSelect) == 0x000008, "Wrong alignment on UMG_STD_Art_ImageBox_5_C_SetSelect");
static_assert(sizeof(UMG_STD_Art_ImageBox_5_C_SetSelect) == 0x000098, "Wrong size on UMG_STD_Art_ImageBox_5_C_SetSelect");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, IsSelecting) == 0x000000, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::IsSelecting' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_GetDesiredSize_ReturnValue) == 0x000004, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_GetCachedGeometry_ReturnValue) == 0x00000C, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_GetAbsoluteSize_ReturnValue) == 0x000044, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000050, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000058, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, K2Node_MakeStruct_Margin) == 0x000060, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_BreakVector2D_X) == 0x000070, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_BreakVector2D_Y) == 0x000074, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000078, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00007C, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000080, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetSelect, K2Node_MakeStruct_Margin_1) == 0x000084, "Member 'UMG_STD_Art_ImageBox_5_C_SetSelect::K2Node_MakeStruct_Margin_1' has a wrong offset!");

// Function UMG_STD_Art_ImageBox_5.UMG_STD_Art_ImageBox_5_C.SetLock
// 0x0001 (0x0001 - 0x0000)
struct UMG_STD_Art_ImageBox_5_C_SetLock final
{
public:
	bool                                          IsLocking;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_Art_ImageBox_5_C_SetLock) == 0x000001, "Wrong alignment on UMG_STD_Art_ImageBox_5_C_SetLock");
static_assert(sizeof(UMG_STD_Art_ImageBox_5_C_SetLock) == 0x000001, "Wrong size on UMG_STD_Art_ImageBox_5_C_SetLock");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_SetLock, IsLocking) == 0x000000, "Member 'UMG_STD_Art_ImageBox_5_C_SetLock::IsLocking' has a wrong offset!");

// Function UMG_STD_Art_ImageBox_5.UMG_STD_Art_ImageBox_5_C.UpdateWidget
// 0x0098 (0x0098 - 0x0000)
struct UMG_STD_Art_ImageBox_5_C_UpdateWidget final
{
public:
	struct FVector2D                              Size;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CharacterIcon;                                     // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CharacterAbilityIcon;                              // 0x0030(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0058(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Level;                                             // 0x0070(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_ImageBox_5_C_UpdateWidget) == 0x000008, "Wrong alignment on UMG_STD_Art_ImageBox_5_C_UpdateWidget");
static_assert(sizeof(UMG_STD_Art_ImageBox_5_C_UpdateWidget) == 0x000098, "Wrong size on UMG_STD_Art_ImageBox_5_C_UpdateWidget");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_UpdateWidget, Size) == 0x000000, "Member 'UMG_STD_Art_ImageBox_5_C_UpdateWidget::Size' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_UpdateWidget, CharacterIcon) == 0x000008, "Member 'UMG_STD_Art_ImageBox_5_C_UpdateWidget::CharacterIcon' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_UpdateWidget, CharacterAbilityIcon) == 0x000030, "Member 'UMG_STD_Art_ImageBox_5_C_UpdateWidget::CharacterAbilityIcon' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_UpdateWidget, Name_0) == 0x000058, "Member 'UMG_STD_Art_ImageBox_5_C_UpdateWidget::Name_0' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_UpdateWidget, Level) == 0x000070, "Member 'UMG_STD_Art_ImageBox_5_C_UpdateWidget::Level' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_UpdateWidget, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000088, "Member 'UMG_STD_Art_ImageBox_5_C_UpdateWidget::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_UpdateWidget, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000089, "Member 'UMG_STD_Art_ImageBox_5_C_UpdateWidget::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_UpdateWidget, CallFunc_BreakVector2D_X) == 0x00008C, "Member 'UMG_STD_Art_ImageBox_5_C_UpdateWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_ImageBox_5_C_UpdateWidget, CallFunc_BreakVector2D_Y) == 0x000090, "Member 'UMG_STD_Art_ImageBox_5_C_UpdateWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");

}

