#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_BoolOptionItem

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_BoolOptionItem.UMG_BoolOptionItem_C
// 0x0058 (0x02E0 - 0x0288)
class UUMG_BoolOptionItem_C final : public UPBBoolOptionItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ButtonOn;                                          // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBG;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MainButton;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Button;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_OFF;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ON;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnSelected;                                        // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_BoolOptionItem(int32 EntryPoint);
	void K2_SetValid(bool bIsValid);
	void K2_RefreshValue();
	void K2_ToggleButton();
	void BndEvt__UMG_BoolItem_MainButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void RefreshValueStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_BoolOptionItem_C">();
	}
	static class UUMG_BoolOptionItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_BoolOptionItem_C>();
	}
};
static_assert(alignof(UUMG_BoolOptionItem_C) == 0x000008, "Wrong alignment on UUMG_BoolOptionItem_C");
static_assert(sizeof(UUMG_BoolOptionItem_C) == 0x0002E0, "Wrong size on UUMG_BoolOptionItem_C");
static_assert(offsetof(UUMG_BoolOptionItem_C, UberGraphFrame) == 0x000288, "Member 'UUMG_BoolOptionItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_BoolOptionItem_C, ButtonOn) == 0x000290, "Member 'UUMG_BoolOptionItem_C::ButtonOn' has a wrong offset!");
static_assert(offsetof(UUMG_BoolOptionItem_C, Button) == 0x000298, "Member 'UUMG_BoolOptionItem_C::Button' has a wrong offset!");
static_assert(offsetof(UUMG_BoolOptionItem_C, ButtonBG) == 0x0002A0, "Member 'UUMG_BoolOptionItem_C::ButtonBG' has a wrong offset!");
static_assert(offsetof(UUMG_BoolOptionItem_C, MainButton) == 0x0002A8, "Member 'UUMG_BoolOptionItem_C::MainButton' has a wrong offset!");
static_assert(offsetof(UUMG_BoolOptionItem_C, Overlay_0) == 0x0002B0, "Member 'UUMG_BoolOptionItem_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UUMG_BoolOptionItem_C, SizeBox_Button) == 0x0002B8, "Member 'UUMG_BoolOptionItem_C::SizeBox_Button' has a wrong offset!");
static_assert(offsetof(UUMG_BoolOptionItem_C, TextBlock_OFF) == 0x0002C0, "Member 'UUMG_BoolOptionItem_C::TextBlock_OFF' has a wrong offset!");
static_assert(offsetof(UUMG_BoolOptionItem_C, TextBlock_ON) == 0x0002C8, "Member 'UUMG_BoolOptionItem_C::TextBlock_ON' has a wrong offset!");
static_assert(offsetof(UUMG_BoolOptionItem_C, OnSelected) == 0x0002D0, "Member 'UUMG_BoolOptionItem_C::OnSelected' has a wrong offset!");

}

