#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CareerWeapon

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CareerWeapon.UMG_CareerWeapon_C
// 0x0090 (0x0340 - 0x02B0)
class UUMG_CareerWeapon_C final : public UPBCareerWeaponDataWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_87;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_background;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_WeaponIcon;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Imageline;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Imageline_0;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WeaponName;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WeaponName_1;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionWeaponItem_C*           UMG_ProgressionWeaponItem;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_WeaponList;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProfileCareerData_C*               WeaponAccurcyNum;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              WeaponDamageNum;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              WeaponHeadShotKillNum;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DetailedCareerData_C*              WeaponHeadShotKillRatio;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             WeaponItemsContainer;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProfileCareerData_C*               WeaponKillNum;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   WeaponID;                                          // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionWeaponItem_C*           CurrentSelectedWeapon;                             // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_CareerWeapon(int32 EntryPoint);
	void K2_RefreshWeaponData();
	void Construct();
	void InitWeaponList();
	void OnSelectedWeapon(class FName WeaponID_0, class UUMG_ProgressionWeaponItem_C* ClickedWidget);
	void UnfocusCurrentWeapon();
	void RefreshInfo();
	void FocusOnFirstWeapon();
	class FText FloatToPercentage(float B);
	void SetWeaponDataInfo();
	void RestoreFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CareerWeapon_C">();
	}
	static class UUMG_CareerWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CareerWeapon_C>();
	}
};
static_assert(alignof(UUMG_CareerWeapon_C) == 0x000008, "Wrong alignment on UUMG_CareerWeapon_C");
static_assert(sizeof(UUMG_CareerWeapon_C) == 0x000340, "Wrong size on UUMG_CareerWeapon_C");
static_assert(offsetof(UUMG_CareerWeapon_C, UberGraphFrame) == 0x0002B0, "Member 'UUMG_CareerWeapon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, Image_87) == 0x0002B8, "Member 'UUMG_CareerWeapon_C::Image_87' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, Image_background) == 0x0002C0, "Member 'UUMG_CareerWeapon_C::Image_background' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, Image_WeaponIcon) == 0x0002C8, "Member 'UUMG_CareerWeapon_C::Image_WeaponIcon' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, Imageline) == 0x0002D0, "Member 'UUMG_CareerWeapon_C::Imageline' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, Imageline_0) == 0x0002D8, "Member 'UUMG_CareerWeapon_C::Imageline_0' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, TextBlock_WeaponName) == 0x0002E0, "Member 'UUMG_CareerWeapon_C::TextBlock_WeaponName' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, TextBlock_WeaponName_1) == 0x0002E8, "Member 'UUMG_CareerWeapon_C::TextBlock_WeaponName_1' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, UMG_ProgressionWeaponItem) == 0x0002F0, "Member 'UUMG_CareerWeapon_C::UMG_ProgressionWeaponItem' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, VerticalBox_WeaponList) == 0x0002F8, "Member 'UUMG_CareerWeapon_C::VerticalBox_WeaponList' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, WeaponAccurcyNum) == 0x000300, "Member 'UUMG_CareerWeapon_C::WeaponAccurcyNum' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, WeaponDamageNum) == 0x000308, "Member 'UUMG_CareerWeapon_C::WeaponDamageNum' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, WeaponHeadShotKillNum) == 0x000310, "Member 'UUMG_CareerWeapon_C::WeaponHeadShotKillNum' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, WeaponHeadShotKillRatio) == 0x000318, "Member 'UUMG_CareerWeapon_C::WeaponHeadShotKillRatio' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, WeaponItemsContainer) == 0x000320, "Member 'UUMG_CareerWeapon_C::WeaponItemsContainer' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, WeaponKillNum) == 0x000328, "Member 'UUMG_CareerWeapon_C::WeaponKillNum' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, WeaponID) == 0x000330, "Member 'UUMG_CareerWeapon_C::WeaponID' has a wrong offset!");
static_assert(offsetof(UUMG_CareerWeapon_C, CurrentSelectedWeapon) == 0x000338, "Member 'UUMG_CareerWeapon_C::CurrentSelectedWeapon' has a wrong offset!");

}

