#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_OriginalSoundTrack

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_OriginalSoundTrack.UMG_OriginalSoundTrack_C
// 0x0028 (0x0360 - 0x0338)
class UUMG_OriginalSoundTrack_C final : public UPBOriginalSoundTrackWidget
{
public:
	class UScrollBox*                             ScrollBox_SoundTrack;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SingleSoundTrack_C*                CurrentPlayingSoundTrack;                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Playing_Audio_Comp;                                // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 InSoundIndex)> OnPlayingSoundChanged;                             // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void RefreshSoundTrackList(TArray<struct FStruct_SoundInfo>& InSoundInfos, class UAudioComponent* InPlayingAudioComp);
	void On_Button_Clicked(int32 InSoundIndex);
	void PlaySoundFromIndex(int32 InIndex, class UAudioComponent* InPlayingAudioComp);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_OriginalSoundTrack_C">();
	}
	static class UUMG_OriginalSoundTrack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_OriginalSoundTrack_C>();
	}
};
static_assert(alignof(UUMG_OriginalSoundTrack_C) == 0x000008, "Wrong alignment on UUMG_OriginalSoundTrack_C");
static_assert(sizeof(UUMG_OriginalSoundTrack_C) == 0x000360, "Wrong size on UUMG_OriginalSoundTrack_C");
static_assert(offsetof(UUMG_OriginalSoundTrack_C, ScrollBox_SoundTrack) == 0x000338, "Member 'UUMG_OriginalSoundTrack_C::ScrollBox_SoundTrack' has a wrong offset!");
static_assert(offsetof(UUMG_OriginalSoundTrack_C, CurrentPlayingSoundTrack) == 0x000340, "Member 'UUMG_OriginalSoundTrack_C::CurrentPlayingSoundTrack' has a wrong offset!");
static_assert(offsetof(UUMG_OriginalSoundTrack_C, Playing_Audio_Comp) == 0x000348, "Member 'UUMG_OriginalSoundTrack_C::Playing_Audio_Comp' has a wrong offset!");
static_assert(offsetof(UUMG_OriginalSoundTrack_C, OnPlayingSoundChanged) == 0x000350, "Member 'UUMG_OriginalSoundTrack_C::OnPlayingSoundChanged' has a wrong offset!");

}

