#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InventoryItemList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_InventoryItemList.UMG_InventoryItemList_C.ExecuteUbergraph_UMG_InventoryItemList
// 0x0004 (0x0004 - 0x0000)
struct UMG_InventoryItemList_C_ExecuteUbergraph_UMG_InventoryItemList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InventoryItemList_C_ExecuteUbergraph_UMG_InventoryItemList) == 0x000004, "Wrong alignment on UMG_InventoryItemList_C_ExecuteUbergraph_UMG_InventoryItemList");
static_assert(sizeof(UMG_InventoryItemList_C_ExecuteUbergraph_UMG_InventoryItemList) == 0x000004, "Wrong size on UMG_InventoryItemList_C_ExecuteUbergraph_UMG_InventoryItemList");
static_assert(offsetof(UMG_InventoryItemList_C_ExecuteUbergraph_UMG_InventoryItemList, EntryPoint) == 0x000000, "Member 'UMG_InventoryItemList_C_ExecuteUbergraph_UMG_InventoryItemList::EntryPoint' has a wrong offset!");

// Function UMG_InventoryItemList.UMG_InventoryItemList_C.Refresh Inventorys
// 0x00B0 (0x00B0 - 0x0000)
struct UMG_InventoryItemList_C_Refresh_Inventorys final
{
public:
	int32                                         ColumnIndex;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RowIndex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_InventoryItem_C*                   CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBFieldModManager_BP_C*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCharacterSlotType                          CallFunc_GetSelectCharacterSlot_ReturnValue;       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_InventoryItem_C*                   CallFunc_Create_ReturnValue_1;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InventoryItemList_C_Refresh_Inventorys) == 0x000008, "Wrong alignment on UMG_InventoryItemList_C_Refresh_Inventorys");
static_assert(sizeof(UMG_InventoryItemList_C_Refresh_Inventorys) == 0x0000B0, "Wrong size on UMG_InventoryItemList_C_Refresh_Inventorys");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, ColumnIndex) == 0x000000, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::ColumnIndex' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, RowIndex) == 0x000004, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::RowIndex' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Create_ReturnValue) == 0x000018, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000020, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000028, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_GetSelectCharacterSlot_ReturnValue) == 0x000034, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_GetSelectCharacterSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, K2Node_MakeStruct_Margin) == 0x000038, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, K2Node_MakeStruct_Margin_1) == 0x000054, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_AddChild_ReturnValue) == 0x000068, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Add_IntInt_ReturnValue_2) == 0x000070, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Add_IntInt_ReturnValue_3) == 0x000074, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000078, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Add_IntInt_ReturnValue_4) == 0x00007C, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Create_ReturnValue_1) == 0x000080, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Array_Add_ReturnValue_1) == 0x000088, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Array_Get_Item) == 0x00008C, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x0000A0, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_Refresh_Inventorys, CallFunc_AddChild_ReturnValue_1) == 0x0000A8, "Member 'UMG_InventoryItemList_C_Refresh_Inventorys::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function UMG_InventoryItemList.UMG_InventoryItemList_C.ConstructRow
// 0x0018 (0x0018 - 0x0000)
struct UMG_InventoryItemList_C_ConstructRow final
{
public:
	class UHorizontalBox*                         CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InventoryItemList_C_ConstructRow) == 0x000008, "Wrong alignment on UMG_InventoryItemList_C_ConstructRow");
static_assert(sizeof(UMG_InventoryItemList_C_ConstructRow) == 0x000018, "Wrong size on UMG_InventoryItemList_C_ConstructRow");
static_assert(offsetof(UMG_InventoryItemList_C_ConstructRow, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'UMG_InventoryItemList_C_ConstructRow::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_ConstructRow, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000008, "Member 'UMG_InventoryItemList_C_ConstructRow::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_ConstructRow, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'UMG_InventoryItemList_C_ConstructRow::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_InventoryItemList.UMG_InventoryItemList_C.RefreshInventoryStatus
// 0x0020 (0x0020 - 0x0000)
struct UMG_InventoryItemList_C_RefreshInventoryStatus final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_InventoryItem_C*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InventoryItemList_C_RefreshInventoryStatus) == 0x000008, "Wrong alignment on UMG_InventoryItemList_C_RefreshInventoryStatus");
static_assert(sizeof(UMG_InventoryItemList_C_RefreshInventoryStatus) == 0x000020, "Wrong size on UMG_InventoryItemList_C_RefreshInventoryStatus");
static_assert(offsetof(UMG_InventoryItemList_C_RefreshInventoryStatus, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_InventoryItemList_C_RefreshInventoryStatus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_RefreshInventoryStatus, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_InventoryItemList_C_RefreshInventoryStatus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_RefreshInventoryStatus, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_InventoryItemList_C_RefreshInventoryStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_RefreshInventoryStatus, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'UMG_InventoryItemList_C_RefreshInventoryStatus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_RefreshInventoryStatus, CallFunc_Array_Get_Item) == 0x000010, "Member 'UMG_InventoryItemList_C_RefreshInventoryStatus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItemList_C_RefreshInventoryStatus, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'UMG_InventoryItemList_C_RefreshInventoryStatus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

