#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Progression_SubPage_Weapon

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.ExecuteUbergraph_UMG_Progression_SubPage_Weapon
// 0x0008 (0x0008 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_ExecuteUbergraph_UMG_Progression_SubPage_Weapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_ExecuteUbergraph_UMG_Progression_SubPage_Weapon) == 0x000004, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_ExecuteUbergraph_UMG_Progression_SubPage_Weapon");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_ExecuteUbergraph_UMG_Progression_SubPage_Weapon) == 0x000008, "Wrong size on UMG_Progression_SubPage_Weapon_C_ExecuteUbergraph_UMG_Progression_SubPage_Weapon");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_ExecuteUbergraph_UMG_Progression_SubPage_Weapon, EntryPoint) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_ExecuteUbergraph_UMG_Progression_SubPage_Weapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_ExecuteUbergraph_UMG_Progression_SubPage_Weapon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_Progression_SubPage_Weapon_C_ExecuteUbergraph_UMG_Progression_SubPage_Weapon::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_PreConstruct");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_PreConstruct) == 0x000001, "Wrong size on UMG_Progression_SubPage_Weapon_C_PreConstruct");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.InitWeaponList
// 0x0098 (0x0098 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_InitWeaponList final
{
public:
	class UUMG_ProgressionWeaponItem_C*           WeaponWidget;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBProgressionManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetWeaponIDArray_ReturnValue;             // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WeaponID, class UUMG_ProgressionWeaponItem_C* ClickedWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionWeaponItem_C*           CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_InitWeaponList) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_InitWeaponList");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_InitWeaponList) == 0x000098, "Wrong size on UMG_Progression_SubPage_Weapon_C_InitWeaponList");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, WeaponWidget) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::WeaponWidget' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_GetWeaponIDArray_ReturnValue) == 0x000018, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_GetWeaponIDArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_Array_Get_Item) == 0x00002C, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000034, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, Temp_int_Array_Index_Variable) == 0x000040, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_Array_Get_Item_1) == 0x000044, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_Create_ReturnValue) == 0x000068, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, K2Node_MakeStruct_Margin) == 0x000070, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000088, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_InitWeaponList, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'UMG_Progression_SubPage_Weapon_C_InitWeaponList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.RefreshWeaponName
// 0x0218 (0x0218 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_RefreshWeaponName final
{
public:
	struct FPBWeaponDefinitionRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0210)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_RefreshWeaponName) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_RefreshWeaponName");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_RefreshWeaponName) == 0x000218, "Wrong size on UMG_Progression_SubPage_Weapon_C_RefreshWeaponName");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshWeaponName, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshWeaponName::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshWeaponName, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000210, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshWeaponName::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.RefreshProgressionList
// 0x0098 (0x0098 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_RefreshProgressionList final
{
public:
	class UPBProgression*                         Progression;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUMG_ProgressionReward_C* Widget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMG_ProgressionReward_C*               CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBProgressionManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPBProgression*>                 CallFunc_GetWeaponProgressionArray_ReturnValue;    // 0x0078(0x0010)(ReferenceParm)
	class UPBProgression*                         CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_RefreshProgressionList");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList) == 0x000098, "Wrong size on UMG_Progression_SubPage_Weapon_C_RefreshProgressionList");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, Progression) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::Progression' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, K2Node_MakeStruct_Margin) == 0x000040, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, CallFunc_Create_ReturnValue) == 0x000050, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000060, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000070, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, CallFunc_GetWeaponProgressionArray_ReturnValue) == 0x000078, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::CallFunc_GetWeaponProgressionArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, CallFunc_Array_Get_Item) == 0x000088, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshProgressionList, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshProgressionList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.OnSelectedWeapon
// 0x0020 (0x0020 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon final
{
public:
	class FName                                   WeaponID_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionWeaponItem_C*           ClickedWidget;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon) == 0x000020, "Wrong size on UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon, WeaponID_0) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon::WeaponID_0' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon, ClickedWidget) == 0x000008, "Member 'UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon::ClickedWidget' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon, CallFunc_GetChildrenCount_ReturnValue) == 0x000014, "Member 'UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon, CallFunc_SelectInt_ReturnValue) == 0x00001C, "Member 'UMG_Progression_SubPage_Weapon_C_OnSelectedWeapon::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.OnRewardSwitch
// 0x0010 (0x0010 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_OnRewardSwitch final
{
public:
	class UUMG_ProgressionReward_C*               Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_OnRewardSwitch) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_OnRewardSwitch");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_OnRewardSwitch) == 0x000010, "Wrong size on UMG_Progression_SubPage_Weapon_C_OnRewardSwitch");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_OnRewardSwitch, Widget) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_OnRewardSwitch::Widget' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_OnRewardSwitch, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_Progression_SubPage_Weapon_C_OnRewardSwitch::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.NavigationToFirstReward
// 0x0020 (0x0020 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward) == 0x000020, "Wrong size on UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward, Navigation_0) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward::Navigation_0' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward, ReturnValue) == 0x000008, "Member 'UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000018, "Member 'UMG_Progression_SubPage_Weapon_C_NavigationToFirstReward::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.NavigationToSelectedWeapon
// 0x0010 (0x0010 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_NavigationToSelectedWeapon final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_NavigationToSelectedWeapon) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_NavigationToSelectedWeapon");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_NavigationToSelectedWeapon) == 0x000010, "Wrong size on UMG_Progression_SubPage_Weapon_C_NavigationToSelectedWeapon");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_NavigationToSelectedWeapon, Navigation_0) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_NavigationToSelectedWeapon::Navigation_0' has a wrong offset!");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_NavigationToSelectedWeapon, ReturnValue) == 0x000008, "Member 'UMG_Progression_SubPage_Weapon_C_NavigationToSelectedWeapon::ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.FocusOnFirstWeapon
// 0x0008 (0x0008 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_FocusOnFirstWeapon final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_FocusOnFirstWeapon) == 0x000008, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_FocusOnFirstWeapon");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_FocusOnFirstWeapon) == 0x000008, "Wrong size on UMG_Progression_SubPage_Weapon_C_FocusOnFirstWeapon");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_FocusOnFirstWeapon, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_FocusOnFirstWeapon::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.UnfocusCurrentWeapon
// 0x0001 (0x0001 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_UnfocusCurrentWeapon final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_UnfocusCurrentWeapon) == 0x000001, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_UnfocusCurrentWeapon");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_UnfocusCurrentWeapon) == 0x000001, "Wrong size on UMG_Progression_SubPage_Weapon_C_UnfocusCurrentWeapon");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_UnfocusCurrentWeapon, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_UnfocusCurrentWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_Progression_SubPage_Weapon.UMG_Progression_SubPage_Weapon_C.RefreshWeaponNewFlag
// 0x0001 (0x0001 - 0x0000)
struct UMG_Progression_SubPage_Weapon_C_RefreshWeaponNewFlag final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Progression_SubPage_Weapon_C_RefreshWeaponNewFlag) == 0x000001, "Wrong alignment on UMG_Progression_SubPage_Weapon_C_RefreshWeaponNewFlag");
static_assert(sizeof(UMG_Progression_SubPage_Weapon_C_RefreshWeaponNewFlag) == 0x000001, "Wrong size on UMG_Progression_SubPage_Weapon_C_RefreshWeaponNewFlag");
static_assert(offsetof(UMG_Progression_SubPage_Weapon_C_RefreshWeaponNewFlag, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_Progression_SubPage_Weapon_C_RefreshWeaponNewFlag::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

