#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CrossHair_PFG

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_CrossHair_PFG.UMG_CrossHair_PFG_C.ExecuteUbergraph_UMG_CrossHair_PFG
// 0x0078 (0x0078 - 0x0000)
struct UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNoAmmo;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG) == 0x000008, "Wrong alignment on UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG");
static_assert(sizeof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG) == 0x000078, "Wrong size on UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, EntryPoint) == 0x000000, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, K2Node_Event_MyGeometry) == 0x000008, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, K2Node_Event_InDeltaTime) == 0x000040, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000044, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, CallFunc_GetEndTime_ReturnValue) == 0x000048, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, K2Node_DynamicCast_AsMaterial_Interface) == 0x000050, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, CallFunc_GetStartTime_ReturnValue) == 0x00005C, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000060, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000068, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, CallFunc_MapRangeClamped_ReturnValue) == 0x00006C, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG, K2Node_Event_bNoAmmo) == 0x000070, "Member 'UMG_CrossHair_PFG_C_ExecuteUbergraph_UMG_CrossHair_PFG::K2Node_Event_bNoAmmo' has a wrong offset!");

// Function UMG_CrossHair_PFG.UMG_CrossHair_PFG_C.NoAmmo
// 0x0001 (0x0001 - 0x0000)
struct UMG_CrossHair_PFG_C_NoAmmo final
{
public:
	bool                                          bNoAmmo;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CrossHair_PFG_C_NoAmmo) == 0x000001, "Wrong alignment on UMG_CrossHair_PFG_C_NoAmmo");
static_assert(sizeof(UMG_CrossHair_PFG_C_NoAmmo) == 0x000001, "Wrong size on UMG_CrossHair_PFG_C_NoAmmo");
static_assert(offsetof(UMG_CrossHair_PFG_C_NoAmmo, bNoAmmo) == 0x000000, "Member 'UMG_CrossHair_PFG_C_NoAmmo::bNoAmmo' has a wrong offset!");

// Function UMG_CrossHair_PFG.UMG_CrossHair_PFG_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_CrossHair_PFG_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CrossHair_PFG_C_Tick) == 0x000004, "Wrong alignment on UMG_CrossHair_PFG_C_Tick");
static_assert(sizeof(UMG_CrossHair_PFG_C_Tick) == 0x00003C, "Wrong size on UMG_CrossHair_PFG_C_Tick");
static_assert(offsetof(UMG_CrossHair_PFG_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_CrossHair_PFG_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_CrossHair_PFG_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_CrossHair_PFG.UMG_CrossHair_PFG_C.ReloadPlay
// 0x0010 (0x0010 - 0x0000)
struct UMG_CrossHair_PFG_C_ReloadPlay final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Start;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CrossHair_PFG_C_ReloadPlay) == 0x000008, "Wrong alignment on UMG_CrossHair_PFG_C_ReloadPlay");
static_assert(sizeof(UMG_CrossHair_PFG_C_ReloadPlay) == 0x000010, "Wrong size on UMG_CrossHair_PFG_C_ReloadPlay");
static_assert(offsetof(UMG_CrossHair_PFG_C_ReloadPlay, StartTime) == 0x000000, "Member 'UMG_CrossHair_PFG_C_ReloadPlay::StartTime' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ReloadPlay, Start) == 0x000004, "Member 'UMG_CrossHair_PFG_C_ReloadPlay::Start' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_PFG_C_ReloadPlay, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_CrossHair_PFG_C_ReloadPlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

