#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NotificationBanner

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_NotificationBanner.UMG_NotificationBanner_C
// 0x0040 (0x02E8 - 0x02A8)
class UUMG_NotificationBanner_C final : public UPBNotificationBannerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_JoinIt;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_1;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_UnselectedMask;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        Text_Title;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Content;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUMG_NotificationBanner_C* Notification)> OnClickedEvent;                                    // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_NotificationBanner(int32 EntryPoint);
	void BndEvt__UMG_NotificationBanner_Button_JoinIt_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void K2_RefreshBannerInfo();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void RefreshInfo();
	void RefreshBannerStyle(bool bSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_NotificationBanner_C">();
	}
	static class UUMG_NotificationBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_NotificationBanner_C>();
	}
};
static_assert(alignof(UUMG_NotificationBanner_C) == 0x000008, "Wrong alignment on UUMG_NotificationBanner_C");
static_assert(sizeof(UUMG_NotificationBanner_C) == 0x0002E8, "Wrong size on UUMG_NotificationBanner_C");
static_assert(offsetof(UUMG_NotificationBanner_C, UberGraphFrame) == 0x0002A8, "Member 'UUMG_NotificationBanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_NotificationBanner_C, Button_JoinIt) == 0x0002B0, "Member 'UUMG_NotificationBanner_C::Button_JoinIt' has a wrong offset!");
static_assert(offsetof(UUMG_NotificationBanner_C, Image_BG_1) == 0x0002B8, "Member 'UUMG_NotificationBanner_C::Image_BG_1' has a wrong offset!");
static_assert(offsetof(UUMG_NotificationBanner_C, Image_UnselectedMask) == 0x0002C0, "Member 'UUMG_NotificationBanner_C::Image_UnselectedMask' has a wrong offset!");
static_assert(offsetof(UUMG_NotificationBanner_C, Text_Title) == 0x0002C8, "Member 'UUMG_NotificationBanner_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUMG_NotificationBanner_C, TextBlock_Content) == 0x0002D0, "Member 'UUMG_NotificationBanner_C::TextBlock_Content' has a wrong offset!");
static_assert(offsetof(UUMG_NotificationBanner_C, OnClickedEvent) == 0x0002D8, "Member 'UUMG_NotificationBanner_C::OnClickedEvent' has a wrong offset!");

}

