#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InventoryCompareItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_InventoryCompareItem.UMG_InventoryCompareItem_C.ExecuteUbergraph_UMG_InventoryCompareItem
// 0x00B8 (0x00B8 - 0x0000)
struct UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0060(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem) == 0x000008, "Wrong alignment on UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem");
static_assert(sizeof(UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem) == 0x0000B8, "Wrong size on UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem");
static_assert(offsetof(UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem, EntryPoint) == 0x000000, "Member 'UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem, K2Node_MakeStruct_SlateFontInfo_1) == 0x000060, "Member 'UMG_InventoryCompareItem_C_ExecuteUbergraph_UMG_InventoryCompareItem::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");

// Function UMG_InventoryCompareItem.UMG_InventoryCompareItem_C.RefreshData
// 0x0050 (0x0050 - 0x0000)
struct UMG_InventoryCompareItem_C_RefreshData final
{
public:
	float                                         EuqippingData;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TestingData;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Unit;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsReverse;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OnlyNumberDisplay;                                 // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberDigits;                                      // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InReverse;                                         // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InventoryCompareItem_C_RefreshData) == 0x000008, "Wrong alignment on UMG_InventoryCompareItem_C_RefreshData");
static_assert(sizeof(UMG_InventoryCompareItem_C_RefreshData) == 0x000050, "Wrong size on UMG_InventoryCompareItem_C_RefreshData");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, EuqippingData) == 0x000000, "Member 'UMG_InventoryCompareItem_C_RefreshData::EuqippingData' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, TestingData) == 0x000004, "Member 'UMG_InventoryCompareItem_C_RefreshData::TestingData' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, Unit) == 0x000008, "Member 'UMG_InventoryCompareItem_C_RefreshData::Unit' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, IsReverse) == 0x000020, "Member 'UMG_InventoryCompareItem_C_RefreshData::IsReverse' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, OnlyNumberDisplay) == 0x000021, "Member 'UMG_InventoryCompareItem_C_RefreshData::OnlyNumberDisplay' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, NumberDigits) == 0x000024, "Member 'UMG_InventoryCompareItem_C_RefreshData::NumberDigits' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, InReverse) == 0x000028, "Member 'UMG_InventoryCompareItem_C_RefreshData::InReverse' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, CallFunc_Conv_FloatToText_ReturnValue) == 0x000030, "Member 'UMG_InventoryCompareItem_C_RefreshData::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000048, "Member 'UMG_InventoryCompareItem_C_RefreshData::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, CallFunc_Less_FloatFloat_ReturnValue) == 0x000049, "Member 'UMG_InventoryCompareItem_C_RefreshData::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_RefreshData, CallFunc_SelectInt_ReturnValue) == 0x00004C, "Member 'UMG_InventoryCompareItem_C_RefreshData::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function UMG_InventoryCompareItem.UMG_InventoryCompareItem_C.SetCompareItemName
// 0x0018 (0x0018 - 0x0000)
struct UMG_InventoryCompareItem_C_SetCompareItemName final
{
public:
	class FText                                   InItemName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_InventoryCompareItem_C_SetCompareItemName) == 0x000008, "Wrong alignment on UMG_InventoryCompareItem_C_SetCompareItemName");
static_assert(sizeof(UMG_InventoryCompareItem_C_SetCompareItemName) == 0x000018, "Wrong size on UMG_InventoryCompareItem_C_SetCompareItemName");
static_assert(offsetof(UMG_InventoryCompareItem_C_SetCompareItemName, InItemName) == 0x000000, "Member 'UMG_InventoryCompareItem_C_SetCompareItemName::InItemName' has a wrong offset!");

// Function UMG_InventoryCompareItem.UMG_InventoryCompareItem_C.Refresh Ammo Data
// 0x0070 (0x0070 - 0x0000)
struct UMG_InventoryCompareItem_C_Refresh_Ammo_Data final
{
public:
	int32                                         InEquippingClipAmmo;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InEquippingBackUpAmmo;                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTestingClipAmmo;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTestingBackUpAmmo;                               // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data) == 0x000008, "Wrong alignment on UMG_InventoryCompareItem_C_Refresh_Ammo_Data");
static_assert(sizeof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data) == 0x000070, "Wrong size on UMG_InventoryCompareItem_C_Refresh_Ammo_Data");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, InEquippingClipAmmo) == 0x000000, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::InEquippingClipAmmo' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, InEquippingBackUpAmmo) == 0x000004, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::InEquippingBackUpAmmo' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, InTestingClipAmmo) == 0x000008, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::InTestingClipAmmo' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, InTestingBackUpAmmo) == 0x00000C, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::InTestingBackUpAmmo' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, CallFunc_SelectInt_ReturnValue) == 0x000024, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000028, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InventoryCompareItem_C_Refresh_Ammo_Data, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'UMG_InventoryCompareItem_C_Refresh_Ammo_Data::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

