#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SettingBase_2

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SettingBase_2.UMG_SettingBase_2_C
// 0x0058 (0x02C8 - 0x0270)
class UUMG_SettingBase_2_C final : public UPBSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBAdvancedSwitcher*                    SettingSwitcher;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentPageIndex;                                  // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bShow)>    OnShowControllerButtonSettingEvent;                // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnTryBackEvent;                                    // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPBUserWidget*                          FocusWidget;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Activated)> OnGraphicsSettingsActivatedChanged;                // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPBSettingOptionData*                   SettingOptionData;                                 // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SettingBase_2(int32 EntryPoint);
	void BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature(int32 CurrentSelectIndex, int32 LastSelectIndex);
	void K2_SwitchPageTab(bool bToLeft);
	void K2_ShowResetConfirmPage();
	void K2_ShowSaveConfirmPage();
	void K2_TryBack();
	void OnInitialized();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void ShowSaveConfirmPage();
	void IsContainsKey(class FName InputActionName, const struct FKey& InKey, bool* bContains);
	void ShowResetConfirmPage();
	void HandleResetConfirm(int32 Index_0);
	void ResetOption();
	void BindSubPageBtnClick();
	void BackPreviousEvent(bool bQuitgame);
	void OnShowButtonSetting(bool bShow);
	void InitializeSwitcher();
	void RestoreFocus();
	void CallNotifyTryBack();
	void CallNotifyShowReset();
	void CallNotifyTrySave();
	void InitSettingOption();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SettingBase_2_C">();
	}
	static class UUMG_SettingBase_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SettingBase_2_C>();
	}
};
static_assert(alignof(UUMG_SettingBase_2_C) == 0x000008, "Wrong alignment on UUMG_SettingBase_2_C");
static_assert(sizeof(UUMG_SettingBase_2_C) == 0x0002C8, "Wrong size on UUMG_SettingBase_2_C");
static_assert(offsetof(UUMG_SettingBase_2_C, UberGraphFrame) == 0x000270, "Member 'UUMG_SettingBase_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_2_C, SettingSwitcher) == 0x000278, "Member 'UUMG_SettingBase_2_C::SettingSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_2_C, CurrentPageIndex) == 0x000280, "Member 'UUMG_SettingBase_2_C::CurrentPageIndex' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_2_C, OnShowControllerButtonSettingEvent) == 0x000288, "Member 'UUMG_SettingBase_2_C::OnShowControllerButtonSettingEvent' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_2_C, OnTryBackEvent) == 0x000298, "Member 'UUMG_SettingBase_2_C::OnTryBackEvent' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_2_C, FocusWidget) == 0x0002A8, "Member 'UUMG_SettingBase_2_C::FocusWidget' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_2_C, OnGraphicsSettingsActivatedChanged) == 0x0002B0, "Member 'UUMG_SettingBase_2_C::OnGraphicsSettingsActivatedChanged' has a wrong offset!");
static_assert(offsetof(UUMG_SettingBase_2_C, SettingOptionData) == 0x0002C0, "Member 'UUMG_SettingBase_2_C::SettingOptionData' has a wrong offset!");

}

