#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CrossHair_PFG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_Launcher_CrossHair_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CrossHair_PFG.UMG_CrossHair_PFG_C
// 0x0090 (0x0358 - 0x02C8)
class UUMG_CrossHair_PFG_C final : public UUMG_Launcher_CrossHair_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_CrossHair_PFG_C;                // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ReloadTimer;                                       // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reload;                                            // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_18;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_84;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NoAmmo;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           InprogressBar;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 lockProLB;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockProLT;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 lockProRB;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 lockProRT;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_279;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Ver_NoAmmo;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Launcher_LauncherLandDistance_C*   WBP_Launcher_LauncherLandDistance;                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CircleMat;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_CrossHair_PFG(int32 EntryPoint);
	void WidgetAnimationEvt_Reload_K2Node_WidgetAnimationEvent_0();
	void ReloadLauncher();
	void NoAmmo(bool bNoAmmo);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void ReloadPlay(float StartTime, bool Start);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CrossHair_PFG_C">();
	}
	static class UUMG_CrossHair_PFG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CrossHair_PFG_C>();
	}
};
static_assert(alignof(UUMG_CrossHair_PFG_C) == 0x000008, "Wrong alignment on UUMG_CrossHair_PFG_C");
static_assert(sizeof(UUMG_CrossHair_PFG_C) == 0x000358, "Wrong size on UUMG_CrossHair_PFG_C");
static_assert(offsetof(UUMG_CrossHair_PFG_C, UberGraphFrame_UMG_CrossHair_PFG_C) == 0x0002C8, "Member 'UUMG_CrossHair_PFG_C::UberGraphFrame_UMG_CrossHair_PFG_C' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, ReloadTimer) == 0x0002D0, "Member 'UUMG_CrossHair_PFG_C::ReloadTimer' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, Reload) == 0x0002D8, "Member 'UUMG_CrossHair_PFG_C::Reload' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, CanvasPanel_0) == 0x0002E0, "Member 'UUMG_CrossHair_PFG_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, Image_0) == 0x0002E8, "Member 'UUMG_CrossHair_PFG_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, Image_9) == 0x0002F0, "Member 'UUMG_CrossHair_PFG_C::Image_9' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, Image_18) == 0x0002F8, "Member 'UUMG_CrossHair_PFG_C::Image_18' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, Image_84) == 0x000300, "Member 'UUMG_CrossHair_PFG_C::Image_84' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, Image_NoAmmo) == 0x000308, "Member 'UUMG_CrossHair_PFG_C::Image_NoAmmo' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, InprogressBar) == 0x000310, "Member 'UUMG_CrossHair_PFG_C::InprogressBar' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, lockProLB) == 0x000318, "Member 'UUMG_CrossHair_PFG_C::lockProLB' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, LockProLT) == 0x000320, "Member 'UUMG_CrossHair_PFG_C::LockProLT' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, lockProRB) == 0x000328, "Member 'UUMG_CrossHair_PFG_C::lockProRB' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, lockProRT) == 0x000330, "Member 'UUMG_CrossHair_PFG_C::lockProRT' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, ScaleBox_279) == 0x000338, "Member 'UUMG_CrossHair_PFG_C::ScaleBox_279' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, Ver_NoAmmo) == 0x000340, "Member 'UUMG_CrossHair_PFG_C::Ver_NoAmmo' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, WBP_Launcher_LauncherLandDistance) == 0x000348, "Member 'UUMG_CrossHair_PFG_C::WBP_Launcher_LauncherLandDistance' has a wrong offset!");
static_assert(offsetof(UUMG_CrossHair_PFG_C, CircleMat) == 0x000350, "Member 'UUMG_CrossHair_PFG_C::CircleMat' has a wrong offset!");

}

