#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_RedemptionCodeTextBlock

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_RedemptionCodeTextBlock.UMG_RedemptionCodeTextBlock_C
// 0x0038 (0x0298 - 0x0260)
class UUMG_RedemptionCodeTextBlock_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BGHover;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGNormal;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          EditableTextCode;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool IsUsableCode)> OnCodeUsebleChanged;                               // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsUsableCode;                                      // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_RedemptionCodeTextBlock(int32 EntryPoint);
	void BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__UMG_RedemptionCodeTextBlock_EditableTextCode_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void GetText(class FText* OutText);
	void SetHoverStyle();
	void SetNormalStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_RedemptionCodeTextBlock_C">();
	}
	static class UUMG_RedemptionCodeTextBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_RedemptionCodeTextBlock_C>();
	}
};
static_assert(alignof(UUMG_RedemptionCodeTextBlock_C) == 0x000008, "Wrong alignment on UUMG_RedemptionCodeTextBlock_C");
static_assert(sizeof(UUMG_RedemptionCodeTextBlock_C) == 0x000298, "Wrong size on UUMG_RedemptionCodeTextBlock_C");
static_assert(offsetof(UUMG_RedemptionCodeTextBlock_C, UberGraphFrame) == 0x000260, "Member 'UUMG_RedemptionCodeTextBlock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeTextBlock_C, BGHover) == 0x000268, "Member 'UUMG_RedemptionCodeTextBlock_C::BGHover' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeTextBlock_C, BGNormal) == 0x000270, "Member 'UUMG_RedemptionCodeTextBlock_C::BGNormal' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeTextBlock_C, EditableTextCode) == 0x000278, "Member 'UUMG_RedemptionCodeTextBlock_C::EditableTextCode' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeTextBlock_C, OnCodeUsebleChanged) == 0x000280, "Member 'UUMG_RedemptionCodeTextBlock_C::OnCodeUsebleChanged' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeTextBlock_C, IsUsableCode) == 0x000290, "Member 'UUMG_RedemptionCodeTextBlock_C::IsUsableCode' has a wrong offset!");

}

