#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TeamPlayerRank

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_TeamPlayerRank.UMG_TeamPlayerRank_C
// 0x0040 (0x02B8 - 0x0278)
class UUMG_TeamPlayerRank_C final : public UPBPlayerListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           PlayerList;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PlayerInfo_InGame_C*               UMG_PlayerState_InGame_0;                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PlayerInfo_InGame_C*               UMG_PlayerState_InGame_1;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PlayerInfo_InGame_C*               UMG_PlayerState_InGame_2;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PlayerInfo_InGame_C*               UMG_PlayerState_InGame_3;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PlayerInfo_InGame_C*               UMG_PlayerState_InGame_4;                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Array_Index;                                       // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_TeamPlayerRank(int32 EntryPoint);
	void K2_RefreshPlayerList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_TeamPlayerRank_C">();
	}
	static class UUMG_TeamPlayerRank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_TeamPlayerRank_C>();
	}
};
static_assert(alignof(UUMG_TeamPlayerRank_C) == 0x000008, "Wrong alignment on UUMG_TeamPlayerRank_C");
static_assert(sizeof(UUMG_TeamPlayerRank_C) == 0x0002B8, "Wrong size on UUMG_TeamPlayerRank_C");
static_assert(offsetof(UUMG_TeamPlayerRank_C, UberGraphFrame) == 0x000278, "Member 'UUMG_TeamPlayerRank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_TeamPlayerRank_C, PlayerList) == 0x000280, "Member 'UUMG_TeamPlayerRank_C::PlayerList' has a wrong offset!");
static_assert(offsetof(UUMG_TeamPlayerRank_C, UMG_PlayerState_InGame_0) == 0x000288, "Member 'UUMG_TeamPlayerRank_C::UMG_PlayerState_InGame_0' has a wrong offset!");
static_assert(offsetof(UUMG_TeamPlayerRank_C, UMG_PlayerState_InGame_1) == 0x000290, "Member 'UUMG_TeamPlayerRank_C::UMG_PlayerState_InGame_1' has a wrong offset!");
static_assert(offsetof(UUMG_TeamPlayerRank_C, UMG_PlayerState_InGame_2) == 0x000298, "Member 'UUMG_TeamPlayerRank_C::UMG_PlayerState_InGame_2' has a wrong offset!");
static_assert(offsetof(UUMG_TeamPlayerRank_C, UMG_PlayerState_InGame_3) == 0x0002A0, "Member 'UUMG_TeamPlayerRank_C::UMG_PlayerState_InGame_3' has a wrong offset!");
static_assert(offsetof(UUMG_TeamPlayerRank_C, UMG_PlayerState_InGame_4) == 0x0002A8, "Member 'UUMG_TeamPlayerRank_C::UMG_PlayerState_InGame_4' has a wrong offset!");
static_assert(offsetof(UUMG_TeamPlayerRank_C, Array_Index) == 0x0002B0, "Member 'UUMG_TeamPlayerRank_C::Array_Index' has a wrong offset!");

}

