#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SettingCard

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SettingCard.UMG_SettingCard_C
// 0x0030 (0x0368 - 0x0338)
class UUMG_SettingCard_C final : public UPBPageButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_105;                                        // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_253;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_356;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Focus;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Setting;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SettingCard(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply On_Border_Setting_MouseButtonUp_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply On_Border_Setting_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SettingCard_C">();
	}
	static class UUMG_SettingCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SettingCard_C>();
	}
};
static_assert(alignof(UUMG_SettingCard_C) == 0x000008, "Wrong alignment on UUMG_SettingCard_C");
static_assert(sizeof(UUMG_SettingCard_C) == 0x000368, "Wrong size on UUMG_SettingCard_C");
static_assert(offsetof(UUMG_SettingCard_C, UberGraphFrame) == 0x000338, "Member 'UUMG_SettingCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SettingCard_C, Border_105) == 0x000340, "Member 'UUMG_SettingCard_C::Border_105' has a wrong offset!");
static_assert(offsetof(UUMG_SettingCard_C, Image_253) == 0x000348, "Member 'UUMG_SettingCard_C::Image_253' has a wrong offset!");
static_assert(offsetof(UUMG_SettingCard_C, Image_356) == 0x000350, "Member 'UUMG_SettingCard_C::Image_356' has a wrong offset!");
static_assert(offsetof(UUMG_SettingCard_C, Image_Focus) == 0x000358, "Member 'UUMG_SettingCard_C::Image_Focus' has a wrong offset!");
static_assert(offsetof(UUMG_SettingCard_C, Image_Setting) == 0x000360, "Member 'UUMG_SettingCard_C::Image_Setting' has a wrong offset!");

}

