#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TeamScore

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_TeamScore.UMG_TeamScore_C
// 0x0028 (0x02D8 - 0x02B0)
class UUMG_TeamScore_C final : public UPBTeamInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 TeamBG;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TeamIcon;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TeamName;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TeamScore;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_TeamScore(int32 EntryPoint);
	void K2_SetTeamScore();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_TeamScore_C">();
	}
	static class UUMG_TeamScore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_TeamScore_C>();
	}
};
static_assert(alignof(UUMG_TeamScore_C) == 0x000008, "Wrong alignment on UUMG_TeamScore_C");
static_assert(sizeof(UUMG_TeamScore_C) == 0x0002D8, "Wrong size on UUMG_TeamScore_C");
static_assert(offsetof(UUMG_TeamScore_C, UberGraphFrame) == 0x0002B0, "Member 'UUMG_TeamScore_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_TeamScore_C, TeamBG) == 0x0002B8, "Member 'UUMG_TeamScore_C::TeamBG' has a wrong offset!");
static_assert(offsetof(UUMG_TeamScore_C, TeamIcon) == 0x0002C0, "Member 'UUMG_TeamScore_C::TeamIcon' has a wrong offset!");
static_assert(offsetof(UUMG_TeamScore_C, TeamName) == 0x0002C8, "Member 'UUMG_TeamScore_C::TeamName' has a wrong offset!");
static_assert(offsetof(UUMG_TeamScore_C, TeamScore) == 0x0002D0, "Member 'UUMG_TeamScore_C::TeamScore' has a wrong offset!");

}

