#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InventoryItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_InventoryItem.UMG_InventoryItem_C.ExecuteUbergraph_UMG_InventoryItem
// 0x0030 (0x0030 - 0x0000)
struct UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0008(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem) == 0x000008, "Wrong alignment on UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem");
static_assert(sizeof(UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem) == 0x000030, "Wrong size on UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem");
static_assert(offsetof(UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem, EntryPoint) == 0x000000, "Member 'UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem, Temp_bool_Variable) == 0x000004, "Member 'UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000005, "Member 'UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem, K2Node_Select_Default) == 0x000008, "Member 'UMG_InventoryItem_C_ExecuteUbergraph_UMG_InventoryItem::K2Node_Select_Default' has a wrong offset!");

}

