#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PropertyLevel

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_PropertyLevel.UMG_PropertyLevel_C.ExecuteUbergraph_UMG_PropertyLevel
// 0x0020 (0x0020 - 0x0000)
struct UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0008(0x0018)()
};
static_assert(alignof(UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel) == 0x000008, "Wrong alignment on UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel");
static_assert(sizeof(UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel) == 0x000020, "Wrong size on UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel");
static_assert(offsetof(UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel, EntryPoint) == 0x000000, "Member 'UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel, CallFunc_TextToUpper_ReturnValue) == 0x000008, "Member 'UMG_PropertyLevel_C_ExecuteUbergraph_UMG_PropertyLevel::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function UMG_PropertyLevel.UMG_PropertyLevel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_PropertyLevel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PropertyLevel_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_PropertyLevel_C_PreConstruct");
static_assert(sizeof(UMG_PropertyLevel_C_PreConstruct) == 0x000001, "Wrong size on UMG_PropertyLevel_C_PreConstruct");
static_assert(offsetof(UMG_PropertyLevel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_PropertyLevel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_PropertyLevel.UMG_PropertyLevel_C.SetLevelInfo
// 0x0002 (0x0002 - 0x0000)
struct UMG_PropertyLevel_C_SetLevelInfo final
{
public:
	EPBCharacterPropertyLevel                     InLevel;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PropertyLevel_C_SetLevelInfo) == 0x000001, "Wrong alignment on UMG_PropertyLevel_C_SetLevelInfo");
static_assert(sizeof(UMG_PropertyLevel_C_SetLevelInfo) == 0x000002, "Wrong size on UMG_PropertyLevel_C_SetLevelInfo");
static_assert(offsetof(UMG_PropertyLevel_C_SetLevelInfo, InLevel) == 0x000000, "Member 'UMG_PropertyLevel_C_SetLevelInfo::InLevel' has a wrong offset!");
static_assert(offsetof(UMG_PropertyLevel_C_SetLevelInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UMG_PropertyLevel_C_SetLevelInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

