#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DetailedCareerData

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_DetailedCareerData.UMG_DetailedCareerData_C.ExecuteUbergraph_UMG_DetailedCareerData
// 0x0004 (0x0004 - 0x0000)
struct UMG_DetailedCareerData_C_ExecuteUbergraph_UMG_DetailedCareerData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_DetailedCareerData_C_ExecuteUbergraph_UMG_DetailedCareerData) == 0x000004, "Wrong alignment on UMG_DetailedCareerData_C_ExecuteUbergraph_UMG_DetailedCareerData");
static_assert(sizeof(UMG_DetailedCareerData_C_ExecuteUbergraph_UMG_DetailedCareerData) == 0x000004, "Wrong size on UMG_DetailedCareerData_C_ExecuteUbergraph_UMG_DetailedCareerData");
static_assert(offsetof(UMG_DetailedCareerData_C_ExecuteUbergraph_UMG_DetailedCareerData, EntryPoint) == 0x000000, "Member 'UMG_DetailedCareerData_C_ExecuteUbergraph_UMG_DetailedCareerData::EntryPoint' has a wrong offset!");

// Function UMG_DetailedCareerData.UMG_DetailedCareerData_C.SetValue
// 0x0030 (0x0030 - 0x0000)
struct UMG_DetailedCareerData_C_SetValue final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InText;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_DetailedCareerData_C_SetValue) == 0x000008, "Wrong alignment on UMG_DetailedCareerData_C_SetValue");
static_assert(sizeof(UMG_DetailedCareerData_C_SetValue) == 0x000030, "Wrong size on UMG_DetailedCareerData_C_SetValue");
static_assert(offsetof(UMG_DetailedCareerData_C_SetValue, InTitle) == 0x000000, "Member 'UMG_DetailedCareerData_C_SetValue::InTitle' has a wrong offset!");
static_assert(offsetof(UMG_DetailedCareerData_C_SetValue, InText) == 0x000018, "Member 'UMG_DetailedCareerData_C_SetValue::InText' has a wrong offset!");

}

