#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CareerCrew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CareerCrew.UMG_CareerCrew_C
// 0x0050 (0x02B0 - 0x0260)
class UUMG_CareerCrew_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_ProfileCharacterInfo_C*            UMG_ProfileCrewInfo;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionOperatorCard_C*         UMG_ProgressionOperatorCard;                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionOperatorCard_C*         UMG_ProgressionOperatorCard_1;                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionOperatorCard_C*         UMG_ProgressionOperatorCard_2;                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionOperatorCard_C*         UMG_ProgressionOperatorCard_3;                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionOperatorCard_C*         UMG_ProgressionOperatorCard_4;                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionOperatorCard_C*         UMG_ProgressionOperatorCard_5;                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Character;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionOperatorCard_C*         SelectedCharacter;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_CareerCrew(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RefreshInfo();
	void InitCharacterList();
	void OnSelectedCharacter(class UUMG_ProgressionOperatorCard_C* Widget);
	void InitFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CareerCrew_C">();
	}
	static class UUMG_CareerCrew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CareerCrew_C>();
	}
};
static_assert(alignof(UUMG_CareerCrew_C) == 0x000008, "Wrong alignment on UUMG_CareerCrew_C");
static_assert(sizeof(UUMG_CareerCrew_C) == 0x0002B0, "Wrong size on UUMG_CareerCrew_C");
static_assert(offsetof(UUMG_CareerCrew_C, UberGraphFrame) == 0x000260, "Member 'UUMG_CareerCrew_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_CareerCrew_C, UMG_ProfileCrewInfo) == 0x000268, "Member 'UUMG_CareerCrew_C::UMG_ProfileCrewInfo' has a wrong offset!");
static_assert(offsetof(UUMG_CareerCrew_C, UMG_ProgressionOperatorCard) == 0x000270, "Member 'UUMG_CareerCrew_C::UMG_ProgressionOperatorCard' has a wrong offset!");
static_assert(offsetof(UUMG_CareerCrew_C, UMG_ProgressionOperatorCard_1) == 0x000278, "Member 'UUMG_CareerCrew_C::UMG_ProgressionOperatorCard_1' has a wrong offset!");
static_assert(offsetof(UUMG_CareerCrew_C, UMG_ProgressionOperatorCard_2) == 0x000280, "Member 'UUMG_CareerCrew_C::UMG_ProgressionOperatorCard_2' has a wrong offset!");
static_assert(offsetof(UUMG_CareerCrew_C, UMG_ProgressionOperatorCard_3) == 0x000288, "Member 'UUMG_CareerCrew_C::UMG_ProgressionOperatorCard_3' has a wrong offset!");
static_assert(offsetof(UUMG_CareerCrew_C, UMG_ProgressionOperatorCard_4) == 0x000290, "Member 'UUMG_CareerCrew_C::UMG_ProgressionOperatorCard_4' has a wrong offset!");
static_assert(offsetof(UUMG_CareerCrew_C, UMG_ProgressionOperatorCard_5) == 0x000298, "Member 'UUMG_CareerCrew_C::UMG_ProgressionOperatorCard_5' has a wrong offset!");
static_assert(offsetof(UUMG_CareerCrew_C, WrapBox_Character) == 0x0002A0, "Member 'UUMG_CareerCrew_C::WrapBox_Character' has a wrong offset!");
static_assert(offsetof(UUMG_CareerCrew_C, SelectedCharacter) == 0x0002A8, "Member 'UUMG_CareerCrew_C::SelectedCharacter' has a wrong offset!");

}

