#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Medal_Big

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_Medal_Big.UMG_Medal_Big_C.RefreshInfo
// 0x0060 (0x0060 - 0x0000)
struct UMG_Medal_Big_C_RefreshInfo final
{
public:
	struct FPBMedalDetailsDataTableRowBase        InMedalDetail;                                     // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InCount;                                           // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
};
static_assert(alignof(UMG_Medal_Big_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_Medal_Big_C_RefreshInfo");
static_assert(sizeof(UMG_Medal_Big_C_RefreshInfo) == 0x000060, "Wrong size on UMG_Medal_Big_C_RefreshInfo");
static_assert(offsetof(UMG_Medal_Big_C_RefreshInfo, InMedalDetail) == 0x000000, "Member 'UMG_Medal_Big_C_RefreshInfo::InMedalDetail' has a wrong offset!");
static_assert(offsetof(UMG_Medal_Big_C_RefreshInfo, InCount) == 0x000040, "Member 'UMG_Medal_Big_C_RefreshInfo::InCount' has a wrong offset!");
static_assert(offsetof(UMG_Medal_Big_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'UMG_Medal_Big_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

