#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ProgressionReward

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ProgressionReward.UMG_ProgressionReward_C
// 0x00A8 (0x0358 - 0x02B0)
class UUMG_ProgressionReward_C final : public UPBProgressionRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Active;                                            // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Master;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Btn;                                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ChallengeTextBlock;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ChallengeTextBlock_Master;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentProgressText;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RewardItemContainer;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusImage;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalProgressText;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Art_NewLabel_C*                UMG_STD_Art_NewLabel;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPBProgressionRewardItemStatus                In_Status;                                         // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UUMG_ProgressionReward_C* Widget)> SwitchRewardEvent;                                 // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUMG_ProgressionRewardItem_C*           RewardItem;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               RewardItemBox;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMarkReadNewItemEvent;                            // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_ProgressionReward(int32 EntryPoint);
	void BndEvt__UMG_ProgressionReward_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ProgressionReward_Btn_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void K2_UpdateReward();
	void PreConstruct(bool IsDesignTime);
	void ActiveWidget();
	void InactiveWidget();
	void SelectWidget();
	void UnselectWidget();
	void UpdateMasterStyle();
	void MarkRead();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ProgressionReward_C">();
	}
	static class UUMG_ProgressionReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ProgressionReward_C>();
	}
};
static_assert(alignof(UUMG_ProgressionReward_C) == 0x000008, "Wrong alignment on UUMG_ProgressionReward_C");
static_assert(sizeof(UUMG_ProgressionReward_C) == 0x000358, "Wrong size on UUMG_ProgressionReward_C");
static_assert(offsetof(UUMG_ProgressionReward_C, UberGraphFrame) == 0x0002B0, "Member 'UUMG_ProgressionReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, Active) == 0x0002B8, "Member 'UUMG_ProgressionReward_C::Active' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, BG) == 0x0002C0, "Member 'UUMG_ProgressionReward_C::BG' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, BG_Master) == 0x0002C8, "Member 'UUMG_ProgressionReward_C::BG_Master' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, Btn) == 0x0002D0, "Member 'UUMG_ProgressionReward_C::Btn' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, ChallengeTextBlock) == 0x0002D8, "Member 'UUMG_ProgressionReward_C::ChallengeTextBlock' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, ChallengeTextBlock_Master) == 0x0002E0, "Member 'UUMG_ProgressionReward_C::ChallengeTextBlock_Master' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, CurrentProgressText) == 0x0002E8, "Member 'UUMG_ProgressionReward_C::CurrentProgressText' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, ProgressBar) == 0x0002F0, "Member 'UUMG_ProgressionReward_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, RewardItemContainer) == 0x0002F8, "Member 'UUMG_ProgressionReward_C::RewardItemContainer' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, StatusImage) == 0x000300, "Member 'UUMG_ProgressionReward_C::StatusImage' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, TotalProgressText) == 0x000308, "Member 'UUMG_ProgressionReward_C::TotalProgressText' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, UMG_STD_Art_NewLabel) == 0x000310, "Member 'UUMG_ProgressionReward_C::UMG_STD_Art_NewLabel' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, In_Status) == 0x000318, "Member 'UUMG_ProgressionReward_C::In_Status' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, SwitchRewardEvent) == 0x000320, "Member 'UUMG_ProgressionReward_C::SwitchRewardEvent' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, RewardItem) == 0x000330, "Member 'UUMG_ProgressionReward_C::RewardItem' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, RewardItemBox) == 0x000338, "Member 'UUMG_ProgressionReward_C::RewardItemBox' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, IsSelected) == 0x000340, "Member 'UUMG_ProgressionReward_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionReward_C, OnMarkReadNewItemEvent) == 0x000348, "Member 'UUMG_ProgressionReward_C::OnMarkReadNewItemEvent' has a wrong offset!");

}

