#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameUI_HitTargetFeedbackFork

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C
// 0x0078 (0x02D8 - 0x0260)
class UUMG_InGameUI_HitTargetFeedbackFork_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SpawnKillLock_Tom;                                 // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpawnKillLock;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimKillColorTrans;                                // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimHitFeedback_Armor;                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimHitFeedback;                                   // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 HitArmorImage;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HitFeedBack;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMeshComponent*                         Sight1PMesh;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      CurrentPawn;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentDamage;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               FOCKMID;                                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     FockTextures;                                      // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UObject*                                Victim_Object;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork(int32 EntryPoint);
	void OnClientInstigatedAnyDamage_Event_0(const struct FPBEventAttackDetailInfo& AttachInfo);
	void OnInitialized();
	void HitArmot();
	void KillEnemy();
	void HitEnemy();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E(class UGESAsyncAction_ListenForGameplayEvent* ProxyObject, const struct FGameplayTag& ActualEvent);
	void OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00(class UGESAsyncAction_ListenForGameplayEvent* ProxyObject, const struct FGameplayTag& ActualEvent);
	void FindSightMesh();
	void UpdateLocation(const struct FGeometry& Geometry);
	void HitTargetHandle(bool KillShot, bool headshot, bool ArmorShot, float Damage);
	void ClientKilltagertHandle(const struct FPBEventAttackDetailInfo& AttackInfo);
	void ClientKillSound();
	void Hit_Target_Handle(const struct FPBEventAttackDetailInfo& AttackInfo);
	void ArmorDestoryHandle();
	void UpdateHitDamageTemp(float InDamage);
	void UpdateHitForkMaterialSize();
	void StopFeedBackAnimation();
	void SetTexByDamage(float InDamage);
	void PlayHitEnemyAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_InGameUI_HitTargetFeedbackFork_C">();
	}
	static class UUMG_InGameUI_HitTargetFeedbackFork_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_InGameUI_HitTargetFeedbackFork_C>();
	}
};
static_assert(alignof(UUMG_InGameUI_HitTargetFeedbackFork_C) == 0x000008, "Wrong alignment on UUMG_InGameUI_HitTargetFeedbackFork_C");
static_assert(sizeof(UUMG_InGameUI_HitTargetFeedbackFork_C) == 0x0002D8, "Wrong size on UUMG_InGameUI_HitTargetFeedbackFork_C");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, UberGraphFrame) == 0x000260, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, SpawnKillLock_Tom) == 0x000268, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::SpawnKillLock_Tom' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, SpawnKillLock) == 0x000270, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::SpawnKillLock' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, AnimKillColorTrans) == 0x000278, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::AnimKillColorTrans' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, AnimHitFeedback_Armor) == 0x000280, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::AnimHitFeedback_Armor' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, AnimHitFeedback) == 0x000288, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::AnimHitFeedback' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, HitArmorImage) == 0x000290, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::HitArmorImage' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, HitFeedBack) == 0x000298, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::HitFeedBack' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, Sight1PMesh) == 0x0002A0, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::Sight1PMesh' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, CurrentPawn) == 0x0002A8, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::CurrentPawn' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, CurrentDamage) == 0x0002B0, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::CurrentDamage' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, FOCKMID) == 0x0002B8, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::FOCKMID' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, FockTextures) == 0x0002C0, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::FockTextures' has a wrong offset!");
static_assert(offsetof(UUMG_InGameUI_HitTargetFeedbackFork_C, Victim_Object) == 0x0002D0, "Member 'UUMG_InGameUI_HitTargetFeedbackFork_C::Victim_Object' has a wrong offset!");

}

