#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_OverBoostHint

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_HelmetHUD_OverBoostHint.UMG_HelmetHUD_OverBoostHint_C
// 0x0030 (0x0300 - 0x02D0)
class UUMG_HelmetHUD_OverBoostHint_C final : public UPBHelmetHUD_OverBoost
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_OverBoost;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsActivated;                                       // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCoolDown;                                        // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x2];                                      // 0x02EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TotalActivateDuration;                             // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentActivateTime;                               // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalCoolDownDuration;                             // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentCoolDownTime;                               // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void K2_RefreshOverBoostActivateInfo(const float InActiveDuration);
	void K2_RefreshCoolDownInfo(const float InCoolDownDuration);
	void RefreshActivateInfo(float InActiveDuration);
	void RefreshCoolDownInfo(float InCoolDownDuration);
	void ActivateTick(float InDeltaTime);
	void CoolDownTick(float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_HelmetHUD_OverBoostHint_C">();
	}
	static class UUMG_HelmetHUD_OverBoostHint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_HelmetHUD_OverBoostHint_C>();
	}
};
static_assert(alignof(UUMG_HelmetHUD_OverBoostHint_C) == 0x000008, "Wrong alignment on UUMG_HelmetHUD_OverBoostHint_C");
static_assert(sizeof(UUMG_HelmetHUD_OverBoostHint_C) == 0x000300, "Wrong size on UUMG_HelmetHUD_OverBoostHint_C");
static_assert(offsetof(UUMG_HelmetHUD_OverBoostHint_C, UberGraphFrame) == 0x0002D0, "Member 'UUMG_HelmetHUD_OverBoostHint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_OverBoostHint_C, Image_BG) == 0x0002D8, "Member 'UUMG_HelmetHUD_OverBoostHint_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_OverBoostHint_C, ProgressBar_OverBoost) == 0x0002E0, "Member 'UUMG_HelmetHUD_OverBoostHint_C::ProgressBar_OverBoost' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_OverBoostHint_C, IsActivated) == 0x0002E8, "Member 'UUMG_HelmetHUD_OverBoostHint_C::IsActivated' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_OverBoostHint_C, IsCoolDown) == 0x0002E9, "Member 'UUMG_HelmetHUD_OverBoostHint_C::IsCoolDown' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_OverBoostHint_C, TotalActivateDuration) == 0x0002EC, "Member 'UUMG_HelmetHUD_OverBoostHint_C::TotalActivateDuration' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_OverBoostHint_C, CurrentActivateTime) == 0x0002F0, "Member 'UUMG_HelmetHUD_OverBoostHint_C::CurrentActivateTime' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_OverBoostHint_C, TotalCoolDownDuration) == 0x0002F4, "Member 'UUMG_HelmetHUD_OverBoostHint_C::TotalCoolDownDuration' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_OverBoostHint_C, CurrentCoolDownTime) == 0x0002F8, "Member 'UUMG_HelmetHUD_OverBoostHint_C::CurrentCoolDownTime' has a wrong offset!");

}

