#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameUI_HitTargetFeedbackFork

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork
// 0x01F8 (0x01F8 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FPBEventAttackDetailInfo& AttachInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FPBGameplayEventParam_CharacterKillEnemy Temp_struct_Variable;                              // 0x0018(0x0048)(NoDestructor)
	class UGESAsyncAction_ListenForGameplayEvent* K2Node_CustomEvent_ProxyObject_1;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualEvent_1;                  // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGESAsyncAction_ListenForGameplayEvent* ProxyObject, const struct FGameplayTag& ActualEvent)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FPBGameplayEventParam_CharacterKillEnemy Temp_struct_Variable_1;                            // 0x0080(0x0048)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* Temp_object_Variable;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGESAsyncAction_ListenForGameplayEvent* CallFunc_ListenForGameplayEvent_ReturnValue;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGESAsyncAction_ListenForGameplayEvent* ProxyObject, const struct FGameplayTag& ActualEvent)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGESAsyncAction_ListenForGameplayEvent* K2Node_CustomEvent_ProxyObject;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualEvent;                    // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* Temp_object_Variable_1;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* CallFunc_ListenForGameplayEvent_ReturnValue_1;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x012C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerController*                    K2Node_DynamicCast_AsPBPlayer_Controller;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBEventAttackDetailInfo               K2Node_CustomEvent_AttachInfo;                     // 0x01B0(0x0048)(ConstParm, NoDestructor)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork) == 0x000008, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork) == 0x0001F8, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, EntryPoint) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, Temp_struct_Variable) == 0x000018, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_CustomEvent_ProxyObject_1) == 0x000060, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_CustomEvent_ActualEvent_1) == 0x000068, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_CustomEvent_ActualEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, Temp_struct_Variable_1) == 0x000080, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, Temp_struct_Variable_2) == 0x0000C8, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, Temp_object_Variable) == 0x0000D0, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_GetPayload_ReturnValue) == 0x0000D8, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_ListenForGameplayEvent_ReturnValue) == 0x0000E0, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_ListenForGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_IsValid_ReturnValue_1) == 0x0000F8, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_CustomEvent_ProxyObject) == 0x000100, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_CustomEvent_ActualEvent) == 0x000108, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_CustomEvent_ActualEvent' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, Temp_struct_Variable_3) == 0x000110, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, Temp_object_Variable_1) == 0x000118, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_ListenForGameplayEvent_ReturnValue_1) == 0x000120, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_ListenForGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_IsValid_ReturnValue_2) == 0x000128, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_Event_MyGeometry) == 0x00012C, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_Event_InDeltaTime) == 0x000164, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_PlayAnimation_ReturnValue) == 0x000168, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000170, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000171, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_BooleanOR_ReturnValue) == 0x000172, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_PlayAnimation_ReturnValue_1) == 0x000178, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_IsAnimationPlaying_ReturnValue_2) == 0x000180, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_IsAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_Array_Get_Item) == 0x000188, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_BooleanOR_ReturnValue_1) == 0x000190, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_IsValid_ReturnValue_3) == 0x000191, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, CallFunc_GetOwningPlayer_ReturnValue) == 0x000198, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_DynamicCast_AsPBPlayer_Controller) == 0x0001A0, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_DynamicCast_AsPBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork, K2Node_CustomEvent_AttachInfo) == 0x0001B0, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ExecuteUbergraph_UMG_InGameUI_HitTargetFeedbackFork::K2Node_CustomEvent_AttachInfo' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.OnClientInstigatedAnyDamage_Event_0
// 0x0048 (0x0048 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_OnClientInstigatedAnyDamage_Event_0 final
{
public:
	struct FPBEventAttackDetailInfo               AttachInfo;                                        // 0x0000(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_OnClientInstigatedAnyDamage_Event_0) == 0x000008, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_OnClientInstigatedAnyDamage_Event_0");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_OnClientInstigatedAnyDamage_Event_0) == 0x000048, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_OnClientInstigatedAnyDamage_Event_0");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_OnClientInstigatedAnyDamage_Event_0, AttachInfo) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_OnClientInstigatedAnyDamage_Event_0::AttachInfo' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_Tick) == 0x000004, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_Tick");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_Tick) == 0x00003C, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_Tick");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E final
{
public:
	class UGESAsyncAction_ListenForGameplayEvent* ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualEvent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E) == 0x000008, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E) == 0x000010, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E, ProxyObject) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E::ProxyObject' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E, ActualEvent) == 0x000008, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_1D01CDF04244A3EBA22E1AB2400EAA8E::ActualEvent' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00 final
{
public:
	class UGESAsyncAction_ListenForGameplayEvent* ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualEvent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00) == 0x000008, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00) == 0x000010, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00, ProxyObject) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00::ProxyObject' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00, ActualEvent) == 0x000008, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_OnMessageReceived_F4BF15124362A52D4A909AA9907BFE00::ActualEvent' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.FindSightMesh
// 0x00C0 (0x00C0 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh final
{
public:
	EPBPartSlotType                               Temp_byte_Variable;                                // 0x0000(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter_BP_C*                      K2Node_DynamicCast_AsPBCharacter_BP;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBWeapon*                              CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBWeaponPartManager*                   CallFunc_GetWeaponPartMgr_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBPartSlotType, class UPartDataHolderComponent*> CallFunc_GetWeaponSlotPartMap_ReturnValue;         // 0x0050(0x0050)(ContainsInstancedReference)
	class UPartDataHolderComponent*               CallFunc_Map_Find_Value;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetPartMesh1P_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh) == 0x000008, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh) == 0x0000C0, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, Temp_byte_Variable) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, K2Node_DynamicCast_AsPBCharacter_BP) == 0x000010, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::K2Node_DynamicCast_AsPBCharacter_BP' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000020, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_GetObjectClass_ReturnValue) == 0x000030, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000038, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000039, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_GetWeaponPartMgr_ReturnValue) == 0x000040, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_GetWeaponPartMgr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_GetWeaponSlotPartMap_ReturnValue) == 0x000050, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_GetWeaponSlotPartMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_Map_Find_Value) == 0x0000A0, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_Map_Find_ReturnValue) == 0x0000A8, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_GetPartMesh1P_ReturnValue) == 0x0000B0, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_GetPartMesh1P_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B8, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_FindSightMesh::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.UpdateLocation
// 0x0098 (0x0098 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetScreenPositionFromWorldLocation_ScreenPosition; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScreenPositionFromWorldLocation_ReturnValue; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ScreenToWidgetLocal_LocalCoordinate;      // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAimingRatio_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation) == 0x000004, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation) == 0x000098, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, Geometry) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::Geometry' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_GetAbsoluteSize_ReturnValue) == 0x000038, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000044, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_GetSocketLocation_ReturnValue) == 0x00004C, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_GetScreenPositionFromWorldLocation_ScreenPosition) == 0x000058, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_GetScreenPositionFromWorldLocation_ScreenPosition' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_GetScreenPositionFromWorldLocation_ReturnValue) == 0x000060, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_GetScreenPositionFromWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000064, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_ScreenToWidgetLocal_LocalCoordinate) == 0x00006C, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_ScreenToWidgetLocal_LocalCoordinate' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_GetAimingRatio_ReturnValue) == 0x000074, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_GetAimingRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_BreakVector2D_X) == 0x000078, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_BreakVector2D_Y) == 0x00007C, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_Lerp_ReturnValue) == 0x000080, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_Lerp_ReturnValue_1) == 0x000084, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_MakeVector2D_ReturnValue) == 0x000088, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation, CallFunc_MakeVector2D_ReturnValue_1) == 0x000090, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateLocation::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.HitTargetHandle
// 0x0020 (0x0020 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle final
{
public:
	bool                                          KillShot;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          headshot;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ArmorShot;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Damage;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle) == 0x000008, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle) == 0x000020, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle, KillShot) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle::KillShot' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle, headshot) == 0x000001, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle::headshot' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle, ArmorShot) == 0x000002, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle::ArmorShot' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle, Damage) == 0x000004, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle::Damage' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_HitTargetHandle::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.ClientKilltagertHandle
// 0x0060 (0x0060 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle final
{
public:
	struct FPBEventAttackDetailInfo               AttackInfo;                                        // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle) == 0x000008, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle) == 0x000060, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle, AttackInfo) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle::AttackInfo' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_ClientKilltagertHandle::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.Hit Target Handle
// 0x00A0 (0x00A0 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle final
{
public:
	struct FPBEventAttackDetailInfo               AttackInfo;                                        // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         DamageTaken;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                VictimObject;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                NewLocalVar_0;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBShieldHover*                         K2Node_DynamicCast_AsPBShield_Hover;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBVehicle*                             K2Node_DynamicCast_AsPBVehicle;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxAirTightness_ReturnValue;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAirTightness_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle) == 0x000008, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle) == 0x0000A0, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, AttackInfo) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::AttackInfo' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, DamageTaken) == 0x000048, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::DamageTaken' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, VictimObject) == 0x000050, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::VictimObject' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, NewLocalVar_0) == 0x000058, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, K2Node_DynamicCast_AsPBShield_Hover) == 0x000060, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::K2Node_DynamicCast_AsPBShield_Hover' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, K2Node_DynamicCast_AsPBVehicle) == 0x000078, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::K2Node_DynamicCast_AsPBVehicle' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, K2Node_DynamicCast_AsPBCharacter) == 0x000088, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::K2Node_DynamicCast_AsPBCharacter' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, CallFunc_GetMaxAirTightness_ReturnValue) == 0x000094, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::CallFunc_GetMaxAirTightness_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, CallFunc_GetAirTightness_ReturnValue) == 0x000098, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::CallFunc_GetAirTightness_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00009C, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_Hit_Target_Handle::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.UpdateHitDamageTemp
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitDamageTemp final
{
public:
	float                                         InDamage;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitDamageTemp) == 0x000004, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitDamageTemp");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitDamageTemp) == 0x000008, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitDamageTemp");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitDamageTemp, InDamage) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitDamageTemp::InDamage' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitDamageTemp, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitDamageTemp::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.UpdateHitForkMaterialSize
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize) == 0x000008, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize) == 0x000010, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_UpdateHitForkMaterialSize::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.StopFeedBackAnimation
// 0x0001 (0x0001 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_StopFeedBackAnimation final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameUI_HitTargetFeedbackFork_C_StopFeedBackAnimation) == 0x000001, "Wrong alignment on UMG_InGameUI_HitTargetFeedbackFork_C_StopFeedBackAnimation");
static_assert(sizeof(UMG_InGameUI_HitTargetFeedbackFork_C_StopFeedBackAnimation) == 0x000001, "Wrong size on UMG_InGameUI_HitTargetFeedbackFork_C_StopFeedBackAnimation");
static_assert(offsetof(UMG_InGameUI_HitTargetFeedbackFork_C_StopFeedBackAnimation, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'UMG_InGameUI_HitTargetFeedbackFork_C_StopFeedBackAnimation::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function UMG_InGameUI_HitTargetFeedbackFork.UMG_InGameUI_HitTargetFeedbackFork_C.SetTexByDamage
// 0x0028 (0x0028 - 0x0000)
struct UMG_InGameUI_HitTargetFeedbackFork_C_SetTexByDamage final
{
public:
	float                                         InDamage;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
