#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ProfileGeneralInfo

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_ProfileGeneralInfo.UMG_ProfileGeneralInfo_C.ExecuteUbergraph_UMG_ProfileGeneralInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_ProfileGeneralInfo_C_ExecuteUbergraph_UMG_ProfileGeneralInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProfileGeneralInfo_C_ExecuteUbergraph_UMG_ProfileGeneralInfo) == 0x000004, "Wrong alignment on UMG_ProfileGeneralInfo_C_ExecuteUbergraph_UMG_ProfileGeneralInfo");
static_assert(sizeof(UMG_ProfileGeneralInfo_C_ExecuteUbergraph_UMG_ProfileGeneralInfo) == 0x000004, "Wrong size on UMG_ProfileGeneralInfo_C_ExecuteUbergraph_UMG_ProfileGeneralInfo");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_ExecuteUbergraph_UMG_ProfileGeneralInfo, EntryPoint) == 0x000000, "Member 'UMG_ProfileGeneralInfo_C_ExecuteUbergraph_UMG_ProfileGeneralInfo::EntryPoint' has a wrong offset!");

// Function UMG_ProfileGeneralInfo.UMG_ProfileGeneralInfo_C.GetPercentageString
// 0x0058 (0x0058 - 0x0000)
struct UMG_ProfileGeneralInfo_C_GetPercentageString final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Return;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProfileGeneralInfo_C_GetPercentageString) == 0x000008, "Wrong alignment on UMG_ProfileGeneralInfo_C_GetPercentageString");
static_assert(sizeof(UMG_ProfileGeneralInfo_C_GetPercentageString) == 0x000058, "Wrong size on UMG_ProfileGeneralInfo_C_GetPercentageString");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetPercentageString, Value) == 0x000000, "Member 'UMG_ProfileGeneralInfo_C_GetPercentageString::Value' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetPercentageString, Return) == 0x000008, "Member 'UMG_ProfileGeneralInfo_C_GetPercentageString::Return' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetPercentageString, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000018, "Member 'UMG_ProfileGeneralInfo_C_GetPercentageString::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetPercentageString, CallFunc_Conv_FloatToText_ReturnValue) == 0x000020, "Member 'UMG_ProfileGeneralInfo_C_GetPercentageString::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetPercentageString, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'UMG_ProfileGeneralInfo_C_GetPercentageString::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetPercentageString, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'UMG_ProfileGeneralInfo_C_GetPercentageString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function UMG_ProfileGeneralInfo.UMG_ProfileGeneralInfo_C.GetStringFromUsageTime
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_ProfileGeneralInfo_C_GetStringFromUsageTime final
{
public:
	float                                         UsageTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UsageTimeString;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime) == 0x000008, "Wrong alignment on UMG_ProfileGeneralInfo_C_GetStringFromUsageTime");
static_assert(sizeof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime) == 0x0000A8, "Wrong size on UMG_ProfileGeneralInfo_C_GetStringFromUsageTime");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, UsageTime) == 0x000000, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::UsageTime' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, UsageTimeString) == 0x000008, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::UsageTimeString' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Percent_FloatFloat_ReturnValue) == 0x00001C, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_FFloor_ReturnValue) == 0x000020, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000024, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_FFloor_ReturnValue_1) == 0x000038, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000050, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_SelectString_ReturnValue) == 0x000078, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_GetStringFromUsageTime, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000098, "Member 'UMG_ProfileGeneralInfo_C_GetStringFromUsageTime::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function UMG_ProfileGeneralInfo.UMG_ProfileGeneralInfo_C.RefreshInfo
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_ProfileGeneralInfo_C_RefreshInfo final
{
public:
	class UPBCareerManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringFromUsageTime_UsageTimeString;   // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x00A8(0x0018)()
	class FString                                 CallFunc_GetPercentageString_Return;               // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00D0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00E8(0x0018)()
	class FString                                 CallFunc_GetPercentageString_Return_1;             // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0110(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0128(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0140(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0158(0x0018)()
	class FString                                 CallFunc_GetPercentageString_Return_2;             // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0180(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0198(0x0018)()
};
static_assert(alignof(UMG_ProfileGeneralInfo_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_ProfileGeneralInfo_C_RefreshInfo");
static_assert(sizeof(UMG_ProfileGeneralInfo_C_RefreshInfo) == 0x0001B0, "Wrong size on UMG_ProfileGeneralInfo_C_RefreshInfo");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_NotEqual_NameName_ReturnValue) == 0x000020, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000040, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_GetStringFromUsageTime_UsageTimeString) == 0x000058, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_GetStringFromUsageTime_UsageTimeString' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000090, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_FloatToText_ReturnValue) == 0x0000A8, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_GetPercentageString_Return) == 0x0000C0, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_GetPercentageString_Return' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000D0, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0000E8, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_GetPercentageString_Return_1) == 0x000100, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_GetPercentageString_Return_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000110, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000128, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000140, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000158, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_GetPercentageString_Return_2) == 0x000170, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_GetPercentageString_Return_2' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000180, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_ProfileGeneralInfo_C_RefreshInfo, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000198, "Member 'UMG_ProfileGeneralInfo_C_RefreshInfo::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");

}

