#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InventoryCompareItem

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_InventoryCompareItem.UMG_InventoryCompareItem_C
// 0x0068 (0x02C8 - 0x0260)
class UUMG_InventoryCompareItem_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Arrow_Down;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Up;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ArrowBoard;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Data;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Item;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_DataItem;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_DataNumber;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Unit;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ItemName;                                          // 0x02A8(0x0018)(Edit, BlueprintVisible)
	bool                                          IsBigItem;                                         // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_InventoryCompareItem(int32 EntryPoint);
	void Construct();
	void RefreshData(float EuqippingData, float TestingData, const class FText& Unit, bool IsReverse, bool OnlyNumberDisplay, int32 NumberDigits);
	void SetCompareItemName(const class FText& InItemName);
	void Refresh_Ammo_Data(int32 InEquippingClipAmmo, int32 InEquippingBackUpAmmo, int32 InTestingClipAmmo, int32 InTestingBackUpAmmo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_InventoryCompareItem_C">();
	}
	static class UUMG_InventoryCompareItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_InventoryCompareItem_C>();
	}
};
static_assert(alignof(UUMG_InventoryCompareItem_C) == 0x000008, "Wrong alignment on UUMG_InventoryCompareItem_C");
static_assert(sizeof(UUMG_InventoryCompareItem_C) == 0x0002C8, "Wrong size on UUMG_InventoryCompareItem_C");
static_assert(offsetof(UUMG_InventoryCompareItem_C, UberGraphFrame) == 0x000260, "Member 'UUMG_InventoryCompareItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, Arrow_Down) == 0x000268, "Member 'UUMG_InventoryCompareItem_C::Arrow_Down' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, Arrow_Up) == 0x000270, "Member 'UUMG_InventoryCompareItem_C::Arrow_Up' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, ArrowBoard) == 0x000278, "Member 'UUMG_InventoryCompareItem_C::ArrowBoard' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, Border_Data) == 0x000280, "Member 'UUMG_InventoryCompareItem_C::Border_Data' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, SizeBox_Item) == 0x000288, "Member 'UUMG_InventoryCompareItem_C::SizeBox_Item' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, TextBlock_DataItem) == 0x000290, "Member 'UUMG_InventoryCompareItem_C::TextBlock_DataItem' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, TextBlock_DataNumber) == 0x000298, "Member 'UUMG_InventoryCompareItem_C::TextBlock_DataNumber' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, TextBlock_Unit) == 0x0002A0, "Member 'UUMG_InventoryCompareItem_C::TextBlock_Unit' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, ItemName) == 0x0002A8, "Member 'UUMG_InventoryCompareItem_C::ItemName' has a wrong offset!");
static_assert(offsetof(UUMG_InventoryCompareItem_C, IsBigItem) == 0x0002C0, "Member 'UUMG_InventoryCompareItem_C::IsBigItem' has a wrong offset!");

}

