#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NewItemPageForRedemption

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_NewItemPageForRedemption.UMG_NewItemPageForRedemption_C
// 0x0040 (0x0378 - 0x0338)
class UUMG_NewItemPageForRedemption_C final : public UPBRedemptionNewItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_ItemList;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_98;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RedemptionCodeRewardItem_C*        UMG_RedemptionCodeRewardItem;                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FName>                           ItemIDArray;                                       // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_NewItemPageForRedemption(int32 EntryPoint);
	void K2_HandleExit();
	void RefreshItemList();
	void InitializeFocus();
	void SetItemIDArray(TArray<class FName>& InItemIDArray);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_NewItemPageForRedemption_C">();
	}
	static class UUMG_NewItemPageForRedemption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_NewItemPageForRedemption_C>();
	}
};
static_assert(alignof(UUMG_NewItemPageForRedemption_C) == 0x000008, "Wrong alignment on UUMG_NewItemPageForRedemption_C");
static_assert(sizeof(UUMG_NewItemPageForRedemption_C) == 0x000378, "Wrong size on UUMG_NewItemPageForRedemption_C");
static_assert(offsetof(UUMG_NewItemPageForRedemption_C, UberGraphFrame) == 0x000338, "Member 'UUMG_NewItemPageForRedemption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPageForRedemption_C, HorizontalBox_ItemList) == 0x000340, "Member 'UUMG_NewItemPageForRedemption_C::HorizontalBox_ItemList' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPageForRedemption_C, Image_Line) == 0x000348, "Member 'UUMG_NewItemPageForRedemption_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPageForRedemption_C, SafeZone_98) == 0x000350, "Member 'UUMG_NewItemPageForRedemption_C::SafeZone_98' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPageForRedemption_C, UMG_RedemptionCodeRewardItem) == 0x000358, "Member 'UUMG_NewItemPageForRedemption_C::UMG_RedemptionCodeRewardItem' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPageForRedemption_C, UMG_STD_Text) == 0x000360, "Member 'UUMG_NewItemPageForRedemption_C::UMG_STD_Text' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPageForRedemption_C, ItemIDArray) == 0x000368, "Member 'UUMG_NewItemPageForRedemption_C::ItemIDArray' has a wrong offset!");

}

