#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ControllerButtonSettings

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C
// 0x0100 (0x0448 - 0x0348)
class UUMG_ControllerButtonSettings_C final : public UPBControllerButtonSettingsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_Card_GamepadKeyBinding_C*          MoveUp;                                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_98;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBCommonRichTextBlock*                 TextBlock_Tips_3;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TipsOverlay;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TipsSwitcher;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_GamepadView_C*                     UMG_GamepadView;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_BindingList;                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Card_GamepadKeyBinding_C*          UseOrReload;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              NoDefaultFocus;                                    // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Skip;                                              // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class FString, float>                    CompletetChallengeArray;                           // 0x03B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 MaxProcessName;                                    // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         MaxProcessData;                                    // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TempGameRoundChallengeAchievement;                 // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPBUserWidget*                          ParentWidget;                                      // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRecordingKey;                                   // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Options;                                           // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_ControllerButtonSettings(int32 EntryPoint);
	void K2_HandleResetThisPage();
	void K2_HandleExit();
	void DSP_OnSwitchInputDevice_Event_0(EInputDevice CurrentDevice);
	void BP_OnActivated();
	void BackEvent(bool bQuitgame);
	void StartRecord(bool StartRecord_0);
	void OnFocusAtButtons(const struct FKey& MainKey, const struct FKey& ViceKey);
	void OnInitialized();
	void BndEvt__UseOrReload_K2Node_ComponentBoundEvent_0_OnKeySet__DelegateSignature();
	void ScrollItemFocus(class UWidget* Item);
	void IsAllKeyAvaliable(bool* bReady);
	void ShowTips(bool bLeaveBinindTips);
	void ConfirmLeave(int32 Index_0);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void IsContainsKey(class FName InputActionName, const struct FKey& InKey, bool* bContains);
	void HandleLeavePage();
	void HandleReset();
	void LeavePage();
	bool BP_OnHandleBackAction();
	void ConfirmReset(int32 Index_0);
	void FocusFirstOptionItem();
	void RefreshAllKeyInfo();
	void SetKeybindInpuDevice(EInputDevice InputPin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ControllerButtonSettings_C">();
	}
	static class UUMG_ControllerButtonSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ControllerButtonSettings_C>();
	}
};
static_assert(alignof(UUMG_ControllerButtonSettings_C) == 0x000008, "Wrong alignment on UUMG_ControllerButtonSettings_C");
static_assert(sizeof(UUMG_ControllerButtonSettings_C) == 0x000448, "Wrong size on UUMG_ControllerButtonSettings_C");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, UberGraphFrame) == 0x000348, "Member 'UUMG_ControllerButtonSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, MoveUp) == 0x000350, "Member 'UUMG_ControllerButtonSettings_C::MoveUp' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, SafeZone_98) == 0x000358, "Member 'UUMG_ControllerButtonSettings_C::SafeZone_98' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, TextBlock_Tips_3) == 0x000360, "Member 'UUMG_ControllerButtonSettings_C::TextBlock_Tips_3' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, TipsOverlay) == 0x000368, "Member 'UUMG_ControllerButtonSettings_C::TipsOverlay' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, TipsSwitcher) == 0x000370, "Member 'UUMG_ControllerButtonSettings_C::TipsSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, UMG_GamepadView) == 0x000378, "Member 'UUMG_ControllerButtonSettings_C::UMG_GamepadView' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, UniformGridPanel_BindingList) == 0x000380, "Member 'UUMG_ControllerButtonSettings_C::UniformGridPanel_BindingList' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, UseOrReload) == 0x000388, "Member 'UUMG_ControllerButtonSettings_C::UseOrReload' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, NoDefaultFocus) == 0x000390, "Member 'UUMG_ControllerButtonSettings_C::NoDefaultFocus' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, Skip) == 0x0003A0, "Member 'UUMG_ControllerButtonSettings_C::Skip' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, CompletetChallengeArray) == 0x0003B0, "Member 'UUMG_ControllerButtonSettings_C::CompletetChallengeArray' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, MaxProcessName) == 0x000400, "Member 'UUMG_ControllerButtonSettings_C::MaxProcessName' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, MaxProcessData) == 0x000410, "Member 'UUMG_ControllerButtonSettings_C::MaxProcessData' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, TempGameRoundChallengeAchievement) == 0x000418, "Member 'UUMG_ControllerButtonSettings_C::TempGameRoundChallengeAchievement' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, ParentWidget) == 0x000428, "Member 'UUMG_ControllerButtonSettings_C::ParentWidget' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, bIsRecordingKey) == 0x000430, "Member 'UUMG_ControllerButtonSettings_C::bIsRecordingKey' has a wrong offset!");
static_assert(offsetof(UUMG_ControllerButtonSettings_C, Options) == 0x000438, "Member 'UUMG_ControllerButtonSettings_C::Options' has a wrong offset!");

}

