#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SingleSoundTrack

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.ExecuteUbergraph_UMG_SingleSoundTrack
// 0x00D0 (0x00D0 - 0x0000)
struct UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0060(0x0070)(ConstParm)
};
static_assert(alignof(UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack) == 0x000008, "Wrong alignment on UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack");
static_assert(sizeof(UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack) == 0x0000D0, "Wrong size on UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack");
static_assert(offsetof(UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack, EntryPoint) == 0x000000, "Member 'UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack, K2Node_Event_MyGeometry) == 0x000028, "Member 'UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack, K2Node_Event_MouseEvent) == 0x000060, "Member 'UMG_SingleSoundTrack_C_ExecuteUbergraph_UMG_SingleSoundTrack::K2Node_Event_MouseEvent' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_SingleSoundTrack_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_SingleSoundTrack_C_OnMouseEnter) == 0x000008, "Wrong alignment on UMG_SingleSoundTrack_C_OnMouseEnter");
static_assert(sizeof(UMG_SingleSoundTrack_C_OnMouseEnter) == 0x0000A8, "Wrong size on UMG_SingleSoundTrack_C_OnMouseEnter");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UMG_SingleSoundTrack_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UMG_SingleSoundTrack_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_SingleSoundTrack_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_SingleSoundTrack_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_SingleSoundTrack_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_SingleSoundTrack_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_SingleSoundTrack_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_SingleSoundTrack_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_SingleSoundTrack_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_SingleSoundTrack_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_SingleSoundTrack_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_SingleSoundTrack_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_SingleSoundTrack_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_SingleSoundTrack_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.InitInfo
// 0x0060 (0x0060 - 0x0000)
struct UMG_SingleSoundTrack_C_InitInfo final
{
public:
	class USoundBase*                             InSoundTrack;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InSoundTrackName;                                  // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InIndex;                                           // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ConvertTime_OutMinutes;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertTime_OutSeconds;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0018)()
};
static_assert(alignof(UMG_SingleSoundTrack_C_InitInfo) == 0x000008, "Wrong alignment on UMG_SingleSoundTrack_C_InitInfo");
static_assert(sizeof(UMG_SingleSoundTrack_C_InitInfo) == 0x000060, "Wrong size on UMG_SingleSoundTrack_C_InitInfo");
static_assert(offsetof(UMG_SingleSoundTrack_C_InitInfo, InSoundTrack) == 0x000000, "Member 'UMG_SingleSoundTrack_C_InitInfo::InSoundTrack' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_InitInfo, InSoundTrackName) == 0x000008, "Member 'UMG_SingleSoundTrack_C_InitInfo::InSoundTrackName' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_InitInfo, InIndex) == 0x000020, "Member 'UMG_SingleSoundTrack_C_InitInfo::InIndex' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_InitInfo, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'UMG_SingleSoundTrack_C_InitInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_InitInfo, CallFunc_ConvertTime_OutMinutes) == 0x000028, "Member 'UMG_SingleSoundTrack_C_InitInfo::CallFunc_ConvertTime_OutMinutes' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_InitInfo, CallFunc_ConvertTime_OutSeconds) == 0x00002C, "Member 'UMG_SingleSoundTrack_C_InitInfo::CallFunc_ConvertTime_OutSeconds' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_InitInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'UMG_SingleSoundTrack_C_InitInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_InitInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'UMG_SingleSoundTrack_C_InitInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.PlaySoundTrack
// 0x0048 (0x0048 - 0x0000)
struct UMG_SingleSoundTrack_C_PlaySoundTrack final
{
public:
	class UAudioComponent*                        InPlayingAudioComp;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlaying;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	TDelegate<void(class USoundWave* PlayingSoundWave, float PlaybackPercent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UMG_SingleSoundTrack_C_PlaySoundTrack) == 0x000008, "Wrong alignment on UMG_SingleSoundTrack_C_PlaySoundTrack");
static_assert(sizeof(UMG_SingleSoundTrack_C_PlaySoundTrack) == 0x000048, "Wrong size on UMG_SingleSoundTrack_C_PlaySoundTrack");
static_assert(offsetof(UMG_SingleSoundTrack_C_PlaySoundTrack, InPlayingAudioComp) == 0x000000, "Member 'UMG_SingleSoundTrack_C_PlaySoundTrack::InPlayingAudioComp' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_PlaySoundTrack, bIsPlaying) == 0x000008, "Member 'UMG_SingleSoundTrack_C_PlaySoundTrack::bIsPlaying' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_PlaySoundTrack, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'UMG_SingleSoundTrack_C_PlaySoundTrack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_PlaySoundTrack, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'UMG_SingleSoundTrack_C_PlaySoundTrack::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_PlaySoundTrack, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'UMG_SingleSoundTrack_C_PlaySoundTrack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.StopSoundTrack
// 0x0040 (0x0040 - 0x0000)
struct UMG_SingleSoundTrack_C_StopSoundTrack final
{
public:
	TDelegate<void(class USoundWave* PlayingSoundWave, float PlaybackPercent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
};
static_assert(alignof(UMG_SingleSoundTrack_C_StopSoundTrack) == 0x000008, "Wrong alignment on UMG_SingleSoundTrack_C_StopSoundTrack");
static_assert(sizeof(UMG_SingleSoundTrack_C_StopSoundTrack) == 0x000040, "Wrong size on UMG_SingleSoundTrack_C_StopSoundTrack");
static_assert(offsetof(UMG_SingleSoundTrack_C_StopSoundTrack, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_SingleSoundTrack_C_StopSoundTrack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_StopSoundTrack, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UMG_SingleSoundTrack_C_StopSoundTrack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_StopSoundTrack, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'UMG_SingleSoundTrack_C_StopSoundTrack::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.ConvertTime
// 0x001C (0x001C - 0x0000)
struct UMG_SingleSoundTrack_C_ConvertTime final
{
public:
	float                                         InSeconds;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutMinutes;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutSeconds;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SingleSoundTrack_C_ConvertTime) == 0x000004, "Wrong alignment on UMG_SingleSoundTrack_C_ConvertTime");
static_assert(sizeof(UMG_SingleSoundTrack_C_ConvertTime) == 0x00001C, "Wrong size on UMG_SingleSoundTrack_C_ConvertTime");
static_assert(offsetof(UMG_SingleSoundTrack_C_ConvertTime, InSeconds) == 0x000000, "Member 'UMG_SingleSoundTrack_C_ConvertTime::InSeconds' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ConvertTime, OutMinutes) == 0x000004, "Member 'UMG_SingleSoundTrack_C_ConvertTime::OutMinutes' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ConvertTime, OutSeconds) == 0x000008, "Member 'UMG_SingleSoundTrack_C_ConvertTime::OutSeconds' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ConvertTime, CallFunc_FCeil_ReturnValue) == 0x00000C, "Member 'UMG_SingleSoundTrack_C_ConvertTime::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ConvertTime, CallFunc_Divide_IntInt_ReturnValue) == 0x000010, "Member 'UMG_SingleSoundTrack_C_ConvertTime::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ConvertTime, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'UMG_SingleSoundTrack_C_ConvertTime::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_ConvertTime, CallFunc_Percent_IntInt_ReturnValue) == 0x000018, "Member 'UMG_SingleSoundTrack_C_ConvertTime::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.OnPlaybackPercent
// 0x0050 (0x0050 - 0x0000)
struct UMG_SingleSoundTrack_C_OnPlaybackPercent final
{
public:
	const class USoundWave*                       PlayingSoundWave;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackPercent;                                   // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertTime_OutMinutes;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertTime_OutSeconds;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
};
static_assert(alignof(UMG_SingleSoundTrack_C_OnPlaybackPercent) == 0x000008, "Wrong alignment on UMG_SingleSoundTrack_C_OnPlaybackPercent");
static_assert(sizeof(UMG_SingleSoundTrack_C_OnPlaybackPercent) == 0x000050, "Wrong size on UMG_SingleSoundTrack_C_OnPlaybackPercent");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnPlaybackPercent, PlayingSoundWave) == 0x000000, "Member 'UMG_SingleSoundTrack_C_OnPlaybackPercent::PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnPlaybackPercent, PlaybackPercent) == 0x000008, "Member 'UMG_SingleSoundTrack_C_OnPlaybackPercent::PlaybackPercent' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnPlaybackPercent, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'UMG_SingleSoundTrack_C_OnPlaybackPercent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnPlaybackPercent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'UMG_SingleSoundTrack_C_OnPlaybackPercent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnPlaybackPercent, CallFunc_ConvertTime_OutMinutes) == 0x000014, "Member 'UMG_SingleSoundTrack_C_OnPlaybackPercent::CallFunc_ConvertTime_OutMinutes' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnPlaybackPercent, CallFunc_ConvertTime_OutSeconds) == 0x000018, "Member 'UMG_SingleSoundTrack_C_OnPlaybackPercent::CallFunc_ConvertTime_OutSeconds' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnPlaybackPercent, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'UMG_SingleSoundTrack_C_OnPlaybackPercent::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnPlaybackPercent, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'UMG_SingleSoundTrack_C_OnPlaybackPercent::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.OnKeyUp
// 0x0370 (0x0370 - 0x0000)
struct UMG_SingleSoundTrack_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0148(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x0200(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x02B8(0x00B8)()
};
static_assert(alignof(UMG_SingleSoundTrack_C_OnKeyUp) == 0x000008, "Wrong alignment on UMG_SingleSoundTrack_C_OnKeyUp");
static_assert(sizeof(UMG_SingleSoundTrack_C_OnKeyUp) == 0x000370, "Wrong size on UMG_SingleSoundTrack_C_OnKeyUp");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'UMG_SingleSoundTrack_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'UMG_SingleSoundTrack_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnKeyUp, ReturnValue) == 0x000070, "Member 'UMG_SingleSoundTrack_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'UMG_SingleSoundTrack_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000140, "Member 'UMG_SingleSoundTrack_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000148, "Member 'UMG_SingleSoundTrack_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnKeyUp, CallFunc_Unhandled_ReturnValue_1) == 0x000200, "Member 'UMG_SingleSoundTrack_C_OnKeyUp::CallFunc_Unhandled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x0002B8, "Member 'UMG_SingleSoundTrack_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_SingleSoundTrack.UMG_SingleSoundTrack_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct UMG_SingleSoundTrack_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_SingleSoundTrack_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on UMG_SingleSoundTrack_C_OnMouseButtonUp");
static_assert(sizeof(UMG_SingleSoundTrack_C_OnMouseButtonUp) == 0x000218, "Wrong size on UMG_SingleSoundTrack_C_OnMouseButtonUp");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'UMG_SingleSoundTrack_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'UMG_SingleSoundTrack_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'UMG_SingleSoundTrack_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SingleSoundTrack_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_SingleSoundTrack_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

