#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FieldModCompareTip

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.ExecuteUbergraph_UMG_FieldModCompareTip
// 0x3B80 (0x3B80 - 0x0000)
struct UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBRayProjectileConfigRow_Replace      K2Node_Event_EquippingRayProjectileConfig;         // 0x0008(0x06A8)(ConstParm)
	struct FPBWeaponConfigRow                     K2Node_Event_EquippingWeaponConfig;                // 0x06B0(0x0B00)(ConstParm)
	struct FPBMeleeWeaponDescription              K2Node_Event_EquippingMeleeWeaponDescription;      // 0x11B0(0x00E8)(ConstParm)
	struct FPBMeleeWeaponDescription              K2Node_Event_TestingMeleeWeaponDescription;        // 0x1298(0x00E8)(ConstParm)
	struct FPBRayProjectileConfigRow_Replace      K2Node_Event_EquippingRayProjectileConfig_1;       // 0x1380(0x06A8)(ConstParm)
	struct FPBRayProjectileConfigRow_Replace      K2Node_Event_TestingRayProjectileConfig;           // 0x1A28(0x06A8)(ConstParm)
	struct FPBWeaponConfigRow                     K2Node_Event_EquippingWeaponConfig_1;              // 0x20D0(0x0B00)(ConstParm)
	struct FPBWeaponConfigRow                     K2Node_Event_TestingWeaponConfig;                  // 0x2BD0(0x0B00)(ConstParm)
	struct FPBMobilityDescription                 K2Node_Event_EquippingMobilityDescription;         // 0x36D0(0x0100)(ConstParm)
	struct FPBMobilityDescription                 K2Node_Event_TestingMobilityDescription;           // 0x37D0(0x0100)(ConstParm)
	struct FPBPodDescription                      K2Node_Event_EquippingPodDescription;              // 0x38D0(0x0158)(ConstParm)
	struct FPBPodDescription                      K2Node_Event_TestingPodDescription;                // 0x3A28(0x0158)(ConstParm)
};
static_assert(alignof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip) == 0x000010, "Wrong alignment on UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip");
static_assert(sizeof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip) == 0x003B80, "Wrong size on UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, EntryPoint) == 0x000000, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_EquippingRayProjectileConfig) == 0x000008, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_EquippingRayProjectileConfig' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_EquippingWeaponConfig) == 0x0006B0, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_EquippingWeaponConfig' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_EquippingMeleeWeaponDescription) == 0x0011B0, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_EquippingMeleeWeaponDescription' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_TestingMeleeWeaponDescription) == 0x001298, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_TestingMeleeWeaponDescription' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_EquippingRayProjectileConfig_1) == 0x001380, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_EquippingRayProjectileConfig_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_TestingRayProjectileConfig) == 0x001A28, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_TestingRayProjectileConfig' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_EquippingWeaponConfig_1) == 0x0020D0, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_EquippingWeaponConfig_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_TestingWeaponConfig) == 0x002BD0, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_TestingWeaponConfig' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_EquippingMobilityDescription) == 0x0036D0, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_EquippingMobilityDescription' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_TestingMobilityDescription) == 0x0037D0, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_TestingMobilityDescription' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_EquippingPodDescription) == 0x0038D0, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_EquippingPodDescription' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip, K2Node_Event_TestingPodDescription) == 0x003A28, "Member 'UMG_FieldModCompareTip_C_ExecuteUbergraph_UMG_FieldModCompareTip::K2Node_Event_TestingPodDescription' has a wrong offset!");

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.K2_RefreshWeaponSingleData
// 0x11B0 (0x11B0 - 0x0000)
struct UMG_FieldModCompareTip_C_K2_RefreshWeaponSingleData final
{
public:
	struct FPBRayProjectileConfigRow_Replace      EquippingRayProjectileConfig;                      // 0x0000(0x06A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         Pad_6A8[0x8];                                      // 0x06A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponConfigRow                     EquippingWeaponConfig;                             // 0x06B0(0x0B00)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FieldModCompareTip_C_K2_RefreshWeaponSingleData) == 0x000010, "Wrong alignment on UMG_FieldModCompareTip_C_K2_RefreshWeaponSingleData");
static_assert(sizeof(UMG_FieldModCompareTip_C_K2_RefreshWeaponSingleData) == 0x0011B0, "Wrong size on UMG_FieldModCompareTip_C_K2_RefreshWeaponSingleData");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshWeaponSingleData, EquippingRayProjectileConfig) == 0x000000, "Member 'UMG_FieldModCompareTip_C_K2_RefreshWeaponSingleData::EquippingRayProjectileConfig' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshWeaponSingleData, EquippingWeaponConfig) == 0x0006B0, "Member 'UMG_FieldModCompareTip_C_K2_RefreshWeaponSingleData::EquippingWeaponConfig' has a wrong offset!");

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.K2_RefreshPodCompareData
// 0x02B0 (0x02B0 - 0x0000)
struct UMG_FieldModCompareTip_C_K2_RefreshPodCompareData final
{
public:
	struct FPBPodDescription                      EquippingPodDescription;                           // 0x0000(0x0158)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBPodDescription                      TestingPodDescription;                             // 0x0158(0x0158)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FieldModCompareTip_C_K2_RefreshPodCompareData) == 0x000008, "Wrong alignment on UMG_FieldModCompareTip_C_K2_RefreshPodCompareData");
static_assert(sizeof(UMG_FieldModCompareTip_C_K2_RefreshPodCompareData) == 0x0002B0, "Wrong size on UMG_FieldModCompareTip_C_K2_RefreshPodCompareData");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshPodCompareData, EquippingPodDescription) == 0x000000, "Member 'UMG_FieldModCompareTip_C_K2_RefreshPodCompareData::EquippingPodDescription' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshPodCompareData, TestingPodDescription) == 0x000158, "Member 'UMG_FieldModCompareTip_C_K2_RefreshPodCompareData::TestingPodDescription' has a wrong offset!");

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.K2_RefreshMobilityCompareData
// 0x0200 (0x0200 - 0x0000)
struct UMG_FieldModCompareTip_C_K2_RefreshMobilityCompareData final
{
public:
	struct FPBMobilityDescription                 EquippingMobilityDescription;                      // 0x0000(0x0100)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBMobilityDescription                 TestingMobilityDescription;                        // 0x0100(0x0100)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FieldModCompareTip_C_K2_RefreshMobilityCompareData) == 0x000008, "Wrong alignment on UMG_FieldModCompareTip_C_K2_RefreshMobilityCompareData");
static_assert(sizeof(UMG_FieldModCompareTip_C_K2_RefreshMobilityCompareData) == 0x000200, "Wrong size on UMG_FieldModCompareTip_C_K2_RefreshMobilityCompareData");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshMobilityCompareData, EquippingMobilityDescription) == 0x000000, "Member 'UMG_FieldModCompareTip_C_K2_RefreshMobilityCompareData::EquippingMobilityDescription' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshMobilityCompareData, TestingMobilityDescription) == 0x000100, "Member 'UMG_FieldModCompareTip_C_K2_RefreshMobilityCompareData::TestingMobilityDescription' has a wrong offset!");

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.K2_RefreshWeaponCompareData
// 0x2350 (0x2350 - 0x0000)
struct UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData final
{
public:
	struct FPBRayProjectileConfigRow_Replace      EquippingRayProjectileConfig;                      // 0x0000(0x06A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBRayProjectileConfigRow_Replace      TestingRayProjectileConfig;                        // 0x06A8(0x06A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBWeaponConfigRow                     EquippingWeaponConfig;                             // 0x0D50(0x0B00)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBWeaponConfigRow                     TestingWeaponConfig;                               // 0x1850(0x0B00)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData) == 0x000010, "Wrong alignment on UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData");
static_assert(sizeof(UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData) == 0x002350, "Wrong size on UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData, EquippingRayProjectileConfig) == 0x000000, "Member 'UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData::EquippingRayProjectileConfig' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData, TestingRayProjectileConfig) == 0x0006A8, "Member 'UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData::TestingRayProjectileConfig' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData, EquippingWeaponConfig) == 0x000D50, "Member 'UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData::EquippingWeaponConfig' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData, TestingWeaponConfig) == 0x001850, "Member 'UMG_FieldModCompareTip_C_K2_RefreshWeaponCompareData::TestingWeaponConfig' has a wrong offset!");

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.K2_RefreshMeleeWeaponCompareData
// 0x01D0 (0x01D0 - 0x0000)
struct UMG_FieldModCompareTip_C_K2_RefreshMeleeWeaponCompareData final
{
public:
	struct FPBMeleeWeaponDescription              EquippingMeleeWeaponDescription;                   // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBMeleeWeaponDescription              TestingMeleeWeaponDescription;                     // 0x00E8(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FieldModCompareTip_C_K2_RefreshMeleeWeaponCompareData) == 0x000008, "Wrong alignment on UMG_FieldModCompareTip_C_K2_RefreshMeleeWeaponCompareData");
static_assert(sizeof(UMG_FieldModCompareTip_C_K2_RefreshMeleeWeaponCompareData) == 0x0001D0, "Wrong size on UMG_FieldModCompareTip_C_K2_RefreshMeleeWeaponCompareData");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshMeleeWeaponCompareData, EquippingMeleeWeaponDescription) == 0x000000, "Member 'UMG_FieldModCompareTip_C_K2_RefreshMeleeWeaponCompareData::EquippingMeleeWeaponDescription' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_K2_RefreshMeleeWeaponCompareData, TestingMeleeWeaponDescription) == 0x0000E8, "Member 'UMG_FieldModCompareTip_C_K2_RefreshMeleeWeaponCompareData::TestingMeleeWeaponDescription' has a wrong offset!");

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.Set Weapon Compare Info
// 0x46F0 (0x46F0 - 0x0000)
struct UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info final
{
public:
	struct FPBRayProjectileConfigRow_Replace      InEquippingRay;                                    // 0x0000(0x06A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBRayProjectileConfigRow_Replace      InTestingRay;                                      // 0x06A8(0x06A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBWeaponConfigRow                     InEquippingRow;                                    // 0x0D50(0x0B00)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBWeaponConfigRow                     InTestingRow;                                      // 0x1850(0x0B00)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBWeaponConfigRow                     TestingRow;                                        // 0x2350(0x0B00)(Edit, BlueprintVisible)
	struct FPBWeaponConfigRow                     EquippingRow;                                      // 0x2E50(0x0B00)(Edit, BlueprintVisible)
	struct FPBRayProjectileConfigRow_Replace      TestingRay;                                        // 0x3950(0x06A8)(Edit, BlueprintVisible)
	struct FPBRayProjectileConfigRow_Replace      EquippingRay;                                      // 0x3FF8(0x06A8)(Edit, BlueprintVisible)
	int32                                         CallFunc_CalcAmmoStore_AmmoPerClip;                // 0x46A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcAmmoStore_BackUpAmmos;                // 0x46A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcAmmoStore_AmmoPerClip_1;              // 0x46A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcAmmoStore_BackUpAmmos_1;              // 0x46AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcBulletSpeed_BulletSpeed;              // 0x46B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcBulletSpeed_BulletSpeed_1;            // 0x46B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcNormalDamage_NormalDamage;            // 0x46B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcNormalDamage_NormalDamage_1;          // 0x46BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcADSTargetTime_ADSTargetTime;          // 0x46C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcADSTargetTime_ADSTargetTime_1;        // 0x46C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x46C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x46CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Calc_Weapon_Fire_Rate_FireRate;           // 0x46D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Calc_Weapon_Fire_Rate_FireRate_1;         // 0x46D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcTargetAccuracy_TargetAccuracy;        // 0x46D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcTargetAccuracy_TargetAccuracy_1;      // 0x46DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcVerticalRecoil_VerticalRecoil;        // 0x46E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcVerticalRecoil_VerticalRecoil_1;      // 0x46E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info) == 0x000010, "Wrong alignment on UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info");
static_assert(sizeof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info) == 0x0046F0, "Wrong size on UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, InEquippingRay) == 0x000000, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::InEquippingRay' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, InTestingRay) == 0x0006A8, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::InTestingRay' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, InEquippingRow) == 0x000D50, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::InEquippingRow' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, InTestingRow) == 0x001850, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::InTestingRow' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, TestingRow) == 0x002350, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::TestingRow' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, EquippingRow) == 0x002E50, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::EquippingRow' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, TestingRay) == 0x003950, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::TestingRay' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, EquippingRay) == 0x003FF8, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::EquippingRay' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcAmmoStore_AmmoPerClip) == 0x0046A0, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcAmmoStore_AmmoPerClip' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcAmmoStore_BackUpAmmos) == 0x0046A4, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcAmmoStore_BackUpAmmos' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcAmmoStore_AmmoPerClip_1) == 0x0046A8, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcAmmoStore_AmmoPerClip_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcAmmoStore_BackUpAmmos_1) == 0x0046AC, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcAmmoStore_BackUpAmmos_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcBulletSpeed_BulletSpeed) == 0x0046B0, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcBulletSpeed_BulletSpeed' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcBulletSpeed_BulletSpeed_1) == 0x0046B4, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcBulletSpeed_BulletSpeed_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcNormalDamage_NormalDamage) == 0x0046B8, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcNormalDamage_NormalDamage' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcNormalDamage_NormalDamage_1) == 0x0046BC, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcNormalDamage_NormalDamage_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcADSTargetTime_ADSTargetTime) == 0x0046C0, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcADSTargetTime_ADSTargetTime' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcADSTargetTime_ADSTargetTime_1) == 0x0046C4, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcADSTargetTime_ADSTargetTime_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0046C8, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0046CC, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_Calc_Weapon_Fire_Rate_FireRate) == 0x0046D0, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_Calc_Weapon_Fire_Rate_FireRate' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_Calc_Weapon_Fire_Rate_FireRate_1) == 0x0046D4, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_Calc_Weapon_Fire_Rate_FireRate_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcTargetAccuracy_TargetAccuracy) == 0x0046D8, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcTargetAccuracy_TargetAccuracy' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcTargetAccuracy_TargetAccuracy_1) == 0x0046DC, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcTargetAccuracy_TargetAccuracy_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcVerticalRecoil_VerticalRecoil) == 0x0046E0, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcVerticalRecoil_VerticalRecoil' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info, CallFunc_CalcVerticalRecoil_VerticalRecoil_1) == 0x0046E4, "Member 'UMG_FieldModCompareTip_C_Set_Weapon_Compare_Info::CallFunc_CalcVerticalRecoil_VerticalRecoil_1' has a wrong offset!");

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.Set Mobility Compare Info
// 0x0200 (0x0200 - 0x0000)
struct UMG_FieldModCompareTip_C_Set_Mobility_Compare_Info final
{
public:
	struct FPBMobilityDescription                 EquippingMobility;                                 // 0x0000(0x0100)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBMobilityDescription                 TestingMobility;                                   // 0x0100(0x0100)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FieldModCompareTip_C_Set_Mobility_Compare_Info) == 0x000008, "Wrong alignment on UMG_FieldModCompareTip_C_Set_Mobility_Compare_Info");
static_assert(sizeof(UMG_FieldModCompareTip_C_Set_Mobility_Compare_Info) == 0x000200, "Wrong size on UMG_FieldModCompareTip_C_Set_Mobility_Compare_Info");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Mobility_Compare_Info, EquippingMobility) == 0x000000, "Member 'UMG_FieldModCompareTip_C_Set_Mobility_Compare_Info::EquippingMobility' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Mobility_Compare_Info, TestingMobility) == 0x000100, "Member 'UMG_FieldModCompareTip_C_Set_Mobility_Compare_Info::TestingMobility' has a wrong offset!");

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.Set Pod Compare Info
// 0x02B0 (0x02B0 - 0x0000)
struct UMG_FieldModCompareTip_C_Set_Pod_Compare_Info final
{
public:
	struct FPBPodDescription                      EquippingPod;                                      // 0x0000(0x0158)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBPodDescription                      TestingPod;                                        // 0x0158(0x0158)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FieldModCompareTip_C_Set_Pod_Compare_Info) == 0x000008, "Wrong alignment on UMG_FieldModCompareTip_C_Set_Pod_Compare_Info");
static_assert(sizeof(UMG_FieldModCompareTip_C_Set_Pod_Compare_Info) == 0x0002B0, "Wrong size on UMG_FieldModCompareTip_C_Set_Pod_Compare_Info");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Pod_Compare_Info, EquippingPod) == 0x000000, "Member 'UMG_FieldModCompareTip_C_Set_Pod_Compare_Info::EquippingPod' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Pod_Compare_Info, TestingPod) == 0x000158, "Member 'UMG_FieldModCompareTip_C_Set_Pod_Compare_Info::TestingPod' has a wrong offset!");

// Function UMG_FieldModCompareTip.UMG_FieldModCompareTip_C.Set Melee Weapon Compare Info
// 0x01D0 (0x01D0 - 0x0000)
struct UMG_FieldModCompareTip_C_Set_Melee_Weapon_Compare_Info final
{
public:
	struct FPBMeleeWeaponDescription              EquippingMeleeWeapon;                              // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPBMeleeWeaponDescription              TestingMeleeWeapon;                                // 0x00E8(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FieldModCompareTip_C_Set_Melee_Weapon_Compare_Info) == 0x000008, "Wrong alignment on UMG_FieldModCompareTip_C_Set_Melee_Weapon_Compare_Info");
static_assert(sizeof(UMG_FieldModCompareTip_C_Set_Melee_Weapon_Compare_Info) == 0x0001D0, "Wrong size on UMG_FieldModCompareTip_C_Set_Melee_Weapon_Compare_Info");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Melee_Weapon_Compare_Info, EquippingMeleeWeapon) == 0x000000, "Member 'UMG_FieldModCompareTip_C_Set_Melee_Weapon_Compare_Info::EquippingMeleeWeapon' has a wrong offset!");
static_assert(offsetof(UMG_FieldModCompareTip_C_Set_Melee_Weapon_Compare_Info, TestingMeleeWeapon) == 0x0000E8, "Member 'UMG_FieldModCompareTip_C_Set_Melee_Weapon_Compare_Info::TestingMeleeWeapon' has a wrong offset!");

}

