#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MainMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_MainMenu.UMG_MainMenu_C.ExecuteUbergraph_UMG_MainMenu
// 0x0060 (0x0060 - 0x0000)
struct UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBPartyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPBMatchmakingStatus NewState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	EPBPlayListType                               K2Node_ComponentBoundEvent_InPlayListType_1;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBPlayListType                               K2Node_ComponentBoundEvent_InPlayListType;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu) == 0x000008, "Wrong alignment on UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu");
static_assert(sizeof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu) == 0x000060, "Wrong size on UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, EntryPoint) == 0x000000, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, K2Node_ComponentBoundEvent_InPlayListType_1) == 0x000020, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::K2Node_ComponentBoundEvent_InPlayListType_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, K2Node_ComponentBoundEvent_InPlayListType) == 0x000021, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::K2Node_ComponentBoundEvent_InPlayListType' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000022, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000023, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000028, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'UMG_MainMenu_C_ExecuteUbergraph_UMG_MainMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function UMG_MainMenu.UMG_MainMenu_C.BndEvt__UMG_MainMenu_PVP_K2Node_ComponentBoundEvent_2_StartMatch__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVP_K2Node_ComponentBoundEvent_2_StartMatch__DelegateSignature final
{
public:
	EPBPlayListType                               InPlayListType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVP_K2Node_ComponentBoundEvent_2_StartMatch__DelegateSignature) == 0x000001, "Wrong alignment on UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVP_K2Node_ComponentBoundEvent_2_StartMatch__DelegateSignature");
static_assert(sizeof(UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVP_K2Node_ComponentBoundEvent_2_StartMatch__DelegateSignature) == 0x000001, "Wrong size on UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVP_K2Node_ComponentBoundEvent_2_StartMatch__DelegateSignature");
static_assert(offsetof(UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVP_K2Node_ComponentBoundEvent_2_StartMatch__DelegateSignature, InPlayListType) == 0x000000, "Member 'UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVP_K2Node_ComponentBoundEvent_2_StartMatch__DelegateSignature::InPlayListType' has a wrong offset!");

// Function UMG_MainMenu.UMG_MainMenu_C.BndEvt__UMG_MainMenu_PVE_K2Node_ComponentBoundEvent_1_StartMatch__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVE_K2Node_ComponentBoundEvent_1_StartMatch__DelegateSignature final
{
public:
	EPBPlayListType                               InPlayListType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVE_K2Node_ComponentBoundEvent_1_StartMatch__DelegateSignature) == 0x000001, "Wrong alignment on UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVE_K2Node_ComponentBoundEvent_1_StartMatch__DelegateSignature");
static_assert(sizeof(UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVE_K2Node_ComponentBoundEvent_1_StartMatch__DelegateSignature) == 0x000001, "Wrong size on UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVE_K2Node_ComponentBoundEvent_1_StartMatch__DelegateSignature");
static_assert(offsetof(UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVE_K2Node_ComponentBoundEvent_1_StartMatch__DelegateSignature, InPlayListType) == 0x000000, "Member 'UMG_MainMenu_C_BndEvt__UMG_MainMenu_PVE_K2Node_ComponentBoundEvent_1_StartMatch__DelegateSignature::InPlayListType' has a wrong offset!");

// Function UMG_MainMenu.UMG_MainMenu_C.OnMouseButtonDown
// 0x02D0 (0x02D0 - 0x0000)
struct UMG_MainMenu_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	struct FEventReply                            CallFunc_OnMouseButtonDown_ReturnValue;            // 0x0218(0x00B8)()
};
static_assert(alignof(UMG_MainMenu_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UMG_MainMenu_C_OnMouseButtonDown");
static_assert(sizeof(UMG_MainMenu_C_OnMouseButtonDown) == 0x0002D0, "Wrong size on UMG_MainMenu_C_OnMouseButtonDown");
static_assert(offsetof(UMG_MainMenu_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UMG_MainMenu_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UMG_MainMenu_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UMG_MainMenu_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_MainMenu_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_OnMouseButtonDown, CallFunc_OnMouseButtonDown_ReturnValue) == 0x000218, "Member 'UMG_MainMenu_C_OnMouseButtonDown::CallFunc_OnMouseButtonDown_ReturnValue' has a wrong offset!");

// Function UMG_MainMenu.UMG_MainMenu_C.InitializeFocus
// 0x0018 (0x0018 - 0x0000)
struct UMG_MainMenu_C_InitializeFocus final
{
public:
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_1;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MainMenu_C_InitializeFocus) == 0x000008, "Wrong alignment on UMG_MainMenu_C_InitializeFocus");
static_assert(sizeof(UMG_MainMenu_C_InitializeFocus) == 0x000018, "Wrong size on UMG_MainMenu_C_InitializeFocus");
static_assert(offsetof(UMG_MainMenu_C_InitializeFocus, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000000, "Member 'UMG_MainMenu_C_InitializeFocus::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_InitializeFocus, CallFunc_GetDesiredFocusTarget_ReturnValue_1) == 0x000008, "Member 'UMG_MainMenu_C_InitializeFocus::CallFunc_GetDesiredFocusTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_InitializeFocus, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'UMG_MainMenu_C_InitializeFocus::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function UMG_MainMenu.UMG_MainMenu_C.On Matching State Changed
// 0x0038 (0x0038 - 0x0000)
struct UMG_MainMenu_C_On_Matching_State_Changed final
{
public:
	EPBMatchmakingStatus                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchmaking_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBPartyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyLeader_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBPartyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyLeader_ReturnValue_1;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MainMenu_C_On_Matching_State_Changed) == 0x000008, "Wrong alignment on UMG_MainMenu_C_On_Matching_State_Changed");
static_assert(sizeof(UMG_MainMenu_C_On_Matching_State_Changed) == 0x000038, "Wrong size on UMG_MainMenu_C_On_Matching_State_Changed");
static_assert(offsetof(UMG_MainMenu_C_On_Matching_State_Changed, NewState) == 0x000000, "Member 'UMG_MainMenu_C_On_Matching_State_Changed::NewState' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_On_Matching_State_Changed, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_MainMenu_C_On_Matching_State_Changed::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_On_Matching_State_Changed, CallFunc_IsMatchmaking_ReturnValue) == 0x000010, "Member 'UMG_MainMenu_C_On_Matching_State_Changed::CallFunc_IsMatchmaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_On_Matching_State_Changed, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'UMG_MainMenu_C_On_Matching_State_Changed::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_On_Matching_State_Changed, CallFunc_IsPartyLeader_ReturnValue) == 0x000020, "Member 'UMG_MainMenu_C_On_Matching_State_Changed::CallFunc_IsPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_On_Matching_State_Changed, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'UMG_MainMenu_C_On_Matching_State_Changed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_On_Matching_State_Changed, CallFunc_Not_PreBool_ReturnValue_1) == 0x000022, "Member 'UMG_MainMenu_C_On_Matching_State_Changed::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_On_Matching_State_Changed, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000028, "Member 'UMG_MainMenu_C_On_Matching_State_Changed::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_On_Matching_State_Changed, CallFunc_IsPartyLeader_ReturnValue_1) == 0x000030, "Member 'UMG_MainMenu_C_On_Matching_State_Changed::CallFunc_IsPartyLeader_ReturnValue_1' has a wrong offset!");

// Function UMG_MainMenu.UMG_MainMenu_C.OnPromoteMemberFinished
// 0x0010 (0x0010 - 0x0000)
struct UMG_MainMenu_C_OnPromoteMemberFinished final
{
public:
	class UPBPartyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyLeader_ReturnValue;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MainMenu_C_OnPromoteMemberFinished) == 0x000008, "Wrong alignment on UMG_MainMenu_C_OnPromoteMemberFinished");
static_assert(sizeof(UMG_MainMenu_C_OnPromoteMemberFinished) == 0x000010, "Wrong size on UMG_MainMenu_C_OnPromoteMemberFinished");
static_assert(offsetof(UMG_MainMenu_C_OnPromoteMemberFinished, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_MainMenu_C_OnPromoteMemberFinished::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_OnPromoteMemberFinished, CallFunc_IsPartyLeader_ReturnValue) == 0x000008, "Member 'UMG_MainMenu_C_OnPromoteMemberFinished::CallFunc_IsPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_OnPromoteMemberFinished, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'UMG_MainMenu_C_OnPromoteMemberFinished::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function UMG_MainMenu.UMG_MainMenu_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct UMG_MainMenu_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MainMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_MainMenu_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_MainMenu_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on UMG_MainMenu_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_MainMenu_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_MainMenu_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenu_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_MainMenu_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

