#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Aiming_Point

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_Aiming_Point.UMG_Aiming_Point_C.ExecuteUbergraph_UMG_Aiming_Point
// 0x0058 (0x0058 - 0x0000)
struct UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point) == 0x000008, "Wrong alignment on UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point");
static_assert(sizeof(UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point) == 0x000058, "Wrong size on UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point");
static_assert(offsetof(UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point, EntryPoint) == 0x000000, "Member 'UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point, K2Node_Event_MyGeometry) == 0x000004, "Member 'UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000050, "Member 'UMG_Aiming_Point_C_ExecuteUbergraph_UMG_Aiming_Point::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function UMG_Aiming_Point.UMG_Aiming_Point_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_Aiming_Point_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Aiming_Point_C_Tick) == 0x000004, "Wrong alignment on UMG_Aiming_Point_C_Tick");
static_assert(sizeof(UMG_Aiming_Point_C_Tick) == 0x00003C, "Wrong size on UMG_Aiming_Point_C_Tick");
static_assert(offsetof(UMG_Aiming_Point_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_Aiming_Point_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_Aiming_Point_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_Aiming_Point.UMG_Aiming_Point_C.GetOnScreenPos
// 0x00F8 (0x00F8 - 0x0000)
struct UMG_Aiming_Point_C_GetOnScreenPos final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TL_0;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BR_0;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               CallFunc_GetAnchors_ReturnValue;                   // 0x0030(0x0010)(NoDestructor)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchorData                            CallFunc_GetLayout_ReturnValue;                    // 0x0058(0x0028)(NoDestructor)
	float                                         CallFunc_GetViewportScale_ReturnValue_1;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue_1;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_2;     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Aiming_Point_C_GetOnScreenPos) == 0x000008, "Wrong alignment on UMG_Aiming_Point_C_GetOnScreenPos");
static_assert(sizeof(UMG_Aiming_Point_C_GetOnScreenPos) == 0x0000F8, "Wrong size on UMG_Aiming_Point_C_GetOnScreenPos");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, Widget) == 0x000000, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::Widget' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, TL_0) == 0x000008, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::TL_0' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, BR_0) == 0x000010, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::BR_0' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_GetViewportScale_ReturnValue) == 0x000018, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_GetAnchors_ReturnValue) == 0x000030, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_GetAnchors_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_GetPosition_ReturnValue) == 0x000040, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_BreakVector2D_X) == 0x000048, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_BreakVector2D_Y) == 0x00004C, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_BreakVector2D_X_1) == 0x000050, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_BreakVector2D_Y_1) == 0x000054, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_GetLayout_ReturnValue) == 0x000058, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_GetLayout_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_GetViewportScale_ReturnValue_1) == 0x000080, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_GetViewportScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000084, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_GetViewportSize_ReturnValue) == 0x000088, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_MakeVector2D_ReturnValue) == 0x000090, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_BreakVector2D_X_2) == 0x000098, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_BreakVector2D_Y_2) == 0x00009C, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x0000A0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A8, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_BreakVector2D_X_3) == 0x0000B0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_BreakVector2D_Y_3) == 0x0000B4, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000B8, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000C0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Multiply_Vector2DFloat_ReturnValue_1) == 0x0000C4, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Multiply_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000CC, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000D0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000D8, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_GetViewportSize_ReturnValue_1) == 0x0000E0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_GetViewportSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Multiply_Vector2DFloat_ReturnValue_2) == 0x0000E8, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Multiply_Vector2DFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x0000F0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");

// Function UMG_Aiming_Point.UMG_Aiming_Point_C.GetOnScreenPos_Any
// 0x00F8 (0x00F8 - 0x0000)
struct UMG_Aiming_Point_C_GetOnScreenPos_Any final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TL_0;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BR_0;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               CallFunc_GetAnchors_ReturnValue;                   // 0x0030(0x0010)(NoDestructor)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchorData                            CallFunc_GetLayout_ReturnValue;                    // 0x0058(0x0028)(NoDestructor)
	float                                         CallFunc_GetViewportScale_ReturnValue_1;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue_1;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_2;     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Aiming_Point_C_GetOnScreenPos_Any) == 0x000008, "Wrong alignment on UMG_Aiming_Point_C_GetOnScreenPos_Any");
static_assert(sizeof(UMG_Aiming_Point_C_GetOnScreenPos_Any) == 0x0000F8, "Wrong size on UMG_Aiming_Point_C_GetOnScreenPos_Any");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, Widget) == 0x000000, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::Widget' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, TL_0) == 0x000008, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::TL_0' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, BR_0) == 0x000010, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::BR_0' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_GetViewportScale_ReturnValue) == 0x000018, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_GetAnchors_ReturnValue) == 0x000030, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_GetAnchors_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_GetPosition_ReturnValue) == 0x000040, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_BreakVector2D_X) == 0x000048, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_BreakVector2D_Y) == 0x00004C, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_BreakVector2D_X_1) == 0x000050, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_BreakVector2D_Y_1) == 0x000054, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_GetLayout_ReturnValue) == 0x000058, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_GetLayout_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_GetViewportScale_ReturnValue_1) == 0x000080, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_GetViewportScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000084, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_GetViewportSize_ReturnValue) == 0x000088, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_MakeVector2D_ReturnValue) == 0x000090, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_BreakVector2D_X_2) == 0x000098, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_BreakVector2D_Y_2) == 0x00009C, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x0000A0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A8, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_BreakVector2D_X_3) == 0x0000B0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_BreakVector2D_Y_3) == 0x0000B4, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000B8, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000C0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Multiply_Vector2DFloat_ReturnValue_1) == 0x0000C4, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Multiply_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000CC, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000D0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000D8, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_GetViewportSize_ReturnValue_1) == 0x0000E0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_GetViewportSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Multiply_Vector2DFloat_ReturnValue_2) == 0x0000E8, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Multiply_Vector2DFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_GetOnScreenPos_Any, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x0000F0, "Member 'UMG_Aiming_Point_C_GetOnScreenPos_Any::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");

// Function UMG_Aiming_Point.UMG_Aiming_Point_C.AimLeftAndRightShow
// 0x0001 (0x0001 - 0x0000)
struct UMG_Aiming_Point_C_AimLeftAndRightShow final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Aiming_Point_C_AimLeftAndRightShow) == 0x000001, "Wrong alignment on UMG_Aiming_Point_C_AimLeftAndRightShow");
static_assert(sizeof(UMG_Aiming_Point_C_AimLeftAndRightShow) == 0x000001, "Wrong size on UMG_Aiming_Point_C_AimLeftAndRightShow");
static_assert(offsetof(UMG_Aiming_Point_C_AimLeftAndRightShow, bShow) == 0x000000, "Member 'UMG_Aiming_Point_C_AimLeftAndRightShow::bShow' has a wrong offset!");

// Function UMG_Aiming_Point.UMG_Aiming_Point_C.CrossHairMainGE_Change
// 0x00E0 (0x00E0 - 0x0000)
struct UMG_Aiming_Point_C_CrossHairMainGE_Change final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargeting_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBWeapon*                              CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentSpread_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Aiming_Point_C_CrossHairMainGE_Change) == 0x000008, "Wrong alignment on UMG_Aiming_Point_C_CrossHairMainGE_Change");
static_assert(sizeof(UMG_Aiming_Point_C_CrossHairMainGE_Change) == 0x0000E0, "Wrong size on UMG_Aiming_Point_C_CrossHairMainGE_Change");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, MyGeometry) == 0x000000, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_GetAbsoluteSize_ReturnValue) == 0x000038, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_BreakVector2D_X) == 0x000040, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_BreakVector2D_Y) == 0x000044, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_K2_GetPawn_ReturnValue) == 0x000058, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, K2Node_DynamicCast_AsPBCharacter) == 0x000060, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::K2Node_DynamicCast_AsPBCharacter' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_IsTargeting_ReturnValue) == 0x000069, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_IsTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000070, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_GetCurrentSpread_ReturnValue) == 0x00007C, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_GetCurrentSpread_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Add_FloatFloat_ReturnValue) == 0x000084, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_SafeDivide_ReturnValue) == 0x000088, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_BreakVector2D_X_1) == 0x00008C, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_BreakVector2D_Y_1) == 0x000090, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000094, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000098, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00009C, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A4, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_MakeVector2D_ReturnValue) == 0x0000A8, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000B0, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0000B8, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000BC, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000C4, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_MakeVector2D_ReturnValue_3) == 0x0000CC, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000D4, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_CrossHairMainGE_Change, CallFunc_FInterpTo_ReturnValue) == 0x0000D8, "Member 'UMG_Aiming_Point_C_CrossHairMainGE_Change::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function UMG_Aiming_Point.UMG_Aiming_Point_C.SetAimPointNewForce
// 0x000C (0x000C - 0x0000)
struct UMG_Aiming_Point_C_SetAimPointNewForce final
{
public:
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Aiming_Point_C_SetAimPointNewForce) == 0x000004, "Wrong alignment on UMG_Aiming_Point_C_SetAimPointNewForce");
static_assert(sizeof(UMG_Aiming_Point_C_SetAimPointNewForce) == 0x00000C, "Wrong size on UMG_Aiming_Point_C_SetAimPointNewForce");
static_assert(offsetof(UMG_Aiming_Point_C_SetAimPointNewForce, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000000, "Member 'UMG_Aiming_Point_C_SetAimPointNewForce::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_SetAimPointNewForce, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'UMG_Aiming_Point_C_SetAimPointNewForce::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_SetAimPointNewForce, CallFunc_FInterpTo_ReturnValue) == 0x000008, "Member 'UMG_Aiming_Point_C_SetAimPointNewForce::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function UMG_Aiming_Point.UMG_Aiming_Point_C.FadeOut
// 0x0020 (0x0020 - 0x0000)
struct UMG_Aiming_Point_C_FadeOut final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Aiming_Point_C_FadeOut) == 0x000008, "Wrong alignment on UMG_Aiming_Point_C_FadeOut");
static_assert(sizeof(UMG_Aiming_Point_C_FadeOut) == 0x000020, "Wrong size on UMG_Aiming_Point_C_FadeOut");
static_assert(offsetof(UMG_Aiming_Point_C_FadeOut, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_Aiming_Point_C_FadeOut::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_FadeOut, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'UMG_Aiming_Point_C_FadeOut::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Aiming_Point_C_FadeOut, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'UMG_Aiming_Point_C_FadeOut::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function UMG_Aiming_Point.UMG_Aiming_Point_C.FadeIn
// 0x0008 (0x0008 - 0x0000)
struct UMG_Aiming_Point_C_FadeIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Aiming_Point_C_FadeIn) == 0x000008, "Wrong alignment on UMG_Aiming_Point_C_FadeIn");
static_assert(sizeof(UMG_Aiming_Point_C_FadeIn) == 0x000008, "Wrong size on UMG_Aiming_Point_C_FadeIn");
static_assert(offsetof(UMG_Aiming_Point_C_FadeIn, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_Aiming_Point_C_FadeIn::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

