#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_IngameHUD_WeaponInfo_WeaponName

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_IngameHUD_WeaponInfo_WeaponName.UMG_IngameHUD_WeaponInfo_WeaponName_C
// 0x0070 (0x0300 - 0x0290)
class UUMG_IngameHUD_WeaponInfo_WeaponName_C final : public UPBHelmetHUD_WeaponInventory
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_WeaponReloading;                              // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_WeaponUnploying;                              // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_WeaponReady;                                  // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_WeaponDeploying;                              // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Default;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_WeaponBG;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_WeaponDeployed;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_WeaponIcon;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      Img_OperationInst;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_WeaponName;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   InputName_KeyBoard;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InputName_Gamepad;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_IngameHUD_WeaponInfo_WeaponName(int32 EntryPoint);
	void WidgetAnimationEvt_Anim_WeaponReloading_K2Node_WidgetAnimationEvent_1();
	void K2_RefreshDeployedWeaponReloadInterruptInfo();
	void K2_RefreshDeployedWeaponReloadInfo(const float ReloadDuration);
	void K2_RefreshUndeployedWeaponInfo();
	void WidgetAnimationEvt_Anim_WeaponDeploying_K2Node_WidgetAnimationEvent_0();
	void K2_RefreshDeployedWeaponAmmoInfo();
	void K2_RefreshDeployedWeaponInfo();
	void K2_RefreshOwningWeaponInfo();
	void RefreshWeaponDisplayName();
	void RefreshWeaponIcon();
	void OnInputDeviceSwitched(EInputDevice CurrentDevice);
	void RefreshAmmoInclipInfo(class UImage* InImage);
	void RefreshRemainingAmmoInfo(class UImage* InImage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_IngameHUD_WeaponInfo_WeaponName_C">();
	}
	static class UUMG_IngameHUD_WeaponInfo_WeaponName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_IngameHUD_WeaponInfo_WeaponName_C>();
	}
};
static_assert(alignof(UUMG_IngameHUD_WeaponInfo_WeaponName_C) == 0x000008, "Wrong alignment on UUMG_IngameHUD_WeaponInfo_WeaponName_C");
static_assert(sizeof(UUMG_IngameHUD_WeaponInfo_WeaponName_C) == 0x000300, "Wrong size on UUMG_IngameHUD_WeaponInfo_WeaponName_C");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, UberGraphFrame) == 0x000290, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Anim_WeaponReloading) == 0x000298, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Anim_WeaponReloading' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Anim_WeaponUnploying) == 0x0002A0, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Anim_WeaponUnploying' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Anim_WeaponReady) == 0x0002A8, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Anim_WeaponReady' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Anim_WeaponDeploying) == 0x0002B0, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Anim_WeaponDeploying' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, CanvasPanel_0) == 0x0002B8, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Image_Default) == 0x0002C0, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Image_Default' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Image_WeaponBG) == 0x0002C8, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Image_WeaponBG' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Image_WeaponDeployed) == 0x0002D0, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Image_WeaponDeployed' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Image_WeaponIcon) == 0x0002D8, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Image_WeaponIcon' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Img_OperationInst) == 0x0002E0, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Img_OperationInst' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, Tex_WeaponName) == 0x0002E8, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::Tex_WeaponName' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, InputName_KeyBoard) == 0x0002F0, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::InputName_KeyBoard' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_WeaponInfo_WeaponName_C, InputName_Gamepad) == 0x0002F8, "Member 'UUMG_IngameHUD_WeaponInfo_WeaponName_C::InputName_Gamepad' has a wrong offset!");

}

