#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NewItemPageForRedemption

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_NewItemPageForRedemption.UMG_NewItemPageForRedemption_C.ExecuteUbergraph_UMG_NewItemPageForRedemption
// 0x0010 (0x0010 - 0x0000)
struct UMG_NewItemPageForRedemption_C_ExecuteUbergraph_UMG_NewItemPageForRedemption final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NewItemPageForRedemption_C_ExecuteUbergraph_UMG_NewItemPageForRedemption) == 0x000008, "Wrong alignment on UMG_NewItemPageForRedemption_C_ExecuteUbergraph_UMG_NewItemPageForRedemption");
static_assert(sizeof(UMG_NewItemPageForRedemption_C_ExecuteUbergraph_UMG_NewItemPageForRedemption) == 0x000010, "Wrong size on UMG_NewItemPageForRedemption_C_ExecuteUbergraph_UMG_NewItemPageForRedemption");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_ExecuteUbergraph_UMG_NewItemPageForRedemption, EntryPoint) == 0x000000, "Member 'UMG_NewItemPageForRedemption_C_ExecuteUbergraph_UMG_NewItemPageForRedemption::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_ExecuteUbergraph_UMG_NewItemPageForRedemption, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'UMG_NewItemPageForRedemption_C_ExecuteUbergraph_UMG_NewItemPageForRedemption::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_NewItemPageForRedemption.UMG_NewItemPageForRedemption_C.RefreshItemList
// 0x0118 (0x0118 - 0x0000)
struct UMG_NewItemPageForRedemption_C_RefreshItemList final
{
public:
	EPBProgressionRewardItemStatus                Status;                                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemDescription                     CallFunc_GetItemDescription_ReturnValue;           // 0x0030(0x00B0)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_RedemptionCodeRewardItem_C*        CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NewItemPageForRedemption_C_RefreshItemList) == 0x000008, "Wrong alignment on UMG_NewItemPageForRedemption_C_RefreshItemList");
static_assert(sizeof(UMG_NewItemPageForRedemption_C_RefreshItemList) == 0x000118, "Wrong size on UMG_NewItemPageForRedemption_C_RefreshItemList");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, Status) == 0x000000, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::Status' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, K2Node_MakeStruct_Margin) == 0x000010, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_Array_Get_Item) == 0x000020, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_GetItemDescription_ReturnValue) == 0x000030, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E1, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000E2, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E8, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_BooleanOR_ReturnValue) == 0x0000F0, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, CallFunc_AddChild_ReturnValue) == 0x000100, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000108, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_RefreshItemList, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'UMG_NewItemPageForRedemption_C_RefreshItemList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_NewItemPageForRedemption.UMG_NewItemPageForRedemption_C.SetItemIDArray
// 0x0010 (0x0010 - 0x0000)
struct UMG_NewItemPageForRedemption_C_SetItemIDArray final
{
public:
	TArray<class FName>                           InItemIDArray;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_NewItemPageForRedemption_C_SetItemIDArray) == 0x000008, "Wrong alignment on UMG_NewItemPageForRedemption_C_SetItemIDArray");
static_assert(sizeof(UMG_NewItemPageForRedemption_C_SetItemIDArray) == 0x000010, "Wrong size on UMG_NewItemPageForRedemption_C_SetItemIDArray");
static_assert(offsetof(UMG_NewItemPageForRedemption_C_SetItemIDArray, InItemIDArray) == 0x000000, "Member 'UMG_NewItemPageForRedemption_C_SetItemIDArray::InItemIDArray' has a wrong offset!");

}

