#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameScoreboardPage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_EndGameScoreboardPage.UMG_EndGameScoreboardPage_C.ExecuteUbergraph_UMG_EndGameScoreboardPage
// 0x0138 (0x0138 - 0x0000)
struct UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBTeam                                       Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBTeam                                       Temp_byte_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBEndGamePlayerScoreInfo              CallFunc_Array_Get_Item;                           // 0x0040(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_EndGamePlayerScoreWidget_C*        K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_1;                           // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_EndGamePlayerScoreWidget_C*        K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget_1; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_EndGamePlayerScoreWidget_C*        K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget_2; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_EndGamePlayerScoreWidget_C*        K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget_3; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage) == 0x000008, "Wrong alignment on UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage");
static_assert(sizeof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage) == 0x000138, "Wrong size on UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, EntryPoint) == 0x000000, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_bool_Variable) == 0x000004, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_bool_Variable_1) == 0x000005, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_bool_Variable_2) == 0x000006, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_bool_Variable_3) == 0x000007, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_byte_Variable) == 0x000008, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_int_Variable) == 0x00000C, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_int_Array_Index_Variable) == 0x000010, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_bool_Variable_4) == 0x000020, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_int_Array_Index_Variable_2) == 0x00002C, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_int_Loop_Counter_Variable_2) == 0x000030, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_Event_IsDesignTime) == 0x000038, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_byte_Variable_1) == 0x000039, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_bool_Variable_5) == 0x00003A, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Array_Get_Item) == 0x000040, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_bool_Variable_6) == 0x000085, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000086, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_Select_Default) == 0x000087, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Map_Find_Value) == 0x000088, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Map_Find_ReturnValue) == 0x00008C, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Map_Find_Value_1) == 0x000090, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Map_Find_ReturnValue_1) == 0x000094, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_GetChildAt_ReturnValue) == 0x000098, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000A0, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_IsValid_ReturnValue) == 0x0000A4, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget) == 0x0000A8, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_bool_Variable_7) == 0x0000B1, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_Select_Default_1) == 0x0000B2, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_GetChildAt_ReturnValue_1) == 0x0000B8, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget_1) == 0x0000C8, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, Temp_int_Variable_1) == 0x0000D4, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000D8, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_GetAllChildren_ReturnValue) == 0x0000E0, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_GetAllChildren_ReturnValue_1) == 0x0000F0, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Array_Get_Item_1) == 0x000100, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Array_Get_Item_2) == 0x000108, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget_2) == 0x000110, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget_3) == 0x000120, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_DynamicCast_AsUMG_End_Game_Player_Score_Widget_3' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Array_Length_ReturnValue_1) == 0x00012C, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Array_Length_ReturnValue_2) == 0x000130, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Less_IntInt_ReturnValue_1) == 0x000134, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage, CallFunc_Less_IntInt_ReturnValue_2) == 0x000135, "Member 'UMG_EndGameScoreboardPage_C_ExecuteUbergraph_UMG_EndGameScoreboardPage::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function UMG_EndGameScoreboardPage.UMG_EndGameScoreboardPage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_EndGameScoreboardPage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EndGameScoreboardPage_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_EndGameScoreboardPage_C_PreConstruct");
static_assert(sizeof(UMG_EndGameScoreboardPage_C_PreConstruct) == 0x000001, "Wrong size on UMG_EndGameScoreboardPage_C_PreConstruct");
static_assert(offsetof(UMG_EndGameScoreboardPage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_EndGameScoreboardPage_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

