#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Benchmark_Chart

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_Benchmark_Chart.UMG_Benchmark_Chart_C.ExecuteUbergraph_UMG_Benchmark_Chart
// 0x0048 (0x0048 - 0x0000)
struct UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBBM_Subsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart) == 0x000008, "Wrong alignment on UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart");
static_assert(sizeof(UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart) == 0x000048, "Wrong size on UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart");
static_assert(offsetof(UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart, EntryPoint) == 0x000000, "Member 'UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart, K2Node_Event_MyGeometry) == 0x000004, "Member 'UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'UMG_Benchmark_Chart_C_ExecuteUbergraph_UMG_Benchmark_Chart::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_Benchmark_Chart.UMG_Benchmark_Chart_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_Benchmark_Chart_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Benchmark_Chart_C_Tick) == 0x000004, "Wrong alignment on UMG_Benchmark_Chart_C_Tick");
static_assert(sizeof(UMG_Benchmark_Chart_C_Tick) == 0x00003C, "Wrong size on UMG_Benchmark_Chart_C_Tick");
static_assert(offsetof(UMG_Benchmark_Chart_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_Benchmark_Chart_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_Benchmark_Chart_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_Benchmark_Chart.UMG_Benchmark_Chart_C.Init
// 0x02B0 (0x02B0 - 0x0000)
struct UMG_Benchmark_Chart_C_Init final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         XDuration;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0xC];                                       // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_1;                // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_2;                // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_3;                // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_5;        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_7;                        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_7;                        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_6;        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_7;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_8;                        // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_8;                        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_8;        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBBM_Subsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0178(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_9;                        // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_9;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0xC];                                      // 0x01A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_4;                // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_4;          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_5;          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x01D8(0x0018)()
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_5;                // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_10;                       // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_10;                       // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_9;        // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_11;                       // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_11;                       // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_12;                       // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_12;                       // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_10;       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MinOfIntArray_IndexOfMinValue;            // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MinOfIntArray_MinValue;                   // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MaxOfIntArray_IndexOfMaxValue;            // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MaxOfIntArray_MaxValue;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_5;            // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_6;          // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_6;            // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_8;                  // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Benchmark_Chart_C_Init) == 0x000010, "Wrong alignment on UMG_Benchmark_Chart_C_Init");
static_assert(sizeof(UMG_Benchmark_Chart_C_Init) == 0x0002B0, "Wrong size on UMG_Benchmark_Chart_C_Init");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, Geometry) == 0x000000, "Member 'UMG_Benchmark_Chart_C_Init::Geometry' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, XDuration) == 0x000038, "Member 'UMG_Benchmark_Chart_C_Init::XDuration' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_GetLocalSize_ReturnValue) == 0x00003C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X) == 0x000044, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y) == 0x000048, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_1) == 0x00004C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_1) == 0x000050, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000054, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000058, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000059, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'UMG_Benchmark_Chart_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MakeVector2D_ReturnValue) == 0x000064, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, Temp_int_Array_Index_Variable) == 0x000070, "Member 'UMG_Benchmark_Chart_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000074, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, Temp_int_Variable) == 0x000078, "Member 'UMG_Benchmark_Chart_C_Init::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_2) == 0x000080, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_2) == 0x000084, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000088, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_3) == 0x00008C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_3) == 0x000090, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MakeVector4_ReturnValue) == 0x0000A0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x0000B0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Add_ReturnValue) == 0x0000B4, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MakeVector4_ReturnValue_1) == 0x0000C0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MakeVector4_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Add_ReturnValue_1) == 0x0000D0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_4) == 0x0000D4, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_4) == 0x0000D8, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MakeVector4_ReturnValue_2) == 0x0000E0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MakeVector4_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Add_ReturnValue_2) == 0x0000F0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_5) == 0x0000F4, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_5) == 0x0000F8, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_4) == 0x0000FC, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MakeVector4_ReturnValue_3) == 0x000100, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MakeVector4_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Add_ReturnValue_3) == 0x000110, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000114, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_6) == 0x000118, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_6' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_6) == 0x00011C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_6' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000120, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_5) == 0x000124, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000128, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00012C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_FTrunc_ReturnValue) == 0x000130, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_7) == 0x000134, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_7' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_7) == 0x000138, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_7' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_6) == 0x00013C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000140, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_FTrunc_ReturnValue_1) == 0x000144, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_7) == 0x000148, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_8) == 0x00014C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_8' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_8) == 0x000150, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_8' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000154, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_8) == 0x000158, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x00015C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Add_FloatFloat_ReturnValue) == 0x000160, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000164, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MapRangeClamped_ReturnValue) == 0x000168, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Round_ReturnValue) == 0x00016C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000170, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Conv_IntToText_ReturnValue) == 0x000178, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Add_ReturnValue_4) == 0x000190, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000194, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Multiply_IntFloat_ReturnValue_3) == 0x000198, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Multiply_IntFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_9) == 0x00019C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_9' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_9) == 0x0001A0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_9' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MakeVector4_ReturnValue_4) == 0x0001B0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MakeVector4_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, Temp_int_Variable_1) == 0x0001C0, "Member 'UMG_Benchmark_Chart_C_Init::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Add_ReturnValue_5) == 0x0001C4, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Multiply_IntFloat_ReturnValue_4) == 0x0001C8, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Multiply_IntFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Multiply_IntFloat_ReturnValue_5) == 0x0001CC, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Multiply_IntFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Round_ReturnValue_1) == 0x0001D0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0001D4, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0001D8, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MakeVector4_ReturnValue_5) == 0x0001F0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MakeVector4_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Add_ReturnValue_6) == 0x000200, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Add_ReturnValue_7) == 0x000204, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Add_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000208, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Add_IntInt_ReturnValue_2) == 0x00020C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Length_ReturnValue) == 0x000210, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_10) == 0x000214, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_10' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_10) == 0x000218, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_10' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x00021C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x000220, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Less_FloatFloat_ReturnValue) == 0x000224, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_SelectFloat_ReturnValue) == 0x000228, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_9) == 0x00022C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_11) == 0x000230, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_11' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_11) == 0x000234, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_11' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x000238, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00023C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_SelectFloat_ReturnValue_1) == 0x000240, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_X_12) == 0x000244, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_X_12' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BreakVector2D_Y_12) == 0x000248, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BreakVector2D_Y_12' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue_10) == 0x00024C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Length_ReturnValue_1) == 0x000250, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MinOfIntArray_IndexOfMinValue) == 0x000254, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MinOfIntArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MinOfIntArray_MinValue) == 0x000258, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MinOfIntArray_MinValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x00025C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Conv_IntToFloat_ReturnValue_4) == 0x000260, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Conv_IntToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Divide_FloatFloat_ReturnValue_6) == 0x000264, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Divide_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MaxOfIntArray_IndexOfMaxValue) == 0x000268, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MaxOfIntArray_IndexOfMaxValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MaxOfIntArray_MaxValue) == 0x00026C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MaxOfIntArray_MaxValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Conv_IntToFloat_ReturnValue_5) == 0x000270, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Conv_IntToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Length_ReturnValue_2) == 0x000274, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000278, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Multiply_IntFloat_ReturnValue_6) == 0x00027C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Multiply_IntFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BooleanOR_ReturnValue) == 0x000280, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000284, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BooleanOR_ReturnValue_1) == 0x000288, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_BooleanOR_ReturnValue_2) == 0x000289, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Get_Item) == 0x00028C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Length_ReturnValue_3) == 0x000290, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Conv_IntToFloat_ReturnValue_6) == 0x000294, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Conv_IntToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x000298, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MapRangeClamped_ReturnValue_1) == 0x00029C, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_MakeVector2D_ReturnValue_1) == 0x0002A0, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_Init, CallFunc_Array_Add_ReturnValue_8) == 0x0002A8, "Member 'UMG_Benchmark_Chart_C_Init::CallFunc_Array_Add_ReturnValue_8' has a wrong offset!");

// Function UMG_Benchmark_Chart.UMG_Benchmark_Chart_C.OnPaint
// 0x0130 (0x0130 - 0x0000)
struct UMG_Benchmark_Chart_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FPaintContext                          LocalContext;                                      // 0x0030(0x0030)(Edit, BlueprintVisible, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_Array_Get_Item;                           // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0xC];                                       // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector4_X;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Y;                           // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Z;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_W;                           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_Array_Get_Item_2;                         // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_X_1;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Y_1;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Z_1;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_W_1;                         // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Benchmark_Chart_C_OnPaint) == 0x000010, "Wrong alignment on UMG_Benchmark_Chart_C_OnPaint");
static_assert(sizeof(UMG_Benchmark_Chart_C_OnPaint) == 0x000130, "Wrong size on UMG_Benchmark_Chart_C_OnPaint");
static_assert(offsetof(UMG_Benchmark_Chart_C_OnPaint, Context) == 0x000000, "Member 'UMG_Benchmark_Chart_C_OnPaint::Context' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_OnPaint, LocalContext) == 0x000030, "Member 'UMG_Benchmark_Chart_C_OnPaint::LocalContext' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_OnPaint, Temp_int_Array_Index_Variable) == 0x000060, "Member 'UMG_Benchmark_Chart_C_OnPaint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_OnPaint, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'UMG_Benchmark_Chart_C_OnPaint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_OnPaint, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'UMG_Benchmark_Chart_C_OnPaint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_OnPaint, Temp_int_Array_Index_Variable_1) == 0x00006C, "Member 'UMG_Benchmark_Chart_C_OnPaint::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_OnPaint, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'UMG_Benchmark_Chart_C_OnPaint::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_OnPaint, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'UMG_Benchmark_Chart_C_OnPaint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Chart_C_OnPaint, Temp_int_Array_Index_Variable_2) == 0x000078, "Member 'UMG_Benchmark_Chart_C_OnPaint::Temp_int_Array_Index_Variable_2' has a wrong offset!");
