#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_HotZone

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_STD_HotZone.UMG_STD_HotZone_C.ExecuteUbergraph_UMG_STD_HotZone
// 0x001C (0x001C - 0x0000)
struct UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x000C(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0014(0x0008)(NoDestructor)
};
static_assert(alignof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone) == 0x000004, "Wrong alignment on UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone");
static_assert(sizeof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone) == 0x00001C, "Wrong size on UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone");
static_assert(offsetof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone, EntryPoint) == 0x000000, "Member 'UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone, Temp_bool_Variable) == 0x000004, "Member 'UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone, Temp_byte_Variable) == 0x000005, "Member 'UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone, Temp_byte_Variable_1) == 0x000006, "Member 'UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone, K2Node_Event_IsDesignTime) == 0x000007, "Member 'UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone, K2Node_Select_Default) == 0x000008, "Member 'UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone, K2Node_Event_InFocusEvent_1) == 0x00000C, "Member 'UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone, K2Node_Event_InFocusEvent) == 0x000014, "Member 'UMG_STD_HotZone_C_ExecuteUbergraph_UMG_STD_HotZone::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function UMG_STD_HotZone.UMG_STD_HotZone_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_HotZone_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_STD_HotZone_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_STD_HotZone_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_STD_HotZone_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_STD_HotZone_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_STD_HotZone_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_STD_HotZone_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_STD_HotZone.UMG_STD_HotZone_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_HotZone_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_STD_HotZone_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_STD_HotZone_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_STD_HotZone_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_STD_HotZone_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_STD_HotZone_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_STD_HotZone_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_STD_HotZone.UMG_STD_HotZone_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_STD_HotZone_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_HotZone_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_STD_HotZone_C_PreConstruct");
static_assert(sizeof(UMG_STD_HotZone_C_PreConstruct) == 0x000001, "Wrong size on UMG_STD_HotZone_C_PreConstruct");
static_assert(offsetof(UMG_STD_HotZone_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_STD_HotZone_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_STD_HotZone.UMG_STD_HotZone_C.GetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct UMG_STD_HotZone_C_GetIsSelected final
{
public:
	bool                                          bIsSelected_0;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_HotZone_C_GetIsSelected) == 0x000001, "Wrong alignment on UMG_STD_HotZone_C_GetIsSelected");
static_assert(sizeof(UMG_STD_HotZone_C_GetIsSelected) == 0x000001, "Wrong size on UMG_STD_HotZone_C_GetIsSelected");
static_assert(offsetof(UMG_STD_HotZone_C_GetIsSelected, bIsSelected_0) == 0x000000, "Member 'UMG_STD_HotZone_C_GetIsSelected::bIsSelected_0' has a wrong offset!");

// Function UMG_STD_HotZone.UMG_STD_HotZone_C.SetIsSelected
// 0x0003 (0x0003 - 0x0000)
struct UMG_STD_HotZone_C_SetIsSelected final
{
public:
	bool                                          Select;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsSelected_0;                                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_HotZone_C_SetIsSelected) == 0x000001, "Wrong alignment on UMG_STD_HotZone_C_SetIsSelected");
static_assert(sizeof(UMG_STD_HotZone_C_SetIsSelected) == 0x000003, "Wrong size on UMG_STD_HotZone_C_SetIsSelected");
static_assert(offsetof(UMG_STD_HotZone_C_SetIsSelected, Select) == 0x000000, "Member 'UMG_STD_HotZone_C_SetIsSelected::Select' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_SetIsSelected, bIsSelected_0) == 0x000001, "Member 'UMG_STD_HotZone_C_SetIsSelected::bIsSelected_0' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_SetIsSelected, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000002, "Member 'UMG_STD_HotZone_C_SetIsSelected::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function UMG_STD_HotZone.UMG_STD_HotZone_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_STD_HotZone_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_STD_HotZone_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_STD_HotZone_C_OnFocusReceived");
static_assert(sizeof(UMG_STD_HotZone_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_STD_HotZone_C_OnFocusReceived");
static_assert(offsetof(UMG_STD_HotZone_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_STD_HotZone_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_STD_HotZone_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_STD_HotZone_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_HotZone_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_STD_HotZone_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

