#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_GeneralSettingPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_SettingPageBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_GeneralSettingPage.UMG_GeneralSettingPage_C
// 0x0050 (0x03C8 - 0x0378)
class UUMG_GeneralSettingPage_C final : public UUMG_SettingPageBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_GeneralSettingPage_C;           // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCard_MainOption_C*                     Card_Gameplay;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             List_GamePlay;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SubPage_CardList;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_MKContent;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          UMG_Option;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Option_C*                          UMG_Option_100;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UPBOptionBaseWidget*>            Extra_Option_Widget_Array;                         // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UPBSettingOptionData*                   SettingOptionData;                                 // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_GeneralSettingPage(int32 EntryPoint);
	void Construct();
	void OnInitialized();
	void SwitchOptionList(int32 Index_0);
	void Reset();
	void On_Use_Option_End_Record();
	void CreateUI(class UPBSettingOptionNode* SettingOptionNode);
	void CreateOption(class UPBSettingOptionNode* SettingOptionNode, class UScrollBox* ScrollBox, class UUMG_Option_C* ParentOption);
	void OnSubOptionClicked(int32 Index_0);
	void ShouldHideOption(class FName OptionName, bool* ShouldHideOption_0);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_GeneralSettingPage_C">();
	}
	static class UUMG_GeneralSettingPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_GeneralSettingPage_C>();
	}
};
static_assert(alignof(UUMG_GeneralSettingPage_C) == 0x000008, "Wrong alignment on UUMG_GeneralSettingPage_C");
static_assert(sizeof(UUMG_GeneralSettingPage_C) == 0x0003C8, "Wrong size on UUMG_GeneralSettingPage_C");
static_assert(offsetof(UUMG_GeneralSettingPage_C, UberGraphFrame_UMG_GeneralSettingPage_C) == 0x000378, "Member 'UUMG_GeneralSettingPage_C::UberGraphFrame_UMG_GeneralSettingPage_C' has a wrong offset!");
static_assert(offsetof(UUMG_GeneralSettingPage_C, Card_Gameplay) == 0x000380, "Member 'UUMG_GeneralSettingPage_C::Card_Gameplay' has a wrong offset!");
static_assert(offsetof(UUMG_GeneralSettingPage_C, List_GamePlay) == 0x000388, "Member 'UUMG_GeneralSettingPage_C::List_GamePlay' has a wrong offset!");
static_assert(offsetof(UUMG_GeneralSettingPage_C, SubPage_CardList) == 0x000390, "Member 'UUMG_GeneralSettingPage_C::SubPage_CardList' has a wrong offset!");
static_assert(offsetof(UUMG_GeneralSettingPage_C, Switcher_MKContent) == 0x000398, "Member 'UUMG_GeneralSettingPage_C::Switcher_MKContent' has a wrong offset!");
static_assert(offsetof(UUMG_GeneralSettingPage_C, UMG_Option) == 0x0003A0, "Member 'UUMG_GeneralSettingPage_C::UMG_Option' has a wrong offset!");
static_assert(offsetof(UUMG_GeneralSettingPage_C, UMG_Option_100) == 0x0003A8, "Member 'UUMG_GeneralSettingPage_C::UMG_Option_100' has a wrong offset!");
static_assert(offsetof(UUMG_GeneralSettingPage_C, Extra_Option_Widget_Array) == 0x0003B0, "Member 'UUMG_GeneralSettingPage_C::Extra_Option_Widget_Array' has a wrong offset!");
static_assert(offsetof(UUMG_GeneralSettingPage_C, SettingOptionData) == 0x0003C0, "Member 'UUMG_GeneralSettingPage_C::SettingOptionData' has a wrong offset!");

}

