#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FieldModQuotaItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_FieldModQuotaItem.UMG_FieldModQuotaItem_C
// 0x0058 (0x02B8 - 0x0260)
class UUMG_FieldModQuotaItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LackQuota;                                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DecreaseQuota;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IncreaseQuota;                                     // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_260;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Quota;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_QuotaTag;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentQuota;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_LackFlag;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MaxQuota;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_New;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_FieldModQuotaItem(int32 EntryPoint);
	void Construct();
	void SetQuotaIncrease();
	void SetQuotaDecrease();
	void SetQuotaLack();
	void HidenDisplayQuotaTag();
	void DisplayQuotaTag(const class FText& UpcomingQuota, const class FText& MaxQuota, bool IsNew, bool IsLackOfQuota);
	void SetQuotaNormal();
	void SetQuotaOnIdle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_FieldModQuotaItem_C">();
	}
	static class UUMG_FieldModQuotaItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_FieldModQuotaItem_C>();
	}
};
static_assert(alignof(UUMG_FieldModQuotaItem_C) == 0x000008, "Wrong alignment on UUMG_FieldModQuotaItem_C");
static_assert(sizeof(UUMG_FieldModQuotaItem_C) == 0x0002B8, "Wrong size on UUMG_FieldModQuotaItem_C");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, UberGraphFrame) == 0x000260, "Member 'UUMG_FieldModQuotaItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, LackQuota) == 0x000268, "Member 'UUMG_FieldModQuotaItem_C::LackQuota' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, DecreaseQuota) == 0x000270, "Member 'UUMG_FieldModQuotaItem_C::DecreaseQuota' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, IncreaseQuota) == 0x000278, "Member 'UUMG_FieldModQuotaItem_C::IncreaseQuota' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, Image_260) == 0x000280, "Member 'UUMG_FieldModQuotaItem_C::Image_260' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, Image_Quota) == 0x000288, "Member 'UUMG_FieldModQuotaItem_C::Image_Quota' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, Overlay_QuotaTag) == 0x000290, "Member 'UUMG_FieldModQuotaItem_C::Overlay_QuotaTag' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, TextBlock_CurrentQuota) == 0x000298, "Member 'UUMG_FieldModQuotaItem_C::TextBlock_CurrentQuota' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, TextBlock_LackFlag) == 0x0002A0, "Member 'UUMG_FieldModQuotaItem_C::TextBlock_LackFlag' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, TextBlock_MaxQuota) == 0x0002A8, "Member 'UUMG_FieldModQuotaItem_C::TextBlock_MaxQuota' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModQuotaItem_C, TextBlock_New) == 0x0002B0, "Member 'UUMG_FieldModQuotaItem_C::TextBlock_New' has a wrong offset!");

}

