#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Tutorial

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_Tutorial.UMG_Tutorial_C.ExecuteUbergraph_UMG_Tutorial
// 0x00C8 (0x00C8 - 0x0000)
struct UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText Title, class FText Description, class UTexture2D* Texture)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Title;                          // 0x0038(0x0018)()
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0050(0x0018)()
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_TutorialDisplayMode_C*             K2Node_DynamicCast_AsUMG_Tutorial_Display_Mode;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_TutorialDisplayMode_C*             K2Node_DynamicCast_AsUMG_Tutorial_Display_Mode_1;  // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial) == 0x000008, "Wrong alignment on UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial");
static_assert(sizeof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial) == 0x0000C8, "Wrong size on UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, EntryPoint) == 0x000000, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00002C, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, K2Node_CustomEvent_Title) == 0x000038, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::K2Node_CustomEvent_Title' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, K2Node_CustomEvent_Description) == 0x000050, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, K2Node_CustomEvent_Texture) == 0x000068, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_GetAllChildren_ReturnValue) == 0x000070, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_GetAllChildren_ReturnValue_1) == 0x000080, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_Array_Get_Item) == 0x000090, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, K2Node_DynamicCast_AsUMG_Tutorial_Display_Mode) == 0x0000A0, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::K2Node_DynamicCast_AsUMG_Tutorial_Display_Mode' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, K2Node_DynamicCast_AsUMG_Tutorial_Display_Mode_1) == 0x0000B0, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::K2Node_DynamicCast_AsUMG_Tutorial_Display_Mode_1' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C5, "Member 'UMG_Tutorial_C_ExecuteUbergraph_UMG_Tutorial::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UMG_Tutorial.UMG_Tutorial_C.CustomEvent_1
// 0x0038 (0x0038 - 0x0000)
struct UMG_Tutorial_C_CustomEvent_1 final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Texture;                                           // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Tutorial_C_CustomEvent_1) == 0x000008, "Wrong alignment on UMG_Tutorial_C_CustomEvent_1");
static_assert(sizeof(UMG_Tutorial_C_CustomEvent_1) == 0x000038, "Wrong size on UMG_Tutorial_C_CustomEvent_1");
static_assert(offsetof(UMG_Tutorial_C_CustomEvent_1, Title) == 0x000000, "Member 'UMG_Tutorial_C_CustomEvent_1::Title' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_CustomEvent_1, Description) == 0x000018, "Member 'UMG_Tutorial_C_CustomEvent_1::Description' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_CustomEvent_1, Texture) == 0x000030, "Member 'UMG_Tutorial_C_CustomEvent_1::Texture' has a wrong offset!");

// Function UMG_Tutorial.UMG_Tutorial_C.OnKeyDown
// 0x02C8 (0x02C8 - 0x0000)
struct UMG_Tutorial_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0128(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01E0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue;             // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0210(0x00B8)()
};
static_assert(alignof(UMG_Tutorial_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_Tutorial_C_OnKeyDown");
static_assert(sizeof(UMG_Tutorial_C_OnKeyDown) == 0x0002C8, "Wrong size on UMG_Tutorial_C_OnKeyDown");
static_assert(offsetof(UMG_Tutorial_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_Tutorial_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_Tutorial_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_Tutorial_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000128, "Member 'UMG_Tutorial_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x0001E0, "Member 'UMG_Tutorial_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0001F8, "Member 'UMG_Tutorial_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_OnKeyDown, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000200, "Member 'UMG_Tutorial_C_OnKeyDown::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_OnKeyDown, CallFunc_PushNormalPrompt_ReturnValue) == 0x000208, "Member 'UMG_Tutorial_C_OnKeyDown::CallFunc_PushNormalPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tutorial_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000210, "Member 'UMG_Tutorial_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function UMG_Tutorial.UMG_Tutorial_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_Tutorial_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Tutorial_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_Tutorial_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_Tutorial_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_Tutorial_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_Tutorial_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_Tutorial_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

