#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MedalPage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_MedalPage.UMG_MedalPage_C.ExecuteUbergraph_UMG_MedalPage
// 0x0038 (0x0038 - 0x0000)
struct UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCareerManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Medal_Small_C*                     K2Node_DynamicCast_AsUMG_Medal_Small;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage) == 0x000008, "Wrong alignment on UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage");
static_assert(sizeof(UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage) == 0x000038, "Wrong size on UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage");
static_assert(offsetof(UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage, EntryPoint) == 0x000000, "Member 'UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage, K2Node_DynamicCast_AsUMG_Medal_Small) == 0x000028, "Member 'UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage::K2Node_DynamicCast_AsUMG_Medal_Small' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UMG_MedalPage_C_ExecuteUbergraph_UMG_MedalPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_MedalPage.UMG_MedalPage_C.InitAllMedals
// 0x0100 (0x0100 - 0x0000)
struct UMG_MedalPage_C_InitAllMedals final
{
public:
	class UUMG_Medal_Small_C*                     LocalMedalSmall;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalIndex;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Medal_Small_C*                     CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPBMedalDetailsDataTableRowBase& InMedalDetail, int32 InCount, class UUMG_Medal_Small_C* InSelectedMedal)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBStateMachineEventRow                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBMedalDetailsDataTableRowBase        CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00B8(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MedalPage_C_InitAllMedals) == 0x000008, "Wrong alignment on UMG_MedalPage_C_InitAllMedals");
static_assert(sizeof(UMG_MedalPage_C_InitAllMedals) == 0x000100, "Wrong size on UMG_MedalPage_C_InitAllMedals");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, LocalMedalSmall) == 0x000000, "Member 'UMG_MedalPage_C_InitAllMedals::LocalMedalSmall' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, LocalIndex) == 0x000008, "Member 'UMG_MedalPage_C_InitAllMedals::LocalIndex' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'UMG_MedalPage_C_InitAllMedals::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UMG_MedalPage_C_InitAllMedals::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_Create_ReturnValue) == 0x000018, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UMG_MedalPage_C_InitAllMedals::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_Array_Get_Item) == 0x000040, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000090, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_Less_IntInt_ReturnValue) == 0x000091, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_Conv_TextToString_ReturnValue) == 0x000098, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_AddChild_ReturnValue) == 0x0000A8, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B0, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000B8, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_InitAllMedals, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0000F8, "Member 'UMG_MedalPage_C_InitAllMedals::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function UMG_MedalPage.UMG_MedalPage_C.RefreshMedalInfos
// 0x0070 (0x0070 - 0x0000)
struct UMG_MedalPage_C_RefreshMedalInfos final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCareerManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Medal_Small_C*                     K2Node_DynamicCast_AsUMG_Medal_Small;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MedalPage_C_RefreshMedalInfos) == 0x000008, "Wrong alignment on UMG_MedalPage_C_RefreshMedalInfos");
static_assert(sizeof(UMG_MedalPage_C_RefreshMedalInfos) == 0x000070, "Wrong size on UMG_MedalPage_C_RefreshMedalInfos");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_MedalPage_C_RefreshMedalInfos::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_MedalPage_C_RefreshMedalInfos::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Array_Get_Item) == 0x000028, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Map_Find_Value) == 0x000030, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Map_Find_ReturnValue) == 0x000034, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Conv_NameToString_ReturnValue) == 0x000038, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Map_Find_Value_1) == 0x00004C, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Map_Find_ReturnValue_1) == 0x000050, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, CallFunc_GetChildAt_ReturnValue) == 0x000058, "Member 'UMG_MedalPage_C_RefreshMedalInfos::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, K2Node_DynamicCast_AsUMG_Medal_Small) == 0x000060, "Member 'UMG_MedalPage_C_RefreshMedalInfos::K2Node_DynamicCast_AsUMG_Medal_Small' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_RefreshMedalInfos, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UMG_MedalPage_C_RefreshMedalInfos::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_MedalPage.UMG_MedalPage_C.OnMedalSelected
// 0x0058 (0x0058 - 0x0000)
struct UMG_MedalPage_C_OnMedalSelected final
{
public:
	struct FPBMedalDetailsDataTableRowBase        InMedalDetail;                                     // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InCount;                                           // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Medal_Small_C*                     InSelectedMedal;                                   // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MedalPage_C_OnMedalSelected) == 0x000008, "Wrong alignment on UMG_MedalPage_C_OnMedalSelected");
static_assert(sizeof(UMG_MedalPage_C_OnMedalSelected) == 0x000058, "Wrong size on UMG_MedalPage_C_OnMedalSelected");
static_assert(offsetof(UMG_MedalPage_C_OnMedalSelected, InMedalDetail) == 0x000000, "Member 'UMG_MedalPage_C_OnMedalSelected::InMedalDetail' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_OnMedalSelected, InCount) == 0x000040, "Member 'UMG_MedalPage_C_OnMedalSelected::InCount' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_OnMedalSelected, InSelectedMedal) == 0x000048, "Member 'UMG_MedalPage_C_OnMedalSelected::InSelectedMedal' has a wrong offset!");
static_assert(offsetof(UMG_MedalPage_C_OnMedalSelected, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'UMG_MedalPage_C_OnMedalSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

