#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Indicator_MedStation

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Indicator_MedStation.UMG_Indicator_MedStation_C
// 0x0090 (0x03A8 - 0x0318)
class UUMG_Indicator_MedStation_C final : public UPBIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_Edge;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Line;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main_Indicator;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main_Normal;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main_Text;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Distance;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Edge_Arrow;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Edge_Icon;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line_SolidLine;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Normal;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TeamProgressBar;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Distance;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Metre;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APBMedicine_BP_C*                       MedStation;                                        // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MedStationScanDuration;                            // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScanRemainingTime;                                 // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Indicator_MedStation(int32 EntryPoint);
	void K2_UpdateCamp(EPBCamp NewCamp);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void UpdatePosition();
	void UpdateStatus();
	void UpdateDistance();
	void UpdateCorner();
	void UpdateInView();
	void UpdateProgress(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Indicator_MedStation_C">();
	}
	static class UUMG_Indicator_MedStation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Indicator_MedStation_C>();
	}
};
static_assert(alignof(UUMG_Indicator_MedStation_C) == 0x000008, "Wrong alignment on UUMG_Indicator_MedStation_C");
static_assert(sizeof(UUMG_Indicator_MedStation_C) == 0x0003A8, "Wrong size on UUMG_Indicator_MedStation_C");
static_assert(offsetof(UUMG_Indicator_MedStation_C, UberGraphFrame) == 0x000318, "Member 'UUMG_Indicator_MedStation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, CanvasPanel_Edge) == 0x000320, "Member 'UUMG_Indicator_MedStation_C::CanvasPanel_Edge' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, CanvasPanel_Line) == 0x000328, "Member 'UUMG_Indicator_MedStation_C::CanvasPanel_Line' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, CanvasPanel_Main) == 0x000330, "Member 'UUMG_Indicator_MedStation_C::CanvasPanel_Main' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, CanvasPanel_Main_Indicator) == 0x000338, "Member 'UUMG_Indicator_MedStation_C::CanvasPanel_Main_Indicator' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, CanvasPanel_Main_Normal) == 0x000340, "Member 'UUMG_Indicator_MedStation_C::CanvasPanel_Main_Normal' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, CanvasPanel_Main_Text) == 0x000348, "Member 'UUMG_Indicator_MedStation_C::CanvasPanel_Main_Text' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, HorizontalBox_Distance) == 0x000350, "Member 'UUMG_Indicator_MedStation_C::HorizontalBox_Distance' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, Image_Edge_Arrow) == 0x000358, "Member 'UUMG_Indicator_MedStation_C::Image_Edge_Arrow' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, Image_Edge_Icon) == 0x000360, "Member 'UUMG_Indicator_MedStation_C::Image_Edge_Icon' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, Image_Line_SolidLine) == 0x000368, "Member 'UUMG_Indicator_MedStation_C::Image_Line_SolidLine' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, Image_Normal) == 0x000370, "Member 'UUMG_Indicator_MedStation_C::Image_Normal' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, Image_TeamProgressBar) == 0x000378, "Member 'UUMG_Indicator_MedStation_C::Image_TeamProgressBar' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, RetainerBox_0) == 0x000380, "Member 'UUMG_Indicator_MedStation_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, TextBlock_Distance) == 0x000388, "Member 'UUMG_Indicator_MedStation_C::TextBlock_Distance' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, TextBlock_Metre) == 0x000390, "Member 'UUMG_Indicator_MedStation_C::TextBlock_Metre' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, MedStation) == 0x000398, "Member 'UUMG_Indicator_MedStation_C::MedStation' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, MedStationScanDuration) == 0x0003A0, "Member 'UUMG_Indicator_MedStation_C::MedStationScanDuration' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MedStation_C, ScanRemainingTime) == 0x0003A4, "Member 'UUMG_Indicator_MedStation_C::ScanRemainingTime' has a wrong offset!");

}

