#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MainMenuPlayCard

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.ExecuteUbergraph_UMG_MainMenuPlayCard
// 0x00F0 (0x00F0 - 0x0000)
struct UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_GotoPage_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Assignment_C*                      K2Node_DynamicCast_AsUMG_Assignment;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x001C(0x0008)(NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0038(0x0008)(NoDestructor)
	struct FBPFocusEvent                          CallFunc_ConvertToBPFocusEvent_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0050(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0068(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPB_GameInstance_C*                     K2Node_DynamicCast_AsPB_Game_Instance;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPB_GameInstance_C*                     K2Node_DynamicCast_AsPB_Game_Instance_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPB_GameInstance_C*                     K2Node_DynamicCast_AsPB_Game_Instance_2;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPBPlayListType InPlayListType)> K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPBPlayListType InPlayListType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard) == 0x000008, "Wrong alignment on UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard");
static_assert(sizeof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard) == 0x0000F0, "Wrong size on UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, EntryPoint) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_GotoPage_ReturnValue) == 0x000008, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_GotoPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_DynamicCast_AsUMG_Assignment) == 0x000010, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_DynamicCast_AsUMG_Assignment' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_Event_InFocusEvent_1) == 0x00001C, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_Event_InFocusEvent) == 0x000038, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_ConvertToBPFocusEvent_ReturnValue) == 0x000040, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_ConvertToBPFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000048, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_Event_IsDesignTime) == 0x000049, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_TextToUpper_ReturnValue) == 0x000050, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_TextToUpper_ReturnValue_1) == 0x000068, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_GetGameInstance_ReturnValue) == 0x000080, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_DynamicCast_AsPB_Game_Instance) == 0x000088, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_DynamicCast_AsPB_Game_Instance' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_GetGameInstance_ReturnValue_1) == 0x000098, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_DynamicCast_AsPB_Game_Instance_1) == 0x0000A0, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_DynamicCast_AsPB_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_GetGameInstance_ReturnValue_2) == 0x0000B0, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_DynamicCast_AsPB_Game_Instance_2) == 0x0000C0, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_DynamicCast_AsPB_Game_Instance_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_IsValid_ReturnValue_2) == 0x0000C9, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, CallFunc_IsVisible_ReturnValue) == 0x0000DC, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E0, "Member 'UMG_MainMenuPlayCard_C_ExecuteUbergraph_UMG_MainMenuPlayCard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_MainMenuPlayCard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MainMenuPlayCard_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_MainMenuPlayCard_C_PreConstruct");
static_assert(sizeof(UMG_MainMenuPlayCard_C_PreConstruct) == 0x000001, "Wrong size on UMG_MainMenuPlayCard_C_PreConstruct");
static_assert(offsetof(UMG_MainMenuPlayCard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_MainMenuPlayCard_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_MainMenuPlayCard_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_MainMenuPlayCard_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_MainMenuPlayCard_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_MainMenuPlayCard_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_MainMenuPlayCard_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_MainMenuPlayCard_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_MainMenuPlayCard_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_MainMenuPlayCard_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_MainMenuPlayCard_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_MainMenuPlayCard_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_MainMenuPlayCard_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UMG_MainMenuPlayCard_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UMG_MainMenuPlayCard_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_MainMenuPlayCard_C_OnFocusReceived");
static_assert(sizeof(UMG_MainMenuPlayCard_C_OnFocusReceived) == 0x0001B0, "Wrong size on UMG_MainMenuPlayCard_C_OnFocusReceived");
static_assert(offsetof(UMG_MainMenuPlayCard_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_MainMenuPlayCard_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_MainMenuPlayCard_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_MainMenuPlayCard_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.HandleBtnClicked
// 0x0008 (0x0008 - 0x0000)
struct UMG_MainMenuPlayCard_C_HandleBtnClicked final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuPlayCard_C_HandleBtnClicked) == 0x000008, "Wrong alignment on UMG_MainMenuPlayCard_C_HandleBtnClicked");
static_assert(sizeof(UMG_MainMenuPlayCard_C_HandleBtnClicked) == 0x000008, "Wrong size on UMG_MainMenuPlayCard_C_HandleBtnClicked");
static_assert(offsetof(UMG_MainMenuPlayCard_C_HandleBtnClicked, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_HandleBtnClicked::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.ShowMatchingMark
// 0x0005 (0x0005 - 0x0000)
struct UMG_MainMenuPlayCard_C_ShowMatchingMark final
{
public:
	bool                                          ShouldShow;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuPlayCard_C_ShowMatchingMark) == 0x000001, "Wrong alignment on UMG_MainMenuPlayCard_C_ShowMatchingMark");
static_assert(sizeof(UMG_MainMenuPlayCard_C_ShowMatchingMark) == 0x000005, "Wrong size on UMG_MainMenuPlayCard_C_ShowMatchingMark");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ShowMatchingMark, ShouldShow) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_ShowMatchingMark::ShouldShow' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ShowMatchingMark, Temp_bool_Variable) == 0x000001, "Member 'UMG_MainMenuPlayCard_C_ShowMatchingMark::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ShowMatchingMark, Temp_byte_Variable) == 0x000002, "Member 'UMG_MainMenuPlayCard_C_ShowMatchingMark::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ShowMatchingMark, Temp_byte_Variable_1) == 0x000003, "Member 'UMG_MainMenuPlayCard_C_ShowMatchingMark::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_ShowMatchingMark, K2Node_Select_Default) == 0x000004, "Member 'UMG_MainMenuPlayCard_C_ShowMatchingMark::K2Node_Select_Default' has a wrong offset!");

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.On Start Matching
// 0x0001 (0x0001 - 0x0000)
struct UMG_MainMenuPlayCard_C_On_Start_Matching final
{
public:
	EPBPlayListType                               InPlayListType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MainMenuPlayCard_C_On_Start_Matching) == 0x000001, "Wrong alignment on UMG_MainMenuPlayCard_C_On_Start_Matching");
static_assert(sizeof(UMG_MainMenuPlayCard_C_On_Start_Matching) == 0x000001, "Wrong size on UMG_MainMenuPlayCard_C_On_Start_Matching");
static_assert(offsetof(UMG_MainMenuPlayCard_C_On_Start_Matching, InPlayListType) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_On_Start_Matching::InPlayListType' has a wrong offset!");

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.RefreshInfo
// 0x0078 (0x0078 - 0x0000)
struct UMG_MainMenuPlayCard_C_RefreshInfo final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InDescription;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             InPlayImage;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InSpecialText;                                     // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            InColor;                                           // 0x0050(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_MainMenuPlayCard_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_MainMenuPlayCard_C_RefreshInfo");
static_assert(sizeof(UMG_MainMenuPlayCard_C_RefreshInfo) == 0x000078, "Wrong size on UMG_MainMenuPlayCard_C_RefreshInfo");
static_assert(offsetof(UMG_MainMenuPlayCard_C_RefreshInfo, InTitle) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_RefreshInfo::InTitle' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_RefreshInfo, InDescription) == 0x000018, "Member 'UMG_MainMenuPlayCard_C_RefreshInfo::InDescription' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_RefreshInfo, InPlayImage) == 0x000030, "Member 'UMG_MainMenuPlayCard_C_RefreshInfo::InPlayImage' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_RefreshInfo, InSpecialText) == 0x000038, "Member 'UMG_MainMenuPlayCard_C_RefreshInfo::InSpecialText' has a wrong offset!");
static_assert(offsetof(UMG_MainMenuPlayCard_C_RefreshInfo, InColor) == 0x000050, "Member 'UMG_MainMenuPlayCard_C_RefreshInfo::InColor' has a wrong offset!");

// Function UMG_MainMenuPlayCard.UMG_MainMenuPlayCard_C.SetLockText
// 0x0018 (0x0018 - 0x0000)
struct UMG_MainMenuPlayCard_C_SetLockText final
{
public:
	class FText                                   NewParam;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_MainMenuPlayCard_C_SetLockText) == 0x000008, "Wrong alignment on UMG_MainMenuPlayCard_C_SetLockText");
static_assert(sizeof(UMG_MainMenuPlayCard_C_SetLockText) == 0x000018, "Wrong size on UMG_MainMenuPlayCard_C_SetLockText");
static_assert(offsetof(UMG_MainMenuPlayCard_C_SetLockText, NewParam) == 0x000000, "Member 'UMG_MainMenuPlayCard_C_SetLockText::NewParam' has a wrong offset!");

}

