#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Chat_InMatching

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Chat_InMatching.UMG_Chat_InMatching_C
// 0x0018 (0x0278 - 0x0260)
class UUMG_Chat_InMatching_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USafeZone*                              SafeZone_0;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ChatWidget_C*                      UMG_ChatWidget_Matching;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Chat_InMatching(int32 EntryPoint);
	void OnStateNameChange(class FName StateName);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Chat_InMatching_C">();
	}
	static class UUMG_Chat_InMatching_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Chat_InMatching_C>();
	}
};
static_assert(alignof(UUMG_Chat_InMatching_C) == 0x000008, "Wrong alignment on UUMG_Chat_InMatching_C");
static_assert(sizeof(UUMG_Chat_InMatching_C) == 0x000278, "Wrong size on UUMG_Chat_InMatching_C");
static_assert(offsetof(UUMG_Chat_InMatching_C, UberGraphFrame) == 0x000260, "Member 'UUMG_Chat_InMatching_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Chat_InMatching_C, SafeZone_0) == 0x000268, "Member 'UUMG_Chat_InMatching_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UUMG_Chat_InMatching_C, UMG_ChatWidget_Matching) == 0x000270, "Member 'UUMG_Chat_InMatching_C::UMG_ChatWidget_Matching' has a wrong offset!");

}

