#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_WaterMarkGroup

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_WaterMarkGroup.UMG_WaterMarkGroup_C.SetContent
// 0x0048 (0x0048 - 0x0000)
struct UMG_WaterMarkGroup_C_SetContent final
{
public:
	class FText                                   PlayerId;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   SteamID;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Version;                                           // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_WaterMarkGroup_C_SetContent) == 0x000008, "Wrong alignment on UMG_WaterMarkGroup_C_SetContent");
static_assert(sizeof(UMG_WaterMarkGroup_C_SetContent) == 0x000048, "Wrong size on UMG_WaterMarkGroup_C_SetContent");
static_assert(offsetof(UMG_WaterMarkGroup_C_SetContent, PlayerId) == 0x000000, "Member 'UMG_WaterMarkGroup_C_SetContent::PlayerId' has a wrong offset!");
static_assert(offsetof(UMG_WaterMarkGroup_C_SetContent, SteamID) == 0x000018, "Member 'UMG_WaterMarkGroup_C_SetContent::SteamID' has a wrong offset!");
static_assert(offsetof(UMG_WaterMarkGroup_C_SetContent, Version) == 0x000030, "Member 'UMG_WaterMarkGroup_C_SetContent::Version' has a wrong offset!");

}

