#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FinishMatchmaking

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_FinishMatchmaking.UMG_FinishMatchmaking_C.ExecuteUbergraph_UMG_FinishMatchmaking
// 0x01B8 (0x01B8 - 0x0000)
struct UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0070(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E0(0x0070)(ConstParm)
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLobbyTimeRemainingText_ReturnValue;    // 0x0160(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLobbyTimeRemainingText_ReturnValue_1;  // 0x0190(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking) == 0x000008, "Wrong alignment on UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking");
static_assert(sizeof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking) == 0x0001B8, "Wrong size on UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, EntryPoint) == 0x000000, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, K2Node_Event_MyGeometry) == 0x000038, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, K2Node_Event_MouseEvent_1) == 0x000070, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, K2Node_Event_MouseEvent) == 0x0000E0, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000150, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000158, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, CallFunc_GetLobbyTimeRemainingText_ReturnValue) == 0x000160, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::CallFunc_GetLobbyTimeRemainingText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, K2Node_CreateDelegate_OutputDelegate_2) == 0x000178, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000188, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, CallFunc_GetLobbyTimeRemainingText_ReturnValue_1) == 0x000190, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::CallFunc_GetLobbyTimeRemainingText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001A8, "Member 'UMG_FinishMatchmaking_C_ExecuteUbergraph_UMG_FinishMatchmaking::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function UMG_FinishMatchmaking.UMG_FinishMatchmaking_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UMG_FinishMatchmaking_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FinishMatchmaking_C_OnMouseLeave) == 0x000008, "Wrong alignment on UMG_FinishMatchmaking_C_OnMouseLeave");
static_assert(sizeof(UMG_FinishMatchmaking_C_OnMouseLeave) == 0x000070, "Wrong size on UMG_FinishMatchmaking_C_OnMouseLeave");
static_assert(offsetof(UMG_FinishMatchmaking_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UMG_FinishMatchmaking_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UMG_FinishMatchmaking.UMG_FinishMatchmaking_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_FinishMatchmaking_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_FinishMatchmaking_C_OnMouseEnter) == 0x000008, "Wrong alignment on UMG_FinishMatchmaking_C_OnMouseEnter");
static_assert(sizeof(UMG_FinishMatchmaking_C_OnMouseEnter) == 0x0000A8, "Wrong size on UMG_FinishMatchmaking_C_OnMouseEnter");
static_assert(offsetof(UMG_FinishMatchmaking_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UMG_FinishMatchmaking_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UMG_FinishMatchmaking_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UMG_FinishMatchmaking.UMG_FinishMatchmaking_C.OnMouseButtonDown_0
// 0x0160 (0x0160 - 0x0000)
struct UMG_FinishMatchmaking_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(UMG_FinishMatchmaking_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on UMG_FinishMatchmaking_C_OnMouseButtonDown_0");
static_assert(sizeof(UMG_FinishMatchmaking_C_OnMouseButtonDown_0) == 0x000160, "Wrong size on UMG_FinishMatchmaking_C_OnMouseButtonDown_0");
static_assert(offsetof(UMG_FinishMatchmaking_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'UMG_FinishMatchmaking_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'UMG_FinishMatchmaking_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_FinishMatchmaking_C_OnMouseButtonDown_0, ReturnValue) == 0x0000A8, "Member 'UMG_FinishMatchmaking_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");

// Function UMG_FinishMatchmaking.UMG_FinishMatchmaking_C.StartAnimation
// 0x0008 (0x0008 - 0x0000)
struct UMG_FinishMatchmaking_C_StartAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FinishMatchmaking_C_StartAnimation) == 0x000008, "Wrong alignment on UMG_FinishMatchmaking_C_StartAnimation");
static_assert(sizeof(UMG_FinishMatchmaking_C_StartAnimation) == 0x000008, "Wrong size on UMG_FinishMatchmaking_C_StartAnimation");
static_assert(offsetof(UMG_FinishMatchmaking_C_StartAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_FinishMatchmaking_C_StartAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_FinishMatchmaking.UMG_FinishMatchmaking_C.ResetWidget
// 0x0001 (0x0001 - 0x0000)
struct UMG_FinishMatchmaking_C_ResetWidget final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_FinishMatchmaking_C_ResetWidget) == 0x000001, "Wrong alignment on UMG_FinishMatchmaking_C_ResetWidget");
static_assert(sizeof(UMG_FinishMatchmaking_C_ResetWidget) == 0x000001, "Wrong size on UMG_FinishMatchmaking_C_ResetWidget");
static_assert(offsetof(UMG_FinishMatchmaking_C_ResetWidget, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'UMG_FinishMatchmaking_C_ResetWidget::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

}

