#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CareerPage

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CareerPage.UMG_CareerPage_C
// 0x0030 (0x0350 - 0x0320)
class UUMG_CareerPage_C final : public UPBCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBAdvancedSwitcher*                    AdvancedSwitcher;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CareerCrew_C*                      UMG_CareerCrew;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CareerWeapon_C*                    UMG_CareerWeapon;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MedalPage_C*                       UMG_MedalPage;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProfileGeneralInfo_C*              UMG_ProfileGeneralInfo;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_CareerPage(int32 EntryPoint);
	void BndEvt__UMG_CareerPage_AdvancedSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature(int32 CurrentSelectIndex, int32 LastSelectIndex);
	void BP_OnActivated();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void RestoreFocus(int32 Selection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CareerPage_C">();
	}
	static class UUMG_CareerPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CareerPage_C>();
	}
};
static_assert(alignof(UUMG_CareerPage_C) == 0x000008, "Wrong alignment on UUMG_CareerPage_C");
static_assert(sizeof(UUMG_CareerPage_C) == 0x000350, "Wrong size on UUMG_CareerPage_C");
static_assert(offsetof(UUMG_CareerPage_C, UberGraphFrame) == 0x000320, "Member 'UUMG_CareerPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_CareerPage_C, AdvancedSwitcher) == 0x000328, "Member 'UUMG_CareerPage_C::AdvancedSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_CareerPage_C, UMG_CareerCrew) == 0x000330, "Member 'UUMG_CareerPage_C::UMG_CareerCrew' has a wrong offset!");
static_assert(offsetof(UUMG_CareerPage_C, UMG_CareerWeapon) == 0x000338, "Member 'UUMG_CareerPage_C::UMG_CareerWeapon' has a wrong offset!");
static_assert(offsetof(UUMG_CareerPage_C, UMG_MedalPage) == 0x000340, "Member 'UUMG_CareerPage_C::UMG_MedalPage' has a wrong offset!");
static_assert(offsetof(UUMG_CareerPage_C, UMG_ProfileGeneralInfo) == 0x000348, "Member 'UUMG_CareerPage_C::UMG_ProfileGeneralInfo' has a wrong offset!");

}

