#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Benchmark_Result

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Benchmark_Result.UMG_Benchmark_Result_C
// 0x0040 (0x0498 - 0x0458)
class UUMG_Benchmark_Result_C final : public UPBBenchmarkResultWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        LoadingMask;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StateTextBlock;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StateTextBlockBorder;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Benchmark_Bottom_C*                UMG_Benchmark_Bottom;                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Benchmark_Chart_Widget_C*          UMG_Benchmark_Chart_Widget;                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<int32>                                 FPSArray;                                          // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_Benchmark_Result(int32 EntryPoint);
	void K2_HandleExit();
	void HideLoading();
	void K2_SetSystemInfo();
	void BP_OnActivated();
	void BndEvt__UMG_Benchmark_Result_UMG_Benchmark_Bottom_K2Node_ComponentBoundEvent_1_OnStartButtonClick__DelegateSignature();
	void K2_RefreshData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Benchmark_Result_C">();
	}
	static class UUMG_Benchmark_Result_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Benchmark_Result_C>();
	}
};
static_assert(alignof(UUMG_Benchmark_Result_C) == 0x000008, "Wrong alignment on UUMG_Benchmark_Result_C");
static_assert(sizeof(UUMG_Benchmark_Result_C) == 0x000498, "Wrong size on UUMG_Benchmark_Result_C");
static_assert(offsetof(UUMG_Benchmark_Result_C, UberGraphFrame) == 0x000458, "Member 'UUMG_Benchmark_Result_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Result_C, LoadingMask) == 0x000460, "Member 'UUMG_Benchmark_Result_C::LoadingMask' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Result_C, StateTextBlock) == 0x000468, "Member 'UUMG_Benchmark_Result_C::StateTextBlock' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Result_C, StateTextBlockBorder) == 0x000470, "Member 'UUMG_Benchmark_Result_C::StateTextBlockBorder' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Result_C, UMG_Benchmark_Bottom) == 0x000478, "Member 'UUMG_Benchmark_Result_C::UMG_Benchmark_Bottom' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Result_C, UMG_Benchmark_Chart_Widget) == 0x000480, "Member 'UUMG_Benchmark_Result_C::UMG_Benchmark_Chart_Widget' has a wrong offset!");
static_assert(offsetof(UUMG_Benchmark_Result_C, FPSArray) == 0x000488, "Member 'UUMG_Benchmark_Result_C::FPSArray' has a wrong offset!");

}

