#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_GamepadView

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_GamepadView.UMG_GamepadView_C.ExecuteUbergraph_UMG_GamepadView
// 0x0028 (0x0028 - 0x0000)
struct UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EInputDevice CurrentDevice)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  K2Node_CustomEvent_CurrentDevice;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView) == 0x000008, "Wrong alignment on UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView");
static_assert(sizeof(UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView) == 0x000028, "Wrong size on UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView");
static_assert(offsetof(UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView, EntryPoint) == 0x000000, "Member 'UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000018, "Member 'UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView, K2Node_CustomEvent_CurrentDevice) == 0x000020, "Member 'UMG_GamepadView_C_ExecuteUbergraph_UMG_GamepadView::K2Node_CustomEvent_CurrentDevice' has a wrong offset!");

// Function UMG_GamepadView.UMG_GamepadView_C.OnSwitchInputDevice
// 0x0001 (0x0001 - 0x0000)
struct UMG_GamepadView_C_OnSwitchInputDevice final
{
public:
	EInputDevice                                  CurrentDevice;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_GamepadView_C_OnSwitchInputDevice) == 0x000001, "Wrong alignment on UMG_GamepadView_C_OnSwitchInputDevice");
static_assert(sizeof(UMG_GamepadView_C_OnSwitchInputDevice) == 0x000001, "Wrong size on UMG_GamepadView_C_OnSwitchInputDevice");
static_assert(offsetof(UMG_GamepadView_C_OnSwitchInputDevice, CurrentDevice) == 0x000000, "Member 'UMG_GamepadView_C_OnSwitchInputDevice::CurrentDevice' has a wrong offset!");

// Function UMG_GamepadView.UMG_GamepadView_C.HighLight
// 0x00E8 (0x00E8 - 0x0000)
struct UMG_GamepadView_C_HighLight final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FKey                                   ViceKey_0;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TArray<struct FKey>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FKey, class UTexture2D*>          CallFunc_GetCurrentGamepadKeymap_KeyMap;           // 0x0070(0x0050)()
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array_1;                          // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UImage*                                 CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_GamepadView_C_HighLight) == 0x000008, "Wrong alignment on UMG_GamepadView_C_HighLight");
static_assert(sizeof(UMG_GamepadView_C_HighLight) == 0x0000E8, "Wrong size on UMG_GamepadView_C_HighLight");
static_assert(offsetof(UMG_GamepadView_C_HighLight, InKey) == 0x000000, "Member 'UMG_GamepadView_C_HighLight::InKey' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, ViceKey_0) == 0x000018, "Member 'UMG_GamepadView_C_HighLight::ViceKey_0' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, K2Node_MakeArray_Array) == 0x000030, "Member 'UMG_GamepadView_C_HighLight::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UMG_GamepadView_C_HighLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, Temp_int_Array_Index_Variable) == 0x000044, "Member 'UMG_GamepadView_C_HighLight::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'UMG_GamepadView_C_HighLight::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, CallFunc_Array_Get_Item) == 0x000050, "Member 'UMG_GamepadView_C_HighLight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'UMG_GamepadView_C_HighLight::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_GamepadView_C_HighLight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, CallFunc_GetCurrentGamepadKeymap_KeyMap) == 0x000070, "Member 'UMG_GamepadView_C_HighLight::CallFunc_GetCurrentGamepadKeymap_KeyMap' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, CallFunc_Map_Find_Value) == 0x0000C0, "Member 'UMG_GamepadView_C_HighLight::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, CallFunc_Map_Find_ReturnValue) == 0x0000C8, "Member 'UMG_GamepadView_C_HighLight::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, K2Node_MakeArray_Array_1) == 0x0000D0, "Member 'UMG_GamepadView_C_HighLight::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_HighLight, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'UMG_GamepadView_C_HighLight::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function UMG_GamepadView.UMG_GamepadView_C.GetCurrentGamepadKeymap
// 0x0108 (0x0108 - 0x0000)
struct UMG_GamepadView_C_GetCurrentGamepadKeymap final
{
public:
	TMap<struct FKey, class UTexture2D*>          KeyMap;                                            // 0x0000(0x0050)(Parm, OutParm)
	EInputDevice                                  Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FKey, class UTexture2D*>          Temp_struct_Variable;                              // 0x0058(0x0050)()
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FKey, class UTexture2D*>          K2Node_Select_Default;                             // 0x00B8(0x0050)()
};
static_assert(alignof(UMG_GamepadView_C_GetCurrentGamepadKeymap) == 0x000008, "Wrong alignment on UMG_GamepadView_C_GetCurrentGamepadKeymap");
static_assert(sizeof(UMG_GamepadView_C_GetCurrentGamepadKeymap) == 0x000108, "Wrong size on UMG_GamepadView_C_GetCurrentGamepadKeymap");
static_assert(offsetof(UMG_GamepadView_C_GetCurrentGamepadKeymap, KeyMap) == 0x000000, "Member 'UMG_GamepadView_C_GetCurrentGamepadKeymap::KeyMap' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_GetCurrentGamepadKeymap, Temp_byte_Variable) == 0x000050, "Member 'UMG_GamepadView_C_GetCurrentGamepadKeymap::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_GetCurrentGamepadKeymap, Temp_struct_Variable) == 0x000058, "Member 'UMG_GamepadView_C_GetCurrentGamepadKeymap::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_GetCurrentGamepadKeymap, CallFunc_GetEngineSubsystem_ReturnValue) == 0x0000A8, "Member 'UMG_GamepadView_C_GetCurrentGamepadKeymap::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_GetCurrentGamepadKeymap, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x0000B0, "Member 'UMG_GamepadView_C_GetCurrentGamepadKeymap::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_GetCurrentGamepadKeymap, K2Node_Select_Default) == 0x0000B8, "Member 'UMG_GamepadView_C_GetCurrentGamepadKeymap::K2Node_Select_Default' has a wrong offset!");

// Function UMG_GamepadView.UMG_GamepadView_C.RefreshMainIcon
// 0x0010 (0x0010 - 0x0000)
struct UMG_GamepadView_C_RefreshMainIcon final
{
public:
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_GamepadView_C_RefreshMainIcon) == 0x000008, "Wrong alignment on UMG_GamepadView_C_RefreshMainIcon");
static_assert(sizeof(UMG_GamepadView_C_RefreshMainIcon) == 0x000010, "Wrong size on UMG_GamepadView_C_RefreshMainIcon");
static_assert(offsetof(UMG_GamepadView_C_RefreshMainIcon, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000000, "Member 'UMG_GamepadView_C_RefreshMainIcon::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_RefreshMainIcon, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x000008, "Member 'UMG_GamepadView_C_RefreshMainIcon::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_GamepadView_C_RefreshMainIcon, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'UMG_GamepadView_C_RefreshMainIcon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

