#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MatchmakingRegion

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_MatchmakingRegion.UMG_MatchmakingRegion_C
// 0x00A0 (0x0338 - 0x0298)
class UUMG_MatchmakingRegion_C final : public UPBMatchmakingRegion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Checking;                                          // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonMain;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageConfirm;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextChecking;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMs;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPING;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextRegionAddress;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextRegionName;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName MatchmakingRegionName)> ButtonConfirm;                                     // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bHasConfirmed;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName MatchmakingRegionName)> ButtonCancelConfirm;                               // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              PingHasRefreshed;                                  // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              PingIsInRefresh;                                   // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUMG_MatchmakingRegions_C*              UMGRegions;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInRefreshPing;                                  // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_MatchmakingRegion(int32 EntryPoint);
	void Construct();
	void K2_RefreshQosData();
	void BndEvt__UMG_MatchmakingRegion_ButtonMain_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void SetPingStyle();
	void QueryPingState();
	void SetRegions(class UUMG_MatchmakingRegions_C* InWidget);
	void StartQos();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_MatchmakingRegion_C">();
	}
	static class UUMG_MatchmakingRegion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_MatchmakingRegion_C>();
	}
};
static_assert(alignof(UUMG_MatchmakingRegion_C) == 0x000008, "Wrong alignment on UUMG_MatchmakingRegion_C");
static_assert(sizeof(UUMG_MatchmakingRegion_C) == 0x000338, "Wrong size on UUMG_MatchmakingRegion_C");
static_assert(offsetof(UUMG_MatchmakingRegion_C, UberGraphFrame) == 0x000298, "Member 'UUMG_MatchmakingRegion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, Checking) == 0x0002A0, "Member 'UUMG_MatchmakingRegion_C::Checking' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, ButtonMain) == 0x0002A8, "Member 'UUMG_MatchmakingRegion_C::ButtonMain' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, ImageConfirm) == 0x0002B0, "Member 'UUMG_MatchmakingRegion_C::ImageConfirm' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, TextChecking) == 0x0002B8, "Member 'UUMG_MatchmakingRegion_C::TextChecking' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, TextMs) == 0x0002C0, "Member 'UUMG_MatchmakingRegion_C::TextMs' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, TextPING) == 0x0002C8, "Member 'UUMG_MatchmakingRegion_C::TextPING' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, TextRegionAddress) == 0x0002D0, "Member 'UUMG_MatchmakingRegion_C::TextRegionAddress' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, TextRegionName) == 0x0002D8, "Member 'UUMG_MatchmakingRegion_C::TextRegionName' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, ButtonConfirm) == 0x0002E0, "Member 'UUMG_MatchmakingRegion_C::ButtonConfirm' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, bHasConfirmed) == 0x0002F0, "Member 'UUMG_MatchmakingRegion_C::bHasConfirmed' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, ButtonCancelConfirm) == 0x0002F8, "Member 'UUMG_MatchmakingRegion_C::ButtonCancelConfirm' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, PingHasRefreshed) == 0x000308, "Member 'UUMG_MatchmakingRegion_C::PingHasRefreshed' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, PingIsInRefresh) == 0x000318, "Member 'UUMG_MatchmakingRegion_C::PingIsInRefresh' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, UMGRegions) == 0x000328, "Member 'UUMG_MatchmakingRegion_C::UMGRegions' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegion_C, bIsInRefreshPing) == 0x000330, "Member 'UUMG_MatchmakingRegion_C::bIsInRefreshPing' has a wrong offset!");

}

