#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_Velocity

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_HelmetHUD_Velocity.UMG_HelmetHUD_Velocity_C
// 0x0020 (0x0288 - 0x0268)
class UUMG_HelmetHUD_Velocity_C final : public UPBHelmetHUD_Velocity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Velocity;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_SpeedMeter;                                    // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MeterMaxSpeed;                                     // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_HelmetHUD_Velocity(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateVelocity();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_HelmetHUD_Velocity_C">();
	}
	static class UUMG_HelmetHUD_Velocity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_HelmetHUD_Velocity_C>();
	}
};
static_assert(alignof(UUMG_HelmetHUD_Velocity_C) == 0x000008, "Wrong alignment on UUMG_HelmetHUD_Velocity_C");
static_assert(sizeof(UUMG_HelmetHUD_Velocity_C) == 0x000288, "Wrong size on UUMG_HelmetHUD_Velocity_C");
static_assert(offsetof(UUMG_HelmetHUD_Velocity_C, UberGraphFrame) == 0x000268, "Member 'UUMG_HelmetHUD_Velocity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Velocity_C, Image_Velocity) == 0x000270, "Member 'UUMG_HelmetHUD_Velocity_C::Image_Velocity' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Velocity_C, DMI_SpeedMeter) == 0x000278, "Member 'UUMG_HelmetHUD_Velocity_C::DMI_SpeedMeter' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Velocity_C, MeterMaxSpeed) == 0x000280, "Member 'UUMG_HelmetHUD_Velocity_C::MeterMaxSpeed' has a wrong offset!");

}

