#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_VoiceTips

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_VoiceTips.UMG_VoiceTips_C
// 0x0018 (0x0278 - 0x0260)
class UUMG_VoiceTips_C final : public UPBUserWidget
{
public:
	class UImage*                                 Image_NameBg_L_1;                                  // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 isSpeaking;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpeakingUserName;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetPlayer(class FString& PlayerName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_VoiceTips_C">();
	}
	static class UUMG_VoiceTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_VoiceTips_C>();
	}
};
static_assert(alignof(UUMG_VoiceTips_C) == 0x000008, "Wrong alignment on UUMG_VoiceTips_C");
static_assert(sizeof(UUMG_VoiceTips_C) == 0x000278, "Wrong size on UUMG_VoiceTips_C");
static_assert(offsetof(UUMG_VoiceTips_C, Image_NameBg_L_1) == 0x000260, "Member 'UUMG_VoiceTips_C::Image_NameBg_L_1' has a wrong offset!");
static_assert(offsetof(UUMG_VoiceTips_C, isSpeaking) == 0x000268, "Member 'UUMG_VoiceTips_C::isSpeaking' has a wrong offset!");
static_assert(offsetof(UUMG_VoiceTips_C, SpeakingUserName) == 0x000270, "Member 'UUMG_VoiceTips_C::SpeakingUserName' has a wrong offset!");

}

