#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ModeFilter

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ModeFilter.UMG_ModeFilter_C
// 0x0140 (0x0478 - 0x0338)
class UUMG_ModeFilter_C final : public UPBGameModeFilter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_41;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_130;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_98;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Maps;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ModeName;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Players;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Victory;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ModeFilterOption_C*                UMG_ModeFilterOption;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ModeFilterOption_C*                UMG_ModeFilterOption_72;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Modes;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBPlaylistItemData                    PlaylistItemData;                                  // 0x03A0(0x00B8)(Edit, BlueprintVisible)
	class FName                                   SelectedMode;                                      // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         SelectedModes;                                     // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUMG_ModeFilterOption_C*                Selected_Mode_Option;                              // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ModeFilter(int32 EntryPoint);
	void CustomEvent_2(class FName ModeName, class UUMG_ModeFilterOption_C* SelectedModeOption);
	void CustomEvent_1();
	void K2_HandleConfirm();
	void BP_OnActivated();
	void K2_RefreshModeFilter();
	void Make_Match_Maps(TArray<struct FDataTableRowHandle>& Maps, class FText* UsabaleMapsText);
	void HandleSelectedModeOption();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ModeFilter_C">();
	}
	static class UUMG_ModeFilter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ModeFilter_C>();
	}
};
static_assert(alignof(UUMG_ModeFilter_C) == 0x000008, "Wrong alignment on UUMG_ModeFilter_C");
static_assert(sizeof(UUMG_ModeFilter_C) == 0x000478, "Wrong size on UUMG_ModeFilter_C");
static_assert(offsetof(UUMG_ModeFilter_C, UberGraphFrame) == 0x000338, "Member 'UUMG_ModeFilter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, Image) == 0x000340, "Member 'UUMG_ModeFilter_C::Image' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, Image_1) == 0x000348, "Member 'UUMG_ModeFilter_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, Image_41) == 0x000350, "Member 'UUMG_ModeFilter_C::Image_41' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, Image_130) == 0x000358, "Member 'UUMG_ModeFilter_C::Image_130' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, SafeZone_98) == 0x000360, "Member 'UUMG_ModeFilter_C::SafeZone_98' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, TextBlock_Maps) == 0x000368, "Member 'UUMG_ModeFilter_C::TextBlock_Maps' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, TextBlock_ModeName) == 0x000370, "Member 'UUMG_ModeFilter_C::TextBlock_ModeName' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, TextBlock_Players) == 0x000378, "Member 'UUMG_ModeFilter_C::TextBlock_Players' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, TextBlock_Victory) == 0x000380, "Member 'UUMG_ModeFilter_C::TextBlock_Victory' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, UMG_ModeFilterOption) == 0x000388, "Member 'UUMG_ModeFilter_C::UMG_ModeFilterOption' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, UMG_ModeFilterOption_72) == 0x000390, "Member 'UUMG_ModeFilter_C::UMG_ModeFilterOption_72' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, WrapBox_Modes) == 0x000398, "Member 'UUMG_ModeFilter_C::WrapBox_Modes' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, PlaylistItemData) == 0x0003A0, "Member 'UUMG_ModeFilter_C::PlaylistItemData' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, SelectedMode) == 0x000458, "Member 'UUMG_ModeFilter_C::SelectedMode' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, SelectedModes) == 0x000460, "Member 'UUMG_ModeFilter_C::SelectedModes' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilter_C, Selected_Mode_Option) == 0x000470, "Member 'UUMG_ModeFilter_C::Selected_Mode_Option' has a wrong offset!");

}

