#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ControllerButtonSettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.ExecuteUbergraph_UMG_ControllerButtonSettings
// 0x0118 (0x0118 - 0x0000)
struct UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool StartRecord)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue_1; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EInputDevice CurrentDevice)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& MainKey, const struct FKey& ViceKey)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FKey>                           CallFunc_GetKeysOfInput_ReturnValue;               // 0x0078(0x0010)(ReferenceParm)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x0088(0x0018)(HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Card_GamepadKeyBinding_C*          K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_MainKey;                        // 0x00D0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_ViceKey;                        // 0x00E8(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_StartRecord;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bQuitgame;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  K2Node_CustomEvent_CurrentDevice;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings");
static_assert(sizeof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings) == 0x000118, "Wrong size on UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, EntryPoint) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_GetDisplayName_ReturnValue_1) == 0x000028, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000038, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x000040, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000048, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_GetCurrentActivateInputDevice_ReturnValue_1) == 0x000050, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_GetCurrentActivateInputDevice_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, Temp_int_Array_Index_Variable) == 0x000064, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_GetKeysOfInput_ReturnValue) == 0x000078, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_GetKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_Array_Get_Item) == 0x000088, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_GetAllChildren_ReturnValue) == 0x0000A0, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding) == 0x0000C0, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_CustomEvent_MainKey) == 0x0000D0, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_CustomEvent_MainKey' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_CustomEvent_ViceKey) == 0x0000E8, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_CustomEvent_ViceKey' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_CustomEvent_StartRecord) == 0x000100, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_CustomEvent_StartRecord' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, Temp_int_Loop_Counter_Variable) == 0x000104, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_CustomEvent_bQuitgame) == 0x000108, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_CustomEvent_bQuitgame' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000109, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, CallFunc_Add_IntInt_ReturnValue) == 0x00010C, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings, K2Node_CustomEvent_CurrentDevice) == 0x000110, "Member 'UMG_ControllerButtonSettings_C_ExecuteUbergraph_UMG_ControllerButtonSettings::K2Node_CustomEvent_CurrentDevice' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.DSP_OnSwitchInputDevice_Event_0
// 0x0001 (0x0001 - 0x0000)
struct UMG_ControllerButtonSettings_C_DSP_OnSwitchInputDevice_Event_0 final
{
public:
	EInputDevice                                  CurrentDevice;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_DSP_OnSwitchInputDevice_Event_0) == 0x000001, "Wrong alignment on UMG_ControllerButtonSettings_C_DSP_OnSwitchInputDevice_Event_0");
static_assert(sizeof(UMG_ControllerButtonSettings_C_DSP_OnSwitchInputDevice_Event_0) == 0x000001, "Wrong size on UMG_ControllerButtonSettings_C_DSP_OnSwitchInputDevice_Event_0");
static_assert(offsetof(UMG_ControllerButtonSettings_C_DSP_OnSwitchInputDevice_Event_0, CurrentDevice) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_DSP_OnSwitchInputDevice_Event_0::CurrentDevice' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.BackEvent
// 0x0001 (0x0001 - 0x0000)
struct UMG_ControllerButtonSettings_C_BackEvent final
{
public:
	bool                                          bQuitgame;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_BackEvent) == 0x000001, "Wrong alignment on UMG_ControllerButtonSettings_C_BackEvent");
static_assert(sizeof(UMG_ControllerButtonSettings_C_BackEvent) == 0x000001, "Wrong size on UMG_ControllerButtonSettings_C_BackEvent");
static_assert(offsetof(UMG_ControllerButtonSettings_C_BackEvent, bQuitgame) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_BackEvent::bQuitgame' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.StartRecord
// 0x0001 (0x0001 - 0x0000)
struct UMG_ControllerButtonSettings_C_StartRecord final
{
public:
	bool                                          StartRecord_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_StartRecord) == 0x000001, "Wrong alignment on UMG_ControllerButtonSettings_C_StartRecord");
static_assert(sizeof(UMG_ControllerButtonSettings_C_StartRecord) == 0x000001, "Wrong size on UMG_ControllerButtonSettings_C_StartRecord");
static_assert(offsetof(UMG_ControllerButtonSettings_C_StartRecord, StartRecord_0) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_StartRecord::StartRecord_0' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.OnFocusAtButtons
// 0x0030 (0x0030 - 0x0000)
struct UMG_ControllerButtonSettings_C_OnFocusAtButtons final
{
public:
	struct FKey                                   MainKey;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FKey                                   ViceKey;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_OnFocusAtButtons) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_OnFocusAtButtons");
static_assert(sizeof(UMG_ControllerButtonSettings_C_OnFocusAtButtons) == 0x000030, "Wrong size on UMG_ControllerButtonSettings_C_OnFocusAtButtons");
static_assert(offsetof(UMG_ControllerButtonSettings_C_OnFocusAtButtons, MainKey) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_OnFocusAtButtons::MainKey' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_OnFocusAtButtons, ViceKey) == 0x000018, "Member 'UMG_ControllerButtonSettings_C_OnFocusAtButtons::ViceKey' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.ScrollItemFocus
// 0x0008 (0x0008 - 0x0000)
struct UMG_ControllerButtonSettings_C_ScrollItemFocus final
{
public:
	class UWidget*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_ScrollItemFocus) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_ScrollItemFocus");
static_assert(sizeof(UMG_ControllerButtonSettings_C_ScrollItemFocus) == 0x000008, "Wrong size on UMG_ControllerButtonSettings_C_ScrollItemFocus");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ScrollItemFocus, Item) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_ScrollItemFocus::Item' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.IsAllKeyAvaliable
// 0x0048 (0x0048 - 0x0000)
struct UMG_ControllerButtonSettings_C_IsAllKeyAvaliable final
{
public:
	bool                                          bReady;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Card_GamepadKeyBinding_C*          K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsKeyAvaliable_bReady;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_IsAllKeyAvaliable");
static_assert(sizeof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable) == 0x000048, "Wrong size on UMG_ControllerButtonSettings_C_IsAllKeyAvaliable");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, bReady) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::bReady' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, CallFunc_Array_Get_Item) == 0x000028, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding) == 0x000038, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsAllKeyAvaliable, CallFunc_IsKeyAvaliable_bReady) == 0x000041, "Member 'UMG_ControllerButtonSettings_C_IsAllKeyAvaliable::CallFunc_IsKeyAvaliable_bReady' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.ShowTips
// 0x0004 (0x0004 - 0x0000)
struct UMG_ControllerButtonSettings_C_ShowTips final
{
public:
	bool                                          bLeaveBinindTips;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllKeyAvaliable_bReady;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_ShowTips) == 0x000001, "Wrong alignment on UMG_ControllerButtonSettings_C_ShowTips");
static_assert(sizeof(UMG_ControllerButtonSettings_C_ShowTips) == 0x000004, "Wrong size on UMG_ControllerButtonSettings_C_ShowTips");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ShowTips, bLeaveBinindTips) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_ShowTips::bLeaveBinindTips' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ShowTips, CallFunc_IsAllKeyAvaliable_bReady) == 0x000001, "Member 'UMG_ControllerButtonSettings_C_ShowTips::CallFunc_IsAllKeyAvaliable_bReady' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ShowTips, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'UMG_ControllerButtonSettings_C_ShowTips::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ShowTips, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'UMG_ControllerButtonSettings_C_ShowTips::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.ConfirmLeave
// 0x0008 (0x0008 - 0x0000)
struct UMG_ControllerButtonSettings_C_ConfirmLeave final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_ConfirmLeave) == 0x000004, "Wrong alignment on UMG_ControllerButtonSettings_C_ConfirmLeave");
static_assert(sizeof(UMG_ControllerButtonSettings_C_ConfirmLeave) == 0x000008, "Wrong size on UMG_ControllerButtonSettings_C_ConfirmLeave");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmLeave, Index_0) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_ConfirmLeave::Index_0' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmLeave, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'UMG_ControllerButtonSettings_C_ConfirmLeave::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.OnKeyDown
// 0x02B8 (0x02B8 - 0x0000)
struct UMG_ControllerButtonSettings_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0140(0x00B8)()
	bool                                          CallFunc_IsContainsKey_bContains;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0200(0x00B8)()
};
static_assert(alignof(UMG_ControllerButtonSettings_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_OnKeyDown");
static_assert(sizeof(UMG_ControllerButtonSettings_C_OnKeyDown) == 0x0002B8, "Wrong size on UMG_ControllerButtonSettings_C_OnKeyDown");
static_assert(offsetof(UMG_ControllerButtonSettings_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_ControllerButtonSettings_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_ControllerButtonSettings_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'UMG_ControllerButtonSettings_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000140, "Member 'UMG_ControllerButtonSettings_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_OnKeyDown, CallFunc_IsContainsKey_bContains) == 0x0001F8, "Member 'UMG_ControllerButtonSettings_C_OnKeyDown::CallFunc_IsContainsKey_bContains' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000200, "Member 'UMG_ControllerButtonSettings_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.IsContainsKey
// 0x0048 (0x0048 - 0x0000)
struct UMG_ControllerButtonSettings_C_IsContainsKey final
{
public:
	class FName                                   InputActionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   InKey;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          bContains;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetKeysFromActionName_ReturnValue;        // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_IsContainsKey) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_IsContainsKey");
static_assert(sizeof(UMG_ControllerButtonSettings_C_IsContainsKey) == 0x000048, "Wrong size on UMG_ControllerButtonSettings_C_IsContainsKey");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsContainsKey, InputActionName) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_IsContainsKey::InputActionName' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsContainsKey, InKey) == 0x000008, "Member 'UMG_ControllerButtonSettings_C_IsContainsKey::InKey' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsContainsKey, bContains) == 0x000020, "Member 'UMG_ControllerButtonSettings_C_IsContainsKey::bContains' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsContainsKey, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000028, "Member 'UMG_ControllerButtonSettings_C_IsContainsKey::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsContainsKey, CallFunc_GetKeysFromActionName_ReturnValue) == 0x000030, "Member 'UMG_ControllerButtonSettings_C_IsContainsKey::CallFunc_GetKeysFromActionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_IsContainsKey, CallFunc_Array_Contains_ReturnValue) == 0x000040, "Member 'UMG_ControllerButtonSettings_C_IsContainsKey::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.HandleLeavePage
// 0x0020 (0x0020 - 0x0000)
struct UMG_ControllerButtonSettings_C_HandleLeavePage final
{
public:
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UPBPromptManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllKeyAvaliable_bReady;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_HandleLeavePage) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_HandleLeavePage");
static_assert(sizeof(UMG_ControllerButtonSettings_C_HandleLeavePage) == 0x000020, "Wrong size on UMG_ControllerButtonSettings_C_HandleLeavePage");
static_assert(offsetof(UMG_ControllerButtonSettings_C_HandleLeavePage, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_HandleLeavePage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_HandleLeavePage, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'UMG_ControllerButtonSettings_C_HandleLeavePage::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_HandleLeavePage, CallFunc_IsAllKeyAvaliable_bReady) == 0x000018, "Member 'UMG_ControllerButtonSettings_C_HandleLeavePage::CallFunc_IsAllKeyAvaliable_bReady' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.HandleReset
// 0x0018 (0x0018 - 0x0000)
struct UMG_ControllerButtonSettings_C_HandleReset final
{
public:
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UPBPromptManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_HandleReset) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_HandleReset");
static_assert(sizeof(UMG_ControllerButtonSettings_C_HandleReset) == 0x000018, "Wrong size on UMG_ControllerButtonSettings_C_HandleReset");
static_assert(offsetof(UMG_ControllerButtonSettings_C_HandleReset, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_HandleReset::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_HandleReset, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'UMG_ControllerButtonSettings_C_HandleReset::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.LeavePage
// 0x0020 (0x0020 - 0x0000)
struct UMG_ControllerButtonSettings_C_LeavePage final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerController_Menu*               K2Node_DynamicCast_AsPBPlayer_Controller_Menu;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_LeavePage) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_LeavePage");
static_assert(sizeof(UMG_ControllerButtonSettings_C_LeavePage) == 0x000020, "Wrong size on UMG_ControllerButtonSettings_C_LeavePage");
static_assert(offsetof(UMG_ControllerButtonSettings_C_LeavePage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_LeavePage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_LeavePage, K2Node_DynamicCast_AsPBPlayer_Controller_Menu) == 0x000008, "Member 'UMG_ControllerButtonSettings_C_LeavePage::K2Node_DynamicCast_AsPBPlayer_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_LeavePage, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UMG_ControllerButtonSettings_C_LeavePage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_LeavePage, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'UMG_ControllerButtonSettings_C_LeavePage::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.BP_OnHandleBackAction
// 0x0028 (0x0028 - 0x0000)
struct UMG_ControllerButtonSettings_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBPromptManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllKeyAvaliable_bReady;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_BP_OnHandleBackAction");
static_assert(sizeof(UMG_ControllerButtonSettings_C_BP_OnHandleBackAction) == 0x000028, "Wrong size on UMG_ControllerButtonSettings_C_BP_OnHandleBackAction");
static_assert(offsetof(UMG_ControllerButtonSettings_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_BP_OnHandleBackAction, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_ControllerButtonSettings_C_BP_OnHandleBackAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_BP_OnHandleBackAction, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'UMG_ControllerButtonSettings_C_BP_OnHandleBackAction::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_BP_OnHandleBackAction, CallFunc_IsAllKeyAvaliable_bReady) == 0x000020, "Member 'UMG_ControllerButtonSettings_C_BP_OnHandleBackAction::CallFunc_IsAllKeyAvaliable_bReady' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.ConfirmReset
// 0x0060 (0x0060 - 0x0000)
struct UMG_ControllerButtonSettings_C_ConfirmReset final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Card_GamepadKeyBinding_C*          K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_ConfirmReset) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_ConfirmReset");
static_assert(sizeof(UMG_ControllerButtonSettings_C_ConfirmReset) == 0x000060, "Wrong size on UMG_ControllerButtonSettings_C_ConfirmReset");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, Index_0) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::Index_0' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000018, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x000020, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, CallFunc_Array_Get_Item) == 0x000040, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding) == 0x000050, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_ConfirmReset, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'UMG_ControllerButtonSettings_C_ConfirmReset::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.FocusFirstOptionItem
// 0x0020 (0x0020 - 0x0000)
struct UMG_ControllerButtonSettings_C_FocusFirstOptionItem final
{
public:
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_FocusFirstOptionItem) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_FocusFirstOptionItem");
static_assert(sizeof(UMG_ControllerButtonSettings_C_FocusFirstOptionItem) == 0x000020, "Wrong size on UMG_ControllerButtonSettings_C_FocusFirstOptionItem");
static_assert(offsetof(UMG_ControllerButtonSettings_C_FocusFirstOptionItem, CallFunc_GetAllChildren_ReturnValue) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_FocusFirstOptionItem::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_FocusFirstOptionItem, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'UMG_ControllerButtonSettings_C_FocusFirstOptionItem::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_FocusFirstOptionItem, CallFunc_Array_Get_Item) == 0x000018, "Member 'UMG_ControllerButtonSettings_C_FocusFirstOptionItem::CallFunc_Array_Get_Item' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.RefreshAllKeyInfo
// 0x0048 (0x0048 - 0x0000)
struct UMG_ControllerButtonSettings_C_RefreshAllKeyInfo final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Card_GamepadKeyBinding_C*          K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_RefreshAllKeyInfo");
static_assert(sizeof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo) == 0x000048, "Wrong size on UMG_ControllerButtonSettings_C_RefreshAllKeyInfo");
static_assert(offsetof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_RefreshAllKeyInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_ControllerButtonSettings_C_RefreshAllKeyInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_ControllerButtonSettings_C_RefreshAllKeyInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'UMG_ControllerButtonSettings_C_RefreshAllKeyInfo::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'UMG_ControllerButtonSettings_C_RefreshAllKeyInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo, CallFunc_Array_Get_Item) == 0x000028, "Member 'UMG_ControllerButtonSettings_C_RefreshAllKeyInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UMG_ControllerButtonSettings_C_RefreshAllKeyInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo, K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding) == 0x000038, "Member 'UMG_ControllerButtonSettings_C_RefreshAllKeyInfo::K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_RefreshAllKeyInfo, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UMG_ControllerButtonSettings_C_RefreshAllKeyInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_ControllerButtonSettings.UMG_ControllerButtonSettings_C.SetKeybindInpuDevice
// 0x0048 (0x0048 - 0x0000)
struct UMG_ControllerButtonSettings_C_SetKeybindInpuDevice final
{
public:
	EInputDevice                                  InputPin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Card_GamepadKeyBinding_C*          K2Node_DynamicCast_AsUMG_Card_Gamepad_Key_Binding; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ControllerButtonSettings_C_SetKeybindInpuDevice) == 0x000008, "Wrong alignment on UMG_ControllerButtonSettings_C_SetKeybindInpuDevice");
static_assert(sizeof(UMG_ControllerButtonSettings_C_SetKeybindInpuDevice) == 0x000048, "Wrong size on UMG_ControllerButtonSettings_C_SetKeybindInpuDevice");
static_assert(offsetof(UMG_ControllerButtonSettings_C_SetKeybindInpuDevice, InputPin) == 0x000000, "Member 'UMG_ControllerButtonSettings_C_SetKeybindInpuDevice::InputPin' has a wrong offset!");
static_assert(offsetof(UMG_ControllerButtonSettings_C_SetKeybindInpuDevice, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'UMG_ControllerButtonSettings_C_SetKeybindInpuDevice::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
