#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FieldModInventoryDetail

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_FieldModInventoryDetail.UMG_FieldModInventoryDetail_C.RefreshInventoryInfo
// 0x0438 (0x0438 - 0x0000)
struct UMG_FieldModInventoryDetail_C_RefreshInventoryInfo final
{
public:
	EPBCharacterSlotType                          SelectCharterSlot_0;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ComparedInventoryId;                               // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SelectInventoryId;                                 // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SelectCharacterId_0;                               // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBFieldModManager_BP_C*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBDataTableManager*                    CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBFieldModManager_BP_C*                CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBFieldModManager_BP_C*                CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCharacterSlotType                          CallFunc_GetSelectCharacterSlot_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSelectItemID_ReturnValue;              // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEquippingItemIDInSlotType_ReturnValue; // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSelectCharacterID_ReturnValue;         // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPreOrderingItemIDInSlotType_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBPlayerState*                         K2Node_DynamicCast_AsPBPlayer_State;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponDefinitionRedirectionRow      CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemDescription                     CallFunc_GetItemDescription_ReturnValue;           // 0x00B8(0x00B0)()
	struct FPBWeaponDefinitionRow                 CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0168(0x0210)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0380(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWeaponSubTypeName_NewParam;            // 0x03A0(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x03BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponNetworkConfig                 CallFunc_GetWeaponNetworkConfig_ReturnValue;       // 0x03C8(0x0038)()
	struct FPBWeaponNetworkConfig                 CallFunc_GetWeaponNetworkConfig_ReturnValue_1;     // 0x0400(0x0038)()
};
static_assert(alignof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo) == 0x000008, "Wrong alignment on UMG_FieldModInventoryDetail_C_RefreshInventoryInfo");
static_assert(sizeof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo) == 0x000438, "Wrong size on UMG_FieldModInventoryDetail_C_RefreshInventoryInfo");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, SelectCharterSlot_0) == 0x000000, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::SelectCharterSlot_0' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, ComparedInventoryId) == 0x000004, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::ComparedInventoryId' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, SelectInventoryId) == 0x00000C, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::SelectInventoryId' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, SelectCharacterId_0) == 0x000014, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::SelectCharacterId_0' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, Temp_text_Variable) == 0x000020, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, Temp_bool_Variable) == 0x000038, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000040, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000048, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000050, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x000058, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetSelectCharacterSlot_ReturnValue) == 0x000060, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetSelectCharacterSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetSelectItemID_ReturnValue) == 0x000064, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetSelectItemID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetEquippingItemIDInSlotType_ReturnValue) == 0x00006C, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetEquippingItemIDInSlotType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetSelectCharacterID_ReturnValue) == 0x000074, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetSelectCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, Temp_bool_Variable_1) == 0x00007C, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetPreOrderingItemIDInSlotType_ReturnValue) == 0x000080, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetPreOrderingItemIDInSlotType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, K2Node_DynamicCast_AsPBPlayer_State) == 0x000090, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::K2Node_DynamicCast_AsPBPlayer_State' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_NotEqual_NameName_ReturnValue) == 0x000099, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000A0, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B0, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000B1, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetItemDescription_ReturnValue) == 0x0000B8, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000168, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000378, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, K2Node_Select_Default) == 0x000380, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000398, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetWeaponSubTypeName_NewParam) == 0x0003A0, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetWeaponSubTypeName_NewParam' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_BooleanAND_ReturnValue) == 0x0003B8, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, K2Node_Select_Default_1) == 0x0003BC, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, K2Node_SwitchEnum_CmpSuccess) == 0x0003C4, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetWeaponNetworkConfig_ReturnValue) == 0x0003C8, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetWeaponNetworkConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshInventoryInfo, CallFunc_GetWeaponNetworkConfig_ReturnValue_1) == 0x000400, "Member 'UMG_FieldModInventoryDetail_C_RefreshInventoryInfo::CallFunc_GetWeaponNetworkConfig_ReturnValue_1' has a wrong offset!");

// Function UMG_FieldModInventoryDetail.UMG_FieldModInventoryDetail_C.Init Inventory Info
// 0x03B0 (0x03B0 - 0x0000)
struct UMG_FieldModInventoryDetail_C_Init_Inventory_Info final
{
public:
	class UPBDataTableManager*                    CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBFieldModManager_BP_C*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBFieldModManager_BP_C*                CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCharacterSlotType                          CallFunc_GetSelectCharacterSlot_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEquippingItemIDInSlotType_ReturnValue; // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSelectCharacterID_ReturnValue;         // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponDefinitionRedirectionRow      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemDescription                     CallFunc_GetItemDescription_ReturnValue;           // 0x0048(0x00B0)()
	struct FPBWeaponDefinitionRow                 CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00F8(0x0210)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharacterSlotText_ReturnValue;         // 0x0310(0x0018)()
	class FText                                   CallFunc_GetWeaponSubTypeName_NewParam;            // 0x0328(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0348(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0360(0x0018)()
	struct FPBWeaponNetworkConfig                 CallFunc_GetWeaponNetworkConfig_ReturnValue;       // 0x0378(0x0038)()
};
static_assert(alignof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info) == 0x000008, "Wrong alignment on UMG_FieldModInventoryDetail_C_Init_Inventory_Info");
static_assert(sizeof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info) == 0x0003B0, "Wrong size on UMG_FieldModInventoryDetail_C_Init_Inventory_Info");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000000, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000010, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetSelectCharacterSlot_ReturnValue) == 0x000018, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetSelectCharacterSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetEquippingItemIDInSlotType_ReturnValue) == 0x00001C, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetEquippingItemIDInSlotType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetSelectCharacterID_ReturnValue) == 0x000024, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetSelectCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, Temp_bool_Variable) == 0x00002C, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000040, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000041, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetItemDescription_ReturnValue) == 0x000048, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000F8, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000308, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetCharacterSlotText_ReturnValue) == 0x000310, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetCharacterSlotText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetWeaponSubTypeName_NewParam) == 0x000328, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetWeaponSubTypeName_NewParam' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, K2Node_SwitchEnum_CmpSuccess) == 0x000340, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_TextIsEmpty_ReturnValue) == 0x000341, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, Temp_text_Variable) == 0x000348, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, K2Node_Select_Default) == 0x000360, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_Init_Inventory_Info, CallFunc_GetWeaponNetworkConfig_ReturnValue) == 0x000378, "Member 'UMG_FieldModInventoryDetail_C_Init_Inventory_Info::CallFunc_GetWeaponNetworkConfig_ReturnValue' has a wrong offset!");

// Function UMG_FieldModInventoryDetail.UMG_FieldModInventoryDetail_C.RefreshCharacterInfo
// 0x0008 (0x0008 - 0x0000)
struct UMG_FieldModInventoryDetail_C_RefreshCharacterInfo final
{
public:
	class FName                                   NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FieldModInventoryDetail_C_RefreshCharacterInfo) == 0x000004, "Wrong alignment on UMG_FieldModInventoryDetail_C_RefreshCharacterInfo");
static_assert(sizeof(UMG_FieldModInventoryDetail_C_RefreshCharacterInfo) == 0x000008, "Wrong size on UMG_FieldModInventoryDetail_C_RefreshCharacterInfo");
static_assert(offsetof(UMG_FieldModInventoryDetail_C_RefreshCharacterInfo, NewParam) == 0x000000, "Member 'UMG_FieldModInventoryDetail_C_RefreshCharacterInfo::NewParam' has a wrong offset!");

}

