#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_WaitingTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MainMenuWidget_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_WaitingTips.UMG_WaitingTips_C
// 0x0030 (0x0320 - 0x02F0)
class UUMG_WaitingTips_C final : public UMainMenuWidget_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_WaitingTips_C;                  // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_TipS;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Waiting;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_143;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WaitingTitle;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Notify;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_WaitingTips(int32 EntryPoint);
	void ShowIn();
	void PreConstruct(bool IsDesignTime);
	void WaitingForSeverCallBack();
	void WaitingForJoinTeam();
	void SetInfo(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_WaitingTips_C">();
	}
	static class UUMG_WaitingTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_WaitingTips_C>();
	}
};
static_assert(alignof(UUMG_WaitingTips_C) == 0x000008, "Wrong alignment on UUMG_WaitingTips_C");
static_assert(sizeof(UUMG_WaitingTips_C) == 0x000320, "Wrong size on UUMG_WaitingTips_C");
static_assert(offsetof(UUMG_WaitingTips_C, UberGraphFrame_UMG_WaitingTips_C) == 0x0002F0, "Member 'UUMG_WaitingTips_C::UberGraphFrame_UMG_WaitingTips_C' has a wrong offset!");
static_assert(offsetof(UUMG_WaitingTips_C, CanvasPanel_TipS) == 0x0002F8, "Member 'UUMG_WaitingTips_C::CanvasPanel_TipS' has a wrong offset!");
static_assert(offsetof(UUMG_WaitingTips_C, CanvasPanel_Waiting) == 0x000300, "Member 'UUMG_WaitingTips_C::CanvasPanel_Waiting' has a wrong offset!");
static_assert(offsetof(UUMG_WaitingTips_C, Image_143) == 0x000308, "Member 'UUMG_WaitingTips_C::Image_143' has a wrong offset!");
static_assert(offsetof(UUMG_WaitingTips_C, WaitingTitle) == 0x000310, "Member 'UUMG_WaitingTips_C::WaitingTitle' has a wrong offset!");
static_assert(offsetof(UUMG_WaitingTips_C, WidgetSwitcher_Notify) == 0x000318, "Member 'UUMG_WaitingTips_C::WidgetSwitcher_Notify' has a wrong offset!");

}

