#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Medal_Small

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Medal_Small.UMG_Medal_Small_C
// 0x0090 (0x02F0 - 0x0260)
class UUMG_Medal_Small_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Main;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Horver;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Num;                                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FPBMedalDetailsDataTableRowBase& InMedalDetail, int32 InCount, class UUMG_Medal_Small_C* InSelectedMedal)> OnMedalSelected;                                   // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FPBMedalDetailsDataTableRowBase        MedalDetail;                                       // 0x02A8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Count;                                             // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_Medal_Small(int32 EntryPoint);
	void BndEvt__UMG_Medal_Small_Button_Main_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__UMG_Medal_Small_Button_Main_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Init(struct FPBMedalDetailsDataTableRowBase& InMedalDetail);
	void RefreshMedalCount(int32 InCount);
	void SetSelected();
	void SetUnselected();
	void SetDefaultFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Medal_Small_C">();
	}
	static class UUMG_Medal_Small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Medal_Small_C>();
	}
};
static_assert(alignof(UUMG_Medal_Small_C) == 0x000008, "Wrong alignment on UUMG_Medal_Small_C");
static_assert(sizeof(UUMG_Medal_Small_C) == 0x0002F0, "Wrong size on UUMG_Medal_Small_C");
static_assert(offsetof(UUMG_Medal_Small_C, UberGraphFrame) == 0x000260, "Member 'UUMG_Medal_Small_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, Button_Main) == 0x000268, "Member 'UUMG_Medal_Small_C::Button_Main' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, Image_Horver) == 0x000270, "Member 'UUMG_Medal_Small_C::Image_Horver' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, Image_Icon) == 0x000278, "Member 'UUMG_Medal_Small_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, Image_Selected) == 0x000280, "Member 'UUMG_Medal_Small_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, Name_0) == 0x000288, "Member 'UUMG_Medal_Small_C::Name_0' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, Num) == 0x000290, "Member 'UUMG_Medal_Small_C::Num' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, OnMedalSelected) == 0x000298, "Member 'UUMG_Medal_Small_C::OnMedalSelected' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, MedalDetail) == 0x0002A8, "Member 'UUMG_Medal_Small_C::MedalDetail' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, Count) == 0x0002E8, "Member 'UUMG_Medal_Small_C::Count' has a wrong offset!");
static_assert(offsetof(UUMG_Medal_Small_C, IsSelected) == 0x0002EC, "Member 'UUMG_Medal_Small_C::IsSelected' has a wrong offset!");

}

