#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PlaylistItem

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_PlaylistItem.UMG_PlaylistItem_C
// 0x0058 (0x0370 - 0x0318)
class UUMG_PlaylistItem_C final : public UPBPlaylistItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FocusOn;                                           // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Collapse;                                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                Spacer_45;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_DisplayModeFilterButton_C*         UMG_DisplayModeFilterButton;                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Art_ImageBox_6_C*              UMG_STD_Art_ImageBox_6;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Searching;                                         // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsSelected;                                       // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UUMG_PlaylistItem_C* PlaylistItem)> Btn_Hover;                                         // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Btn_Clicked;                                       // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_PlaylistItem(int32 EntryPoint);
	void BndEvt__UMG_PlaylistItem_UMG_DisplayModeFilterButton_K2Node_ComponentBoundEvent_0_Click__DelegateSignature();
	void BndEvt__UMG_DisplayMode_UMG_STD_Art_ImageBox_6_K2Node_ComponentBoundEvent_7_Btn_Unhover__DelegateSignature();
	void BndEvt__UMG_DisplayMode_UMG_STD_Art_ImageBox_6_K2Node_ComponentBoundEvent_6_Btn_Hover__DelegateSignature();
	void BndEvt__UMG_DisplayMode_UMG_STD_Art_ImageBox_6_K2Node_ComponentBoundEvent_5_Btn_Clicked__DelegateSignature();
	void K2_RefreshData();
	void RefreshSearchMode(bool IsPartyMember);
	void RefreshNormalMode();
	void RefreshPartyStatus(bool IsPartMember);
	void SetNormalMode(bool NeedRevertFocusAnimtion);
	void SetSearchMode(bool IsPartyMember);
	void DisplayModeFilter();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_PlaylistItem_C">();
	}
	static class UUMG_PlaylistItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_PlaylistItem_C>();
	}
};
static_assert(alignof(UUMG_PlaylistItem_C) == 0x000008, "Wrong alignment on UUMG_PlaylistItem_C");
static_assert(sizeof(UUMG_PlaylistItem_C) == 0x000370, "Wrong size on UUMG_PlaylistItem_C");
static_assert(offsetof(UUMG_PlaylistItem_C, UberGraphFrame) == 0x000318, "Member 'UUMG_PlaylistItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_PlaylistItem_C, FocusOn) == 0x000320, "Member 'UUMG_PlaylistItem_C::FocusOn' has a wrong offset!");
static_assert(offsetof(UUMG_PlaylistItem_C, Collapse) == 0x000328, "Member 'UUMG_PlaylistItem_C::Collapse' has a wrong offset!");
static_assert(offsetof(UUMG_PlaylistItem_C, Spacer_45) == 0x000330, "Member 'UUMG_PlaylistItem_C::Spacer_45' has a wrong offset!");
static_assert(offsetof(UUMG_PlaylistItem_C, UMG_DisplayModeFilterButton) == 0x000338, "Member 'UUMG_PlaylistItem_C::UMG_DisplayModeFilterButton' has a wrong offset!");
static_assert(offsetof(UUMG_PlaylistItem_C, UMG_STD_Art_ImageBox_6) == 0x000340, "Member 'UUMG_PlaylistItem_C::UMG_STD_Art_ImageBox_6' has a wrong offset!");
static_assert(offsetof(UUMG_PlaylistItem_C, Searching) == 0x000348, "Member 'UUMG_PlaylistItem_C::Searching' has a wrong offset!");
static_assert(offsetof(UUMG_PlaylistItem_C, bIsSelected) == 0x000349, "Member 'UUMG_PlaylistItem_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UUMG_PlaylistItem_C, Btn_Hover) == 0x000350, "Member 'UUMG_PlaylistItem_C::Btn_Hover' has a wrong offset!");
static_assert(offsetof(UUMG_PlaylistItem_C, Btn_Clicked) == 0x000360, "Member 'UUMG_PlaylistItem_C::Btn_Clicked' has a wrong offset!");

}

