#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CareerWeapon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_CareerWeapon.UMG_CareerWeapon_C.ExecuteUbergraph_UMG_CareerWeapon
// 0x0004 (0x0004 - 0x0000)
struct UMG_CareerWeapon_C_ExecuteUbergraph_UMG_CareerWeapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CareerWeapon_C_ExecuteUbergraph_UMG_CareerWeapon) == 0x000004, "Wrong alignment on UMG_CareerWeapon_C_ExecuteUbergraph_UMG_CareerWeapon");
static_assert(sizeof(UMG_CareerWeapon_C_ExecuteUbergraph_UMG_CareerWeapon) == 0x000004, "Wrong size on UMG_CareerWeapon_C_ExecuteUbergraph_UMG_CareerWeapon");
static_assert(offsetof(UMG_CareerWeapon_C_ExecuteUbergraph_UMG_CareerWeapon, EntryPoint) == 0x000000, "Member 'UMG_CareerWeapon_C_ExecuteUbergraph_UMG_CareerWeapon::EntryPoint' has a wrong offset!");

// Function UMG_CareerWeapon.UMG_CareerWeapon_C.InitWeaponList
// 0x0098 (0x0098 - 0x0000)
struct UMG_CareerWeapon_C_InitWeaponList final
{
public:
	class UUMG_ProgressionWeaponItem_C*           WeaponWidget;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBProgressionManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetWeaponIDArray_ReturnValue;             // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WeaponID, class UUMG_ProgressionWeaponItem_C* ClickedWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionWeaponItem_C*           CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerWeapon_C_InitWeaponList) == 0x000008, "Wrong alignment on UMG_CareerWeapon_C_InitWeaponList");
static_assert(sizeof(UMG_CareerWeapon_C_InitWeaponList) == 0x000098, "Wrong size on UMG_CareerWeapon_C_InitWeaponList");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, WeaponWidget) == 0x000000, "Member 'UMG_CareerWeapon_C_InitWeaponList::WeaponWidget' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UMG_CareerWeapon_C_InitWeaponList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_GetWeaponIDArray_ReturnValue) == 0x000018, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_GetWeaponIDArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_Array_Get_Item) == 0x00002C, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000034, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, Temp_int_Array_Index_Variable) == 0x000040, "Member 'UMG_CareerWeapon_C_InitWeaponList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_Array_Get_Item_1) == 0x000044, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'UMG_CareerWeapon_C_InitWeaponList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_Create_ReturnValue) == 0x000068, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, K2Node_MakeStruct_Margin) == 0x000070, "Member 'UMG_CareerWeapon_C_InitWeaponList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'UMG_CareerWeapon_C_InitWeaponList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000088, "Member 'UMG_CareerWeapon_C_InitWeaponList::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_InitWeaponList, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'UMG_CareerWeapon_C_InitWeaponList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_CareerWeapon.UMG_CareerWeapon_C.OnSelectedWeapon
// 0x0010 (0x0010 - 0x0000)
struct UMG_CareerWeapon_C_OnSelectedWeapon final
{
public:
	class FName                                   WeaponID_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionWeaponItem_C*           ClickedWidget;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CareerWeapon_C_OnSelectedWeapon) == 0x000008, "Wrong alignment on UMG_CareerWeapon_C_OnSelectedWeapon");
static_assert(sizeof(UMG_CareerWeapon_C_OnSelectedWeapon) == 0x000010, "Wrong size on UMG_CareerWeapon_C_OnSelectedWeapon");
static_assert(offsetof(UMG_CareerWeapon_C_OnSelectedWeapon, WeaponID_0) == 0x000000, "Member 'UMG_CareerWeapon_C_OnSelectedWeapon::WeaponID_0' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_OnSelectedWeapon, ClickedWidget) == 0x000008, "Member 'UMG_CareerWeapon_C_OnSelectedWeapon::ClickedWidget' has a wrong offset!");

// Function UMG_CareerWeapon.UMG_CareerWeapon_C.UnfocusCurrentWeapon
// 0x0001 (0x0001 - 0x0000)
struct UMG_CareerWeapon_C_UnfocusCurrentWeapon final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerWeapon_C_UnfocusCurrentWeapon) == 0x000001, "Wrong alignment on UMG_CareerWeapon_C_UnfocusCurrentWeapon");
static_assert(sizeof(UMG_CareerWeapon_C_UnfocusCurrentWeapon) == 0x000001, "Wrong size on UMG_CareerWeapon_C_UnfocusCurrentWeapon");
static_assert(offsetof(UMG_CareerWeapon_C_UnfocusCurrentWeapon, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_CareerWeapon_C_UnfocusCurrentWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_CareerWeapon.UMG_CareerWeapon_C.FocusOnFirstWeapon
// 0x0010 (0x0010 - 0x0000)
struct UMG_CareerWeapon_C_FocusOnFirstWeapon final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerWeapon_C_FocusOnFirstWeapon) == 0x000008, "Wrong alignment on UMG_CareerWeapon_C_FocusOnFirstWeapon");
static_assert(sizeof(UMG_CareerWeapon_C_FocusOnFirstWeapon) == 0x000010, "Wrong size on UMG_CareerWeapon_C_FocusOnFirstWeapon");
static_assert(offsetof(UMG_CareerWeapon_C_FocusOnFirstWeapon, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'UMG_CareerWeapon_C_FocusOnFirstWeapon::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_FocusOnFirstWeapon, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_CareerWeapon_C_FocusOnFirstWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_CareerWeapon.UMG_CareerWeapon_C.FloatToPercentage
// 0x0078 (0x0078 - 0x0000)
struct UMG_CareerWeapon_C_FloatToPercentage final
{
public:
	float                                         B;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0028(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
};
static_assert(alignof(UMG_CareerWeapon_C_FloatToPercentage) == 0x000008, "Wrong alignment on UMG_CareerWeapon_C_FloatToPercentage");
static_assert(sizeof(UMG_CareerWeapon_C_FloatToPercentage) == 0x000078, "Wrong size on UMG_CareerWeapon_C_FloatToPercentage");
static_assert(offsetof(UMG_CareerWeapon_C_FloatToPercentage, B) == 0x000000, "Member 'UMG_CareerWeapon_C_FloatToPercentage::B' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_FloatToPercentage, ReturnValue) == 0x000008, "Member 'UMG_CareerWeapon_C_FloatToPercentage::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_FloatToPercentage, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'UMG_CareerWeapon_C_FloatToPercentage::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_FloatToPercentage, CallFunc_Conv_FloatToText_ReturnValue) == 0x000028, "Member 'UMG_CareerWeapon_C_FloatToPercentage::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_FloatToPercentage, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'UMG_CareerWeapon_C_FloatToPercentage::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_FloatToPercentage, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'UMG_CareerWeapon_C_FloatToPercentage::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_FloatToPercentage, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'UMG_CareerWeapon_C_FloatToPercentage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UMG_CareerWeapon.UMG_CareerWeapon_C.SetWeaponDataInfo
// 0x02C0 (0x02C0 - 0x0000)
struct UMG_CareerWeapon_C_SetWeaponDataInfo final
{
public:
	struct FPBWeaponProfileData                   LWeaponData;                                       // 0x0000(0x0014)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponDefinitionRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0210)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FloatToPercentage_ReturnValue;            // 0x0230(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0248(0x0018)()
	class FText                                   CallFunc_FloatToPercentage_ReturnValue_1;          // 0x0260(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0278(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0290(0x0018)()
	struct FPBWeaponProfileData                   CallFunc_Map_Find_Value;                           // 0x02A8(0x0014)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerWeapon_C_SetWeaponDataInfo) == 0x000008, "Wrong alignment on UMG_CareerWeapon_C_SetWeaponDataInfo");
static_assert(sizeof(UMG_CareerWeapon_C_SetWeaponDataInfo) == 0x0002C0, "Wrong size on UMG_CareerWeapon_C_SetWeaponDataInfo");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, LWeaponData) == 0x000000, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::LWeaponData' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000228, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, CallFunc_FloatToPercentage_ReturnValue) == 0x000230, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::CallFunc_FloatToPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000248, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, CallFunc_FloatToPercentage_ReturnValue_1) == 0x000260, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::CallFunc_FloatToPercentage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000278, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000290, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, CallFunc_Map_Find_Value) == 0x0002A8, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_CareerWeapon_C_SetWeaponDataInfo, CallFunc_Map_Find_ReturnValue) == 0x0002BC, "Member 'UMG_CareerWeapon_C_SetWeaponDataInfo::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function UMG_CareerWeapon.UMG_CareerWeapon_C.RestoreFocus
// 0x0001 (0x0001 - 0x0000)
struct UMG_CareerWeapon_C_RestoreFocus final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CareerWeapon_C_RestoreFocus) == 0x000001, "Wrong alignment on UMG_CareerWeapon_C_RestoreFocus");
static_assert(sizeof(UMG_CareerWeapon_C_RestoreFocus) == 0x000001, "Wrong size on UMG_CareerWeapon_C_RestoreFocus");
static_assert(offsetof(UMG_CareerWeapon_C_RestoreFocus, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_CareerWeapon_C_RestoreFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

