#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FriendsList_Widget

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_FriendsList_Widget.UMG_FriendsList_Widget_C
// 0x0050 (0x0398 - 0x0348)
class UUMG_FriendsList_Widget_C final : public UPBFriendsListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             OnlineCount;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBFlippingBook*                        PBFlippingBook_Friends;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Down;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Up;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PageCount;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PageIndex;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalCount;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SwitcherLeft_C*                    UMG_SwitcherLeft;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SwitcherRight_C*                   UMG_SwitcherRight;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_FriendsList_Widget(int32 EntryPoint);
	void BP_OnActivated();
	void Destruct();
	void Construct();
	void BndEvt__UMG_FriendsList_Widget_UMG_SwitcherRight_K2Node_ComponentBoundEvent_1_OnRightArrowClicked__DelegateSignature();
	void BndEvt__UMG_FriendsList_Widget_UMG_SwitcherLeft_K2Node_ComponentBoundEvent_0_OnLeftArrowClicked__DelegateSignature();
	void OnInitialized();
	void DSP_OnSwitchInputDevice_Event_0(EInputDevice CurrentDevice);
	void K2_RefreshFriendsListCompleted();
	void RefreshInfo();
	void RefreshFlippingBook();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void UpdateInputDeviceInfo(EInputDevice Selection);
	void SwitcherToLeft();
	void SwitcherToRight();
	void SetDefaultFocus();
	void RefreshSwitcherInfo();
	void GetLogicServerID(int32 InIndex, struct FUniqueNetIdRepl* LogicServerID);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_FriendsList_Widget_C">();
	}
	static class UUMG_FriendsList_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_FriendsList_Widget_C>();
	}
};
static_assert(alignof(UUMG_FriendsList_Widget_C) == 0x000008, "Wrong alignment on UUMG_FriendsList_Widget_C");
static_assert(sizeof(UUMG_FriendsList_Widget_C) == 0x000398, "Wrong size on UUMG_FriendsList_Widget_C");
static_assert(offsetof(UUMG_FriendsList_Widget_C, UberGraphFrame) == 0x000348, "Member 'UUMG_FriendsList_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_FriendsList_Widget_C, OnlineCount) == 0x000350, "Member 'UUMG_FriendsList_Widget_C::OnlineCount' has a wrong offset!");
static_assert(offsetof(UUMG_FriendsList_Widget_C, PBFlippingBook_Friends) == 0x000358, "Member 'UUMG_FriendsList_Widget_C::PBFlippingBook_Friends' has a wrong offset!");
static_assert(offsetof(UUMG_FriendsList_Widget_C, SizeBox_Down) == 0x000360, "Member 'UUMG_FriendsList_Widget_C::SizeBox_Down' has a wrong offset!");
static_assert(offsetof(UUMG_FriendsList_Widget_C, SizeBox_Up) == 0x000368, "Member 'UUMG_FriendsList_Widget_C::SizeBox_Up' has a wrong offset!");
static_assert(offsetof(UUMG_FriendsList_Widget_C, TextBlock_PageCount) == 0x000370, "Member 'UUMG_FriendsList_Widget_C::TextBlock_PageCount' has a wrong offset!");
static_assert(offsetof(UUMG_FriendsList_Widget_C, TextBlock_PageIndex) == 0x000378, "Member 'UUMG_FriendsList_Widget_C::TextBlock_PageIndex' has a wrong offset!");
static_assert(offsetof(UUMG_FriendsList_Widget_C, TotalCount) == 0x000380, "Member 'UUMG_FriendsList_Widget_C::TotalCount' has a wrong offset!");
static_assert(offsetof(UUMG_FriendsList_Widget_C, UMG_SwitcherLeft) == 0x000388, "Member 'UUMG_FriendsList_Widget_C::UMG_SwitcherLeft' has a wrong offset!");
static_assert(offsetof(UUMG_FriendsList_Widget_C, UMG_SwitcherRight) == 0x000390, "Member 'UUMG_FriendsList_Widget_C::UMG_SwitcherRight' has a wrong offset!");

}

