#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Party_Widget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Party_Widget.UMG_Party_Widget_C
// 0x0040 (0x0370 - 0x0330)
class UUMG_Party_Widget_C final : public UPBPartyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Refresh;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Focus;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PartyFailed;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PartyMembers;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BusinessCard_C*                    UMG_BusinessCard;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 MemberNum)> OnPartyRefreshed;                                  // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_Party_Widget(int32 EntryPoint);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__UMG_Party_Widget_Button_Refresh_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void K2_OnPartyRefreshed(const TArray<class UPBUserObject*>& InPartyMemberObjects);
	void K2_OnCreatePartyFinished(bool bWasSuccessful);
	void BndEvt__UMG_Party_Widget_Button_Refresh_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void RefreshParty();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Party_Widget_C">();
	}
	static class UUMG_Party_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Party_Widget_C>();
	}
};
static_assert(alignof(UUMG_Party_Widget_C) == 0x000008, "Wrong alignment on UUMG_Party_Widget_C");
static_assert(sizeof(UUMG_Party_Widget_C) == 0x000370, "Wrong size on UUMG_Party_Widget_C");
static_assert(offsetof(UUMG_Party_Widget_C, UberGraphFrame) == 0x000330, "Member 'UUMG_Party_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Party_Widget_C, Button_Refresh) == 0x000338, "Member 'UUMG_Party_Widget_C::Button_Refresh' has a wrong offset!");
static_assert(offsetof(UUMG_Party_Widget_C, Image_Focus) == 0x000340, "Member 'UUMG_Party_Widget_C::Image_Focus' has a wrong offset!");
static_assert(offsetof(UUMG_Party_Widget_C, PartyFailed) == 0x000348, "Member 'UUMG_Party_Widget_C::PartyFailed' has a wrong offset!");
static_assert(offsetof(UUMG_Party_Widget_C, PartyMembers) == 0x000350, "Member 'UUMG_Party_Widget_C::PartyMembers' has a wrong offset!");
static_assert(offsetof(UUMG_Party_Widget_C, UMG_BusinessCard) == 0x000358, "Member 'UUMG_Party_Widget_C::UMG_BusinessCard' has a wrong offset!");
static_assert(offsetof(UUMG_Party_Widget_C, OnPartyRefreshed) == 0x000360, "Member 'UUMG_Party_Widget_C::OnPartyRefreshed' has a wrong offset!");

}

