#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_OverBoost

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_HelmetHUD_OverBoost.UMG_HelmetHUD_OverBoost_C.ExecuteUbergraph_UMG_HelmetHUD_OverBoost
// 0x0058 (0x0058 - 0x0000)
struct UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InCoolDownDuration;                   // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EInputDevice CurrentDevice)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InActiveDuration;                     // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost) == 0x000008, "Wrong alignment on UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost");
static_assert(sizeof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost) == 0x000058, "Wrong size on UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost, EntryPoint) == 0x000000, "Member 'UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost, K2Node_Event_InCoolDownDuration) == 0x000004, "Member 'UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost::K2Node_Event_InCoolDownDuration' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x000020, "Member 'UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost, K2Node_Event_InActiveDuration) == 0x000024, "Member 'UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost::K2Node_Event_InActiveDuration' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost, CallFunc_PlayAnimationForward_ReturnValue) == 0x000050, "Member 'UMG_HelmetHUD_OverBoost_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoost::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoost.UMG_HelmetHUD_OverBoost_C.K2_RefreshOverBoostActivateInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_OverBoost_C_K2_RefreshOverBoostActivateInfo final
{
public:
	float                                         InActiveDuration;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoost_C_K2_RefreshOverBoostActivateInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoost_C_K2_RefreshOverBoostActivateInfo");
static_assert(sizeof(UMG_HelmetHUD_OverBoost_C_K2_RefreshOverBoostActivateInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_OverBoost_C_K2_RefreshOverBoostActivateInfo");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_K2_RefreshOverBoostActivateInfo, InActiveDuration) == 0x000000, "Member 'UMG_HelmetHUD_OverBoost_C_K2_RefreshOverBoostActivateInfo::InActiveDuration' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoost.UMG_HelmetHUD_OverBoost_C.K2_RefreshCoolDownInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_OverBoost_C_K2_RefreshCoolDownInfo final
{
public:
	float                                         InCoolDownDuration;                                // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoost_C_K2_RefreshCoolDownInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoost_C_K2_RefreshCoolDownInfo");
static_assert(sizeof(UMG_HelmetHUD_OverBoost_C_K2_RefreshCoolDownInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_OverBoost_C_K2_RefreshCoolDownInfo");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_K2_RefreshCoolDownInfo, InCoolDownDuration) == 0x000000, "Member 'UMG_HelmetHUD_OverBoost_C_K2_RefreshCoolDownInfo::InCoolDownDuration' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoost.UMG_HelmetHUD_OverBoost_C.RefreshIconInfo
// 0x0160 (0x0160 - 0x0000)
struct UMG_HelmetHUD_OverBoost_C_RefreshIconInfo final
{
public:
	class FName                                   LocalItemId;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBMobilityDefinitionRow               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0138)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBMobilityDefinitionRedirectionRow    CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0148(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_HelmetHUD_OverBoost_C_RefreshIconInfo) == 0x000008, "Wrong alignment on UMG_HelmetHUD_OverBoost_C_RefreshIconInfo");
static_assert(sizeof(UMG_HelmetHUD_OverBoost_C_RefreshIconInfo) == 0x000160, "Wrong size on UMG_HelmetHUD_OverBoost_C_RefreshIconInfo");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshIconInfo, LocalItemId) == 0x000000, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshIconInfo::LocalItemId' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshIconInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshIconInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshIconInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000140, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshIconInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshIconInfo, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000148, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshIconInfo::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshIconInfo, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000158, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshIconInfo::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoost.UMG_HelmetHUD_OverBoost_C.RefreshActivateInfo
// 0x0068 (0x0068 - 0x0000)
struct UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo final
{
public:
	float                                         InActiveDuration;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo) == 0x000008, "Wrong alignment on UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo");
static_assert(sizeof(UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo) == 0x000068, "Wrong size on UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo, InActiveDuration) == 0x000000, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo::InActiveDuration' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo, CallFunc_GetEndTime_ReturnValue) == 0x000030, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000060, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshActivateInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoost.UMG_HelmetHUD_OverBoost_C.RefreshCoolDownInfo
// 0x0020 (0x0020 - 0x0000)
struct UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo final
{
public:
	float                                         InCoolDownDuration;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo) == 0x000008, "Wrong alignment on UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo");
static_assert(sizeof(UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo) == 0x000020, "Wrong size on UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo, InCoolDownDuration) == 0x000000, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo::InCoolDownDuration' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'UMG_HelmetHUD_OverBoost_C_RefreshCoolDownInfo::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoost.UMG_HelmetHUD_OverBoost_C.OnInputDeviceupdate
// 0x0002 (0x0002 - 0x0000)
struct UMG_HelmetHUD_OverBoost_C_OnInputDeviceupdate final
{
public:
	EInputDevice                                  CurrentDevice;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_HelmetHUD_OverBoost_C_OnInputDeviceupdate) == 0x000001, "Wrong alignment on UMG_HelmetHUD_OverBoost_C_OnInputDeviceupdate");
static_assert(sizeof(UMG_HelmetHUD_OverBoost_C_OnInputDeviceupdate) == 0x000002, "Wrong size on UMG_HelmetHUD_OverBoost_C_OnInputDeviceupdate");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_OnInputDeviceupdate, CurrentDevice) == 0x000000, "Member 'UMG_HelmetHUD_OverBoost_C_OnInputDeviceupdate::CurrentDevice' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoost_C_OnInputDeviceupdate, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UMG_HelmetHUD_OverBoost_C_OnInputDeviceupdate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

