#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SocialTip_Widget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SocialTip_Widget.UMG_SocialTip_Widget_C
// 0x0038 (0x0298 - 0x0260)
class UUMG_SocialTip_Widget_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    CommonActionWidget_Input;                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InputName;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   InputNameText;                                     // 0x0278(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FName                                   Input;                                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SocialTip_Widget(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SocialTip_Widget_C">();
	}
	static class UUMG_SocialTip_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SocialTip_Widget_C>();
	}
};
static_assert(alignof(UUMG_SocialTip_Widget_C) == 0x000008, "Wrong alignment on UUMG_SocialTip_Widget_C");
static_assert(sizeof(UUMG_SocialTip_Widget_C) == 0x000298, "Wrong size on UUMG_SocialTip_Widget_C");
static_assert(offsetof(UUMG_SocialTip_Widget_C, UberGraphFrame) == 0x000260, "Member 'UUMG_SocialTip_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SocialTip_Widget_C, CommonActionWidget_Input) == 0x000268, "Member 'UUMG_SocialTip_Widget_C::CommonActionWidget_Input' has a wrong offset!");
static_assert(offsetof(UUMG_SocialTip_Widget_C, InputName) == 0x000270, "Member 'UUMG_SocialTip_Widget_C::InputName' has a wrong offset!");
static_assert(offsetof(UUMG_SocialTip_Widget_C, InputNameText) == 0x000278, "Member 'UUMG_SocialTip_Widget_C::InputNameText' has a wrong offset!");
static_assert(offsetof(UUMG_SocialTip_Widget_C, Input) == 0x000290, "Member 'UUMG_SocialTip_Widget_C::Input' has a wrong offset!");

}

