#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ChargeButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ChargeButton.UMG_ChargeButton_C
// 0x0028 (0x0BC8 - 0x0BA0)
class UUMG_ChargeButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0BA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_1;                                          // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ActionName;                                   // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ActionName_1;                                 // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ChargeButton(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ChargeButton_C">();
	}
	static class UUMG_ChargeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ChargeButton_C>();
	}
};
static_assert(alignof(UUMG_ChargeButton_C) == 0x000008, "Wrong alignment on UUMG_ChargeButton_C");
static_assert(sizeof(UUMG_ChargeButton_C) == 0x000BC8, "Wrong size on UUMG_ChargeButton_C");
static_assert(offsetof(UUMG_ChargeButton_C, UberGraphFrame) == 0x000BA0, "Member 'UUMG_ChargeButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ChargeButton_C, NewAnimation) == 0x000BA8, "Member 'UUMG_ChargeButton_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UUMG_ChargeButton_C, Border_1) == 0x000BB0, "Member 'UUMG_ChargeButton_C::Border_1' has a wrong offset!");
static_assert(offsetof(UUMG_ChargeButton_C, Text_ActionName) == 0x000BB8, "Member 'UUMG_ChargeButton_C::Text_ActionName' has a wrong offset!");
static_assert(offsetof(UUMG_ChargeButton_C, Text_ActionName_1) == 0x000BC0, "Member 'UUMG_ChargeButton_C::Text_ActionName_1' has a wrong offset!");

}

