#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_BLACKMARKET

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_BLACKMARKET.UMG_BLACKMARKET_C.ExecuteUbergraph_UMG_BLACKMARKET
// 0x0004 (0x0004 - 0x0000)
struct UMG_BLACKMARKET_C_ExecuteUbergraph_UMG_BLACKMARKET final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_BLACKMARKET_C_ExecuteUbergraph_UMG_BLACKMARKET) == 0x000004, "Wrong alignment on UMG_BLACKMARKET_C_ExecuteUbergraph_UMG_BLACKMARKET");
static_assert(sizeof(UMG_BLACKMARKET_C_ExecuteUbergraph_UMG_BLACKMARKET) == 0x000004, "Wrong size on UMG_BLACKMARKET_C_ExecuteUbergraph_UMG_BLACKMARKET");
static_assert(offsetof(UMG_BLACKMARKET_C_ExecuteUbergraph_UMG_BLACKMARKET, EntryPoint) == 0x000000, "Member 'UMG_BLACKMARKET_C_ExecuteUbergraph_UMG_BLACKMARKET::EntryPoint' has a wrong offset!");

// Function UMG_BLACKMARKET.UMG_BLACKMARKET_C.InitInfo
// 0x0048 (0x0048 - 0x0000)
struct UMG_BLACKMARKET_C_InitInfo final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBProductPoolType                            CallFunc_Array_Get_Item;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBStoreProductInfo                    CallFunc_Array_Get_Item_1;                         // 0x0010(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_BLACKMARKET_C_InitInfo) == 0x000008, "Wrong alignment on UMG_BLACKMARKET_C_InitInfo");
static_assert(sizeof(UMG_BLACKMARKET_C_InitInfo) == 0x000048, "Wrong size on UMG_BLACKMARKET_C_InitInfo");
static_assert(offsetof(UMG_BLACKMARKET_C_InitInfo, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_BLACKMARKET_C_InitInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_InitInfo, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_BLACKMARKET_C_InitInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_InitInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_BLACKMARKET_C_InitInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_InitInfo, CallFunc_Array_Get_Item) == 0x00000C, "Member 'UMG_BLACKMARKET_C_InitInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_InitInfo, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'UMG_BLACKMARKET_C_InitInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_InitInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'UMG_BLACKMARKET_C_InitInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_InitInfo, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'UMG_BLACKMARKET_C_InitInfo::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_InitInfo, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UMG_BLACKMARKET_C_InitInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_InitInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'UMG_BLACKMARKET_C_InitInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_BLACKMARKET.UMG_BLACKMARKET_C.RefreshUI
// 0x0080 (0x0080 - 0x0000)
struct UMG_BLACKMARKET_C_RefreshUI final
{
public:
	struct FPBStoreProductInfo                    CallFunc_Array_Get_Item;                           // 0x0000(0x0028)()
	struct FPBStoreProductInfo                    CallFunc_Array_Get_Item_1;                         // 0x0028(0x0028)()
	struct FPBStoreProductInfo                    CallFunc_Array_Get_Item_2;                         // 0x0050(0x0028)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_BLACKMARKET_C_RefreshUI) == 0x000008, "Wrong alignment on UMG_BLACKMARKET_C_RefreshUI");
static_assert(sizeof(UMG_BLACKMARKET_C_RefreshUI) == 0x000080, "Wrong size on UMG_BLACKMARKET_C_RefreshUI");
static_assert(offsetof(UMG_BLACKMARKET_C_RefreshUI, CallFunc_Array_Get_Item) == 0x000000, "Member 'UMG_BLACKMARKET_C_RefreshUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_RefreshUI, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'UMG_BLACKMARKET_C_RefreshUI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_RefreshUI, CallFunc_Array_Get_Item_2) == 0x000050, "Member 'UMG_BLACKMARKET_C_RefreshUI::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_RefreshUI, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000078, "Member 'UMG_BLACKMARKET_C_RefreshUI::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function UMG_BLACKMARKET.UMG_BLACKMARKET_C.DoCustomNavigation_0
// 0x0010 (0x0010 - 0x0000)
struct UMG_BLACKMARKET_C_DoCustomNavigation_0 final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_BLACKMARKET_C_DoCustomNavigation_0) == 0x000008, "Wrong alignment on UMG_BLACKMARKET_C_DoCustomNavigation_0");
static_assert(sizeof(UMG_BLACKMARKET_C_DoCustomNavigation_0) == 0x000010, "Wrong size on UMG_BLACKMARKET_C_DoCustomNavigation_0");
static_assert(offsetof(UMG_BLACKMARKET_C_DoCustomNavigation_0, Navigation_0) == 0x000000, "Member 'UMG_BLACKMARKET_C_DoCustomNavigation_0::Navigation_0' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_DoCustomNavigation_0, ReturnValue) == 0x000008, "Member 'UMG_BLACKMARKET_C_DoCustomNavigation_0::ReturnValue' has a wrong offset!");

// Function UMG_BLACKMARKET.UMG_BLACKMARKET_C.SetFocusAfterRefreshUI
// 0x0001 (0x0001 - 0x0000)
struct UMG_BLACKMARKET_C_SetFocusAfterRefreshUI final
{
public:
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_BLACKMARKET_C_SetFocusAfterRefreshUI) == 0x000001, "Wrong alignment on UMG_BLACKMARKET_C_SetFocusAfterRefreshUI");
static_assert(sizeof(UMG_BLACKMARKET_C_SetFocusAfterRefreshUI) == 0x000001, "Wrong size on UMG_BLACKMARKET_C_SetFocusAfterRefreshUI");
static_assert(offsetof(UMG_BLACKMARKET_C_SetFocusAfterRefreshUI, CallFunc_IsActivated_ReturnValue) == 0x000000, "Member 'UMG_BLACKMARKET_C_SetFocusAfterRefreshUI::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function UMG_BLACKMARKET.UMG_BLACKMARKET_C.DoCustomNavigation_1
// 0x0010 (0x0010 - 0x0000)
struct UMG_BLACKMARKET_C_DoCustomNavigation_1 final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_BLACKMARKET_C_DoCustomNavigation_1) == 0x000008, "Wrong alignment on UMG_BLACKMARKET_C_DoCustomNavigation_1");
static_assert(sizeof(UMG_BLACKMARKET_C_DoCustomNavigation_1) == 0x000010, "Wrong size on UMG_BLACKMARKET_C_DoCustomNavigation_1");
static_assert(offsetof(UMG_BLACKMARKET_C_DoCustomNavigation_1, Navigation_0) == 0x000000, "Member 'UMG_BLACKMARKET_C_DoCustomNavigation_1::Navigation_0' has a wrong offset!");
static_assert(offsetof(UMG_BLACKMARKET_C_DoCustomNavigation_1, ReturnValue) == 0x000008, "Member 'UMG_BLACKMARKET_C_DoCustomNavigation_1::ReturnValue' has a wrong offset!");

// Function UMG_BLACKMARKET.UMG_BLACKMARKET_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_BLACKMARKET_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_BLACKMARKET_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_BLACKMARKET_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_BLACKMARKET_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_BLACKMARKET_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_BLACKMARKET_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_BLACKMARKET_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

