#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FieldModCompareTip

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_FieldModCompareTip.UMG_FieldModCompareTip_C
// 0x00D8 (0x0348 - 0x0270)
class UUMG_FieldModCompareTip_C final : public UPBInventoryDataCompareWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Flag_0;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flag_1;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flag_2;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flag_3;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_21;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_137;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InventoryCompareItem_C*            Item_0;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InventoryCompareItem_C*            Item_1;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InventoryCompareItem_C*            Item_2;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InventoryCompareItem_C*            Item_3;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InventoryCompareItem_C*            Item_4;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InventoryCompareItem_C*            Item_5;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InventoryCompareItem_C*            Item_6;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InventoryCompareItem_C*            Item_7;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           List_0;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           List_1;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           List_2;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           List_3;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<float>                                 EquipWeaponSaved;                                  // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 EquipLauncherSaved;                                // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 EquipMeleeSaved;                                   // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 EquipMobilitySaved;                                // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_FieldModCompareTip(int32 EntryPoint);
	void K2_RefreshWeaponSingleData(const struct FPBRayProjectileConfigRow_Replace& EquippingRayProjectileConfig, const struct FPBWeaponConfigRow& EquippingWeaponConfig);
	void K2_RefreshPodCompareData(const struct FPBPodDescription& EquippingPodDescription, const struct FPBPodDescription& TestingPodDescription);
	void K2_RefreshMobilityCompareData(const struct FPBMobilityDescription& EquippingMobilityDescription, const struct FPBMobilityDescription& TestingMobilityDescription);
	void K2_RefreshWeaponCompareData(const struct FPBRayProjectileConfigRow_Replace& EquippingRayProjectileConfig, const struct FPBRayProjectileConfigRow_Replace& TestingRayProjectileConfig, const struct FPBWeaponConfigRow& EquippingWeaponConfig, const struct FPBWeaponConfigRow& TestingWeaponConfig);
	void K2_RefreshMeleeWeaponCompareData(const struct FPBMeleeWeaponDescription& EquippingMeleeWeaponDescription, const struct FPBMeleeWeaponDescription& TestingMeleeWeaponDescription);
	void Set_Weapon_Compare_Info(const struct FPBRayProjectileConfigRow_Replace& InEquippingRay, const struct FPBRayProjectileConfigRow_Replace& InTestingRay, const struct FPBWeaponConfigRow& InEquippingRow, const struct FPBWeaponConfigRow& InTestingRow);
	void Set_Mobility_Compare_Info(const struct FPBMobilityDescription& EquippingMobility, const struct FPBMobilityDescription& TestingMobility);
	void Set_Pod_Compare_Info(const struct FPBPodDescription& EquippingPod, const struct FPBPodDescription& TestingPod);
	void Set_Melee_Weapon_Compare_Info(const struct FPBMeleeWeaponDescription& EquippingMeleeWeapon, const struct FPBMeleeWeaponDescription& TestingMeleeWeapon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_FieldModCompareTip_C">();
	}
	static class UUMG_FieldModCompareTip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_FieldModCompareTip_C>();
	}
};
static_assert(alignof(UUMG_FieldModCompareTip_C) == 0x000008, "Wrong alignment on UUMG_FieldModCompareTip_C");
static_assert(sizeof(UUMG_FieldModCompareTip_C) == 0x000348, "Wrong size on UUMG_FieldModCompareTip_C");
static_assert(offsetof(UUMG_FieldModCompareTip_C, UberGraphFrame) == 0x000270, "Member 'UUMG_FieldModCompareTip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Flag_0) == 0x000278, "Member 'UUMG_FieldModCompareTip_C::Flag_0' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Flag_1) == 0x000280, "Member 'UUMG_FieldModCompareTip_C::Flag_1' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Flag_2) == 0x000288, "Member 'UUMG_FieldModCompareTip_C::Flag_2' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Flag_3) == 0x000290, "Member 'UUMG_FieldModCompareTip_C::Flag_3' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Image_21) == 0x000298, "Member 'UUMG_FieldModCompareTip_C::Image_21' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Image_137) == 0x0002A0, "Member 'UUMG_FieldModCompareTip_C::Image_137' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Item_0) == 0x0002A8, "Member 'UUMG_FieldModCompareTip_C::Item_0' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Item_1) == 0x0002B0, "Member 'UUMG_FieldModCompareTip_C::Item_1' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Item_2) == 0x0002B8, "Member 'UUMG_FieldModCompareTip_C::Item_2' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Item_3) == 0x0002C0, "Member 'UUMG_FieldModCompareTip_C::Item_3' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Item_4) == 0x0002C8, "Member 'UUMG_FieldModCompareTip_C::Item_4' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Item_5) == 0x0002D0, "Member 'UUMG_FieldModCompareTip_C::Item_5' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Item_6) == 0x0002D8, "Member 'UUMG_FieldModCompareTip_C::Item_6' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, Item_7) == 0x0002E0, "Member 'UUMG_FieldModCompareTip_C::Item_7' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, List_0) == 0x0002E8, "Member 'UUMG_FieldModCompareTip_C::List_0' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, List_1) == 0x0002F0, "Member 'UUMG_FieldModCompareTip_C::List_1' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, List_2) == 0x0002F8, "Member 'UUMG_FieldModCompareTip_C::List_2' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, List_3) == 0x000300, "Member 'UUMG_FieldModCompareTip_C::List_3' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, EquipWeaponSaved) == 0x000308, "Member 'UUMG_FieldModCompareTip_C::EquipWeaponSaved' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, EquipLauncherSaved) == 0x000318, "Member 'UUMG_FieldModCompareTip_C::EquipLauncherSaved' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, EquipMeleeSaved) == 0x000328, "Member 'UUMG_FieldModCompareTip_C::EquipMeleeSaved' has a wrong offset!");
static_assert(offsetof(UUMG_FieldModCompareTip_C, EquipMobilitySaved) == 0x000338, "Member 'UUMG_FieldModCompareTip_C::EquipMobilitySaved' has a wrong offset!");

}

