#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ProgressionWeaponItem

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_ProgressionWeaponItem.UMG_ProgressionWeaponItem_C.ExecuteUbergraph_UMG_ProgressionWeaponItem
// 0x0014 (0x0014 - 0x0000)
struct UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
};
static_assert(alignof(UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem) == 0x000004, "Wrong alignment on UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem");
static_assert(sizeof(UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem) == 0x000014, "Wrong size on UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem, EntryPoint) == 0x000000, "Member 'UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem, Temp_byte_Variable) == 0x000004, "Member 'UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem, Temp_byte_Variable_1) == 0x000005, "Member 'UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem, Temp_byte_Variable_2) == 0x000006, "Member 'UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem, K2Node_Event_IsDesignTime) == 0x000007, "Member 'UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem, K2Node_Select_Default) == 0x000008, "Member 'UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'UMG_ProgressionWeaponItem_C_ExecuteUbergraph_UMG_ProgressionWeaponItem::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function UMG_ProgressionWeaponItem.UMG_ProgressionWeaponItem_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_ProgressionWeaponItem_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_ProgressionWeaponItem_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_ProgressionWeaponItem_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_ProgressionWeaponItem_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_ProgressionWeaponItem_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_ProgressionWeaponItem_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_ProgressionWeaponItem.UMG_ProgressionWeaponItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_ProgressionWeaponItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProgressionWeaponItem_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_ProgressionWeaponItem_C_PreConstruct");
static_assert(sizeof(UMG_ProgressionWeaponItem_C_PreConstruct) == 0x000001, "Wrong size on UMG_ProgressionWeaponItem_C_PreConstruct");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_ProgressionWeaponItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_ProgressionWeaponItem.UMG_ProgressionWeaponItem_C.ActiveBackground
// 0x0010 (0x0010 - 0x0000)
struct UMG_ProgressionWeaponItem_C_ActiveBackground final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProgressionWeaponItem_C_ActiveBackground) == 0x000008, "Wrong alignment on UMG_ProgressionWeaponItem_C_ActiveBackground");
static_assert(sizeof(UMG_ProgressionWeaponItem_C_ActiveBackground) == 0x000010, "Wrong size on UMG_ProgressionWeaponItem_C_ActiveBackground");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ActiveBackground, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'UMG_ProgressionWeaponItem_C_ActiveBackground::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ActiveBackground, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'UMG_ProgressionWeaponItem_C_ActiveBackground::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_ActiveBackground, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_ProgressionWeaponItem_C_ActiveBackground::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_ProgressionWeaponItem.UMG_ProgressionWeaponItem_C.InactiveBackground
// 0x0008 (0x0008 - 0x0000)
struct UMG_ProgressionWeaponItem_C_InactiveBackground final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProgressionWeaponItem_C_InactiveBackground) == 0x000008, "Wrong alignment on UMG_ProgressionWeaponItem_C_InactiveBackground");
static_assert(sizeof(UMG_ProgressionWeaponItem_C_InactiveBackground) == 0x000008, "Wrong size on UMG_ProgressionWeaponItem_C_InactiveBackground");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_InactiveBackground, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_ProgressionWeaponItem_C_InactiveBackground::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_ProgressionWeaponItem.UMG_ProgressionWeaponItem_C.RefreshNewFlag
// 0x0018 (0x0018 - 0x0000)
struct UMG_ProgressionWeaponItem_C_RefreshNewFlag final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBProgressionManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasWeaponNewItem_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProgressionWeaponItem_C_RefreshNewFlag) == 0x000008, "Wrong alignment on UMG_ProgressionWeaponItem_C_RefreshNewFlag");
static_assert(sizeof(UMG_ProgressionWeaponItem_C_RefreshNewFlag) == 0x000018, "Wrong size on UMG_ProgressionWeaponItem_C_RefreshNewFlag");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_RefreshNewFlag, Temp_bool_Variable) == 0x000000, "Member 'UMG_ProgressionWeaponItem_C_RefreshNewFlag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_RefreshNewFlag, Temp_byte_Variable) == 0x000001, "Member 'UMG_ProgressionWeaponItem_C_RefreshNewFlag::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_RefreshNewFlag, Temp_byte_Variable_1) == 0x000002, "Member 'UMG_ProgressionWeaponItem_C_RefreshNewFlag::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_RefreshNewFlag, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_ProgressionWeaponItem_C_RefreshNewFlag::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_RefreshNewFlag, CallFunc_HasWeaponNewItem_ReturnValue) == 0x000010, "Member 'UMG_ProgressionWeaponItem_C_RefreshNewFlag::CallFunc_HasWeaponNewItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionWeaponItem_C_RefreshNewFlag, K2Node_Select_Default) == 0x000011, "Member 'UMG_ProgressionWeaponItem_C_RefreshNewFlag::K2Node_Select_Default' has a wrong offset!");

}

