#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PartyMemberList_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_PartyMemberList_Widget.UMG_PartyMemberList_Widget_C.ExecuteUbergraph_UMG_PartyMemberList_Widget
// 0x0018 (0x0018 - 0x0000)
struct UMG_PartyMemberList_Widget_C_ExecuteUbergraph_UMG_PartyMemberList_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPBUserObject*>                  K2Node_Event_InPartyMemberObjects;                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(UMG_PartyMemberList_Widget_C_ExecuteUbergraph_UMG_PartyMemberList_Widget) == 0x000008, "Wrong alignment on UMG_PartyMemberList_Widget_C_ExecuteUbergraph_UMG_PartyMemberList_Widget");
static_assert(sizeof(UMG_PartyMemberList_Widget_C_ExecuteUbergraph_UMG_PartyMemberList_Widget) == 0x000018, "Wrong size on UMG_PartyMemberList_Widget_C_ExecuteUbergraph_UMG_PartyMemberList_Widget");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_ExecuteUbergraph_UMG_PartyMemberList_Widget, EntryPoint) == 0x000000, "Member 'UMG_PartyMemberList_Widget_C_ExecuteUbergraph_UMG_PartyMemberList_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_ExecuteUbergraph_UMG_PartyMemberList_Widget, K2Node_Event_InPartyMemberObjects) == 0x000008, "Member 'UMG_PartyMemberList_Widget_C_ExecuteUbergraph_UMG_PartyMemberList_Widget::K2Node_Event_InPartyMemberObjects' has a wrong offset!");

// Function UMG_PartyMemberList_Widget.UMG_PartyMemberList_Widget_C.K2_OnPartyRefreshed
// 0x0010 (0x0010 - 0x0000)
struct UMG_PartyMemberList_Widget_C_K2_OnPartyRefreshed final
{
public:
	TArray<class UPBUserObject*>                  InPartyMemberObjects;                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_PartyMemberList_Widget_C_K2_OnPartyRefreshed) == 0x000008, "Wrong alignment on UMG_PartyMemberList_Widget_C_K2_OnPartyRefreshed");
static_assert(sizeof(UMG_PartyMemberList_Widget_C_K2_OnPartyRefreshed) == 0x000010, "Wrong size on UMG_PartyMemberList_Widget_C_K2_OnPartyRefreshed");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_K2_OnPartyRefreshed, InPartyMemberObjects) == 0x000000, "Member 'UMG_PartyMemberList_Widget_C_K2_OnPartyRefreshed::InPartyMemberObjects' has a wrong offset!");

// Function UMG_PartyMemberList_Widget.UMG_PartyMemberList_Widget_C.RefreshPartyInfo
// 0x0028 (0x0028 - 0x0000)
struct UMG_PartyMemberList_Widget_C_RefreshPartyInfo final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBUserObject*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo) == 0x000008, "Wrong alignment on UMG_PartyMemberList_Widget_C_RefreshPartyInfo");
static_assert(sizeof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo) == 0x000028, "Wrong size on UMG_PartyMemberList_Widget_C_RefreshPartyInfo");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_PartyMemberList_Widget_C_RefreshPartyInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_PartyMemberList_Widget_C_RefreshPartyInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_PartyMemberList_Widget_C_RefreshPartyInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo, CallFunc_Array_Get_Item) == 0x000010, "Member 'UMG_PartyMemberList_Widget_C_RefreshPartyInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'UMG_PartyMemberList_Widget_C_RefreshPartyInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo, CallFunc_Array_Length_ReturnValue_1) == 0x00001C, "Member 'UMG_PartyMemberList_Widget_C_RefreshPartyInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'UMG_PartyMemberList_Widget_C_RefreshPartyInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_RefreshPartyInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000021, "Member 'UMG_PartyMemberList_Widget_C_RefreshPartyInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_PartyMemberList_Widget.UMG_PartyMemberList_Widget_C.SetDefaultFocus
// 0x0010 (0x0010 - 0x0000)
struct UMG_PartyMemberList_Widget_C_SetDefaultFocus final
{
public:
	class UUMG_PlayerWidget_PartyMember_C*        K2Node_DynamicCast_AsUMG_Player_Widget_Party_Member; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PartyMemberList_Widget_C_SetDefaultFocus) == 0x000008, "Wrong alignment on UMG_PartyMemberList_Widget_C_SetDefaultFocus");
static_assert(sizeof(UMG_PartyMemberList_Widget_C_SetDefaultFocus) == 0x000010, "Wrong size on UMG_PartyMemberList_Widget_C_SetDefaultFocus");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_SetDefaultFocus, K2Node_DynamicCast_AsUMG_Player_Widget_Party_Member) == 0x000000, "Member 'UMG_PartyMemberList_Widget_C_SetDefaultFocus::K2Node_DynamicCast_AsUMG_Player_Widget_Party_Member' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_SetDefaultFocus, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'UMG_PartyMemberList_Widget_C_SetDefaultFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_PartyMemberList_Widget.UMG_PartyMemberList_Widget_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_PartyMemberList_Widget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyMemberList_Widget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_PartyMemberList_Widget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_PartyMemberList_Widget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_PartyMemberList_Widget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_PartyMemberList_Widget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_PartyMemberList_Widget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

