#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_QuestInfoReward

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_QuestInfoReward.UMG_QuestInfoReward_C.ExecuteUbergraph_UMG_QuestInfoReward
// 0x0008 (0x0008 - 0x0000)
struct UMG_QuestInfoReward_C_ExecuteUbergraph_UMG_QuestInfoReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_QuestInfoReward_C_ExecuteUbergraph_UMG_QuestInfoReward) == 0x000004, "Wrong alignment on UMG_QuestInfoReward_C_ExecuteUbergraph_UMG_QuestInfoReward");
static_assert(sizeof(UMG_QuestInfoReward_C_ExecuteUbergraph_UMG_QuestInfoReward) == 0x000008, "Wrong size on UMG_QuestInfoReward_C_ExecuteUbergraph_UMG_QuestInfoReward");
static_assert(offsetof(UMG_QuestInfoReward_C_ExecuteUbergraph_UMG_QuestInfoReward, EntryPoint) == 0x000000, "Member 'UMG_QuestInfoReward_C_ExecuteUbergraph_UMG_QuestInfoReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_ExecuteUbergraph_UMG_QuestInfoReward, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_QuestInfoReward_C_ExecuteUbergraph_UMG_QuestInfoReward::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_QuestInfoReward.UMG_QuestInfoReward_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_QuestInfoReward_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_QuestInfoReward_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_QuestInfoReward_C_PreConstruct");
static_assert(sizeof(UMG_QuestInfoReward_C_PreConstruct) == 0x000001, "Wrong size on UMG_QuestInfoReward_C_PreConstruct");
static_assert(offsetof(UMG_QuestInfoReward_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_QuestInfoReward_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_QuestInfoReward.UMG_QuestInfoReward_C.RefreshInfo
// 0x0038 (0x0038 - 0x0000)
struct UMG_QuestInfoReward_C_RefreshInfo final
{
public:
	EPBQuestModuleState                           State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Desc;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CurrentProgress;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalProgress;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBRewardItem>                  RewardArray;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_QuestInfoReward_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_QuestInfoReward_C_RefreshInfo");
static_assert(sizeof(UMG_QuestInfoReward_C_RefreshInfo) == 0x000038, "Wrong size on UMG_QuestInfoReward_C_RefreshInfo");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshInfo, State) == 0x000000, "Member 'UMG_QuestInfoReward_C_RefreshInfo::State' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshInfo, Desc) == 0x000008, "Member 'UMG_QuestInfoReward_C_RefreshInfo::Desc' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshInfo, CurrentProgress) == 0x000020, "Member 'UMG_QuestInfoReward_C_RefreshInfo::CurrentProgress' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshInfo, TotalProgress) == 0x000024, "Member 'UMG_QuestInfoReward_C_RefreshInfo::TotalProgress' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshInfo, RewardArray) == 0x000028, "Member 'UMG_QuestInfoReward_C_RefreshInfo::RewardArray' has a wrong offset!");

// Function UMG_QuestInfoReward.UMG_QuestInfoReward_C.RefreshState
// 0x0018 (0x0018 - 0x0000)
struct UMG_QuestInfoReward_C_RefreshState final
{
public:
	EPBQuestModuleState                           State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             QuestStateTexture;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_QuestInfoReward_C_RefreshState) == 0x000008, "Wrong alignment on UMG_QuestInfoReward_C_RefreshState");
static_assert(sizeof(UMG_QuestInfoReward_C_RefreshState) == 0x000018, "Wrong size on UMG_QuestInfoReward_C_RefreshState");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshState, State) == 0x000000, "Member 'UMG_QuestInfoReward_C_RefreshState::State' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshState, QuestStateTexture) == 0x000008, "Member 'UMG_QuestInfoReward_C_RefreshState::QuestStateTexture' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshState, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'UMG_QuestInfoReward_C_RefreshState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_QuestInfoReward.UMG_QuestInfoReward_C.RefreshReward
// 0x0078 (0x0078 - 0x0000)
struct UMG_QuestInfoReward_C_RefreshReward final
{
public:
	TArray<struct FPBRewardItem>                  RewardArray;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBRewardItem                          CallFunc_Array_Get_Item;                           // 0x001C(0x000C)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScaleBox*                              CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_QuestInfoReward_C_RefreshReward) == 0x000008, "Wrong alignment on UMG_QuestInfoReward_C_RefreshReward");
static_assert(sizeof(UMG_QuestInfoReward_C_RefreshReward) == 0x000078, "Wrong size on UMG_QuestInfoReward_C_RefreshReward");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, RewardArray) == 0x000000, "Member 'UMG_QuestInfoReward_C_RefreshReward::RewardArray' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'UMG_QuestInfoReward_C_RefreshReward::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UMG_QuestInfoReward_C_RefreshReward::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'UMG_QuestInfoReward_C_RefreshReward::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, CallFunc_Array_Get_Item) == 0x00001C, "Member 'UMG_QuestInfoReward_C_RefreshReward::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'UMG_QuestInfoReward_C_RefreshReward::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'UMG_QuestInfoReward_C_RefreshReward::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'UMG_QuestInfoReward_C_RefreshReward::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, CallFunc_Create_ReturnValue) == 0x000038, "Member 'UMG_QuestInfoReward_C_RefreshReward::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'UMG_QuestInfoReward_C_RefreshReward::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'UMG_QuestInfoReward_C_RefreshReward::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000050, "Member 'UMG_QuestInfoReward_C_RefreshReward::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'UMG_QuestInfoReward_C_RefreshReward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, CallFunc_AddChild_ReturnValue_1) == 0x000060, "Member 'UMG_QuestInfoReward_C_RefreshReward::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshReward, K2Node_MakeStruct_Margin) == 0x000068, "Member 'UMG_QuestInfoReward_C_RefreshReward::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function UMG_QuestInfoReward.UMG_QuestInfoReward_C.RefreshProgress
// 0x0050 (0x0050 - 0x0000)
struct UMG_QuestInfoReward_C_RefreshProgress final
{
public:
	int32                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Total;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_QuestInfoReward_C_RefreshProgress) == 0x000008, "Wrong alignment on UMG_QuestInfoReward_C_RefreshProgress");
static_assert(sizeof(UMG_QuestInfoReward_C_RefreshProgress) == 0x000050, "Wrong size on UMG_QuestInfoReward_C_RefreshProgress");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshProgress, Current) == 0x000000, "Member 'UMG_QuestInfoReward_C_RefreshProgress::Current' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshProgress, Total) == 0x000004, "Member 'UMG_QuestInfoReward_C_RefreshProgress::Total' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshProgress, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'UMG_QuestInfoReward_C_RefreshProgress::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshProgress, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'UMG_QuestInfoReward_C_RefreshProgress::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshProgress, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'UMG_QuestInfoReward_C_RefreshProgress::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshProgress, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000028, "Member 'UMG_QuestInfoReward_C_RefreshProgress::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshProgress, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000030, "Member 'UMG_QuestInfoReward_C_RefreshProgress::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoReward_C_RefreshProgress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'UMG_QuestInfoReward_C_RefreshProgress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

