#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameFieldMod

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_InGameFieldMod.UMG_InGameFieldMod_C.ExecuteUbergraph_UMG_InGameFieldMod
// 0x00A0 (0x00A0 - 0x0000)
struct UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBFieldModManager_BP_C*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSelectCharacterID_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuccessful;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InErrorCode;                          // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBGameMode_Tutorials_C*                K2Node_DynamicCast_AsPBGame_Mode_Tutorials;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod) == 0x000008, "Wrong alignment on UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod");
static_assert(sizeof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod) == 0x0000A0, "Wrong size on UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, EntryPoint) == 0x000000, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, Temp_byte_Variable) == 0x000004, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, Temp_byte_Variable_1) == 0x000020, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000028, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetSelectCharacterID_ReturnValue) == 0x000030, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetSelectCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000038, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00003D, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, Temp_bool_Variable) == 0x00003E, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, K2Node_Select_Default) == 0x00003F, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, K2Node_Event_bSuccessful) == 0x000040, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::K2Node_Event_bSuccessful' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, K2Node_Event_InErrorCode) == 0x000044, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::K2Node_Event_InErrorCode' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000049, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00004A, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_BooleanAND_ReturnValue_1) == 0x00004C, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00004D, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00004E, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetGameMode_ReturnValue) == 0x000050, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, K2Node_DynamicCast_AsPBGame_Mode_Tutorials) == 0x000058, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::K2Node_DynamicCast_AsPBGame_Mode_Tutorials' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetDisplayName_ReturnValue_1) == 0x000068, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000078, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetDisplayName_ReturnValue_2) == 0x000080, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod, CallFunc_GetDisplayName_ReturnValue_3) == 0x000090, "Member 'UMG_InGameFieldMod_C_ExecuteUbergraph_UMG_InGameFieldMod::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");

// Function UMG_InGameFieldMod.UMG_InGameFieldMod_C.K2_OnPreOrderComplete
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameFieldMod_C_K2_OnPreOrderComplete final
{
public:
	bool                                          bSuccessful;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InErrorCode;                                       // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameFieldMod_C_K2_OnPreOrderComplete) == 0x000004, "Wrong alignment on UMG_InGameFieldMod_C_K2_OnPreOrderComplete");
static_assert(sizeof(UMG_InGameFieldMod_C_K2_OnPreOrderComplete) == 0x000008, "Wrong size on UMG_InGameFieldMod_C_K2_OnPreOrderComplete");
static_assert(offsetof(UMG_InGameFieldMod_C_K2_OnPreOrderComplete, bSuccessful) == 0x000000, "Member 'UMG_InGameFieldMod_C_K2_OnPreOrderComplete::bSuccessful' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_K2_OnPreOrderComplete, InErrorCode) == 0x000004, "Member 'UMG_InGameFieldMod_C_K2_OnPreOrderComplete::InErrorCode' has a wrong offset!");

// Function UMG_InGameFieldMod.UMG_InGameFieldMod_C.InitFieldMod
// 0x0028 (0x0028 - 0x0000)
struct UMG_InGameFieldMod_C_InitFieldMod final
{
public:
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameFieldMod_C_InitFieldMod) == 0x000008, "Wrong alignment on UMG_InGameFieldMod_C_InitFieldMod");
static_assert(sizeof(UMG_InGameFieldMod_C_InitFieldMod) == 0x000028, "Wrong size on UMG_InGameFieldMod_C_InitFieldMod");
static_assert(offsetof(UMG_InGameFieldMod_C_InitFieldMod, CallFunc_GetActiveWidget_ReturnValue) == 0x000000, "Member 'UMG_InGameFieldMod_C_InitFieldMod::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_InitFieldMod, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'UMG_InGameFieldMod_C_InitFieldMod::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_InitFieldMod, CallFunc_GetDisplayName_ReturnValue_1) == 0x000018, "Member 'UMG_InGameFieldMod_C_InitFieldMod::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");

// Function UMG_InGameFieldMod.UMG_InGameFieldMod_C.OnKeyDown
// 0x02B8 (0x02B8 - 0x0000)
struct UMG_InGameFieldMod_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0148(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0200(0x00B8)()
};
static_assert(alignof(UMG_InGameFieldMod_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_InGameFieldMod_C_OnKeyDown");
static_assert(sizeof(UMG_InGameFieldMod_C_OnKeyDown) == 0x0002B8, "Wrong size on UMG_InGameFieldMod_C_OnKeyDown");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_InGameFieldMod_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_InGameFieldMod_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_InGameFieldMod_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'UMG_InGameFieldMod_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000140, "Member 'UMG_InGameFieldMod_C_OnKeyDown::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000144, "Member 'UMG_InGameFieldMod_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000145, "Member 'UMG_InGameFieldMod_C_OnKeyDown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, CallFunc_BooleanAND_ReturnValue) == 0x000146, "Member 'UMG_InGameFieldMod_C_OnKeyDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000148, "Member 'UMG_InGameFieldMod_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000200, "Member 'UMG_InGameFieldMod_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_InGameFieldMod.UMG_InGameFieldMod_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameFieldMod_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameFieldMod_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_InGameFieldMod_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_InGameFieldMod_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on UMG_InGameFieldMod_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_InGameFieldMod_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_InGameFieldMod_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameFieldMod_C_BP_GetDesiredFocusTarget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'UMG_InGameFieldMod_C_BP_GetDesiredFocusTarget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

