#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Message_General

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_Message_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Message_General.UMG_Message_General_C
// 0x0020 (0x02A0 - 0x0280)
class UUMG_Message_General_C final : public UUMG_Message_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FocusOn;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Flash;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_58;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Message_General(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Message_General_C">();
	}
	static class UUMG_Message_General_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Message_General_C>();
	}
};
static_assert(alignof(UUMG_Message_General_C) == 0x000008, "Wrong alignment on UUMG_Message_General_C");
static_assert(sizeof(UUMG_Message_General_C) == 0x0002A0, "Wrong size on UUMG_Message_General_C");
static_assert(offsetof(UUMG_Message_General_C, UberGraphFrame) == 0x000280, "Member 'UUMG_Message_General_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Message_General_C, FocusOn) == 0x000288, "Member 'UUMG_Message_General_C::FocusOn' has a wrong offset!");
static_assert(offsetof(UUMG_Message_General_C, Flash) == 0x000290, "Member 'UUMG_Message_General_C::Flash' has a wrong offset!");
static_assert(offsetof(UUMG_Message_General_C, TextBlock_58) == 0x000298, "Member 'UUMG_Message_General_C::TextBlock_58' has a wrong offset!");

}

