#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Widget_ActionButton01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Widget_ActionButton01.UMG_Widget_ActionButton01_C
// 0x0040 (0x0BF0 - 0x0BB0)
class UUMG_Widget_ActionButton01_C final : public UCommonBoundActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       onhover;                                           // 0x0BB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomBar;                                         // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_955;                                         // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Hovered;                                           // 0x0BD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              UnHovered;                                         // 0x0BE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_Widget_ActionButton01(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void BP_OnClicked();
	void Hover();
	void Unhover();
	void Select();
	void Unselect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Widget_ActionButton01_C">();
	}
	static class UUMG_Widget_ActionButton01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Widget_ActionButton01_C>();
	}
};
static_assert(alignof(UUMG_Widget_ActionButton01_C) == 0x000008, "Wrong alignment on UUMG_Widget_ActionButton01_C");
static_assert(sizeof(UUMG_Widget_ActionButton01_C) == 0x000BF0, "Wrong size on UUMG_Widget_ActionButton01_C");
static_assert(offsetof(UUMG_Widget_ActionButton01_C, UberGraphFrame) == 0x000BB0, "Member 'UUMG_Widget_ActionButton01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_ActionButton01_C, onhover) == 0x000BB8, "Member 'UUMG_Widget_ActionButton01_C::onhover' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_ActionButton01_C, BottomBar) == 0x000BC0, "Member 'UUMG_Widget_ActionButton01_C::BottomBar' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_ActionButton01_C, Image_955) == 0x000BC8, "Member 'UUMG_Widget_ActionButton01_C::Image_955' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_ActionButton01_C, Hovered) == 0x000BD0, "Member 'UUMG_Widget_ActionButton01_C::Hovered' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_ActionButton01_C, UnHovered) == 0x000BE0, "Member 'UUMG_Widget_ActionButton01_C::UnHovered' has a wrong offset!");

}

