#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Aiming_Point

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Aiming_Point.UMG_Aiming_Point_C
// 0x00D0 (0x0330 - 0x0260)
class UUMG_Aiming_Point_C final : public UPBWeaponCrossHairWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideShow;                                          // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cross_Center;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cross_L;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cross_R;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cross_T;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cross_U;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Crosshair_Main_GE;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Float_Circle;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         MoveUnit;                                          // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpreadModify;                                      // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeaponSwayTranslation;                             // 0x02B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               WeaponSwayRotation;                                // 0x02C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DeltaTimeX;                                        // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireIndicateReticleScale;                          // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BR;                                                // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TL;                                                // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ADSIndicateReticleScale;                           // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveIndicator;                                     // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MeterPitch;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FOVScaler;                                         // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spread;                                            // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBWeapon*                              Current_Weapon;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Force_Input;                                   // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetingFOVScler;                                 // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pull_Factor;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetForce;                                       // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle_FadeOut;                               // 0x0318(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SpreadCircleMid;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTargeting;                                       // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCaching;                                         // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SubRoundSpread;                                    // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Aiming_Point(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void GetOnScreenPos(class UUserWidget* Widget, struct FVector2D* TL_0, struct FVector2D* BR_0);
	void GetOnScreenPos_Any(class UWidget* Widget, struct FVector2D* TL_0, struct FVector2D* BR_0);
	void AimLeftAndRightShow(bool bShow);
	void CrossHairMainGE_Change(const struct FGeometry& MyGeometry);
	void SetAimPointNewForce();
	void AddForce_GE();
	void FadeOut();
	void FadeIn();
	void Fade();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Aiming_Point_C">();
	}
	static class UUMG_Aiming_Point_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Aiming_Point_C>();
	}
};
static_assert(alignof(UUMG_Aiming_Point_C) == 0x000008, "Wrong alignment on UUMG_Aiming_Point_C");
static_assert(sizeof(UUMG_Aiming_Point_C) == 0x000330, "Wrong size on UUMG_Aiming_Point_C");
static_assert(offsetof(UUMG_Aiming_Point_C, UberGraphFrame) == 0x000260, "Member 'UUMG_Aiming_Point_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, HideShow) == 0x000268, "Member 'UUMG_Aiming_Point_C::HideShow' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, CanvasPanel) == 0x000270, "Member 'UUMG_Aiming_Point_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Cross_Center) == 0x000278, "Member 'UUMG_Aiming_Point_C::Cross_Center' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Cross_L) == 0x000280, "Member 'UUMG_Aiming_Point_C::Cross_L' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Cross_R) == 0x000288, "Member 'UUMG_Aiming_Point_C::Cross_R' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Cross_T) == 0x000290, "Member 'UUMG_Aiming_Point_C::Cross_T' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Cross_U) == 0x000298, "Member 'UUMG_Aiming_Point_C::Cross_U' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Crosshair_Main_GE) == 0x0002A0, "Member 'UUMG_Aiming_Point_C::Crosshair_Main_GE' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Float_Circle) == 0x0002A8, "Member 'UUMG_Aiming_Point_C::Float_Circle' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, MoveUnit) == 0x0002B0, "Member 'UUMG_Aiming_Point_C::MoveUnit' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, SpreadModify) == 0x0002B4, "Member 'UUMG_Aiming_Point_C::SpreadModify' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, WeaponSwayTranslation) == 0x0002B8, "Member 'UUMG_Aiming_Point_C::WeaponSwayTranslation' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, WeaponSwayRotation) == 0x0002C4, "Member 'UUMG_Aiming_Point_C::WeaponSwayRotation' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, DeltaTimeX) == 0x0002D0, "Member 'UUMG_Aiming_Point_C::DeltaTimeX' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, FireIndicateReticleScale) == 0x0002D4, "Member 'UUMG_Aiming_Point_C::FireIndicateReticleScale' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, BR) == 0x0002D8, "Member 'UUMG_Aiming_Point_C::BR' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, TL) == 0x0002E0, "Member 'UUMG_Aiming_Point_C::TL' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, ADSIndicateReticleScale) == 0x0002E8, "Member 'UUMG_Aiming_Point_C::ADSIndicateReticleScale' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, MoveIndicator) == 0x0002EC, "Member 'UUMG_Aiming_Point_C::MoveIndicator' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, MeterPitch) == 0x0002F0, "Member 'UUMG_Aiming_Point_C::MeterPitch' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, FOVScaler) == 0x0002F8, "Member 'UUMG_Aiming_Point_C::FOVScaler' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Spread) == 0x0002FC, "Member 'UUMG_Aiming_Point_C::Spread' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Current_Weapon) == 0x000300, "Member 'UUMG_Aiming_Point_C::Current_Weapon' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, New_Force_Input) == 0x000308, "Member 'UUMG_Aiming_Point_C::New_Force_Input' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, TargetingFOVScler) == 0x00030C, "Member 'UUMG_Aiming_Point_C::TargetingFOVScler' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, Pull_Factor) == 0x000310, "Member 'UUMG_Aiming_Point_C::Pull_Factor' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, TargetForce) == 0x000314, "Member 'UUMG_Aiming_Point_C::TargetForce' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, TimerHandle_FadeOut) == 0x000318, "Member 'UUMG_Aiming_Point_C::TimerHandle_FadeOut' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, SpreadCircleMid) == 0x000320, "Member 'UUMG_Aiming_Point_C::SpreadCircleMid' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, IsTargeting) == 0x000328, "Member 'UUMG_Aiming_Point_C::IsTargeting' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, IsCaching) == 0x000329, "Member 'UUMG_Aiming_Point_C::IsCaching' has a wrong offset!");
static_assert(offsetof(UUMG_Aiming_Point_C, SubRoundSpread) == 0x00032C, "Member 'UUMG_Aiming_Point_C::SubRoundSpread' has a wrong offset!");

}

