#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_DetailedCareerData

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_DetailedCareerData.UMG_DetailedCareerData_C
// 0x0018 (0x0278 - 0x0260)
class UUMG_DetailedCareerData_C final : public UPBProfileGeneralWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Title;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueText;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_DetailedCareerData(int32 EntryPoint);
	void SetValue(const class FText& InTitle, const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_DetailedCareerData_C">();
	}
	static class UUMG_DetailedCareerData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_DetailedCareerData_C>();
	}
};
static_assert(alignof(UUMG_DetailedCareerData_C) == 0x000008, "Wrong alignment on UUMG_DetailedCareerData_C");
static_assert(sizeof(UUMG_DetailedCareerData_C) == 0x000278, "Wrong size on UUMG_DetailedCareerData_C");
static_assert(offsetof(UUMG_DetailedCareerData_C, UberGraphFrame) == 0x000260, "Member 'UUMG_DetailedCareerData_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_DetailedCareerData_C, Title) == 0x000268, "Member 'UUMG_DetailedCareerData_C::Title' has a wrong offset!");
static_assert(offsetof(UUMG_DetailedCareerData_C, ValueText) == 0x000270, "Member 'UUMG_DetailedCareerData_C::ValueText' has a wrong offset!");

}

