#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Prompt

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Prompt.UMG_Prompt_C
// 0x0038 (0x03B8 - 0x0380)
class UUMG_Prompt_C final : public UPBPopUpWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Discription;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Options;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Option_0;                                          // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Option_2;                                          // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_Prompt(int32 EntryPoint);
	void K2_RefreshPopUp();
	void CustomEvent_1(int32 Index_0);
	void Construct();
	bool BP_OnHandleBackAction();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Prompt_C">();
	}
	static class UUMG_Prompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Prompt_C>();
	}
};
static_assert(alignof(UUMG_Prompt_C) == 0x000008, "Wrong alignment on UUMG_Prompt_C");
static_assert(sizeof(UUMG_Prompt_C) == 0x0003B8, "Wrong size on UUMG_Prompt_C");
static_assert(offsetof(UUMG_Prompt_C, UberGraphFrame) == 0x000380, "Member 'UUMG_Prompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Prompt_C, Flash) == 0x000388, "Member 'UUMG_Prompt_C::Flash' has a wrong offset!");
static_assert(offsetof(UUMG_Prompt_C, Image_112) == 0x000390, "Member 'UUMG_Prompt_C::Image_112' has a wrong offset!");
static_assert(offsetof(UUMG_Prompt_C, Text_Discription) == 0x000398, "Member 'UUMG_Prompt_C::Text_Discription' has a wrong offset!");
static_assert(offsetof(UUMG_Prompt_C, Title) == 0x0003A0, "Member 'UUMG_Prompt_C::Title' has a wrong offset!");
static_assert(offsetof(UUMG_Prompt_C, WrapBox_Options) == 0x0003A8, "Member 'UUMG_Prompt_C::WrapBox_Options' has a wrong offset!");
static_assert(offsetof(UUMG_Prompt_C, Option_0) == 0x0003B0, "Member 'UUMG_Prompt_C::Option_0' has a wrong offset!");
static_assert(offsetof(UUMG_Prompt_C, Option_2) == 0x0003B1, "Member 'UUMG_Prompt_C::Option_2' has a wrong offset!");

}

