#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_RedemptionCodeWidget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_RedemptionCodeWidget.UMG_RedemptionCodeWidget_C
// 0x0040 (0x0390 - 0x0350)
class UUMG_RedemptionCodeWidget_C final : public UPBRedemptionCodeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_108;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_111;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageUnavailable;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextUnaavailable;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RedemptionCodeTextBlock_C*         UMG_RedemptionCodeTextBlock;                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FName>                           ItemIDArray;                                       // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_RedemptionCodeWidget(int32 EntryPoint);
	void BP_OnActivated();
	void K2_UsingRedemptionCodeFailed();
	void K2_RequestFailed();
	void BndEvt__UMG_RedemptionCodeWidget_UMG_RedemptionCodeTextBlock_K2Node_ComponentBoundEvent_1_OnCodeUsebleChanged__DelegateSignature(bool IsUsableCode);
	void BndEvt__UMG_RedemptionCodeWidget_Button_108_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature();
	void K2_UsingRedemptionCodeSuccessful();
	void HideButtonBlock();
	void ShowButtonBlock();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_RedemptionCodeWidget_C">();
	}
	static class UUMG_RedemptionCodeWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_RedemptionCodeWidget_C>();
	}
};
static_assert(alignof(UUMG_RedemptionCodeWidget_C) == 0x000008, "Wrong alignment on UUMG_RedemptionCodeWidget_C");
static_assert(sizeof(UUMG_RedemptionCodeWidget_C) == 0x000390, "Wrong size on UUMG_RedemptionCodeWidget_C");
static_assert(offsetof(UUMG_RedemptionCodeWidget_C, UberGraphFrame) == 0x000350, "Member 'UUMG_RedemptionCodeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeWidget_C, Button_108) == 0x000358, "Member 'UUMG_RedemptionCodeWidget_C::Button_108' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeWidget_C, Image_111) == 0x000360, "Member 'UUMG_RedemptionCodeWidget_C::Image_111' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeWidget_C, ImageUnavailable) == 0x000368, "Member 'UUMG_RedemptionCodeWidget_C::ImageUnavailable' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeWidget_C, TextUnaavailable) == 0x000370, "Member 'UUMG_RedemptionCodeWidget_C::TextUnaavailable' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeWidget_C, UMG_RedemptionCodeTextBlock) == 0x000378, "Member 'UUMG_RedemptionCodeWidget_C::UMG_RedemptionCodeTextBlock' has a wrong offset!");
static_assert(offsetof(UUMG_RedemptionCodeWidget_C, ItemIDArray) == 0x000380, "Member 'UUMG_RedemptionCodeWidget_C::ItemIDArray' has a wrong offset!");

}

