#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MatchmakingRegions

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_MatchmakingRegions.UMG_MatchmakingRegions_C.ExecuteUbergraph_UMG_MatchmakingRegions
// 0x01F8 (0x01F8 - 0x0000)
struct UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName MatchmakingRegionName)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_MatchmakingRegion_C*               K2Node_DynamicCast_AsUMG_Matchmaking_Region;       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_MatchmakingRegionName_1;        // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_MatchmakingRegionName;          // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName MatchmakingRegionName)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class UUMG_MatchmakingRegion_C*               CallFunc_Create_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBMatchmakingRegionInfo               CallFunc_Array_Get_Item;                           // 0x00E8(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBMatchmakingRegionAddressRow         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0118(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x01A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_MatchmakingRegion_C*               K2Node_DynamicCast_AsUMG_Matchmaking_Region_1;     // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions) == 0x000008, "Wrong alignment on UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions");
static_assert(sizeof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions) == 0x0001F8, "Wrong size on UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, EntryPoint) == 0x000000, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000010, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, Temp_int_Array_Index_Variable) == 0x000058, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Percent_IntInt_ReturnValue) == 0x000060, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Divide_IntInt_ReturnValue) == 0x000064, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_SwitchInteger_CmpSuccess) == 0x000068, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_GetChildAt_ReturnValue) == 0x000070, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_DynamicCast_AsUMG_Matchmaking_Region) == 0x000080, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_DynamicCast_AsUMG_Matchmaking_Region' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_CustomEvent_MatchmakingRegionName_1) == 0x00008C, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_CustomEvent_MatchmakingRegionName_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_CustomEvent_MatchmakingRegionName) == 0x000094, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_CustomEvent_MatchmakingRegionName' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Conv_NameToString_ReturnValue) == 0x0000A0, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0000B0, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000C0, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Array_Add_ReturnValue) == 0x0000C4, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C8, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Create_ReturnValue) == 0x0000D8, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x0000E0, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Less_IntInt_ReturnValue) == 0x00010C, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Conv_StringToName_ReturnValue) == 0x000110, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_GetDataTableRowFromName_OutRow) == 0x000118, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000150, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Conv_TextToString_ReturnValue) == 0x000158, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000168, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000178, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000180, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_PlayAnimation_ReturnValue) == 0x000188, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_PlayAnimation_ReturnValue_1) == 0x000190, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_PlayAnimation_ReturnValue_2) == 0x000198, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_GetAllChildren_ReturnValue) == 0x0001A0, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_HasAnyChildren_ReturnValue) == 0x0001B0, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Array_Get_Item_1) == 0x0001B8, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_DynamicCast_AsUMG_Matchmaking_Region_1) == 0x0001C0, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_DynamicCast_AsUMG_Matchmaking_Region_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Array_Length_ReturnValue_1) == 0x0001CC, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_IsValid_ReturnValue_1) == 0x0001D0, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001D1, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0001D2, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_GetDisplayName_ReturnValue) == 0x0001D8, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions, CallFunc_GetDisplayName_ReturnValue_1) == 0x0001E8, "Member 'UMG_MatchmakingRegions_C_ExecuteUbergraph_UMG_MatchmakingRegions::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");

// Function UMG_MatchmakingRegions.UMG_MatchmakingRegions_C.OnButtonCancelConfirm
// 0x0008 (0x0008 - 0x0000)
struct UMG_MatchmakingRegions_C_OnButtonCancelConfirm final
{
public:
	class FName                                   MatchmakingRegionName;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchmakingRegions_C_OnButtonCancelConfirm) == 0x000004, "Wrong alignment on UMG_MatchmakingRegions_C_OnButtonCancelConfirm");
static_assert(sizeof(UMG_MatchmakingRegions_C_OnButtonCancelConfirm) == 0x000008, "Wrong size on UMG_MatchmakingRegions_C_OnButtonCancelConfirm");
static_assert(offsetof(UMG_MatchmakingRegions_C_OnButtonCancelConfirm, MatchmakingRegionName) == 0x000000, "Member 'UMG_MatchmakingRegions_C_OnButtonCancelConfirm::MatchmakingRegionName' has a wrong offset!");

// Function UMG_MatchmakingRegions.UMG_MatchmakingRegions_C.OnButtonConfirm
// 0x0008 (0x0008 - 0x0000)
struct UMG_MatchmakingRegions_C_OnButtonConfirm final
{
public:
	class FName                                   MatchmakingRegionName;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchmakingRegions_C_OnButtonConfirm) == 0x000004, "Wrong alignment on UMG_MatchmakingRegions_C_OnButtonConfirm");
static_assert(sizeof(UMG_MatchmakingRegions_C_OnButtonConfirm) == 0x000008, "Wrong size on UMG_MatchmakingRegions_C_OnButtonConfirm");
static_assert(offsetof(UMG_MatchmakingRegions_C_OnButtonConfirm, MatchmakingRegionName) == 0x000000, "Member 'UMG_MatchmakingRegions_C_OnButtonConfirm::MatchmakingRegionName' has a wrong offset!");

// Function UMG_MatchmakingRegions.UMG_MatchmakingRegions_C.NotifyChoosingRegion
// 0x0018 (0x0018 - 0x0000)
struct UMG_MatchmakingRegions_C_NotifyChoosingRegion final
{
public:
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_MainMenuLayout_C*                  K2Node_DynamicCast_AsUMG_Main_Menu_Layout;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MatchmakingRegions_C_NotifyChoosingRegion) == 0x000008, "Wrong alignment on UMG_MatchmakingRegions_C_NotifyChoosingRegion");
static_assert(sizeof(UMG_MatchmakingRegions_C_NotifyChoosingRegion) == 0x000018, "Wrong size on UMG_MatchmakingRegions_C_NotifyChoosingRegion");
static_assert(offsetof(UMG_MatchmakingRegions_C_NotifyChoosingRegion, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'UMG_MatchmakingRegions_C_NotifyChoosingRegion::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_NotifyChoosingRegion, K2Node_DynamicCast_AsUMG_Main_Menu_Layout) == 0x000008, "Member 'UMG_MatchmakingRegions_C_NotifyChoosingRegion::K2Node_DynamicCast_AsUMG_Main_Menu_Layout' has a wrong offset!");
static_assert(offsetof(UMG_MatchmakingRegions_C_NotifyChoosingRegion, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UMG_MatchmakingRegions_C_NotifyChoosingRegion::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_MatchmakingRegions.UMG_MatchmakingRegions_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UMG_MatchmakingRegions_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchmakingRegions_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on UMG_MatchmakingRegions_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(UMG_MatchmakingRegions_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on UMG_MatchmakingRegions_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(UMG_MatchmakingRegions_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'UMG_MatchmakingRegions_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

