#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MedalPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_MedalPage.UMG_MedalPage_C
// 0x0070 (0x0390 - 0x0320)
class UUMG_MedalPage_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_Medal_Big_C*                       UMG_Medal_Big;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_0;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, int32>                      MedaNameIndexMap;                                  // 0x0338(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUMG_Medal_Small_C*                     SelectedMedal;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_MedalPage(int32 EntryPoint);
	void BP_OnActivated();
	void OnInitialized();
	void InitAllMedals();
	void RefreshMedalInfos();
	void OnMedalSelected(const struct FPBMedalDetailsDataTableRowBase& InMedalDetail, int32 InCount, class UUMG_Medal_Small_C* InSelectedMedal);
	void OnProfileDataUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_MedalPage_C">();
	}
	static class UUMG_MedalPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_MedalPage_C>();
	}
};
static_assert(alignof(UUMG_MedalPage_C) == 0x000008, "Wrong alignment on UUMG_MedalPage_C");
static_assert(sizeof(UUMG_MedalPage_C) == 0x000390, "Wrong size on UUMG_MedalPage_C");
static_assert(offsetof(UUMG_MedalPage_C, UberGraphFrame) == 0x000320, "Member 'UUMG_MedalPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_MedalPage_C, UMG_Medal_Big) == 0x000328, "Member 'UUMG_MedalPage_C::UMG_Medal_Big' has a wrong offset!");
static_assert(offsetof(UUMG_MedalPage_C, WrapBox_0) == 0x000330, "Member 'UUMG_MedalPage_C::WrapBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_MedalPage_C, MedaNameIndexMap) == 0x000338, "Member 'UUMG_MedalPage_C::MedaNameIndexMap' has a wrong offset!");
static_assert(offsetof(UUMG_MedalPage_C, SelectedMedal) == 0x000388, "Member 'UUMG_MedalPage_C::SelectedMedal' has a wrong offset!");

}

