#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SettingGraphics

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.ExecuteUbergraph_UMG_SettingGraphics
// 0x0118 (0x0118 - 0x0000)
struct UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBEnumOptionItemWidget*                K2Node_DynamicCast_AsPBEnum_Option_Item_Widget;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowDLSS_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_2;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_3;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class UPBOptionBaseWidget*                    CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBGameMode_Menu*                       K2Node_DynamicCast_AsPBGame_Mode_Menu;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics");
static_assert(sizeof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics) == 0x000118, "Wrong size on UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, EntryPoint) == 0x000000, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_Event_IsDesignTime) == 0x000008, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000010, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_DynamicCast_AsPBEnum_Option_Item_Widget) == 0x000018, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_DynamicCast_AsPBEnum_Option_Item_Widget' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_ComponentBoundEvent_Index_1) == 0x000034, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_ComponentBoundEvent_Index) == 0x000038, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000040, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_ShouldShowDLSS_ReturnValue) == 0x000048, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_ShouldShowDLSS_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_GetEngineSubsystem_ReturnValue_2) == 0x000060, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_GetEngineSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_GetEngineSubsystem_ReturnValue_3) == 0x000070, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_GetEngineSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_CreateDelegate_OutputDelegate_2) == 0x000078, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_CreateDelegate_OutputDelegate_4) == 0x000098, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000A8, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B8, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_GetGameMode_ReturnValue) == 0x0000D8, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_DynamicCast_AsPBGame_Mode_Menu) == 0x0000E0, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_DynamicCast_AsPBGame_Mode_Menu' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_GetDisplayName_ReturnValue) == 0x0000F0, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_GetActiveWidget_ReturnValue) == 0x000100, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics, CallFunc_GetDisplayName_ReturnValue_1) == 0x000108, "Member 'UMG_SettingGraphics_C_ExecuteUbergraph_UMG_SettingGraphics::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.BndEvt__UMG_SettingGraphics_Card_Display_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_Display_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_Display_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature) == 0x000004, "Wrong alignment on UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_Display_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature");
static_assert(sizeof(UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_Display_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature) == 0x000004, "Wrong size on UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_Display_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature");
static_assert(offsetof(UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_Display_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature, Index_0) == 0x000000, "Member 'UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_Display_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature::Index_0' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.BndEvt__UMG_SettingGraphics_Card_GraphicsQuality_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_GraphicsQuality_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_GraphicsQuality_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature) == 0x000004, "Wrong alignment on UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_GraphicsQuality_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature");
static_assert(sizeof(UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_GraphicsQuality_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature) == 0x000004, "Wrong size on UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_GraphicsQuality_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature");
static_assert(offsetof(UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_GraphicsQuality_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature, Index_0) == 0x000000, "Member 'UMG_SettingGraphics_C_BndEvt__UMG_SettingGraphics_Card_GraphicsQuality_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature::Index_0' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_SettingGraphics_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingGraphics_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_SettingGraphics_C_PreConstruct");
static_assert(sizeof(UMG_SettingGraphics_C_PreConstruct) == 0x000001, "Wrong size on UMG_SettingGraphics_C_PreConstruct");
static_assert(offsetof(UMG_SettingGraphics_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_SettingGraphics_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.Init Resolution
// 0x00A0 (0x00A0 - 0x0000)
struct UMG_SettingGraphics_C_Init_Resolution final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      CallFunc_GetSupportedFullscreenResolutions_Resolutions; // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSupportedFullscreenResolutions_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntPointToString_ReturnValue;        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumOption_ReturnValue;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_EnumOptionItem_C*                  K2Node_DynamicCast_AsUMG_Enum_Option_Item;         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingGraphics_C_Init_Resolution) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_Init_Resolution");
static_assert(sizeof(UMG_SettingGraphics_C_Init_Resolution) == 0x0000A0, "Wrong size on UMG_SettingGraphics_C_Init_Resolution");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_SettingGraphics_C_Init_Resolution::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_SettingGraphics_C_Init_Resolution::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_GetPlatformName_ReturnValue) == 0x000010, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000028, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_GetSupportedFullscreenResolutions_Resolutions) == 0x000030, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_GetSupportedFullscreenResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_GetSupportedFullscreenResolutions_ReturnValue) == 0x000040, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_GetSupportedFullscreenResolutions_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_Array_Get_Item) == 0x000044, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_Conv_IntPointToString_ReturnValue) == 0x000050, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_Conv_IntPointToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_GetEnumOption_ReturnValue) == 0x000060, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_GetEnumOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, K2Node_DynamicCast_AsUMG_Enum_Option_Item) == 0x000088, "Member 'UMG_SettingGraphics_C_Init_Resolution::K2Node_DynamicCast_AsUMG_Enum_Option_Item' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'UMG_SettingGraphics_C_Init_Resolution::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_Init_Resolution, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'UMG_SettingGraphics_C_Init_Resolution::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.SwitchOptionList
// 0x0030 (0x0030 - 0x0000)
struct UMG_SettingGraphics_C_SwitchOptionList final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingGraphics_C_SwitchOptionList) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_SwitchOptionList");
static_assert(sizeof(UMG_SettingGraphics_C_SwitchOptionList) == 0x000030, "Wrong size on UMG_SettingGraphics_C_SwitchOptionList");
static_assert(offsetof(UMG_SettingGraphics_C_SwitchOptionList, Index_0) == 0x000000, "Member 'UMG_SettingGraphics_C_SwitchOptionList::Index_0' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_SwitchOptionList, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'UMG_SettingGraphics_C_SwitchOptionList::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_SwitchOptionList, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'UMG_SettingGraphics_C_SwitchOptionList::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_SwitchOptionList, CallFunc_GetDisplayName_ReturnValue_1) == 0x000020, "Member 'UMG_SettingGraphics_C_SwitchOptionList::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.RefreshSuperResolutionQuality
// 0x0050 (0x0050 - 0x0000)
struct UMG_SettingGraphics_C_RefreshSuperResolutionQuality final
{
public:
	uint8                                         Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Temp_text_Variable;                                // 0x0008(0x0010)(ReferenceParm)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumOption_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumOption_ReturnValue_1;              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_EnumOptionItem_C*                  K2Node_DynamicCast_AsUMG_Enum_Option_Item;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_Select_Default;                             // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_RefreshSuperResolutionQuality");
static_assert(sizeof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality) == 0x000050, "Wrong size on UMG_SettingGraphics_C_RefreshSuperResolutionQuality");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, Temp_byte_Variable) == 0x000000, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, Temp_text_Variable) == 0x000008, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000018, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000020, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, CallFunc_GetEnumOption_ReturnValue) == 0x000028, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::CallFunc_GetEnumOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, CallFunc_GetEnumOption_ReturnValue_1) == 0x00002A, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::CallFunc_GetEnumOption_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, K2Node_DynamicCast_AsUMG_Enum_Option_Item) == 0x000030, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::K2Node_DynamicCast_AsUMG_Enum_Option_Item' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000039, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_RefreshSuperResolutionQuality, K2Node_Select_Default) == 0x000040, "Member 'UMG_SettingGraphics_C_RefreshSuperResolutionQuality::K2Node_Select_Default' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.HandleBenchmark
// 0x0010 (0x0010 - 0x0000)
struct UMG_SettingGraphics_C_HandleBenchmark final
{
public:
	class UPBMainMenuManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushMenu_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingGraphics_C_HandleBenchmark) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_HandleBenchmark");
static_assert(sizeof(UMG_SettingGraphics_C_HandleBenchmark) == 0x000010, "Wrong size on UMG_SettingGraphics_C_HandleBenchmark");
static_assert(offsetof(UMG_SettingGraphics_C_HandleBenchmark, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'UMG_SettingGraphics_C_HandleBenchmark::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_HandleBenchmark, CallFunc_PushMenu_ReturnValue) == 0x000008, "Member 'UMG_SettingGraphics_C_HandleBenchmark::CallFunc_PushMenu_ReturnValue' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.InitGraphicsQuality
// 0x0090 (0x0090 - 0x0000)
struct UMG_SettingGraphics_C_InitGraphicsQuality final
{
public:
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptionBaseWidget*                    CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptionBaseWidget*                    CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptionBaseWidget*                    CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingGraphics_C_InitGraphicsQuality) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_InitGraphicsQuality");
static_assert(sizeof(UMG_SettingGraphics_C_InitGraphicsQuality) == 0x000090, "Wrong size on UMG_SettingGraphics_C_InitGraphicsQuality");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000000, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, Temp_int_Array_Index_Variable) == 0x000010, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, Temp_int_Array_Index_Variable_2) == 0x000020, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, Temp_int_Loop_Counter_Variable_2) == 0x000034, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Array_Get_Item) == 0x000038, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000060, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Less_IntInt_ReturnValue_1) == 0x000075, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Array_Length_ReturnValue_2) == 0x00007C, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Less_IntInt_ReturnValue_2) == 0x000088, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_InitGraphicsQuality, CallFunc_Array_Add_ReturnValue_1) == 0x00008C, "Member 'UMG_SettingGraphics_C_InitGraphicsQuality::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.UpdateGraphicsQualitySubOption
// 0x0030 (0x0030 - 0x0000)
struct UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptionBaseWidget*                    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumOption_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption");
static_assert(sizeof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption) == 0x000030, "Wrong size on UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption, CallFunc_Array_Get_Item) == 0x000010, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000020, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption, CallFunc_GetEnumOption_ReturnValue) == 0x000028, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption::CallFunc_GetEnumOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualitySubOption::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.UpdateGraphicsQualityOption
// 0x0018 (0x0018 - 0x0000)
struct UMG_SettingGraphics_C_UpdateGraphicsQualityOption final
{
public:
	class UPBOptionBaseWidget*                    Option;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingGraphics_C_UpdateGraphicsQualityOption) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_UpdateGraphicsQualityOption");
static_assert(sizeof(UMG_SettingGraphics_C_UpdateGraphicsQualityOption) == 0x000018, "Wrong size on UMG_SettingGraphics_C_UpdateGraphicsQualityOption");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualityOption, Option) == 0x000000, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualityOption::Option' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualityOption, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualityOption::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualityOption, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualityOption::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.UpdateGraphicsQualityToCustom
// 0x0010 (0x0010 - 0x0000)
struct UMG_SettingGraphics_C_UpdateGraphicsQualityToCustom final
{
public:
	class UUMG_EnumOptionItem_C*                  K2Node_DynamicCast_AsUMG_Enum_Option_Item;         // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingGraphics_C_UpdateGraphicsQualityToCustom) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_UpdateGraphicsQualityToCustom");
static_assert(sizeof(UMG_SettingGraphics_C_UpdateGraphicsQualityToCustom) == 0x000010, "Wrong size on UMG_SettingGraphics_C_UpdateGraphicsQualityToCustom");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualityToCustom, K2Node_DynamicCast_AsUMG_Enum_Option_Item) == 0x000000, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualityToCustom::K2Node_DynamicCast_AsUMG_Enum_Option_Item' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateGraphicsQualityToCustom, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'UMG_SettingGraphics_C_UpdateGraphicsQualityToCustom::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_SettingGraphics.UMG_SettingGraphics_C.UpdateAntiAliasing
// 0x0038 (0x0038 - 0x0000)
struct UMG_SettingGraphics_C_UpdateAntiAliasing final
{
public:
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumOption_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_EnumOptionItem_C*                  K2Node_DynamicCast_AsUMG_Enum_Option_Item;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue_2;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumOption_ReturnValue_1;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumOption_ReturnValue_2;              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingGraphics_C_UpdateAntiAliasing) == 0x000008, "Wrong alignment on UMG_SettingGraphics_C_UpdateAntiAliasing");
static_assert(sizeof(UMG_SettingGraphics_C_UpdateAntiAliasing) == 0x000038, "Wrong size on UMG_SettingGraphics_C_UpdateAntiAliasing");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateAntiAliasing, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000000, "Member 'UMG_SettingGraphics_C_UpdateAntiAliasing::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateAntiAliasing, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000008, "Member 'UMG_SettingGraphics_C_UpdateAntiAliasing::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateAntiAliasing, CallFunc_GetEnumOption_ReturnValue) == 0x000010, "Member 'UMG_SettingGraphics_C_UpdateAntiAliasing::CallFunc_GetEnumOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateAntiAliasing, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'UMG_SettingGraphics_C_UpdateAntiAliasing::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateAntiAliasing, K2Node_DynamicCast_AsUMG_Enum_Option_Item) == 0x000018, "Member 'UMG_SettingGraphics_C_UpdateAntiAliasing::K2Node_DynamicCast_AsUMG_Enum_Option_Item' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateAntiAliasing, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UMG_SettingGraphics_C_UpdateAntiAliasing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateAntiAliasing, CallFunc_GetEngineSubsystem_ReturnValue_2) == 0x000028, "Member 'UMG_SettingGraphics_C_UpdateAntiAliasing::CallFunc_GetEngineSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_SettingGraphics_C_UpdateAntiAliasing, CallFunc_GetEnumOption_ReturnValue_1) == 0x000030, "Member 'UMG_SettingGraphics_C_UpdateAntiAliasing::CallFunc_GetEnumOption_ReturnValue_1' has a wrong offset!");
