#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_LoginGate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_LoginGate.UMG_LoginGate_C.ExecuteUbergraph_UMG_LoginGate
// 0x0068 (0x0068 - 0x0000)
struct UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InQueueIndex;                         // 0x0010(0x0018)(ConstParm)
	int32                                         K2Node_Event_InErrorCode;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetErrorCodeTextFromNumber_ReturnValue;   // 0x0030(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate) == 0x000008, "Wrong alignment on UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate");
static_assert(sizeof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate) == 0x000068, "Wrong size on UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, EntryPoint) == 0x000000, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, K2Node_Event_InQueueIndex) == 0x000010, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::K2Node_Event_InQueueIndex' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, K2Node_Event_InErrorCode) == 0x000028, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::K2Node_Event_InErrorCode' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00002D, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00002E, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_GetErrorCodeTextFromNumber_ReturnValue) == 0x000030, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_GetErrorCodeTextFromNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_BooleanOR_ReturnValue_1) == 0x000049, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_GetPlatformName_ReturnValue) == 0x000050, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000060, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000061, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate, CallFunc_BooleanOR_ReturnValue_2) == 0x000062, "Member 'UMG_LoginGate_C_ExecuteUbergraph_UMG_LoginGate::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function UMG_LoginGate.UMG_LoginGate_C.BndEvt__UMG_LoginGate_TryAgin_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LoginGate_C_BndEvt__UMG_LoginGate_TryAgin_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LoginGate_C_BndEvt__UMG_LoginGate_TryAgin_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LoginGate_C_BndEvt__UMG_LoginGate_TryAgin_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_LoginGate_C_BndEvt__UMG_LoginGate_TryAgin_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_LoginGate_C_BndEvt__UMG_LoginGate_TryAgin_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_LoginGate_C_BndEvt__UMG_LoginGate_TryAgin_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_LoginGate_C_BndEvt__UMG_LoginGate_TryAgin_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_LoginGate.UMG_LoginGate_C.K2_LoginGateFail
// 0x0004 (0x0004 - 0x0000)
struct UMG_LoginGate_C_K2_LoginGateFail final
{
public:
	int32                                         InErrorCode;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LoginGate_C_K2_LoginGateFail) == 0x000004, "Wrong alignment on UMG_LoginGate_C_K2_LoginGateFail");
static_assert(sizeof(UMG_LoginGate_C_K2_LoginGateFail) == 0x000004, "Wrong size on UMG_LoginGate_C_K2_LoginGateFail");
static_assert(offsetof(UMG_LoginGate_C_K2_LoginGateFail, InErrorCode) == 0x000000, "Member 'UMG_LoginGate_C_K2_LoginGateFail::InErrorCode' has a wrong offset!");

// Function UMG_LoginGate.UMG_LoginGate_C.K2_RefreshQueueStatus
// 0x0018 (0x0018 - 0x0000)
struct UMG_LoginGate_C_K2_RefreshQueueStatus final
{
public:
	class FText                                   InQueueIndex;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_LoginGate_C_K2_RefreshQueueStatus) == 0x000008, "Wrong alignment on UMG_LoginGate_C_K2_RefreshQueueStatus");
static_assert(sizeof(UMG_LoginGate_C_K2_RefreshQueueStatus) == 0x000018, "Wrong size on UMG_LoginGate_C_K2_RefreshQueueStatus");
static_assert(offsetof(UMG_LoginGate_C_K2_RefreshQueueStatus, InQueueIndex) == 0x000000, "Member 'UMG_LoginGate_C_K2_RefreshQueueStatus::InQueueIndex' has a wrong offset!");

// Function UMG_LoginGate.UMG_LoginGate_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UMG_LoginGate_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_LoginGate_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UMG_LoginGate_C_OnMouseButtonDown");
static_assert(sizeof(UMG_LoginGate_C_OnMouseButtonDown) == 0x000218, "Wrong size on UMG_LoginGate_C_OnMouseButtonDown");
static_assert(offsetof(UMG_LoginGate_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UMG_LoginGate_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UMG_LoginGate_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UMG_LoginGate_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UMG_LoginGate_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UMG_LoginGate.UMG_LoginGate_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct UMG_LoginGate_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x01B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LoginGate_C_OnFocusReceived) == 0x000008, "Wrong alignment on UMG_LoginGate_C_OnFocusReceived");
static_assert(sizeof(UMG_LoginGate_C_OnFocusReceived) == 0x0001B8, "Wrong size on UMG_LoginGate_C_OnFocusReceived");
static_assert(offsetof(UMG_LoginGate_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UMG_LoginGate_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UMG_LoginGate_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UMG_LoginGate_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UMG_LoginGate_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnFocusReceived, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0001B0, "Member 'UMG_LoginGate_C_OnFocusReceived::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnFocusReceived, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001B4, "Member 'UMG_LoginGate_C_OnFocusReceived::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnFocusReceived, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001B5, "Member 'UMG_LoginGate_C_OnFocusReceived::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LoginGate_C_OnFocusReceived, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0001B6, "Member 'UMG_LoginGate_C_OnFocusReceived::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");

}

