#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_StoreProduct_Armory

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_StoreProduct_Armory.UMG_StoreProduct_Armory_C.ExecuteUbergraph_UMG_StoreProduct_Armory
// 0x0038 (0x0038 - 0x0000)
struct UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
	struct FBPFocusEvent                          CallFunc_ConvertToBPFocusEvent_ReturnValue;        // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory) == 0x000008, "Wrong alignment on UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory");
static_assert(sizeof(UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory) == 0x000038, "Wrong size on UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory");
static_assert(offsetof(UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory, EntryPoint) == 0x000000, "Member 'UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory, CallFunc_ConvertToBPFocusEvent_ReturnValue) == 0x000014, "Member 'UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory::CallFunc_ConvertToBPFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'UMG_StoreProduct_Armory_C_ExecuteUbergraph_UMG_StoreProduct_Armory::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UMG_StoreProduct_Armory.UMG_StoreProduct_Armory_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_StoreProduct_Armory_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_StoreProduct_Armory_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_StoreProduct_Armory_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_StoreProduct_Armory_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_StoreProduct_Armory_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_StoreProduct_Armory_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_StoreProduct_Armory_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_StoreProduct_Armory.UMG_StoreProduct_Armory_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_StoreProduct_Armory_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_StoreProduct_Armory_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_StoreProduct_Armory_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_StoreProduct_Armory_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_StoreProduct_Armory_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_StoreProduct_Armory_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_StoreProduct_Armory_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_StoreProduct_Armory.UMG_StoreProduct_Armory_C.SetCategoryText
// 0x0001 (0x0001 - 0x0000)
struct UMG_StoreProduct_Armory_C_SetCategoryText final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_StoreProduct_Armory_C_SetCategoryText) == 0x000001, "Wrong alignment on UMG_StoreProduct_Armory_C_SetCategoryText");
static_assert(sizeof(UMG_StoreProduct_Armory_C_SetCategoryText) == 0x000001, "Wrong size on UMG_StoreProduct_Armory_C_SetCategoryText");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetCategoryText, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'UMG_StoreProduct_Armory_C_SetCategoryText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_StoreProduct_Armory.UMG_StoreProduct_Armory_C.SetPaymentMethod
// 0x0040 (0x0040 - 0x0000)
struct UMG_StoreProduct_Armory_C_SetPaymentMethod final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBProductPaymentMethod                CallFunc_Array_Get_Item;                           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_StoreProduct_Armory_C_SetPaymentMethod) == 0x000008, "Wrong alignment on UMG_StoreProduct_Armory_C_SetPaymentMethod");
static_assert(sizeof(UMG_StoreProduct_Armory_C_SetPaymentMethod) == 0x000040, "Wrong size on UMG_StoreProduct_Armory_C_SetPaymentMethod");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetPaymentMethod, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_StoreProduct_Armory_C_SetPaymentMethod::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetPaymentMethod, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_StoreProduct_Armory_C_SetPaymentMethod::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetPaymentMethod, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_StoreProduct_Armory_C_SetPaymentMethod::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetPaymentMethod, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'UMG_StoreProduct_Armory_C_SetPaymentMethod::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetPaymentMethod, CallFunc_Array_Get_Item) == 0x000010, "Member 'UMG_StoreProduct_Armory_C_SetPaymentMethod::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetPaymentMethod, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'UMG_StoreProduct_Armory_C_SetPaymentMethod::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetPaymentMethod, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'UMG_StoreProduct_Armory_C_SetPaymentMethod::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetPaymentMethod, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'UMG_StoreProduct_Armory_C_SetPaymentMethod::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_StoreProduct_Armory.UMG_StoreProduct_Armory_C.SetGradeStyle
// 0x0158 (0x0158 - 0x0000)
struct UMG_StoreProduct_Armory_C_SetGradeStyle final
{
public:
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_3;                  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_4;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_5;                  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0088(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00D8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0100(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0128(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_StoreProduct_Armory_C_SetGradeStyle) == 0x000008, "Wrong alignment on UMG_StoreProduct_Armory_C_SetGradeStyle");
static_assert(sizeof(UMG_StoreProduct_Armory_C_SetGradeStyle) == 0x000158, "Wrong size on UMG_StoreProduct_Armory_C_SetGradeStyle");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue) == 0x000000, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_1) == 0x000010, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_2) == 0x000020, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_3) == 0x000030, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_4) == 0x000040, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, CallFunc_MakeColor_ReturnValue_5) == 0x000050, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::CallFunc_MakeColor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, K2Node_MakeStruct_SlateColor_1) == 0x000088, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, K2Node_MakeStruct_SlateColor_2) == 0x0000B0, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, K2Node_MakeStruct_SlateColor_3) == 0x0000D8, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, K2Node_MakeStruct_SlateColor_4) == 0x000100, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, K2Node_MakeStruct_SlateColor_5) == 0x000128, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_SetGradeStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000150, "Member 'UMG_StoreProduct_Armory_C_SetGradeStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_StoreProduct_Armory.UMG_StoreProduct_Armory_C.PromptPurchase
// 0x0078 (0x0078 - 0x0000)
struct UMG_StoreProduct_Armory_C_PromptPurchase final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0018)()
	struct FPBProductPaymentMethod                CallFunc_Array_Get_Item;                           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushNormalPrompt_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_PurchaseInArmoryPrompt_C*          K2Node_DynamicCast_AsUMG_Purchase_in_Armory_Prompt; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_StoreProduct_Armory_C_PromptPurchase) == 0x000008, "Wrong alignment on UMG_StoreProduct_Armory_C_PromptPurchase");
static_assert(sizeof(UMG_StoreProduct_Armory_C_PromptPurchase) == 0x000078, "Wrong size on UMG_StoreProduct_Armory_C_PromptPurchase");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, CallFunc_Array_Get_Item) == 0x000040, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000058, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, CallFunc_PushNormalPrompt_ReturnValue) == 0x000060, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::CallFunc_PushNormalPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, K2Node_DynamicCast_AsUMG_Purchase_in_Armory_Prompt) == 0x000068, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::K2Node_DynamicCast_AsUMG_Purchase_in_Armory_Prompt' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_PromptPurchase, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'UMG_StoreProduct_Armory_C_PromptPurchase::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_StoreProduct_Armory.UMG_StoreProduct_Armory_C.RecordInteractInfo
// 0x0018 (0x0018 - 0x0000)
struct UMG_StoreProduct_Armory_C_RecordInteractInfo final
{
public:
	class UPBEventTrackingManager*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_StoreProduct_Armory_C_RecordInteractInfo) == 0x000008, "Wrong alignment on UMG_StoreProduct_Armory_C_RecordInteractInfo");
static_assert(sizeof(UMG_StoreProduct_Armory_C_RecordInteractInfo) == 0x000018, "Wrong size on UMG_StoreProduct_Armory_C_RecordInteractInfo");
static_assert(offsetof(UMG_StoreProduct_Armory_C_RecordInteractInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_StoreProduct_Armory_C_RecordInteractInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_StoreProduct_Armory_C_RecordInteractInfo, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'UMG_StoreProduct_Armory_C_RecordInteractInfo::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

