#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_Health

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_HelmetHUD_Health.UMG_HelmetHUD_Health_C.ExecuteUbergraph_UMG_HelmetHUD_Health
// 0x0048 (0x0048 - 0x0000)
struct UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InAirPressure;                        // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InAirTightness;                       // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health) == 0x000004, "Wrong alignment on UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health");
static_assert(sizeof(UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health) == 0x000048, "Wrong size on UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health");
static_assert(offsetof(UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health, EntryPoint) == 0x000000, "Member 'UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health, K2Node_Event_InAirPressure) == 0x000004, "Member 'UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health::K2Node_Event_InAirPressure' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health, K2Node_Event_InAirTightness) == 0x000008, "Member 'UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health::K2Node_Event_InAirTightness' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health, K2Node_Event_MyGeometry) == 0x00000C, "Member 'UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health, K2Node_Event_InDeltaTime) == 0x000044, "Member 'UMG_HelmetHUD_Health_C_ExecuteUbergraph_UMG_HelmetHUD_Health::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function UMG_HelmetHUD_Health.UMG_HelmetHUD_Health_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_HelmetHUD_Health_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Health_C_Tick) == 0x000004, "Wrong alignment on UMG_HelmetHUD_Health_C_Tick");
static_assert(sizeof(UMG_HelmetHUD_Health_C_Tick) == 0x00003C, "Wrong size on UMG_HelmetHUD_Health_C_Tick");
static_assert(offsetof(UMG_HelmetHUD_Health_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_HelmetHUD_Health_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_HelmetHUD_Health_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_HelmetHUD_Health.UMG_HelmetHUD_Health_C.K2_RefreshAirTightnessInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_Health_C_K2_RefreshAirTightnessInfo final
{
public:
	float                                         InAirTightness;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Health_C_K2_RefreshAirTightnessInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_Health_C_K2_RefreshAirTightnessInfo");
static_assert(sizeof(UMG_HelmetHUD_Health_C_K2_RefreshAirTightnessInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_Health_C_K2_RefreshAirTightnessInfo");
static_assert(offsetof(UMG_HelmetHUD_Health_C_K2_RefreshAirTightnessInfo, InAirTightness) == 0x000000, "Member 'UMG_HelmetHUD_Health_C_K2_RefreshAirTightnessInfo::InAirTightness' has a wrong offset!");

// Function UMG_HelmetHUD_Health.UMG_HelmetHUD_Health_C.K2_RefreshAirPressureInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_Health_C_K2_RefreshAirPressureInfo final
{
public:
	float                                         InAirPressure;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Health_C_K2_RefreshAirPressureInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_Health_C_K2_RefreshAirPressureInfo");
static_assert(sizeof(UMG_HelmetHUD_Health_C_K2_RefreshAirPressureInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_Health_C_K2_RefreshAirPressureInfo");
static_assert(offsetof(UMG_HelmetHUD_Health_C_K2_RefreshAirPressureInfo, InAirPressure) == 0x000000, "Member 'UMG_HelmetHUD_Health_C_K2_RefreshAirPressureInfo::InAirPressure' has a wrong offset!");

// Function UMG_HelmetHUD_Health.UMG_HelmetHUD_Health_C.RefreshAirTightnessInfo
// 0x0028 (0x0028 - 0x0000)
struct UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo final
{
public:
	float                                         InAirTightness;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_AirTightnessPencent;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo) == 0x000008, "Wrong alignment on UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo");
static_assert(sizeof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo) == 0x000028, "Wrong size on UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, InAirTightness) == 0x000000, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::InAirTightness' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, L_AirTightnessPencent) == 0x000004, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::L_AirTightnessPencent' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000013, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_Less_FloatFloat_ReturnValue) == 0x000014, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo, CallFunc_FMin_ReturnValue) == 0x000024, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightnessInfo::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function UMG_HelmetHUD_Health.UMG_HelmetHUD_Health_C.RefreshAirpressureInfo
// 0x0110 (0x0110 - 0x0000)
struct UMG_HelmetHUD_Health_C_RefreshAirpressureInfo final
{
public:
	float                                         InAirPressure;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_AirPressurePencent;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0028)()
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0080(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x00E0(0x0018)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo) == 0x000008, "Wrong alignment on UMG_HelmetHUD_Health_C_RefreshAirpressureInfo");
static_assert(sizeof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo) == 0x000110, "Wrong size on UMG_HelmetHUD_Health_C_RefreshAirpressureInfo");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, InAirPressure) == 0x000000, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::InAirPressure' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, L_AirPressurePencent) == 0x000004, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::L_AirPressurePencent' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000031, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_GetEndTime_ReturnValue) == 0x000034, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_K2_SetTimer_ReturnValue) == 0x000038, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_Less_FloatFloat_ReturnValue) == 0x000040, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000041, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000042, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_LinearColorLerp_ReturnValue) == 0x000044, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, K2Node_MakeStruct_SlateColor_1) == 0x000058, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_GetCachedGeometry_ReturnValue) == 0x000080, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_BreakVector2D_X) == 0x0000B8, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_BreakVector2D_Y) == 0x0000BC, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_GetAbsoluteSize_ReturnValue) == 0x0000C0, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_BreakVector2D_X_1) == 0x0000C8, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_BreakVector2D_Y_1) == 0x0000CC, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000D0, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D4, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000D8, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_Conv_FloatToText_ReturnValue) == 0x0000E0, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000F8, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_MakeVector2D_ReturnValue) == 0x0000FC, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000104, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirpressureInfo, CallFunc_FMin_ReturnValue) == 0x000108, "Member 'UMG_HelmetHUD_Health_C_RefreshAirpressureInfo::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function UMG_HelmetHUD_Health.UMG_HelmetHUD_Health_C.PlayAirPressureAnim
// 0x0008 (0x0008 - 0x0000)
struct UMG_HelmetHUD_Health_C_PlayAirPressureAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Health_C_PlayAirPressureAnim) == 0x000008, "Wrong alignment on UMG_HelmetHUD_Health_C_PlayAirPressureAnim");
static_assert(sizeof(UMG_HelmetHUD_Health_C_PlayAirPressureAnim) == 0x000008, "Wrong size on UMG_HelmetHUD_Health_C_PlayAirPressureAnim");
static_assert(offsetof(UMG_HelmetHUD_Health_C_PlayAirPressureAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_HelmetHUD_Health_C_PlayAirPressureAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_HelmetHUD_Health.UMG_HelmetHUD_Health_C.RefreshAirTightness
// 0x0088 (0x0088 - 0x0000)
struct UMG_HelmetHUD_Health_C_RefreshAirTightness final
{
public:
	float                                         InPencent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0010(0x0018)()
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0028(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Health_C_RefreshAirTightness) == 0x000008, "Wrong alignment on UMG_HelmetHUD_Health_C_RefreshAirTightness");
static_assert(sizeof(UMG_HelmetHUD_Health_C_RefreshAirTightness) == 0x000088, "Wrong size on UMG_HelmetHUD_Health_C_RefreshAirTightness");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, InPencent) == 0x000000, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::InPencent' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_Conv_FloatToText_ReturnValue) == 0x000010, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_GetCachedGeometry_ReturnValue) == 0x000028, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_GetAbsoluteSize_ReturnValue) == 0x000060, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_BreakVector2D_X) == 0x000068, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_BreakVector2D_Y) == 0x00006C, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_BreakVector2D_X_1) == 0x000070, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_BreakVector2D_Y_1) == 0x000074, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000078, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_RefreshAirTightness, CallFunc_MakeVector2D_ReturnValue) == 0x000080, "Member 'UMG_HelmetHUD_Health_C_RefreshAirTightness::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function UMG_HelmetHUD_Health.UMG_HelmetHUD_Health_C.SimulateRecoverAirTightness
// 0x000C (0x000C - 0x0000)
struct UMG_HelmetHUD_Health_C_SimulateRecoverAirTightness final
{
public:
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_Health_C_SimulateRecoverAirTightness) == 0x000004, "Wrong alignment on UMG_HelmetHUD_Health_C_SimulateRecoverAirTightness");
static_assert(sizeof(UMG_HelmetHUD_Health_C_SimulateRecoverAirTightness) == 0x00000C, "Wrong size on UMG_HelmetHUD_Health_C_SimulateRecoverAirTightness");
static_assert(offsetof(UMG_HelmetHUD_Health_C_SimulateRecoverAirTightness, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000000, "Member 'UMG_HelmetHUD_Health_C_SimulateRecoverAirTightness::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_Health_C_SimulateRecoverAirTightness, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000004, "Member 'UMG_HelmetHUD_Health_C_SimulateRecoverAirTightness::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
