#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SettingCard

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_SettingCard.UMG_SettingCard_C.ExecuteUbergraph_UMG_SettingCard
// 0x0120 (0x0120 - 0x0000)
struct UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0008(0x0070)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0078(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00B0(0x0070)(ConstParm)
};
static_assert(alignof(UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard) == 0x000008, "Wrong alignment on UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard");
static_assert(sizeof(UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard) == 0x000120, "Wrong size on UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard");
static_assert(offsetof(UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard, EntryPoint) == 0x000000, "Member 'UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard, K2Node_Event_MouseEvent) == 0x000008, "Member 'UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard, K2Node_Event_MyGeometry) == 0x000078, "Member 'UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard, K2Node_Event_MouseEvent_1) == 0x0000B0, "Member 'UMG_SettingCard_C_ExecuteUbergraph_UMG_SettingCard::K2Node_Event_MouseEvent_1' has a wrong offset!");

// Function UMG_SettingCard.UMG_SettingCard_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UMG_SettingCard_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_SettingCard_C_OnMouseLeave) == 0x000008, "Wrong alignment on UMG_SettingCard_C_OnMouseLeave");
static_assert(sizeof(UMG_SettingCard_C_OnMouseLeave) == 0x000070, "Wrong size on UMG_SettingCard_C_OnMouseLeave");
static_assert(offsetof(UMG_SettingCard_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UMG_SettingCard_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UMG_SettingCard.UMG_SettingCard_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_SettingCard_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_SettingCard_C_OnMouseEnter) == 0x000008, "Wrong alignment on UMG_SettingCard_C_OnMouseEnter");
static_assert(sizeof(UMG_SettingCard_C_OnMouseEnter) == 0x0000A8, "Wrong size on UMG_SettingCard_C_OnMouseEnter");
static_assert(offsetof(UMG_SettingCard_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UMG_SettingCard_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UMG_SettingCard_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UMG_SettingCard.UMG_SettingCard_C.On_Border_Setting_MouseButtonUp_0
// 0x0220 (0x0220 - 0x0000)
struct UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
	class UCommonActivatableWidget*               CallFunc_GotoPage_ReturnValue;                     // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0) == 0x000008, "Wrong alignment on UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0");
static_assert(sizeof(UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0) == 0x000220, "Wrong size on UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0, MyGeometry) == 0x000000, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0, MouseEvent) == 0x000038, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0, ReturnValue) == 0x0000A8, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0, CallFunc_GotoPage_ReturnValue) == 0x000218, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonUp_0::CallFunc_GotoPage_ReturnValue' has a wrong offset!");

// Function UMG_SettingCard.UMG_SettingCard_C.On_Border_Setting_MouseButtonDown_0
// 0x0228 (0x0228 - 0x0000)
struct UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	class UPBMainMenuManager_BP_C*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	class UCommonActivatableWidget*               CallFunc_PushMenu_ReturnValue;                     // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0) == 0x000008, "Wrong alignment on UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0");
static_assert(sizeof(UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0) == 0x000228, "Wrong size on UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0, MyGeometry) == 0x000000, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0, MouseEvent) == 0x000038, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0, ReturnValue) == 0x0000A8, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000160, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0, CallFunc_PushMenu_ReturnValue) == 0x000220, "Member 'UMG_SettingCard_C_On_Border_Setting_MouseButtonDown_0::CallFunc_PushMenu_ReturnValue' has a wrong offset!");

}

