#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_LimitedTimeLoginPage_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_LimitedTimeLoginPage_Base.UMG_LimitedTimeLoginPage_Base_C.ExecuteUbergraph_UMG_LimitedTimeLoginPage_Base
// 0x0004 (0x0004 - 0x0000)
struct UMG_LimitedTimeLoginPage_Base_C_ExecuteUbergraph_UMG_LimitedTimeLoginPage_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LimitedTimeLoginPage_Base_C_ExecuteUbergraph_UMG_LimitedTimeLoginPage_Base) == 0x000004, "Wrong alignment on UMG_LimitedTimeLoginPage_Base_C_ExecuteUbergraph_UMG_LimitedTimeLoginPage_Base");
static_assert(sizeof(UMG_LimitedTimeLoginPage_Base_C_ExecuteUbergraph_UMG_LimitedTimeLoginPage_Base) == 0x000004, "Wrong size on UMG_LimitedTimeLoginPage_Base_C_ExecuteUbergraph_UMG_LimitedTimeLoginPage_Base");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_ExecuteUbergraph_UMG_LimitedTimeLoginPage_Base, EntryPoint) == 0x000000, "Member 'UMG_LimitedTimeLoginPage_Base_C_ExecuteUbergraph_UMG_LimitedTimeLoginPage_Base::EntryPoint' has a wrong offset!");

// Function UMG_LimitedTimeLoginPage_Base.UMG_LimitedTimeLoginPage_Base_C.RefreshRewardList
// 0x0068 (0x0068 - 0x0000)
struct UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBRewardItem                          CallFunc_Array_Get_Item;                           // 0x000C(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UScaleBox*                              CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList) == 0x000008, "Wrong alignment on UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList");
static_assert(sizeof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList) == 0x000068, "Wrong size on UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, CallFunc_Array_Get_Item) == 0x00000C, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, CallFunc_Create_ReturnValue) == 0x000028, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, K2Node_MakeStruct_Margin) == 0x000030, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, CallFunc_AddChild_ReturnValue_1) == 0x000050, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000058, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UMG_LimitedTimeLoginPage_Base_C_RefreshRewardList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

