#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EventTaskProgress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_EventTaskProgress.UMG_EventTaskProgress_C.ExecuteUbergraph_UMG_EventTaskProgress
// 0x0044 (0x0044 - 0x0000)
struct UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress) == 0x000004, "Wrong alignment on UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress");
static_assert(sizeof(UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress) == 0x000044, "Wrong size on UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress");
static_assert(offsetof(UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress, EntryPoint) == 0x000000, "Member 'UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress, K2Node_Event_MyGeometry) == 0x000008, "Member 'UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress, K2Node_Event_InDeltaTime) == 0x000040, "Member 'UMG_EventTaskProgress_C_ExecuteUbergraph_UMG_EventTaskProgress::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function UMG_EventTaskProgress.UMG_EventTaskProgress_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_EventTaskProgress_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EventTaskProgress_C_Tick) == 0x000004, "Wrong alignment on UMG_EventTaskProgress_C_Tick");
static_assert(sizeof(UMG_EventTaskProgress_C_Tick) == 0x00003C, "Wrong size on UMG_EventTaskProgress_C_Tick");
static_assert(offsetof(UMG_EventTaskProgress_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_EventTaskProgress_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_EventTaskProgress_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_EventTaskProgress.UMG_EventTaskProgress_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_EventTaskProgress_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EventTaskProgress_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_EventTaskProgress_C_PreConstruct");
static_assert(sizeof(UMG_EventTaskProgress_C_PreConstruct) == 0x000001, "Wrong size on UMG_EventTaskProgress_C_PreConstruct");
static_assert(offsetof(UMG_EventTaskProgress_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_EventTaskProgress_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_EventTaskProgress.UMG_EventTaskProgress_C.RefreshProgress
// 0x0020 (0x0020 - 0x0000)
struct UMG_EventTaskProgress_C_RefreshProgress final
{
public:
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EventTaskProgress_C_RefreshProgress) == 0x000004, "Wrong alignment on UMG_EventTaskProgress_C_RefreshProgress");
static_assert(sizeof(UMG_EventTaskProgress_C_RefreshProgress) == 0x000020, "Wrong size on UMG_EventTaskProgress_C_RefreshProgress");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshProgress, CallFunc_Multiply_IntInt_ReturnValue) == 0x000000, "Member 'UMG_EventTaskProgress_C_RefreshProgress::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshProgress, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000004, "Member 'UMG_EventTaskProgress_C_RefreshProgress::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshProgress, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'UMG_EventTaskProgress_C_RefreshProgress::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshProgress, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00000C, "Member 'UMG_EventTaskProgress_C_RefreshProgress::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshProgress, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'UMG_EventTaskProgress_C_RefreshProgress::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshProgress, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000014, "Member 'UMG_EventTaskProgress_C_RefreshProgress::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshProgress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'UMG_EventTaskProgress_C_RefreshProgress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshProgress, CallFunc_GetChildrenCount_ReturnValue) == 0x00001C, "Member 'UMG_EventTaskProgress_C_RefreshProgress::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");

// Function UMG_EventTaskProgress.UMG_EventTaskProgress_C.RefreshRewardList
// 0x0078 (0x0078 - 0x0000)
struct UMG_EventTaskProgress_C_RefreshRewardList final
{
public:
	TArray<struct FPBProgressActivityReward>      ProgressActivityRewardArray;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         ResidualPoints;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBProgressActivityReward              CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMG_ActivityCenter_ProgressReward_C*   CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EventTaskProgress_C_RefreshRewardList) == 0x000008, "Wrong alignment on UMG_EventTaskProgress_C_RefreshRewardList");
static_assert(sizeof(UMG_EventTaskProgress_C_RefreshRewardList) == 0x000078, "Wrong size on UMG_EventTaskProgress_C_RefreshRewardList");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, ProgressActivityRewardArray) == 0x000000, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::ProgressActivityRewardArray' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, ResidualPoints) == 0x000010, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::ResidualPoints' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, Temp_int_Array_Index_Variable) == 0x000018, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, CallFunc_Array_Get_Item) == 0x000020, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003C, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, K2Node_MakeStruct_Margin) == 0x000048, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, CallFunc_Create_ReturnValue) == 0x000058, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, CallFunc_AddChild_ReturnValue) == 0x000060, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x000068, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshRewardList, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'UMG_EventTaskProgress_C_RefreshRewardList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_EventTaskProgress.UMG_EventTaskProgress_C.RefreshInfo
// 0x0030 (0x0030 - 0x0000)
struct UMG_EventTaskProgress_C_RefreshInfo final
{
public:
	TArray<struct FPBProgressActivityReward>      ProgressActivityRewardArray;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Points_0;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
};
static_assert(alignof(UMG_EventTaskProgress_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_EventTaskProgress_C_RefreshInfo");
static_assert(sizeof(UMG_EventTaskProgress_C_RefreshInfo) == 0x000030, "Wrong size on UMG_EventTaskProgress_C_RefreshInfo");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshInfo, ProgressActivityRewardArray) == 0x000000, "Member 'UMG_EventTaskProgress_C_RefreshInfo::ProgressActivityRewardArray' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshInfo, Points_0) == 0x000010, "Member 'UMG_EventTaskProgress_C_RefreshInfo::Points_0' has a wrong offset!");
static_assert(offsetof(UMG_EventTaskProgress_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'UMG_EventTaskProgress_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

