#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityCenter_ProgressReward

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_ActivityCenter_ProgressReward.UMG_ActivityCenter_ProgressReward_C.RefreshInfo
// 0x0028 (0x0028 - 0x0000)
struct UMG_ActivityCenter_ProgressReward_C_RefreshInfo final
{
public:
	struct FPBRewardItem                          Reward;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         Points;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
};
static_assert(alignof(UMG_ActivityCenter_ProgressReward_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_ActivityCenter_ProgressReward_C_RefreshInfo");
static_assert(sizeof(UMG_ActivityCenter_ProgressReward_C_RefreshInfo) == 0x000028, "Wrong size on UMG_ActivityCenter_ProgressReward_C_RefreshInfo");
static_assert(offsetof(UMG_ActivityCenter_ProgressReward_C_RefreshInfo, Reward) == 0x000000, "Member 'UMG_ActivityCenter_ProgressReward_C_RefreshInfo::Reward' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_ProgressReward_C_RefreshInfo, Points) == 0x00000C, "Member 'UMG_ActivityCenter_ProgressReward_C_RefreshInfo::Points' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_ProgressReward_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'UMG_ActivityCenter_ProgressReward_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

