#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_OriginalSoundTrack

#include "Basic.hpp"

#include "Struct_SoundInfo_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_OriginalSoundTrack.UMG_OriginalSoundTrack_C.RefreshSoundTrackList
// 0x0090 (0x0090 - 0x0000)
struct UMG_OriginalSoundTrack_C_RefreshSoundTrackList final
{
public:
	TArray<struct FStruct_SoundInfo>              InSoundInfos;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UAudioComponent*                        InPlayingAudioComp;                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleSoundTrack_C*                CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SoundInfo                      CallFunc_Array_Get_Item;                           // 0x0038(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InSoundIndex)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList) == 0x000008, "Wrong alignment on UMG_OriginalSoundTrack_C_RefreshSoundTrackList");
static_assert(sizeof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList) == 0x000090, "Wrong size on UMG_OriginalSoundTrack_C_RefreshSoundTrackList");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, InSoundInfos) == 0x000000, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::InSoundInfos' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, InPlayingAudioComp) == 0x000010, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::InPlayingAudioComp' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, Temp_int_Array_Index_Variable) == 0x000018, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, CallFunc_Create_ReturnValue) == 0x000030, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, CallFunc_Array_Get_Item) == 0x000038, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000071, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, K2Node_MakeStruct_Margin) == 0x000074, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_RefreshSoundTrackList, CallFunc_AddChild_ReturnValue) == 0x000088, "Member 'UMG_OriginalSoundTrack_C_RefreshSoundTrackList::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UMG_OriginalSoundTrack.UMG_OriginalSoundTrack_C.On Button Clicked
// 0x0004 (0x0004 - 0x0000)
struct UMG_OriginalSoundTrack_C_On_Button_Clicked final
{
public:
	int32                                         InSoundIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_OriginalSoundTrack_C_On_Button_Clicked) == 0x000004, "Wrong alignment on UMG_OriginalSoundTrack_C_On_Button_Clicked");
static_assert(sizeof(UMG_OriginalSoundTrack_C_On_Button_Clicked) == 0x000004, "Wrong size on UMG_OriginalSoundTrack_C_On_Button_Clicked");
static_assert(offsetof(UMG_OriginalSoundTrack_C_On_Button_Clicked, InSoundIndex) == 0x000000, "Member 'UMG_OriginalSoundTrack_C_On_Button_Clicked::InSoundIndex' has a wrong offset!");

// Function UMG_OriginalSoundTrack.UMG_OriginalSoundTrack_C.PlaySoundFromIndex
// 0x0030 (0x0030 - 0x0000)
struct UMG_OriginalSoundTrack_C_PlaySoundFromIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        InPlayingAudioComp;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SingleSoundTrack_C*                K2Node_DynamicCast_AsUMG_Single_Sound_Track;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_OriginalSoundTrack_C_PlaySoundFromIndex) == 0x000008, "Wrong alignment on UMG_OriginalSoundTrack_C_PlaySoundFromIndex");
static_assert(sizeof(UMG_OriginalSoundTrack_C_PlaySoundFromIndex) == 0x000030, "Wrong size on UMG_OriginalSoundTrack_C_PlaySoundFromIndex");
static_assert(offsetof(UMG_OriginalSoundTrack_C_PlaySoundFromIndex, InIndex) == 0x000000, "Member 'UMG_OriginalSoundTrack_C_PlaySoundFromIndex::InIndex' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_PlaySoundFromIndex, InPlayingAudioComp) == 0x000008, "Member 'UMG_OriginalSoundTrack_C_PlaySoundFromIndex::InPlayingAudioComp' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_PlaySoundFromIndex, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UMG_OriginalSoundTrack_C_PlaySoundFromIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_PlaySoundFromIndex, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'UMG_OriginalSoundTrack_C_PlaySoundFromIndex::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_PlaySoundFromIndex, K2Node_DynamicCast_AsUMG_Single_Sound_Track) == 0x000020, "Member 'UMG_OriginalSoundTrack_C_PlaySoundFromIndex::K2Node_DynamicCast_AsUMG_Single_Sound_Track' has a wrong offset!");
static_assert(offsetof(UMG_OriginalSoundTrack_C_PlaySoundFromIndex, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UMG_OriginalSoundTrack_C_PlaySoundFromIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

