#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InvitationTip_Widget

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C
// 0x0050 (0x0378 - 0x0328)
class UUMG_InvitationTip_Widget_C final : public UPBInvitationTipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               InvitationTip;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      PBInputTipsImage_Accept;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      PBInputTipsImage_Reject;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_InvitationDuration;                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SenderName;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TimeOutTip;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Button_Invitation_C*               UMG_Button_Accept;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Button_Invitation_C*               UMG_Button_Reject;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle_TimeOut;                               // 0x0370(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_InvitationTip_Widget(int32 EntryPoint);
	void BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void AutoRejectInvitation();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void HandleTimeOutEvent();
	void HiddenTimeOutTip();
	void OnInvitationReceived(const class FString& SenderName_0);
	void RejectInvite();
	void AcceptInvite();
	void OnInputDeviceSwitch(EInputDevice CurrentDevice);
	void SetSenderName(class FString& InNameStr);
	void OnPlayerStatusUpdate(EPBPlayerStatus NewPlayerStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_InvitationTip_Widget_C">();
	}
	static class UUMG_InvitationTip_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_InvitationTip_Widget_C>();
	}
};
static_assert(alignof(UUMG_InvitationTip_Widget_C) == 0x000008, "Wrong alignment on UUMG_InvitationTip_Widget_C");
static_assert(sizeof(UUMG_InvitationTip_Widget_C) == 0x000378, "Wrong size on UUMG_InvitationTip_Widget_C");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, UberGraphFrame) == 0x000328, "Member 'UUMG_InvitationTip_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, InvitationTip) == 0x000330, "Member 'UUMG_InvitationTip_Widget_C::InvitationTip' has a wrong offset!");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, PBInputTipsImage_Accept) == 0x000338, "Member 'UUMG_InvitationTip_Widget_C::PBInputTipsImage_Accept' has a wrong offset!");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, PBInputTipsImage_Reject) == 0x000340, "Member 'UUMG_InvitationTip_Widget_C::PBInputTipsImage_Reject' has a wrong offset!");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, ProgressBar_InvitationDuration) == 0x000348, "Member 'UUMG_InvitationTip_Widget_C::ProgressBar_InvitationDuration' has a wrong offset!");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, SenderName) == 0x000350, "Member 'UUMG_InvitationTip_Widget_C::SenderName' has a wrong offset!");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, TimeOutTip) == 0x000358, "Member 'UUMG_InvitationTip_Widget_C::TimeOutTip' has a wrong offset!");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, UMG_Button_Accept) == 0x000360, "Member 'UUMG_InvitationTip_Widget_C::UMG_Button_Accept' has a wrong offset!");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, UMG_Button_Reject) == 0x000368, "Member 'UUMG_InvitationTip_Widget_C::UMG_Button_Reject' has a wrong offset!");
static_assert(offsetof(UUMG_InvitationTip_Widget_C, TimerHandle_TimeOut) == 0x000370, "Member 'UUMG_InvitationTip_Widget_C::TimerHandle_TimeOut' has a wrong offset!");

}

