#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InvitationTip_Widget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.ExecuteUbergraph_UMG_InvitationTip_Widget
// 0x00C8 (0x00C8 - 0x0000)
struct UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EInputDevice CurrentDevice)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPBPlayerStatus NewPlayerStatus)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UPBLocalPlayer*                         K2Node_DynamicCast_AsPBLocal_Player;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget");
static_assert(sizeof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget) == 0x0000C8, "Wrong size on UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, EntryPoint) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_Event_MyGeometry) == 0x000004, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000040, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000044, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000050, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x000068, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_ComponentBoundEvent_Button_5) == 0x000070, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_ComponentBoundEvent_Button_4) == 0x000078, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000080, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_DynamicCast_AsPBLocal_Player) == 0x000098, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_DynamicCast_AsPBLocal_Player' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_ComponentBoundEvent_Button_3) == 0x0000A8, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_ComponentBoundEvent_Button_2) == 0x0000B0, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_ComponentBoundEvent_Button_1) == 0x0000B8, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget, K2Node_ComponentBoundEvent_Button) == 0x0000C0, "Member 'UMG_InvitationTip_Widget_C_ExecuteUbergraph_UMG_InvitationTip_Widget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_BndEvt__UMG_InvitationTip_Widget_UMG_Button_Reject_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_InvitationTip_Widget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_Tick) == 0x000004, "Wrong alignment on UMG_InvitationTip_Widget_C_Tick");
static_assert(sizeof(UMG_InvitationTip_Widget_C_Tick) == 0x00003C, "Wrong size on UMG_InvitationTip_Widget_C_Tick");
static_assert(offsetof(UMG_InvitationTip_Widget_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_InvitationTip_Widget_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.HandleTimeOutEvent
// 0x0018 (0x0018 - 0x0000)
struct UMG_InvitationTip_Widget_C_HandleTimeOutEvent final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_HandleTimeOutEvent) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_HandleTimeOutEvent");
static_assert(sizeof(UMG_InvitationTip_Widget_C_HandleTimeOutEvent) == 0x000018, "Wrong size on UMG_InvitationTip_Widget_C_HandleTimeOutEvent");
static_assert(offsetof(UMG_InvitationTip_Widget_C_HandleTimeOutEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_HandleTimeOutEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_HandleTimeOutEvent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'UMG_InvitationTip_Widget_C_HandleTimeOutEvent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.OnInvitationReceived
// 0x0030 (0x0030 - 0x0000)
struct UMG_InvitationTip_Widget_C_OnInvitationReceived final
{
public:
	class FString                                 SenderName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_OnInvitationReceived) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_OnInvitationReceived");
static_assert(sizeof(UMG_InvitationTip_Widget_C_OnInvitationReceived) == 0x000030, "Wrong size on UMG_InvitationTip_Widget_C_OnInvitationReceived");
static_assert(offsetof(UMG_InvitationTip_Widget_C_OnInvitationReceived, SenderName_0) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_OnInvitationReceived::SenderName_0' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_OnInvitationReceived, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000010, "Member 'UMG_InvitationTip_Widget_C_OnInvitationReceived::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_OnInvitationReceived, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'UMG_InvitationTip_Widget_C_OnInvitationReceived::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_OnInvitationReceived, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'UMG_InvitationTip_Widget_C_OnInvitationReceived::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.OnInputDeviceSwitch
// 0x0002 (0x0002 - 0x0000)
struct UMG_InvitationTip_Widget_C_OnInputDeviceSwitch final
{
public:
	EInputDevice                                  CurrentDevice;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_OnInputDeviceSwitch) == 0x000001, "Wrong alignment on UMG_InvitationTip_Widget_C_OnInputDeviceSwitch");
static_assert(sizeof(UMG_InvitationTip_Widget_C_OnInputDeviceSwitch) == 0x000002, "Wrong size on UMG_InvitationTip_Widget_C_OnInputDeviceSwitch");
static_assert(offsetof(UMG_InvitationTip_Widget_C_OnInputDeviceSwitch, CurrentDevice) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_OnInputDeviceSwitch::CurrentDevice' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_OnInputDeviceSwitch, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UMG_InvitationTip_Widget_C_OnInputDeviceSwitch::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.SetSenderName
// 0x0070 (0x0070 - 0x0000)
struct UMG_InvitationTip_Widget_C_SetSenderName final
{
public:
	class FString                                 InNameStr;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0050(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_SetSenderName) == 0x000008, "Wrong alignment on UMG_InvitationTip_Widget_C_SetSenderName");
static_assert(sizeof(UMG_InvitationTip_Widget_C_SetSenderName) == 0x000070, "Wrong size on UMG_InvitationTip_Widget_C_SetSenderName");
static_assert(offsetof(UMG_InvitationTip_Widget_C_SetSenderName, InNameStr) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_SetSenderName::InNameStr' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_SetSenderName, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'UMG_InvitationTip_Widget_C_SetSenderName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_SetSenderName, CallFunc_GetSubstring_ReturnValue) == 0x000028, "Member 'UMG_InvitationTip_Widget_C_SetSenderName::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_SetSenderName, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'UMG_InvitationTip_Widget_C_SetSenderName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_SetSenderName, CallFunc_Len_ReturnValue) == 0x000048, "Member 'UMG_InvitationTip_Widget_C_SetSenderName::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_SetSenderName, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000050, "Member 'UMG_InvitationTip_Widget_C_SetSenderName::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_SetSenderName, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'UMG_InvitationTip_Widget_C_SetSenderName::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_InvitationTip_Widget.UMG_InvitationTip_Widget_C.OnPlayerStatusUpdate
// 0x0002 (0x0002 - 0x0000)
struct UMG_InvitationTip_Widget_C_OnPlayerStatusUpdate final
{
public:
	EPBPlayerStatus                               NewPlayerStatus;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InvitationTip_Widget_C_OnPlayerStatusUpdate) == 0x000001, "Wrong alignment on UMG_InvitationTip_Widget_C_OnPlayerStatusUpdate");
static_assert(sizeof(UMG_InvitationTip_Widget_C_OnPlayerStatusUpdate) == 0x000002, "Wrong size on UMG_InvitationTip_Widget_C_OnPlayerStatusUpdate");
static_assert(offsetof(UMG_InvitationTip_Widget_C_OnPlayerStatusUpdate, NewPlayerStatus) == 0x000000, "Member 'UMG_InvitationTip_Widget_C_OnPlayerStatusUpdate::NewPlayerStatus' has a wrong offset!");
static_assert(offsetof(UMG_InvitationTip_Widget_C_OnPlayerStatusUpdate, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'UMG_InvitationTip_Widget_C_OnPlayerStatusUpdate::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

