#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_WaterMark

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UMG_WaterMark.UMG_WaterMark_C.ExecuteUbergraph_UMG_WaterMark
// 0x00D0 (0x00D0 - 0x0000)
struct UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0070(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBLocalPlayer*                         K2Node_DynamicCast_AsPBLocal_Player;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformIDStr_ReturnValue;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark) == 0x000008, "Wrong alignment on UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark");
static_assert(sizeof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark) == 0x0000D0, "Wrong size on UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, EntryPoint) == 0x000000, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, Temp_int_Variable) == 0x000030, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, Temp_int_Variable_1) == 0x000034, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_GetChildrenCount_ReturnValue) == 0x000040, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_Percent_IntInt_ReturnValue) == 0x000060, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_Abs_Int_ReturnValue) == 0x000064, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000070, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_PlayAnimation_ReturnValue_1) == 0x000090, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000098, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000A0, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, K2Node_DynamicCast_AsPBLocal_Player) == 0x0000A8, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::K2Node_DynamicCast_AsPBLocal_Player' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_GetPlatformIDStr_ReturnValue) == 0x0000B8, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_GetPlatformIDStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, CallFunc_IsEmpty_ReturnValue) == 0x0000C8, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark, K2Node_Event_IsDesignTime) == 0x0000C9, "Member 'UMG_WaterMark_C_ExecuteUbergraph_UMG_WaterMark::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_WaterMark.UMG_WaterMark_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_WaterMark_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_WaterMark_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_WaterMark_C_PreConstruct");
static_assert(sizeof(UMG_WaterMark_C_PreConstruct) == 0x000001, "Wrong size on UMG_WaterMark_C_PreConstruct");
static_assert(offsetof(UMG_WaterMark_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_WaterMark_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_WaterMark.UMG_WaterMark_C.HandlePlatformID
// 0x0058 (0x0058 - 0x0000)
struct UMG_WaterMark_C_HandlePlatformID final
{
public:
	class UPBLocalPlayer*                         LocalPlayer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformIDStr_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
};
static_assert(alignof(UMG_WaterMark_C_HandlePlatformID) == 0x000008, "Wrong alignment on UMG_WaterMark_C_HandlePlatformID");
static_assert(sizeof(UMG_WaterMark_C_HandlePlatformID) == 0x000058, "Wrong size on UMG_WaterMark_C_HandlePlatformID");
static_assert(offsetof(UMG_WaterMark_C_HandlePlatformID, LocalPlayer) == 0x000000, "Member 'UMG_WaterMark_C_HandlePlatformID::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_HandlePlatformID, CallFunc_GetPlatformIDStr_ReturnValue) == 0x000008, "Member 'UMG_WaterMark_C_HandlePlatformID::CallFunc_GetPlatformIDStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_HandlePlatformID, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UMG_WaterMark_C_HandlePlatformID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_HandlePlatformID, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'UMG_WaterMark_C_HandlePlatformID::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_HandlePlatformID, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'UMG_WaterMark_C_HandlePlatformID::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_HandlePlatformID, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'UMG_WaterMark_C_HandlePlatformID::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UMG_WaterMark.UMG_WaterMark_C.HandldeDefaultUID
// 0x0030 (0x0030 - 0x0000)
struct UMG_WaterMark_C_HandldeDefaultUID final
{
public:
	class UPBLocalPlayer*                         self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDefaultIDStr_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(UMG_WaterMark_C_HandldeDefaultUID) == 0x000008, "Wrong alignment on UMG_WaterMark_C_HandldeDefaultUID");
static_assert(sizeof(UMG_WaterMark_C_HandldeDefaultUID) == 0x000030, "Wrong size on UMG_WaterMark_C_HandldeDefaultUID");
static_assert(offsetof(UMG_WaterMark_C_HandldeDefaultUID, self2) == 0x000000, "Member 'UMG_WaterMark_C_HandldeDefaultUID::self2' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_HandldeDefaultUID, CallFunc_GetDefaultIDStr_ReturnValue) == 0x000008, "Member 'UMG_WaterMark_C_HandldeDefaultUID::CallFunc_GetDefaultIDStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_HandldeDefaultUID, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'UMG_WaterMark_C_HandldeDefaultUID::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UMG_WaterMark.UMG_WaterMark_C.HandleGameVersion
// 0x0018 (0x0018 - 0x0000)
struct UMG_WaterMark_C_HandleGameVersion final
{
public:
	class FText                                   CallFunc_GetCurrentChangelist_ReturnValue;         // 0x0000(0x0018)()
};
static_assert(alignof(UMG_WaterMark_C_HandleGameVersion) == 0x000008, "Wrong alignment on UMG_WaterMark_C_HandleGameVersion");
static_assert(sizeof(UMG_WaterMark_C_HandleGameVersion) == 0x000018, "Wrong size on UMG_WaterMark_C_HandleGameVersion");
static_assert(offsetof(UMG_WaterMark_C_HandleGameVersion, CallFunc_GetCurrentChangelist_ReturnValue) == 0x000000, "Member 'UMG_WaterMark_C_HandleGameVersion::CallFunc_GetCurrentChangelist_ReturnValue' has a wrong offset!");

// Function UMG_WaterMark.UMG_WaterMark_C.InitMark
// 0x0110 (0x0110 - 0x0000)
struct UMG_WaterMark_C_InitMark final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_WaterMarkGroup_C*                  CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCurrentChangelist_ReturnValue;         // 0x0028(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformIDStr_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDefaultIDStr_ReturnValue;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBLocalPlayer*                         K2Node_DynamicCast_AsPBLocal_Player;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_WaterMark_C_InitMark) == 0x000008, "Wrong alignment on UMG_WaterMark_C_InitMark");
static_assert(sizeof(UMG_WaterMark_C_InitMark) == 0x000110, "Wrong size on UMG_WaterMark_C_InitMark");
static_assert(offsetof(UMG_WaterMark_C_InitMark, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'UMG_WaterMark_C_InitMark::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_InitMark, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'UMG_WaterMark_C_InitMark::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_WaterMark_C_InitMark, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_WaterMark_C_InitMark::Temp_int_Array_Index_Variable' has a wrong offset!");
