#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PartyLeaderInMatchmaking

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.ExecuteUbergraph_UMG_PartyLeaderInMatchmaking
// 0x0018 (0x0018 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMatchmakingManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking) == 0x000018, "Wrong size on UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking, EntryPoint) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'UMG_PartyLeaderInMatchmaking_C_ExecuteUbergraph_UMG_PartyLeaderInMatchmaking::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.BndEvt__UMG_CancelMatchMaking_UMG_Button_MatchMaking_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_BndEvt__UMG_CancelMatchMaking_UMG_Button_MatchMaking_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_BndEvt__UMG_CancelMatchMaking_UMG_Button_MatchMaking_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_BndEvt__UMG_CancelMatchMaking_UMG_Button_MatchMaking_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_BndEvt__UMG_CancelMatchMaking_UMG_Button_MatchMaking_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_PartyLeaderInMatchmaking_C_BndEvt__UMG_CancelMatchMaking_UMG_Button_MatchMaking_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_BndEvt__UMG_CancelMatchMaking_UMG_Button_MatchMaking_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_BndEvt__UMG_CancelMatchMaking_UMG_Button_MatchMaking_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.UpdateTime
// 0x00C0 (0x00C0 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_UpdateTime final
{
public:
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_UpdateTime) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_UpdateTime");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_UpdateTime) == 0x0000C0, "Wrong size on UMG_PartyLeaderInMatchmaking_C_UpdateTime");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Less_IntInt_ReturnValue) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Less_IntInt_ReturnValue_1) == 0x000030, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Percent_IntInt_ReturnValue) == 0x000060, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000068, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000088, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A0, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Divide_IntInt_ReturnValue) == 0x0000B8, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_UpdateTime, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'UMG_PartyLeaderInMatchmaking_C_UpdateTime::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.StartTimer
// 0x0018 (0x0018 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_StartTimer final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_StartTimer) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_StartTimer");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_StartTimer) == 0x000018, "Wrong size on UMG_PartyLeaderInMatchmaking_C_StartTimer");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_StartTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_StartTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_StartTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'UMG_PartyLeaderInMatchmaking_C_StartTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.ConnectMatchServer
// 0x0010 (0x0010 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_ConnectMatchServer final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_ConnectMatchServer) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_ConnectMatchServer");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_ConnectMatchServer) == 0x000010, "Wrong size on UMG_PartyLeaderInMatchmaking_C_ConnectMatchServer");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_ConnectMatchServer, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_ConnectMatchServer::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_ConnectMatchServer, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_PartyLeaderInMatchmaking_C_ConnectMatchServer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.Start Match Searching
// 0x0010 (0x0010 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_Start_Match_Searching final
{
public:
	bool                                          IsPartyLeader;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_Start_Match_Searching) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_Start_Match_Searching");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_Start_Match_Searching) == 0x000010, "Wrong size on UMG_PartyLeaderInMatchmaking_C_Start_Match_Searching");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Match_Searching, IsPartyLeader) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Match_Searching::IsPartyLeader' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Match_Searching, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Match_Searching::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.MatchCompleted
// 0x0030 (0x0030 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_MatchCompleted final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_MatchCompleted) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_MatchCompleted");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_MatchCompleted) == 0x000030, "Wrong size on UMG_PartyLeaderInMatchmaking_C_MatchCompleted");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_MatchCompleted, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_MatchCompleted::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_MatchCompleted, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UMG_PartyLeaderInMatchmaking_C_MatchCompleted::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_MatchCompleted, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'UMG_PartyLeaderInMatchmaking_C_MatchCompleted::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_MatchCompleted, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000028, "Member 'UMG_PartyLeaderInMatchmaking_C_MatchCompleted::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.Start Waiting Players
// 0x01F8 (0x01F8 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players final
{
public:
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBLobbyInfo                           CallFunc_GetLobbyInfo_ReturnValue;                 // 0x0008(0x0078)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0098(0x0018)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBGameModeDefinitionRow               CallFunc_GetDataTableRowFromName_OutRow;           // 0x00B8(0x0110)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x01D0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players) == 0x0001F8, "Wrong size on UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, CallFunc_GetLobbyInfo_ReturnValue) == 0x000008, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::CallFunc_GetLobbyInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, CallFunc_Conv_IntToText_ReturnValue) == 0x000098, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B0, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000B8, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001C8, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0001D0, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players, K2Node_CreateDelegate_OutputDelegate) == 0x0001E8, "Member 'UMG_PartyLeaderInMatchmaking_C_Start_Waiting_Players::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.CancelSearching
// 0x0008 (0x0008 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_CancelSearching final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_CancelSearching) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_CancelSearching");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_CancelSearching) == 0x000008, "Wrong size on UMG_PartyLeaderInMatchmaking_C_CancelSearching");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_CancelSearching, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_CancelSearching::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.OnLobbyPlayersUpdated
// 0x00A0 (0x00A0 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated final
{
public:
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBLobbyInfo                           CallFunc_GetLobbyInfo_ReturnValue;                 // 0x0008(0x0078)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0088(0x0018)()
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated) == 0x0000A0, "Wrong size on UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated, CallFunc_GetLobbyInfo_ReturnValue) == 0x000008, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated::CallFunc_GetLobbyInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated, CallFunc_Conv_IntToText_ReturnValue) == 0x000088, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyPlayersUpdated::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.OnLobbyStarted
// 0x0038 (0x0038 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLobbyTimeRemainingText_ReturnValue;    // 0x0018(0x0018)()
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted) == 0x000038, "Wrong size on UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted, CallFunc_GetLobbyTimeRemainingText_ReturnValue) == 0x000018, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted::CallFunc_GetLobbyTimeRemainingText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyStarted::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");

// Function UMG_PartyLeaderInMatchmaking.UMG_PartyLeaderInMatchmaking_C.OnLobbyTimeUpdated
// 0x0020 (0x0020 - 0x0000)
struct UMG_PartyLeaderInMatchmaking_C_OnLobbyTimeUpdated final
{
public:
	class UPBLobbyManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLobbyTimeRemainingText_ReturnValue;    // 0x0008(0x0018)()
};
static_assert(alignof(UMG_PartyLeaderInMatchmaking_C_OnLobbyTimeUpdated) == 0x000008, "Wrong alignment on UMG_PartyLeaderInMatchmaking_C_OnLobbyTimeUpdated");
static_assert(sizeof(UMG_PartyLeaderInMatchmaking_C_OnLobbyTimeUpdated) == 0x000020, "Wrong size on UMG_PartyLeaderInMatchmaking_C_OnLobbyTimeUpdated");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyTimeUpdated, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyTimeUpdated::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyLeaderInMatchmaking_C_OnLobbyTimeUpdated, CallFunc_GetLobbyTimeRemainingText_ReturnValue) == 0x000008, "Member 'UMG_PartyLeaderInMatchmaking_C_OnLobbyTimeUpdated::CallFunc_GetLobbyTimeRemainingText_ReturnValue' has a wrong offset!");

}

