#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_Progress_MG_Deploy

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy
// 0x01D8 (0x01D8 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* K2Node_CustomEvent_ProxyObject_3;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualEvent_3;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGESAsyncAction_ListenForGameplayEvent* ProxyObject, const struct FGameplayTag& ActualEvent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FPBGameplayEventParam_WeaponMounted    Temp_struct_Variable;                              // 0x0030(0x0008)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGESEventManager*                       CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBGameplayEventParam_WeaponMounted    Temp_struct_Variable_2;                            // 0x0050(0x0008)(NoDestructor)
	class UGESAsyncAction_ListenForGameplayEvent* K2Node_CustomEvent_ProxyObject_2;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualEvent_2;                  // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGESAsyncAction_ListenForGameplayEvent* ProxyObject, const struct FGameplayTag& ActualEvent)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FPBGameplayEventParam_WeaponMounted    Temp_struct_Variable_3;                            // 0x0078(0x0008)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* Temp_object_Variable_1;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGESEventManager*                       CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBGameplayEventParam_WeaponMounted    Temp_struct_Variable_5;                            // 0x00A0(0x0008)(NoDestructor)
	class UGESAsyncAction_ListenForGameplayEvent* K2Node_CustomEvent_ProxyObject_1;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualEvent_1;                  // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGESAsyncAction_ListenForGameplayEvent* ProxyObject, const struct FGameplayTag& ActualEvent)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FPBGameplayEventParam_WeaponMounted    Temp_struct_Variable_6;                            // 0x00C8(0x0008)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_7;                            // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* Temp_object_Variable_2;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGESEventManager*                       CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGESAsyncAction_ListenForGameplayEvent* CallFunc_ListenForGameplayEvent_ReturnValue;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBGameplayEventParam_WeaponMounted    Temp_struct_Variable_8;                            // 0x0100(0x0008)(NoDestructor)
	class UGESAsyncAction_ListenForGameplayEvent* K2Node_CustomEvent_ProxyObject;                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualEvent;                    // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGESAsyncAction_ListenForGameplayEvent* ProxyObject, const struct FGameplayTag& ActualEvent)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	struct FPBGameplayEventParam_WeaponMounted    Temp_struct_Variable_9;                            // 0x0128(0x0008)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_10;                           // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* Temp_object_Variable_3;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_2;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0144(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBGameplayEventParam_WeaponMounted    Temp_struct_Variable_11;                           // 0x0180(0x0008)(NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPayload_ReturnValue_3;                 // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGESEventManager*                       CallFunc_GetWorldSubsystem_ReturnValue_3;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_2;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* CallFunc_ListenForGameplayEvent_ReturnValue_1;     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* CallFunc_ListenForGameplayEvent_ReturnValue_2;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_3;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGESAsyncAction_ListenForGameplayEvent* CallFunc_ListenForGameplayEvent_ReturnValue_3;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy) == 0x0001D8, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, EntryPoint) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CustomEvent_ProxyObject_3) == 0x000010, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CustomEvent_ProxyObject_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CustomEvent_ActualEvent_3) == 0x000018, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CustomEvent_ActualEvent_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable) == 0x000030, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_1) == 0x000038, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_object_Variable) == 0x000040, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000048, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_2) == 0x000050, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CustomEvent_ProxyObject_2) == 0x000058, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CustomEvent_ProxyObject_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CustomEvent_ActualEvent_2) == 0x000060, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CustomEvent_ActualEvent_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_3) == 0x000078, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_4) == 0x000080, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_object_Variable_1) == 0x000088, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000090, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetPayload_ReturnValue) == 0x000098, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_5) == 0x0000A0, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CustomEvent_ProxyObject_1) == 0x0000A8, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CustomEvent_ActualEvent_1) == 0x0000B0, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CustomEvent_ActualEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B8, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_6) == 0x0000C8, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_7) == 0x0000D0, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_object_Variable_2) == 0x0000D8, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x0000E0, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetPayload_ReturnValue_1) == 0x0000E8, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_ListenForGameplayEvent_ReturnValue) == 0x0000F0, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_ListenForGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_8) == 0x000100, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CustomEvent_ProxyObject) == 0x000108, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CustomEvent_ActualEvent) == 0x000110, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CustomEvent_ActualEvent' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_9) == 0x000128, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_10) == 0x000130, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_object_Variable_3) == 0x000138, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetPayload_ReturnValue_2) == 0x000140, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetPayload_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_Event_MyGeometry) == 0x000144, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_Event_InDeltaTime) == 0x00017C, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, Temp_struct_Variable_11) == 0x000180, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, K2Node_SwitchName_CmpSuccess) == 0x000188, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetPayload_ReturnValue_3) == 0x000189, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetPayload_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetWorldSubsystem_ReturnValue_3) == 0x000190, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetWorldSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetOwningPlayerPawn_ReturnValue_1) == 0x000198, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetOwningPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetOwningPlayerPawn_ReturnValue_2) == 0x0001A0, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetOwningPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_ListenForGameplayEvent_ReturnValue_1) == 0x0001A8, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_ListenForGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_ListenForGameplayEvent_ReturnValue_2) == 0x0001B0, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_ListenForGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_IsValid_ReturnValue_1) == 0x0001B8, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_IsValid_ReturnValue_2) == 0x0001B9, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_GetOwningPlayerPawn_ReturnValue_3) == 0x0001C0, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_GetOwningPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_ListenForGameplayEvent_ReturnValue_3) == 0x0001C8, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_ListenForGameplayEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy, CallFunc_IsValid_ReturnValue_3) == 0x0001D0, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_ExecuteUbergraph_UMG_InGameHUD_Progress_MG_Deploy::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_Tick) == 0x000004, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_Tick");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_Tick) == 0x00003C, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_Tick");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF final
{
public:
	class UGESAsyncAction_ListenForGameplayEvent* ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualEvent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF) == 0x000010, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF, ProxyObject) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF::ProxyObject' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF, ActualEvent) == 0x000008, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_D02D02CF409F3C9CBCCE3BBBB9D9AAFF::ActualEvent' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F final
{
public:
	class UGESAsyncAction_ListenForGameplayEvent* ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualEvent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F) == 0x000010, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F, ProxyObject) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F::ProxyObject' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F, ActualEvent) == 0x000008, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_ABAC8C8044D1071C3FF3ADB45ECDFA7F::ActualEvent' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0 final
{
public:
	class UGESAsyncAction_ListenForGameplayEvent* ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualEvent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0) == 0x000010, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0, ProxyObject) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0::ProxyObject' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0, ActualEvent) == 0x000008, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_C0EDEFB647F87E789D8FE58945F5FFE0::ActualEvent' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5 final
{
public:
	class UGESAsyncAction_ListenForGameplayEvent* ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualEvent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5) == 0x000010, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5, ProxyObject) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5::ProxyObject' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5, ActualEvent) == 0x000008, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_OnMessageReceived_65D826AE4DE463375AFC8D9FC8ECE4C5::ActualEvent' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.SetupDeploying
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_SetupDeploying final
{
public:
	struct FPBGameplayEventParam_WeaponMounted    EventParm_WeaponMounted;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_SetupDeploying) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_SetupDeploying");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_SetupDeploying) == 0x000008, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_SetupDeploying");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_SetupDeploying, EventParm_WeaponMounted) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_SetupDeploying::EventParm_WeaponMounted' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.SetupUndeploying
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_SetupUndeploying final
{
public:
	struct FPBGameplayEventParam_WeaponMounted    EventParm_WeaponMounted;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_SetupUndeploying) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_SetupUndeploying");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_SetupUndeploying) == 0x000008, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_SetupUndeploying");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_SetupUndeploying, EventParm_WeaponMounted) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_SetupUndeploying::EventParm_WeaponMounted' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.HideTips
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_HideTips final
{
public:
	struct FPBGameplayEventParam_WeaponMounted    EventParm_WeaponMounted;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_HideTips) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_HideTips");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_HideTips) == 0x000008, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_HideTips");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_HideTips, EventParm_WeaponMounted) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_HideTips::EventParm_WeaponMounted' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.UpdateDeploying
// 0x0020 (0x0020 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWeaponMountedOperationPercentage_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying) == 0x000020, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying, InDeltaTime) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying::InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying, K2Node_DynamicCast_AsPBCharacter) == 0x000010, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying::K2Node_DynamicCast_AsPBCharacter' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying, CallFunc_GetWeaponMountedOperationPercentage_ReturnValue) == 0x00001C, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_UpdateDeploying::CallFunc_GetWeaponMountedOperationPercentage_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_Progress_MG_Deploy.UMG_InGameHUD_Progress_MG_Deploy_C.UpdateUndeploying
// 0x0028 (0x0028 - 0x0000)
struct UMG_InGameHUD_Progress_MG_Deploy_C_UpdateUndeploying final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWeaponMountedOperationPercentage_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateUndeploying) == 0x000008, "Wrong alignment on UMG_InGameHUD_Progress_MG_Deploy_C_UpdateUndeploying");
static_assert(sizeof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateUndeploying) == 0x000028, "Wrong size on UMG_InGameHUD_Progress_MG_Deploy_C_UpdateUndeploying");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateUndeploying, InDeltaTime) == 0x000000, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_UpdateUndeploying::InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_Progress_MG_Deploy_C_UpdateUndeploying, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_Progress_MG_Deploy_C_UpdateUndeploying::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
