#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_GameWarning

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_GameWarning.UMG_GameWarning_C
// 0x0018 (0x0350 - 0x0338)
class UUMG_GameWarning_C final : public UPBGameWarningWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Zoom;                                              // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          ZoomIn;                                            // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_GameWarning(int32 EntryPoint);
	void CustomEvent_2();
	void CustomEvent_1();
	void CustomEvent_0();
	void Construct();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_GameWarning_C">();
	}
	static class UUMG_GameWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_GameWarning_C>();
	}
};
static_assert(alignof(UUMG_GameWarning_C) == 0x000008, "Wrong alignment on UUMG_GameWarning_C");
static_assert(sizeof(UUMG_GameWarning_C) == 0x000350, "Wrong size on UUMG_GameWarning_C");
static_assert(offsetof(UUMG_GameWarning_C, UberGraphFrame) == 0x000338, "Member 'UUMG_GameWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_GameWarning_C, Zoom) == 0x000340, "Member 'UUMG_GameWarning_C::Zoom' has a wrong offset!");
static_assert(offsetof(UUMG_GameWarning_C, ZoomIn) == 0x000348, "Member 'UUMG_GameWarning_C::ZoomIn' has a wrong offset!");

}

