#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Tab_Social

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_Tab_Social.UMG_Tab_Social_C.ExecuteUbergraph_UMG_Tab_Social
// 0x0004 (0x0004 - 0x0000)
struct UMG_Tab_Social_C_ExecuteUbergraph_UMG_Tab_Social final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Tab_Social_C_ExecuteUbergraph_UMG_Tab_Social) == 0x000004, "Wrong alignment on UMG_Tab_Social_C_ExecuteUbergraph_UMG_Tab_Social");
static_assert(sizeof(UMG_Tab_Social_C_ExecuteUbergraph_UMG_Tab_Social) == 0x000004, "Wrong size on UMG_Tab_Social_C_ExecuteUbergraph_UMG_Tab_Social");
static_assert(offsetof(UMG_Tab_Social_C_ExecuteUbergraph_UMG_Tab_Social, EntryPoint) == 0x000000, "Member 'UMG_Tab_Social_C_ExecuteUbergraph_UMG_Tab_Social::EntryPoint' has a wrong offset!");

// Function UMG_Tab_Social.UMG_Tab_Social_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UMG_Tab_Social_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UMG_Tab_Social_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UMG_Tab_Social_C_OnMouseButtonDown");
static_assert(sizeof(UMG_Tab_Social_C_OnMouseButtonDown) == 0x000218, "Wrong size on UMG_Tab_Social_C_OnMouseButtonDown");
static_assert(offsetof(UMG_Tab_Social_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UMG_Tab_Social_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Tab_Social_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UMG_Tab_Social_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UMG_Tab_Social_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UMG_Tab_Social_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Tab_Social_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UMG_Tab_Social_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

}

