#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_FieldModQuotaItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_FieldModQuotaItem.UMG_FieldModQuotaItem_C.ExecuteUbergraph_UMG_FieldModQuotaItem
// 0x0004 (0x0004 - 0x0000)
struct UMG_FieldModQuotaItem_C_ExecuteUbergraph_UMG_FieldModQuotaItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FieldModQuotaItem_C_ExecuteUbergraph_UMG_FieldModQuotaItem) == 0x000004, "Wrong alignment on UMG_FieldModQuotaItem_C_ExecuteUbergraph_UMG_FieldModQuotaItem");
static_assert(sizeof(UMG_FieldModQuotaItem_C_ExecuteUbergraph_UMG_FieldModQuotaItem) == 0x000004, "Wrong size on UMG_FieldModQuotaItem_C_ExecuteUbergraph_UMG_FieldModQuotaItem");
static_assert(offsetof(UMG_FieldModQuotaItem_C_ExecuteUbergraph_UMG_FieldModQuotaItem, EntryPoint) == 0x000000, "Member 'UMG_FieldModQuotaItem_C_ExecuteUbergraph_UMG_FieldModQuotaItem::EntryPoint' has a wrong offset!");

// Function UMG_FieldModQuotaItem.UMG_FieldModQuotaItem_C.SetQuotaIncrease
// 0x0008 (0x0008 - 0x0000)
struct UMG_FieldModQuotaItem_C_SetQuotaIncrease final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FieldModQuotaItem_C_SetQuotaIncrease) == 0x000008, "Wrong alignment on UMG_FieldModQuotaItem_C_SetQuotaIncrease");
static_assert(sizeof(UMG_FieldModQuotaItem_C_SetQuotaIncrease) == 0x000008, "Wrong size on UMG_FieldModQuotaItem_C_SetQuotaIncrease");
static_assert(offsetof(UMG_FieldModQuotaItem_C_SetQuotaIncrease, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_FieldModQuotaItem_C_SetQuotaIncrease::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_FieldModQuotaItem.UMG_FieldModQuotaItem_C.SetQuotaDecrease
// 0x0008 (0x0008 - 0x0000)
struct UMG_FieldModQuotaItem_C_SetQuotaDecrease final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FieldModQuotaItem_C_SetQuotaDecrease) == 0x000008, "Wrong alignment on UMG_FieldModQuotaItem_C_SetQuotaDecrease");
static_assert(sizeof(UMG_FieldModQuotaItem_C_SetQuotaDecrease) == 0x000008, "Wrong size on UMG_FieldModQuotaItem_C_SetQuotaDecrease");
static_assert(offsetof(UMG_FieldModQuotaItem_C_SetQuotaDecrease, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_FieldModQuotaItem_C_SetQuotaDecrease::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_FieldModQuotaItem.UMG_FieldModQuotaItem_C.SetQuotaLack
// 0x0008 (0x0008 - 0x0000)
struct UMG_FieldModQuotaItem_C_SetQuotaLack final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_FieldModQuotaItem_C_SetQuotaLack) == 0x000008, "Wrong alignment on UMG_FieldModQuotaItem_C_SetQuotaLack");
static_assert(sizeof(UMG_FieldModQuotaItem_C_SetQuotaLack) == 0x000008, "Wrong size on UMG_FieldModQuotaItem_C_SetQuotaLack");
static_assert(offsetof(UMG_FieldModQuotaItem_C_SetQuotaLack, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_FieldModQuotaItem_C_SetQuotaLack::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_FieldModQuotaItem.UMG_FieldModQuotaItem_C.DisplayQuotaTag
// 0x0088 (0x0088 - 0x0000)
struct UMG_FieldModQuotaItem_C_DisplayQuotaTag final
{
public:
	class FText                                   UpcomingQuota;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   MaxQuota;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsNew;                                             // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsLackOfQuota;                                     // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0060(0x0028)()
};
static_assert(alignof(UMG_FieldModQuotaItem_C_DisplayQuotaTag) == 0x000008, "Wrong alignment on UMG_FieldModQuotaItem_C_DisplayQuotaTag");
static_assert(sizeof(UMG_FieldModQuotaItem_C_DisplayQuotaTag) == 0x000088, "Wrong size on UMG_FieldModQuotaItem_C_DisplayQuotaTag");
static_assert(offsetof(UMG_FieldModQuotaItem_C_DisplayQuotaTag, UpcomingQuota) == 0x000000, "Member 'UMG_FieldModQuotaItem_C_DisplayQuotaTag::UpcomingQuota' has a wrong offset!");
static_assert(offsetof(UMG_FieldModQuotaItem_C_DisplayQuotaTag, MaxQuota) == 0x000018, "Member 'UMG_FieldModQuotaItem_C_DisplayQuotaTag::MaxQuota' has a wrong offset!");
static_assert(offsetof(UMG_FieldModQuotaItem_C_DisplayQuotaTag, IsNew) == 0x000030, "Member 'UMG_FieldModQuotaItem_C_DisplayQuotaTag::IsNew' has a wrong offset!");
static_assert(offsetof(UMG_FieldModQuotaItem_C_DisplayQuotaTag, IsLackOfQuota) == 0x000031, "Member 'UMG_FieldModQuotaItem_C_DisplayQuotaTag::IsLackOfQuota' has a wrong offset!");
static_assert(offsetof(UMG_FieldModQuotaItem_C_DisplayQuotaTag, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'UMG_FieldModQuotaItem_C_DisplayQuotaTag::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_FieldModQuotaItem_C_DisplayQuotaTag, K2Node_MakeStruct_SlateColor_1) == 0x000060, "Member 'UMG_FieldModQuotaItem_C_DisplayQuotaTag::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

