#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Widget_PlayerInfo

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Widget_PlayerInfo.UMG_Widget_PlayerInfo_C
// 0x0088 (0x02E8 - 0x0260)
class UUMG_Widget_PlayerInfo_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Avatar;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Main;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_73;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_303;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerState;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollText_C*                          ScrollName;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StateText;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PartyLeaderWidget_C*               UMG_PartyLeaderWidget;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFocused;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnfocused;                                       // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPBUserObject*                          UserObject;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Widget_PlayerInfo(int32 EntryPoint);
	void BndEvt__UMG_PlayerInfo_Widget_Button_Main_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_PlayerInfo_Widget_Button_Main_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void RefreshInfo(class UPBUserObject* InUserObject);
	void SetDefaultFocus();
	void SetAvatarImg(class UTexture2D* IconTexture);
	void ShowPartyLeaderIcon(bool IsShow);
	void RefreshDisplayInfo();
	void UMG_Widget_PlayerInfo_AutoGenFunc(class UPBUserObject* UserObject_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Widget_PlayerInfo_C">();
	}
	static class UUMG_Widget_PlayerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Widget_PlayerInfo_C>();
	}
};
static_assert(alignof(UUMG_Widget_PlayerInfo_C) == 0x000008, "Wrong alignment on UUMG_Widget_PlayerInfo_C");
static_assert(sizeof(UUMG_Widget_PlayerInfo_C) == 0x0002E8, "Wrong size on UUMG_Widget_PlayerInfo_C");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, UberGraphFrame) == 0x000260, "Member 'UUMG_Widget_PlayerInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, Avatar) == 0x000268, "Member 'UUMG_Widget_PlayerInfo_C::Avatar' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, Button_Main) == 0x000270, "Member 'UUMG_Widget_PlayerInfo_C::Button_Main' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, Image_73) == 0x000278, "Member 'UUMG_Widget_PlayerInfo_C::Image_73' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, Image_303) == 0x000280, "Member 'UUMG_Widget_PlayerInfo_C::Image_303' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, Image_BG) == 0x000288, "Member 'UUMG_Widget_PlayerInfo_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, PlayerState) == 0x000290, "Member 'UUMG_Widget_PlayerInfo_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, ScrollName) == 0x000298, "Member 'UUMG_Widget_PlayerInfo_C::ScrollName' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, StateText) == 0x0002A0, "Member 'UUMG_Widget_PlayerInfo_C::StateText' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, UMG_PartyLeaderWidget) == 0x0002A8, "Member 'UUMG_Widget_PlayerInfo_C::UMG_PartyLeaderWidget' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, OnFocused) == 0x0002B0, "Member 'UUMG_Widget_PlayerInfo_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, OnUnfocused) == 0x0002C0, "Member 'UUMG_Widget_PlayerInfo_C::OnUnfocused' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, OnClicked) == 0x0002D0, "Member 'UUMG_Widget_PlayerInfo_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_PlayerInfo_C, UserObject) == 0x0002E0, "Member 'UUMG_Widget_PlayerInfo_C::UserObject' has a wrong offset!");

}

