#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Indicator_MotionSensor

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Indicator_MotionSensor.UMG_Indicator_MotionSensor_C
// 0x0098 (0x03B0 - 0x0318)
class UUMG_Indicator_MotionSensor_C final : public UPBIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_Edge;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Line;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main_Indicator;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main_Normal;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main_Text;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Distance;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Edge_Arrow;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Edge_Icon;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line_SolidLine;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Normal;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TeamProgressBar;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Distance;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Metre;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APBMotionSensor*                        MotionSensor;                                      // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimeHandle_Twinkle;                                // 0x0398(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBright;                                         // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Motion_Sensor_Data_Scan_Duration;                  // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentRemainingTime;                              // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          hasScanned;                                        // 0x03AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_Indicator_MotionSensor(int32 EntryPoint);
	void Destruct();
	void Construct();
	void K2_UpdateCamp(EPBCamp NewCamp);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdatePosition();
	void UpdateStatus();
	void UpdateDistance();
	void UpdateInView();
	void OnHasScannedEnemy(bool InBool);
	void Twinkle();
	void UpdateProgress(float DetaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Indicator_MotionSensor_C">();
	}
	static class UUMG_Indicator_MotionSensor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Indicator_MotionSensor_C>();
	}
};
static_assert(alignof(UUMG_Indicator_MotionSensor_C) == 0x000008, "Wrong alignment on UUMG_Indicator_MotionSensor_C");
static_assert(sizeof(UUMG_Indicator_MotionSensor_C) == 0x0003B0, "Wrong size on UUMG_Indicator_MotionSensor_C");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, UberGraphFrame) == 0x000318, "Member 'UUMG_Indicator_MotionSensor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, CanvasPanel_Edge) == 0x000320, "Member 'UUMG_Indicator_MotionSensor_C::CanvasPanel_Edge' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, CanvasPanel_Line) == 0x000328, "Member 'UUMG_Indicator_MotionSensor_C::CanvasPanel_Line' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, CanvasPanel_Main) == 0x000330, "Member 'UUMG_Indicator_MotionSensor_C::CanvasPanel_Main' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, CanvasPanel_Main_Indicator) == 0x000338, "Member 'UUMG_Indicator_MotionSensor_C::CanvasPanel_Main_Indicator' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, CanvasPanel_Main_Normal) == 0x000340, "Member 'UUMG_Indicator_MotionSensor_C::CanvasPanel_Main_Normal' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, CanvasPanel_Main_Text) == 0x000348, "Member 'UUMG_Indicator_MotionSensor_C::CanvasPanel_Main_Text' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, HorizontalBox_Distance) == 0x000350, "Member 'UUMG_Indicator_MotionSensor_C::HorizontalBox_Distance' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, Image_Edge_Arrow) == 0x000358, "Member 'UUMG_Indicator_MotionSensor_C::Image_Edge_Arrow' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, Image_Edge_Icon) == 0x000360, "Member 'UUMG_Indicator_MotionSensor_C::Image_Edge_Icon' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, Image_Line_SolidLine) == 0x000368, "Member 'UUMG_Indicator_MotionSensor_C::Image_Line_SolidLine' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, Image_Normal) == 0x000370, "Member 'UUMG_Indicator_MotionSensor_C::Image_Normal' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, Image_TeamProgressBar) == 0x000378, "Member 'UUMG_Indicator_MotionSensor_C::Image_TeamProgressBar' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, TextBlock_Distance) == 0x000380, "Member 'UUMG_Indicator_MotionSensor_C::TextBlock_Distance' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, TextBlock_Metre) == 0x000388, "Member 'UUMG_Indicator_MotionSensor_C::TextBlock_Metre' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, MotionSensor) == 0x000390, "Member 'UUMG_Indicator_MotionSensor_C::MotionSensor' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, TimeHandle_Twinkle) == 0x000398, "Member 'UUMG_Indicator_MotionSensor_C::TimeHandle_Twinkle' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, bIsBright) == 0x0003A0, "Member 'UUMG_Indicator_MotionSensor_C::bIsBright' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, Motion_Sensor_Data_Scan_Duration) == 0x0003A4, "Member 'UUMG_Indicator_MotionSensor_C::Motion_Sensor_Data_Scan_Duration' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, CurrentRemainingTime) == 0x0003A8, "Member 'UUMG_Indicator_MotionSensor_C::CurrentRemainingTime' has a wrong offset!");
static_assert(offsetof(UUMG_Indicator_MotionSensor_C, hasScanned) == 0x0003AC, "Member 'UUMG_Indicator_MotionSensor_C::hasScanned' has a wrong offset!");

}

