#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PromptStreamerMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_PromptStreamerMode.UMG_PromptStreamerMode_C
// 0x0040 (0x0360 - 0x0320)
class UUMG_PromptStreamerMode_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UConfirmPageButton_C*                   ConfirmPageButtonNo;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfirmPageButton_C*                   ConfirmPageButtonYes;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Discription;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Option_0;                                          // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Option_2;                                          // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_PromptStreamerMode(int32 EntryPoint);
	void BndEvt__UMG_PromptStreamerMode_ConfirmPageButtonNo_K2Node_ComponentBoundEvent_1_OnButtonReleaseed__DelegateSignature();
	void BndEvt__UMG_PromptStreamerMode_ConfirmPageButtonYes_K2Node_ComponentBoundEvent_0_OnButtonReleaseed__DelegateSignature();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_PromptStreamerMode_C">();
	}
	static class UUMG_PromptStreamerMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_PromptStreamerMode_C>();
	}
};
static_assert(alignof(UUMG_PromptStreamerMode_C) == 0x000008, "Wrong alignment on UUMG_PromptStreamerMode_C");
static_assert(sizeof(UUMG_PromptStreamerMode_C) == 0x000360, "Wrong size on UUMG_PromptStreamerMode_C");
static_assert(offsetof(UUMG_PromptStreamerMode_C, UberGraphFrame) == 0x000320, "Member 'UUMG_PromptStreamerMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_PromptStreamerMode_C, Flash) == 0x000328, "Member 'UUMG_PromptStreamerMode_C::Flash' has a wrong offset!");
static_assert(offsetof(UUMG_PromptStreamerMode_C, ConfirmPageButtonNo) == 0x000330, "Member 'UUMG_PromptStreamerMode_C::ConfirmPageButtonNo' has a wrong offset!");
static_assert(offsetof(UUMG_PromptStreamerMode_C, ConfirmPageButtonYes) == 0x000338, "Member 'UUMG_PromptStreamerMode_C::ConfirmPageButtonYes' has a wrong offset!");
static_assert(offsetof(UUMG_PromptStreamerMode_C, Image_112) == 0x000340, "Member 'UUMG_PromptStreamerMode_C::Image_112' has a wrong offset!");
static_assert(offsetof(UUMG_PromptStreamerMode_C, Text_Discription) == 0x000348, "Member 'UUMG_PromptStreamerMode_C::Text_Discription' has a wrong offset!");
static_assert(offsetof(UUMG_PromptStreamerMode_C, Title) == 0x000350, "Member 'UUMG_PromptStreamerMode_C::Title' has a wrong offset!");
static_assert(offsetof(UUMG_PromptStreamerMode_C, Option_0) == 0x000358, "Member 'UUMG_PromptStreamerMode_C::Option_0' has a wrong offset!");
static_assert(offsetof(UUMG_PromptStreamerMode_C, Option_2) == 0x000359, "Member 'UUMG_PromptStreamerMode_C::Option_2' has a wrong offset!");

}

