#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CharacterItem

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CharacterItem.UMG_CharacterItem_C
// 0x0030 (0x0430 - 0x0400)
class UUMG_CharacterItem_C final : public UPBItemFieldModWidget_Character
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_63;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Art_ImageBox_5_C*              UMG_STD_Art_ImageBox_5;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_HotZone_C*                     UMG_STD_HotZone;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SelectCharacterList_C*             InChacterList;                                     // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCurrentSelect;                                    // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_CharacterItem(int32 EntryPoint);
	void BndEvt__UMG_CharacterItem_UMG_STD_HotZone_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature();
	void BndEvt__UMG_CharacterItem_UMG_STD_HotZone_K2Node_ComponentBoundEvent_1_OnHover_Default__DelegateSignature();
	void K2_OnSelectCharacter();
	void K2_OnRefreshItem();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CharacterItem_C">();
	}
	static class UUMG_CharacterItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CharacterItem_C>();
	}
};
static_assert(alignof(UUMG_CharacterItem_C) == 0x000008, "Wrong alignment on UUMG_CharacterItem_C");
static_assert(sizeof(UUMG_CharacterItem_C) == 0x000430, "Wrong size on UUMG_CharacterItem_C");
static_assert(offsetof(UUMG_CharacterItem_C, UberGraphFrame) == 0x000400, "Member 'UUMG_CharacterItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_CharacterItem_C, Image_63) == 0x000408, "Member 'UUMG_CharacterItem_C::Image_63' has a wrong offset!");
static_assert(offsetof(UUMG_CharacterItem_C, UMG_STD_Art_ImageBox_5) == 0x000410, "Member 'UUMG_CharacterItem_C::UMG_STD_Art_ImageBox_5' has a wrong offset!");
static_assert(offsetof(UUMG_CharacterItem_C, UMG_STD_HotZone) == 0x000418, "Member 'UUMG_CharacterItem_C::UMG_STD_HotZone' has a wrong offset!");
static_assert(offsetof(UUMG_CharacterItem_C, InChacterList) == 0x000420, "Member 'UUMG_CharacterItem_C::InChacterList' has a wrong offset!");
static_assert(offsetof(UUMG_CharacterItem_C, bCurrentSelect) == 0x000428, "Member 'UUMG_CharacterItem_C::bCurrentSelect' has a wrong offset!");

}

