#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Widget_MainTitle

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Widget_MainTitle.UMG_Widget_MainTitle_C
// 0x0040 (0x02A0 - 0x0260)
class UUMG_Widget_MainTitle_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             FrameTitle;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainTitle;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleImage;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MainTitleText;                                     // 0x0280(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             TitleImageTexture;                                 // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Widget_MainTitle(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetInfo(const class FText& TitleText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Widget_MainTitle_C">();
	}
	static class UUMG_Widget_MainTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Widget_MainTitle_C>();
	}
};
static_assert(alignof(UUMG_Widget_MainTitle_C) == 0x000008, "Wrong alignment on UUMG_Widget_MainTitle_C");
static_assert(sizeof(UUMG_Widget_MainTitle_C) == 0x0002A0, "Wrong size on UUMG_Widget_MainTitle_C");
static_assert(offsetof(UUMG_Widget_MainTitle_C, UberGraphFrame) == 0x000260, "Member 'UUMG_Widget_MainTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_MainTitle_C, FrameTitle) == 0x000268, "Member 'UUMG_Widget_MainTitle_C::FrameTitle' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_MainTitle_C, MainTitle) == 0x000270, "Member 'UUMG_Widget_MainTitle_C::MainTitle' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_MainTitle_C, TitleImage) == 0x000278, "Member 'UUMG_Widget_MainTitle_C::TitleImage' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_MainTitle_C, MainTitleText) == 0x000280, "Member 'UUMG_Widget_MainTitle_C::MainTitleText' has a wrong offset!");
static_assert(offsetof(UUMG_Widget_MainTitle_C, TitleImageTexture) == 0x000298, "Member 'UUMG_Widget_MainTitle_C::TitleImageTexture' has a wrong offset!");

}

