#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_Mother_BG

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_HelmetHUD_Mother_BG.UMG_HelmetHUD_Mother_BG_C
// 0x0038 (0x0298 - 0x0260)
class UUMG_HelmetHUD_Mother_BG_C final : public UPBHelmetHUD_Mother_BG
{
public:
	class UUSUMGSlotWidget*                       ExtensionPoin_MiniMap;                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Health;                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Mobility;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Pod_Left;                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Pod_Right;                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_Velocity;                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUSUMGSlotWidget*                       ExtensionPoint_WeaponInventory;                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_HelmetHUD_Mother_BG_C">();
	}
	static class UUMG_HelmetHUD_Mother_BG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_HelmetHUD_Mother_BG_C>();
	}
};
static_assert(alignof(UUMG_HelmetHUD_Mother_BG_C) == 0x000008, "Wrong alignment on UUMG_HelmetHUD_Mother_BG_C");
static_assert(sizeof(UUMG_HelmetHUD_Mother_BG_C) == 0x000298, "Wrong size on UUMG_HelmetHUD_Mother_BG_C");
static_assert(offsetof(UUMG_HelmetHUD_Mother_BG_C, ExtensionPoin_MiniMap) == 0x000260, "Member 'UUMG_HelmetHUD_Mother_BG_C::ExtensionPoin_MiniMap' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Mother_BG_C, ExtensionPoint_Health) == 0x000268, "Member 'UUMG_HelmetHUD_Mother_BG_C::ExtensionPoint_Health' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Mother_BG_C, ExtensionPoint_Mobility) == 0x000270, "Member 'UUMG_HelmetHUD_Mother_BG_C::ExtensionPoint_Mobility' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Mother_BG_C, ExtensionPoint_Pod_Left) == 0x000278, "Member 'UUMG_HelmetHUD_Mother_BG_C::ExtensionPoint_Pod_Left' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Mother_BG_C, ExtensionPoint_Pod_Right) == 0x000280, "Member 'UUMG_HelmetHUD_Mother_BG_C::ExtensionPoint_Pod_Right' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Mother_BG_C, ExtensionPoint_Velocity) == 0x000288, "Member 'UUMG_HelmetHUD_Mother_BG_C::ExtensionPoint_Velocity' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_Mother_BG_C, ExtensionPoint_WeaponInventory) == 0x000290, "Member 'UUMG_HelmetHUD_Mother_BG_C::ExtensionPoint_WeaponInventory' has a wrong offset!");

}

