#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameTeamScoreWidget

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EndGameTeamScoreWidget.UMG_EndGameTeamScoreWidget_C
// 0x00A0 (0x0300 - 0x0260)
class UUMG_EndGameTeamScoreWidget_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_90;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 wtBgImage;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             wtScoreText;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 wtTeamLogo;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             wtTeamName;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             wtWinLoseText;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPBCamp                                       TeamType;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBCamp, TSoftObjectPtr<class UTexture2D>> BgTextures;                                        // 0x02A0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	int32                                         TeamResult;                                        // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsVacuum;                                         // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Score;                                             // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_EndGameTeamScoreWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RefreshWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EndGameTeamScoreWidget_C">();
	}
	static class UUMG_EndGameTeamScoreWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EndGameTeamScoreWidget_C>();
	}
};
static_assert(alignof(UUMG_EndGameTeamScoreWidget_C) == 0x000008, "Wrong alignment on UUMG_EndGameTeamScoreWidget_C");
static_assert(sizeof(UUMG_EndGameTeamScoreWidget_C) == 0x000300, "Wrong size on UUMG_EndGameTeamScoreWidget_C");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, UberGraphFrame) == 0x000260, "Member 'UUMG_EndGameTeamScoreWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, Image_90) == 0x000268, "Member 'UUMG_EndGameTeamScoreWidget_C::Image_90' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, wtBgImage) == 0x000270, "Member 'UUMG_EndGameTeamScoreWidget_C::wtBgImage' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, wtScoreText) == 0x000278, "Member 'UUMG_EndGameTeamScoreWidget_C::wtScoreText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, wtTeamLogo) == 0x000280, "Member 'UUMG_EndGameTeamScoreWidget_C::wtTeamLogo' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, wtTeamName) == 0x000288, "Member 'UUMG_EndGameTeamScoreWidget_C::wtTeamName' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, wtWinLoseText) == 0x000290, "Member 'UUMG_EndGameTeamScoreWidget_C::wtWinLoseText' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, TeamType) == 0x000298, "Member 'UUMG_EndGameTeamScoreWidget_C::TeamType' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, BgTextures) == 0x0002A0, "Member 'UUMG_EndGameTeamScoreWidget_C::BgTextures' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, TeamResult) == 0x0002F0, "Member 'UUMG_EndGameTeamScoreWidget_C::TeamResult' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, bIsVacuum) == 0x0002F4, "Member 'UUMG_EndGameTeamScoreWidget_C::bIsVacuum' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameTeamScoreWidget_C, Score) == 0x0002F8, "Member 'UUMG_EndGameTeamScoreWidget_C::Score' has a wrong offset!");

}

