#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SingleSoundTrack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SingleSoundTrack.UMG_SingleSoundTrack_C
// 0x0088 (0x02E8 - 0x0260)
class UUMG_SingleSoundTrack_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         CurrentPlaySoundTime;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Play;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayingSound_Minutes;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayingSound_Seconds;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SoundName;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalDuration_Minutes;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalDuration_Seconds;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SoundTrack;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PlayingAudioComp;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 InSoundIndex)> OnButtonClicked;                                   // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Is_Playing;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSoundPlayComplete;                               // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         SoundIndex;                                        // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SingleSoundTrack(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void InitInfo(class USoundBase* InSoundTrack, const class FText& InSoundTrackName, int32 InIndex);
	void PlaySoundTrack(class UAudioComponent* InPlayingAudioComp, bool bIsPlaying);
	void StopSoundTrack();
	void ConvertTime(float InSeconds, int32* OutMinutes, int32* OutSeconds);
	void OnPlaybackPercent(const class USoundWave* PlayingSoundWave, const float PlaybackPercent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SingleSoundTrack_C">();
	}
	static class UUMG_SingleSoundTrack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SingleSoundTrack_C>();
	}
};
static_assert(alignof(UUMG_SingleSoundTrack_C) == 0x000008, "Wrong alignment on UUMG_SingleSoundTrack_C");
static_assert(sizeof(UUMG_SingleSoundTrack_C) == 0x0002E8, "Wrong size on UUMG_SingleSoundTrack_C");
static_assert(offsetof(UUMG_SingleSoundTrack_C, UberGraphFrame) == 0x000260, "Member 'UUMG_SingleSoundTrack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, Hovered) == 0x000268, "Member 'UUMG_SingleSoundTrack_C::Hovered' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, CurrentPlaySoundTime) == 0x000270, "Member 'UUMG_SingleSoundTrack_C::CurrentPlaySoundTime' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, Image_Play) == 0x000278, "Member 'UUMG_SingleSoundTrack_C::Image_Play' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, PlayingSound_Minutes) == 0x000280, "Member 'UUMG_SingleSoundTrack_C::PlayingSound_Minutes' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, PlayingSound_Seconds) == 0x000288, "Member 'UUMG_SingleSoundTrack_C::PlayingSound_Seconds' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, SoundName) == 0x000290, "Member 'UUMG_SingleSoundTrack_C::SoundName' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, TotalDuration_Minutes) == 0x000298, "Member 'UUMG_SingleSoundTrack_C::TotalDuration_Minutes' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, TotalDuration_Seconds) == 0x0002A0, "Member 'UUMG_SingleSoundTrack_C::TotalDuration_Seconds' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, SoundTrack) == 0x0002A8, "Member 'UUMG_SingleSoundTrack_C::SoundTrack' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, PlayingAudioComp) == 0x0002B0, "Member 'UUMG_SingleSoundTrack_C::PlayingAudioComp' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, OnButtonClicked) == 0x0002B8, "Member 'UUMG_SingleSoundTrack_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, Is_Playing) == 0x0002C8, "Member 'UUMG_SingleSoundTrack_C::Is_Playing' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, OnSoundPlayComplete) == 0x0002D0, "Member 'UUMG_SingleSoundTrack_C::OnSoundPlayComplete' has a wrong offset!");
static_assert(offsetof(UUMG_SingleSoundTrack_C, SoundIndex) == 0x0002E0, "Member 'UUMG_SingleSoundTrack_C::SoundIndex' has a wrong offset!");

}

