#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ArtBookPage

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ArtBookPage.UMG_ArtBookPage_C
// 0x0020 (0x0280 - 0x0260)
class UUMG_ArtBookPage_C final : public UUserWidget
{
public:
	class UImage*                                 Image_254;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Main;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Label;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Init(const class FText& InLabel, TSoftObjectPtr<class UTexture2D> InImage);
	void HideText();
	void ShowText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ArtBookPage_C">();
	}
	static class UUMG_ArtBookPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ArtBookPage_C>();
	}
};
static_assert(alignof(UUMG_ArtBookPage_C) == 0x000008, "Wrong alignment on UUMG_ArtBookPage_C");
static_assert(sizeof(UUMG_ArtBookPage_C) == 0x000280, "Wrong size on UUMG_ArtBookPage_C");
static_assert(offsetof(UUMG_ArtBookPage_C, Image_254) == 0x000260, "Member 'UUMG_ArtBookPage_C::Image_254' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBookPage_C, Image_Main) == 0x000268, "Member 'UUMG_ArtBookPage_C::Image_Main' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBookPage_C, Overlay_1) == 0x000270, "Member 'UUMG_ArtBookPage_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UUMG_ArtBookPage_C, Text_Label) == 0x000278, "Member 'UUMG_ArtBookPage_C::Text_Label' has a wrong offset!");

}

