#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SingleMedal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MainMenuWidget_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SingleMedal.UMG_SingleMedal_C
// 0x0070 (0x0360 - 0x02F0)
class UUMG_SingleMedal_C final : public UMainMenuWidget_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UMG_SingleMedal_C;                  // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FocusOn;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_142;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ChallengeItem;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MainButton;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tag;                                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TypeBG;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWidget* Item)> FocusButton;                                       // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              ButtonClick;                                       // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   MedalID;                                           // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SerialNumber;                                      // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SingleMedal(int32 EntryPoint);
	void SetCustomFocus();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__MainButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void SetInfo(class FName InMedalID, int32 InCount, int32 InSerialNumber, struct FFPB_MedalDetailsConfig_BP& InMedalDetailsConfig);
	void SetNewItemInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SingleMedal_C">();
	}
	static class UUMG_SingleMedal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SingleMedal_C>();
	}
};
static_assert(alignof(UUMG_SingleMedal_C) == 0x000008, "Wrong alignment on UUMG_SingleMedal_C");
static_assert(sizeof(UUMG_SingleMedal_C) == 0x000360, "Wrong size on UUMG_SingleMedal_C");
static_assert(offsetof(UUMG_SingleMedal_C, UberGraphFrame_UMG_SingleMedal_C) == 0x0002F0, "Member 'UUMG_SingleMedal_C::UberGraphFrame_UMG_SingleMedal_C' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, FocusOn) == 0x0002F8, "Member 'UUMG_SingleMedal_C::FocusOn' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, Image_142) == 0x000300, "Member 'UUMG_SingleMedal_C::Image_142' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, Image_ChallengeItem) == 0x000308, "Member 'UUMG_SingleMedal_C::Image_ChallengeItem' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, MainButton) == 0x000310, "Member 'UUMG_SingleMedal_C::MainButton' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, Name_0) == 0x000318, "Member 'UUMG_SingleMedal_C::Name_0' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, Tag) == 0x000320, "Member 'UUMG_SingleMedal_C::Tag' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, TypeBG) == 0x000328, "Member 'UUMG_SingleMedal_C::TypeBG' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, FocusButton) == 0x000330, "Member 'UUMG_SingleMedal_C::FocusButton' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, ButtonClick) == 0x000340, "Member 'UUMG_SingleMedal_C::ButtonClick' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, MedalID) == 0x000350, "Member 'UUMG_SingleMedal_C::MedalID' has a wrong offset!");
static_assert(offsetof(UUMG_SingleMedal_C, SerialNumber) == 0x000358, "Member 'UUMG_SingleMedal_C::SerialNumber' has a wrong offset!");

}

