#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Indicator_Character

#include "Basic.hpp"

#include "Enum_EmojiIconType_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.ExecuteUbergraph_UMG_Indicator_Character
// 0x0148 (0x0148 - 0x0000)
struct UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0084(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBCharacter*                           K2Node_DynamicCast_AsPBCharacter_1;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBCamp                                       K2Node_Event_NewCamp;                              // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBMarkableComponent*                   K2Node_Event_NewRelatedMarkable;                   // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBIndicatorStatus                            K2Node_Event_NewStatus;                            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0120(0x0028)()
};
static_assert(alignof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character) == 0x000008, "Wrong alignment on UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character");
static_assert(sizeof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character) == 0x000148, "Wrong size on UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, EntryPoint) == 0x000000, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, Temp_int_Array_Index_Variable) == 0x000030, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_GetOwner_ReturnValue) == 0x000070, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_DynamicCast_AsPBCharacter) == 0x000078, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_DynamicCast_AsPBCharacter' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_Event_IsDesignTime) == 0x000081, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_Event_MyGeometry) == 0x000084, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_Event_InDeltaTime) == 0x0000BC, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_IsValid_ReturnValue_2) == 0x0000C1, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_GetOwner_ReturnValue_1) == 0x0000C8, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_DynamicCast_AsPBCharacter_1) == 0x0000D0, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_DynamicCast_AsPBCharacter_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_MakeArray_Array) == 0x0000E0, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000100, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_IsValid_ReturnValue_3) == 0x000109, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, CallFunc_IsValid_ReturnValue_4) == 0x00010A, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_Event_NewCamp) == 0x00010B, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_Event_NewCamp' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_SwitchEnum_CmpSuccess) == 0x00010C, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_Event_NewRelatedMarkable) == 0x000110, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_Event_NewRelatedMarkable' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_Event_NewStatus) == 0x000118, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_Event_NewStatus' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character, K2Node_MakeStruct_SlateColor_2) == 0x000120, "Member 'UMG_Indicator_Character_C_ExecuteUbergraph_UMG_Indicator_Character::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.K2_UpdateIndicatorStatus
// 0x0001 (0x0001 - 0x0000)
struct UMG_Indicator_Character_C_K2_UpdateIndicatorStatus final
{
public:
	EPBIndicatorStatus                            NewStatus;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Character_C_K2_UpdateIndicatorStatus) == 0x000001, "Wrong alignment on UMG_Indicator_Character_C_K2_UpdateIndicatorStatus");
static_assert(sizeof(UMG_Indicator_Character_C_K2_UpdateIndicatorStatus) == 0x000001, "Wrong size on UMG_Indicator_Character_C_K2_UpdateIndicatorStatus");
static_assert(offsetof(UMG_Indicator_Character_C_K2_UpdateIndicatorStatus, NewStatus) == 0x000000, "Member 'UMG_Indicator_Character_C_K2_UpdateIndicatorStatus::NewStatus' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.K2_UpdateRelatedMarkable
// 0x0008 (0x0008 - 0x0000)
struct UMG_Indicator_Character_C_K2_UpdateRelatedMarkable final
{
public:
	class UPBMarkableComponent*                   NewRelatedMarkable;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Character_C_K2_UpdateRelatedMarkable) == 0x000008, "Wrong alignment on UMG_Indicator_Character_C_K2_UpdateRelatedMarkable");
static_assert(sizeof(UMG_Indicator_Character_C_K2_UpdateRelatedMarkable) == 0x000008, "Wrong size on UMG_Indicator_Character_C_K2_UpdateRelatedMarkable");
static_assert(offsetof(UMG_Indicator_Character_C_K2_UpdateRelatedMarkable, NewRelatedMarkable) == 0x000000, "Member 'UMG_Indicator_Character_C_K2_UpdateRelatedMarkable::NewRelatedMarkable' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.K2_UpdateCamp
// 0x0001 (0x0001 - 0x0000)
struct UMG_Indicator_Character_C_K2_UpdateCamp final
{
public:
	EPBCamp                                       NewCamp;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Character_C_K2_UpdateCamp) == 0x000001, "Wrong alignment on UMG_Indicator_Character_C_K2_UpdateCamp");
static_assert(sizeof(UMG_Indicator_Character_C_K2_UpdateCamp) == 0x000001, "Wrong size on UMG_Indicator_Character_C_K2_UpdateCamp");
static_assert(offsetof(UMG_Indicator_Character_C_K2_UpdateCamp, NewCamp) == 0x000000, "Member 'UMG_Indicator_Character_C_K2_UpdateCamp::NewCamp' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_Indicator_Character_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Character_C_Tick) == 0x000004, "Wrong alignment on UMG_Indicator_Character_C_Tick");
static_assert(sizeof(UMG_Indicator_Character_C_Tick) == 0x00003C, "Wrong size on UMG_Indicator_Character_C_Tick");
static_assert(offsetof(UMG_Indicator_Character_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_Indicator_Character_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_Indicator_Character_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_Indicator_Character_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Indicator_Character_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_Indicator_Character_C_PreConstruct");
static_assert(sizeof(UMG_Indicator_Character_C_PreConstruct) == 0x000001, "Wrong size on UMG_Indicator_Character_C_PreConstruct");
static_assert(offsetof(UMG_Indicator_Character_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_Indicator_Character_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdatePosition
// 0x0004 (0x0004 - 0x0000)
struct UMG_Indicator_Character_C_UpdatePosition final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Character_C_UpdatePosition) == 0x000004, "Wrong alignment on UMG_Indicator_Character_C_UpdatePosition");
static_assert(sizeof(UMG_Indicator_Character_C_UpdatePosition) == 0x000004, "Wrong size on UMG_Indicator_Character_C_UpdatePosition");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition, DeltaTime) == 0x000000, "Member 'UMG_Indicator_Character_C_UpdatePosition::DeltaTime' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdateDisable
// 0x0010 (0x0010 - 0x0000)
struct UMG_Indicator_Character_C_UpdateDisable final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInCharacterLifeStatus_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInCharacterLifeStatus_ReturnValue_1;    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Indicator_Character_C_UpdateDisable) == 0x000008, "Wrong alignment on UMG_Indicator_Character_C_UpdateDisable");
static_assert(sizeof(UMG_Indicator_Character_C_UpdateDisable) == 0x000010, "Wrong size on UMG_Indicator_Character_C_UpdateDisable");
static_assert(offsetof(UMG_Indicator_Character_C_UpdateDisable, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'UMG_Indicator_Character_C_UpdateDisable::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdateDisable, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_Indicator_Character_C_UpdateDisable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdateDisable, CallFunc_IsInCharacterLifeStatus_ReturnValue) == 0x000009, "Member 'UMG_Indicator_Character_C_UpdateDisable::CallFunc_IsInCharacterLifeStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdateDisable, CallFunc_IsInCharacterLifeStatus_ReturnValue_1) == 0x00000A, "Member 'UMG_Indicator_Character_C_UpdateDisable::CallFunc_IsInCharacterLifeStatus_ReturnValue_1' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdateStatus
// 0x0001 (0x0001 - 0x0000)
struct UMG_Indicator_Character_C_UpdateStatus final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Indicator_Character_C_UpdateStatus) == 0x000001, "Wrong alignment on UMG_Indicator_Character_C_UpdateStatus");
static_assert(sizeof(UMG_Indicator_Character_C_UpdateStatus) == 0x000001, "Wrong size on UMG_Indicator_Character_C_UpdateStatus");
static_assert(offsetof(UMG_Indicator_Character_C_UpdateStatus, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'UMG_Indicator_Character_C_UpdateStatus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdatePlayerName
// 0x0070 (0x0070 - 0x0000)
struct UMG_Indicator_Character_C_UpdatePlayerName final
{
public:
	class UPBFriendManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBFriendManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class FString                                 CallFunc_GetBlockPlayerDisplayName_BP_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBlockPlayerList_BP_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0058(0x0018)()
};
static_assert(alignof(UMG_Indicator_Character_C_UpdatePlayerName) == 0x000008, "Wrong alignment on UMG_Indicator_Character_C_UpdatePlayerName");
static_assert(sizeof(UMG_Indicator_Character_C_UpdatePlayerName) == 0x000070, "Wrong size on UMG_Indicator_Character_C_UpdatePlayerName");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePlayerName, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UMG_Indicator_Character_C_UpdatePlayerName::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePlayerName, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000008, "Member 'UMG_Indicator_Character_C_UpdatePlayerName::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePlayerName, CallFunc_GetPlayerName_ReturnValue) == 0x000010, "Member 'UMG_Indicator_Character_C_UpdatePlayerName::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePlayerName, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UMG_Indicator_Character_C_UpdatePlayerName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'UMG_Indicator_Character_C_UpdatePlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePlayerName, CallFunc_GetBlockPlayerDisplayName_BP_ReturnValue) == 0x000040, "Member 'UMG_Indicator_Character_C_UpdatePlayerName::CallFunc_GetBlockPlayerDisplayName_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePlayerName, CallFunc_IsInBlockPlayerList_BP_ReturnValue) == 0x000050, "Member 'UMG_Indicator_Character_C_UpdatePlayerName::CallFunc_IsInBlockPlayerList_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePlayerName, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000058, "Member 'UMG_Indicator_Character_C_UpdatePlayerName::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdatePosition_Main
// 0x0010 (0x0010 - 0x0000)
struct UMG_Indicator_Character_C_UpdatePosition_Main final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Character_C_UpdatePosition_Main) == 0x000008, "Wrong alignment on UMG_Indicator_Character_C_UpdatePosition_Main");
static_assert(sizeof(UMG_Indicator_Character_C_UpdatePosition_Main) == 0x000010, "Wrong size on UMG_Indicator_Character_C_UpdatePosition_Main");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Main, DeltaTime) == 0x000000, "Member 'UMG_Indicator_Character_C_UpdatePosition_Main::DeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Main, Speed) == 0x000004, "Member 'UMG_Indicator_Character_C_UpdatePosition_Main::Speed' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Main, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'UMG_Indicator_Character_C_UpdatePosition_Main::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdatePosition_Edge
// 0x0010 (0x0010 - 0x0000)
struct UMG_Indicator_Character_C_UpdatePosition_Edge final
{
public:
	bool                                          CallFunc_IsInCharacterLifeStatus_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Character_C_UpdatePosition_Edge) == 0x000004, "Wrong alignment on UMG_Indicator_Character_C_UpdatePosition_Edge");
static_assert(sizeof(UMG_Indicator_Character_C_UpdatePosition_Edge) == 0x000010, "Wrong size on UMG_Indicator_Character_C_UpdatePosition_Edge");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Edge, CallFunc_IsInCharacterLifeStatus_ReturnValue) == 0x000000, "Member 'UMG_Indicator_Character_C_UpdatePosition_Edge::CallFunc_IsInCharacterLifeStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Edge, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'UMG_Indicator_Character_C_UpdatePosition_Edge::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Edge, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'UMG_Indicator_Character_C_UpdatePosition_Edge::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Edge, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'UMG_Indicator_Character_C_UpdatePosition_Edge::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdatePosition_Line
// 0x00D8 (0x00D8 - 0x0000)
struct UMG_Indicator_Character_C_UpdatePosition_Line final
{
public:
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ScreenToViewport_ViewportPosition;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Distance2D_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue_1;            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ScreenToViewport_ViewportPosition_1;      // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue_1;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_2;     // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_3;     // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot_1;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Character_C_UpdatePosition_Line) == 0x000008, "Wrong alignment on UMG_Indicator_Character_C_UpdatePosition_Line");
static_assert(sizeof(UMG_Indicator_Character_C_UpdatePosition_Line) == 0x0000D8, "Wrong size on UMG_Indicator_Character_C_UpdatePosition_Line");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_GetViewportSize_ReturnValue) == 0x000000, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000008, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_ScreenToViewport_ViewportPosition) == 0x000018, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_ScreenToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Distance2D_ReturnValue) == 0x000020, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000028, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_GetViewportSize_ReturnValue_1) == 0x000034, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_GetViewportSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Multiply_Vector2DFloat_ReturnValue_1) == 0x00003C, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Multiply_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000048, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_ScreenToViewport_ViewportPosition_1) == 0x000054, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_ScreenToViewport_ViewportPosition_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x00005C, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_VSize2D_ReturnValue) == 0x000064, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000068, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_MakeVector2D_ReturnValue) == 0x00006C, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x000074, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_VSize2D_ReturnValue_1) == 0x00007C, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_VSize2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Normal2D_ReturnValue) == 0x000080, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000088, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Multiply_Vector2DFloat_ReturnValue_2) == 0x00008C, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Multiply_Vector2DFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000094, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x00009C, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_Multiply_Vector2DFloat_ReturnValue_3) == 0x0000A4, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_Multiply_Vector2DFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, K2Node_DynamicCast_AsCanvas_Panel_Slot_1) == 0x0000B0, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::K2Node_DynamicCast_AsCanvas_Panel_Slot_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_GetSize_ReturnValue) == 0x0000BC, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_BreakVector2D_X) == 0x0000C4, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_BreakVector2D_Y) == 0x0000C8, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Line, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000CC, "Member 'UMG_Indicator_Character_C_UpdatePosition_Line::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UdpateRole
// 0x0400 (0x0400 - 0x0000)
struct UMG_Indicator_Character_C_UdpateRole final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBCharacterDefinitionRow              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x03D0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Indicator_Character_C_UdpateRole) == 0x000008, "Wrong alignment on UMG_Indicator_Character_C_UdpateRole");
static_assert(sizeof(UMG_Indicator_Character_C_UdpateRole) == 0x000400, "Wrong size on UMG_Indicator_Character_C_UdpateRole");
static_assert(offsetof(UMG_Indicator_Character_C_UdpateRole, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'UMG_Indicator_Character_C_UdpateRole::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UdpateRole, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000008, "Member 'UMG_Indicator_Character_C_UdpateRole::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UdpateRole, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'UMG_Indicator_Character_C_UdpateRole::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UdpateRole, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003E0, "Member 'UMG_Indicator_Character_C_UdpateRole::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UdpateRole, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0003E8, "Member 'UMG_Indicator_Character_C_UdpateRole::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UdpateRole, K2Node_DynamicCast_AsTexture_2D) == 0x0003F0, "Member 'UMG_Indicator_Character_C_UdpateRole::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UdpateRole, K2Node_DynamicCast_bSuccess) == 0x0003F8, "Member 'UMG_Indicator_Character_C_UdpateRole::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdatePosition_Corner
// 0x0038 (0x0038 - 0x0000)
struct UMG_Indicator_Character_C_UpdatePosition_Corner final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TargetPosition;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelteTime;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeed;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Vector2DInterpTo_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Indicator_Character_C_UpdatePosition_Corner) == 0x000008, "Wrong alignment on UMG_Indicator_Character_C_UpdatePosition_Corner");
static_assert(sizeof(UMG_Indicator_Character_C_UpdatePosition_Corner) == 0x000038, "Wrong size on UMG_Indicator_Character_C_UpdatePosition_Corner");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, Image) == 0x000000, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::Image' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, TargetPosition) == 0x000008, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::TargetPosition' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, DelteTime) == 0x000010, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::DelteTime' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, InterpSpeed) == 0x000014, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::InterpSpeed' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, Temp_struct_Variable) == 0x00001C, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, Temp_bool_Variable) == 0x000024, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000025, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, K2Node_Select_Default) == 0x000028, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdatePosition_Corner, CallFunc_Vector2DInterpTo_ReturnValue) == 0x000030, "Member 'UMG_Indicator_Character_C_UpdatePosition_Corner::CallFunc_Vector2DInterpTo_ReturnValue' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.SwitchInfoPad
// 0x0002 (0x0002 - 0x0000)
struct UMG_Indicator_Character_C_SwitchInfoPad final
{
public:
	bool                                          bShowMarkBox;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowText;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Indicator_Character_C_SwitchInfoPad) == 0x000001, "Wrong alignment on UMG_Indicator_Character_C_SwitchInfoPad");
static_assert(sizeof(UMG_Indicator_Character_C_SwitchInfoPad) == 0x000002, "Wrong size on UMG_Indicator_Character_C_SwitchInfoPad");
static_assert(offsetof(UMG_Indicator_Character_C_SwitchInfoPad, bShowMarkBox) == 0x000000, "Member 'UMG_Indicator_Character_C_SwitchInfoPad::bShowMarkBox' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_SwitchInfoPad, bShowText) == 0x000001, "Member 'UMG_Indicator_Character_C_SwitchInfoPad::bShowText' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdateHealthAndArmor
// 0x000C (0x000C - 0x0000)
struct UMG_Indicator_Character_C_UpdateHealthAndArmor final
{
public:
	float                                         CallFunc_GetAirTightness_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxAirTightness_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Indicator_Character_C_UpdateHealthAndArmor) == 0x000004, "Wrong alignment on UMG_Indicator_Character_C_UpdateHealthAndArmor");
static_assert(sizeof(UMG_Indicator_Character_C_UpdateHealthAndArmor) == 0x00000C, "Wrong size on UMG_Indicator_Character_C_UpdateHealthAndArmor");
static_assert(offsetof(UMG_Indicator_Character_C_UpdateHealthAndArmor, CallFunc_GetAirTightness_ReturnValue) == 0x000000, "Member 'UMG_Indicator_Character_C_UpdateHealthAndArmor::CallFunc_GetAirTightness_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdateHealthAndArmor, CallFunc_GetMaxAirTightness_ReturnValue) == 0x000004, "Member 'UMG_Indicator_Character_C_UpdateHealthAndArmor::CallFunc_GetMaxAirTightness_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Indicator_Character_C_UpdateHealthAndArmor, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'UMG_Indicator_Character_C_UpdateHealthAndArmor::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function UMG_Indicator_Character.UMG_Indicator_Character_C.UpdateTeamDisable
// 0x0100 (0x0100 - 0x0000)
struct UMG_Indicator_Character_C_UpdateTeamDisable final
{
public:
	TArray<class UImage*>                         InstArray;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0060(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0088(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
