#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SoundTrackLabel

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "Struct_SoundInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_SoundTrackLabel.UMG_SoundTrackLabel_C
// 0x0050 (0x02B0 - 0x0260)
class UUMG_SoundTrackLabel_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ButtonMain;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayingSound_Minutes;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayingSound_Seconds;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayingSoundName;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        AudioComp;                                         // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_OriginalSoundTrack_C*              UMGOriginalSoundTrack;                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_SoundInfo>              SoundInfoArray;                                    // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PlayingSoundIndex;                                 // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_SoundTrackLabel(int32 EntryPoint);
	void BndEvt__UMG_SoundTrackLabel_ButtonMain_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_SoundTrackLabel_ButtonMain_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OpenSoundTrackPage();
	void PlayArtBookMusic();
	void StopArtBookMusic();
	void OnPlaybackPercent(const class USoundWave* PlayingSoundWave, const float PlaybackPercent);
	void OnPlayingSoundChanged(int32 InSoundIndex);
	void ConvertTime(float InSeconds, int32* OutMinutes, int32* OutSeconds);
	void Play_Next_Sound();
	void OnFinishPlaying();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_SoundTrackLabel_C">();
	}
	static class UUMG_SoundTrackLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_SoundTrackLabel_C>();
	}
};
static_assert(alignof(UUMG_SoundTrackLabel_C) == 0x000008, "Wrong alignment on UUMG_SoundTrackLabel_C");
static_assert(sizeof(UUMG_SoundTrackLabel_C) == 0x0002B0, "Wrong size on UUMG_SoundTrackLabel_C");
static_assert(offsetof(UUMG_SoundTrackLabel_C, UberGraphFrame) == 0x000260, "Member 'UUMG_SoundTrackLabel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_SoundTrackLabel_C, ButtonMain) == 0x000268, "Member 'UUMG_SoundTrackLabel_C::ButtonMain' has a wrong offset!");
static_assert(offsetof(UUMG_SoundTrackLabel_C, PlayingSound_Minutes) == 0x000270, "Member 'UUMG_SoundTrackLabel_C::PlayingSound_Minutes' has a wrong offset!");
static_assert(offsetof(UUMG_SoundTrackLabel_C, PlayingSound_Seconds) == 0x000278, "Member 'UUMG_SoundTrackLabel_C::PlayingSound_Seconds' has a wrong offset!");
static_assert(offsetof(UUMG_SoundTrackLabel_C, PlayingSoundName) == 0x000280, "Member 'UUMG_SoundTrackLabel_C::PlayingSoundName' has a wrong offset!");
static_assert(offsetof(UUMG_SoundTrackLabel_C, AudioComp) == 0x000288, "Member 'UUMG_SoundTrackLabel_C::AudioComp' has a wrong offset!");
static_assert(offsetof(UUMG_SoundTrackLabel_C, UMGOriginalSoundTrack) == 0x000290, "Member 'UUMG_SoundTrackLabel_C::UMGOriginalSoundTrack' has a wrong offset!");
static_assert(offsetof(UUMG_SoundTrackLabel_C, SoundInfoArray) == 0x000298, "Member 'UUMG_SoundTrackLabel_C::SoundInfoArray' has a wrong offset!");
static_assert(offsetof(UUMG_SoundTrackLabel_C, PlayingSoundIndex) == 0x0002A8, "Member 'UUMG_SoundTrackLabel_C::PlayingSoundIndex' has a wrong offset!");

}

