#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ModeFilterOption

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ModeFilterOption.UMG_ModeFilterOption_C
// 0x0068 (0x02C8 - 0x0260)
class UUMG_ModeFilterOption_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FocusOn;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_ModeOption;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ModeIcon;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectTag;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ModeName;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName ModeName, class UUMG_ModeFilterOption_C* SelectedModeOption)> OnSelectMode;                                      // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   ModeName;                                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PlaylistItemName;                                  // 0x02AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnCliced;                                          // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_ModeFilterOption(int32 EntryPoint);
	void BndEvt__UMG_ModeFilterOption_Button_ModeOption_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__UMG_ModeFilterOption_Button_ModeOption_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void RefreshInfo(class FName InModeName, class FName InPlaylistItemName);
	void UpdateSelectedFlag(bool IsSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ModeFilterOption_C">();
	}
	static class UUMG_ModeFilterOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ModeFilterOption_C>();
	}
};
static_assert(alignof(UUMG_ModeFilterOption_C) == 0x000008, "Wrong alignment on UUMG_ModeFilterOption_C");
static_assert(sizeof(UUMG_ModeFilterOption_C) == 0x0002C8, "Wrong size on UUMG_ModeFilterOption_C");
static_assert(offsetof(UUMG_ModeFilterOption_C, UberGraphFrame) == 0x000260, "Member 'UUMG_ModeFilterOption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, FocusOn) == 0x000268, "Member 'UUMG_ModeFilterOption_C::FocusOn' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, Button_ModeOption) == 0x000270, "Member 'UUMG_ModeFilterOption_C::Button_ModeOption' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, Image_ModeIcon) == 0x000278, "Member 'UUMG_ModeFilterOption_C::Image_ModeIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, Image_SelectTag) == 0x000280, "Member 'UUMG_ModeFilterOption_C::Image_SelectTag' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, TextBlock_ModeName) == 0x000288, "Member 'UUMG_ModeFilterOption_C::TextBlock_ModeName' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, OnSelectMode) == 0x000290, "Member 'UUMG_ModeFilterOption_C::OnSelectMode' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, ModeName) == 0x0002A0, "Member 'UUMG_ModeFilterOption_C::ModeName' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, bIsSelected) == 0x0002A8, "Member 'UUMG_ModeFilterOption_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, PlaylistItemName) == 0x0002AC, "Member 'UUMG_ModeFilterOption_C::PlaylistItemName' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, bIsFocused) == 0x0002B4, "Member 'UUMG_ModeFilterOption_C::bIsFocused' has a wrong offset!");
static_assert(offsetof(UUMG_ModeFilterOption_C, OnCliced) == 0x0002B8, "Member 'UUMG_ModeFilterOption_C::OnCliced' has a wrong offset!");

}

