#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_InGameHUD_WarningWidget_BackpackDown

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Struct_GamePlayEvent_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_InGameHUD_Mother_C*                K2Node_CustomEvent_Parient;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown) == 0x000008, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown) == 0x000010, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown, EntryPoint) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown, K2Node_CustomEvent_Parient) == 0x000008, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_ExecuteUbergraph_UMG_InGameHUD_WarningWidget_BackpackDown::K2Node_CustomEvent_Parient' has a wrong offset!");

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.Event_ParientPreConstruct
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_Event_ParientPreConstruct final
{
public:
	class UUMG_InGameHUD_Mother_C*                Parient;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_Event_ParientPreConstruct) == 0x000008, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_Event_ParientPreConstruct");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_Event_ParientPreConstruct) == 0x000008, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_Event_ParientPreConstruct");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_Event_ParientPreConstruct, Parient) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_Event_ParientPreConstruct::Parient' has a wrong offset!");

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.ReceiveThreadEvent
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_ReceiveThreadEvent final
{
public:
	int32                                         ThreadPoint;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_ReceiveThreadEvent) == 0x000004, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_ReceiveThreadEvent");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_ReceiveThreadEvent) == 0x000008, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_ReceiveThreadEvent");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_ReceiveThreadEvent, ThreadPoint) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_ReceiveThreadEvent::ThreadPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_ReceiveThreadEvent, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_ReceiveThreadEvent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.OnRefreshStatePior
// 0x0038 (0x0038 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior final
{
public:
	int32                                         LocalThreadPoint;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HaveActive;                                        // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStruct_GamePlayEvent>          K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	struct FStruct_GamePlayEvent                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior) == 0x000008, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior) == 0x000038, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, LocalThreadPoint) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::LocalThreadPoint' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, HaveActive) == 0x000004, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::HaveActive' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, K2Node_MakeArray_Array) == 0x000018, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, CallFunc_Array_Get_Item) == 0x000028, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior, CallFunc_Greater_IntInt_ReturnValue) == 0x000035, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshStatePior::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.SetText
// 0x0028 (0x0028 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           TextColor;                                         // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_SetText) == 0x000008, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_SetText");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_SetText) == 0x000028, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_SetText");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_SetText, InText) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_SetText::InText' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_SetText, TextColor) == 0x000018, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_SetText::TextColor' has a wrong offset!");

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.OnRefreshText
// 0x0020 (0x0020 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshText final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshText) == 0x000008, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshText");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshText) == 0x000020, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshText");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshText, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshText::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshText, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_OnRefreshText::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.StopAnimations
// 0x0001 (0x0001 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_StopAnimations final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_StopAnimations) == 0x000001, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_StopAnimations");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_StopAnimations) == 0x000001, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_StopAnimations");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_StopAnimations, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_StopAnimations::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.PlayActiveAnimation
// 0x0010 (0x0010 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_PlayActiveAnimation final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_PlayActiveAnimation) == 0x000008, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_PlayActiveAnimation");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_PlayActiveAnimation) == 0x000010, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_PlayActiveAnimation");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_PlayActiveAnimation, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_PlayActiveAnimation::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_PlayActiveAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_PlayActiveAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.DeactiveAllEvent
// 0x0008 (0x0008 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_DeactiveAllEvent final
{
public:
	struct FStruct_GamePlayEvent                  K2Node_MakeStruct_Struct_GamePlayEvent;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_DeactiveAllEvent) == 0x000004, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_DeactiveAllEvent");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_DeactiveAllEvent) == 0x000008, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_DeactiveAllEvent");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_DeactiveAllEvent, K2Node_MakeStruct_Struct_GamePlayEvent) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_DeactiveAllEvent::K2Node_MakeStruct_Struct_GamePlayEvent' has a wrong offset!");

// Function UMG_InGameHUD_WarningWidget_BackpackDown.UMG_InGameHUD_WarningWidget_BackpackDown_C.SetCountDownVisiable
// 0x0001 (0x0001 - 0x0000)
struct UMG_InGameHUD_WarningWidget_BackpackDown_C_SetCountDownVisiable final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_InGameHUD_WarningWidget_BackpackDown_C_SetCountDownVisiable) == 0x000001, "Wrong alignment on UMG_InGameHUD_WarningWidget_BackpackDown_C_SetCountDownVisiable");
static_assert(sizeof(UMG_InGameHUD_WarningWidget_BackpackDown_C_SetCountDownVisiable) == 0x000001, "Wrong size on UMG_InGameHUD_WarningWidget_BackpackDown_C_SetCountDownVisiable");
static_assert(offsetof(UMG_InGameHUD_WarningWidget_BackpackDown_C_SetCountDownVisiable, InVisibility) == 0x000000, "Member 'UMG_InGameHUD_WarningWidget_BackpackDown_C_SetCountDownVisiable::InVisibility' has a wrong offset!");

}

