#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_IngameHUD_Heat

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_IngameHUD_Heat.UMG_IngameHUD_Heat_C
// 0x0070 (0x02D0 - 0x0260)
class UUMG_IngameHUD_Heat_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 circle;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TintBorder;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InGameHUD_Mother_C*                ParientHUD;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         WeaponHeatPercent;                                 // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHeat;                                           // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BackPackHeatPercent;                               // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinalHeatPercent;                                  // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LowTempColor;                                      // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MaxTempColor;                                      // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxOringeHeatPercent;                              // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CirclePtr;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            HeatCurve;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapSize;                                           // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_IngameHUD_Heat(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void GetBigestHeat();
	void SetBarColor();
	void SetHeatCircleSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_IngameHUD_Heat_C">();
	}
	static class UUMG_IngameHUD_Heat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_IngameHUD_Heat_C>();
	}
};
static_assert(alignof(UUMG_IngameHUD_Heat_C) == 0x000008, "Wrong alignment on UUMG_IngameHUD_Heat_C");
static_assert(sizeof(UUMG_IngameHUD_Heat_C) == 0x0002D0, "Wrong size on UUMG_IngameHUD_Heat_C");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, UberGraphFrame) == 0x000260, "Member 'UUMG_IngameHUD_Heat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, circle) == 0x000268, "Member 'UUMG_IngameHUD_Heat_C::circle' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, TintBorder) == 0x000270, "Member 'UUMG_IngameHUD_Heat_C::TintBorder' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, ParientHUD) == 0x000278, "Member 'UUMG_IngameHUD_Heat_C::ParientHUD' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, WeaponHeatPercent) == 0x000280, "Member 'UUMG_IngameHUD_Heat_C::WeaponHeatPercent' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, MaxHeat) == 0x000284, "Member 'UUMG_IngameHUD_Heat_C::MaxHeat' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, BackPackHeatPercent) == 0x000288, "Member 'UUMG_IngameHUD_Heat_C::BackPackHeatPercent' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, FinalHeatPercent) == 0x00028C, "Member 'UUMG_IngameHUD_Heat_C::FinalHeatPercent' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, LowTempColor) == 0x000290, "Member 'UUMG_IngameHUD_Heat_C::LowTempColor' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, MaxTempColor) == 0x0002A0, "Member 'UUMG_IngameHUD_Heat_C::MaxTempColor' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, MaxOringeHeatPercent) == 0x0002B0, "Member 'UUMG_IngameHUD_Heat_C::MaxOringeHeatPercent' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, CirclePtr) == 0x0002B8, "Member 'UUMG_IngameHUD_Heat_C::CirclePtr' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, HeatCurve) == 0x0002C0, "Member 'UUMG_IngameHUD_Heat_C::HeatCurve' has a wrong offset!");
static_assert(offsetof(UUMG_IngameHUD_Heat_C, MapSize) == 0x0002C8, "Member 'UUMG_IngameHUD_Heat_C::MapSize' has a wrong offset!");

}

