#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_STD_Art_IconButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.ExecuteUbergraph_UMG_STD_Art_IconButton
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_Art_IconButton_C_ExecuteUbergraph_UMG_STD_Art_IconButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_ExecuteUbergraph_UMG_STD_Art_IconButton) == 0x000004, "Wrong alignment on UMG_STD_Art_IconButton_C_ExecuteUbergraph_UMG_STD_Art_IconButton");
static_assert(sizeof(UMG_STD_Art_IconButton_C_ExecuteUbergraph_UMG_STD_Art_IconButton) == 0x000008, "Wrong size on UMG_STD_Art_IconButton_C_ExecuteUbergraph_UMG_STD_Art_IconButton");
static_assert(offsetof(UMG_STD_Art_IconButton_C_ExecuteUbergraph_UMG_STD_Art_IconButton, EntryPoint) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_ExecuteUbergraph_UMG_STD_Art_IconButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_ExecuteUbergraph_UMG_STD_Art_IconButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_STD_Art_IconButton_C_ExecuteUbergraph_UMG_STD_Art_IconButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_STD_Art_IconButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_STD_Art_IconButton_C_PreConstruct");
static_assert(sizeof(UMG_STD_Art_IconButton_C_PreConstruct) == 0x000001, "Wrong size on UMG_STD_Art_IconButton_C_PreConstruct");
static_assert(offsetof(UMG_STD_Art_IconButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.UpdateText
// 0x0040 (0x0040 - 0x0000)
struct UMG_STD_Art_IconButton_C_UpdateText final
{
public:
	bool                                          HaveMainName;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewButtonName;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          HaveLabel;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewButtonLabel;                                    // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_UpdateText) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_UpdateText");
static_assert(sizeof(UMG_STD_Art_IconButton_C_UpdateText) == 0x000040, "Wrong size on UMG_STD_Art_IconButton_C_UpdateText");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateText, HaveMainName) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_UpdateText::HaveMainName' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateText, NewButtonName) == 0x000008, "Member 'UMG_STD_Art_IconButton_C_UpdateText::NewButtonName' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateText, HaveLabel) == 0x000020, "Member 'UMG_STD_Art_IconButton_C_UpdateText::HaveLabel' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateText, NewButtonLabel) == 0x000028, "Member 'UMG_STD_Art_IconButton_C_UpdateText::NewButtonLabel' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.UpdateIconOrIconMaterial
// 0x0040 (0x0040 - 0x0000)
struct UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       Material;                                          // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          ChangeOnlyTexture;                                 // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial");
static_assert(sizeof(UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial) == 0x000040, "Wrong size on UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial, Texture) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial::Texture' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial, Material) == 0x000008, "Member 'UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial::Material' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial, ChangeOnlyTexture) == 0x000030, "Member 'UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial::ChangeOnlyTexture' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'UMG_STD_Art_IconButton_C_UpdateIconOrIconMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.UpdateSize
// 0x0030 (0x0030 - 0x0000)
struct UMG_STD_Art_IconButton_C_UpdateSize final
{
public:
	struct FVector2D                              InVec;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_UpdateSize) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_UpdateSize");
static_assert(sizeof(UMG_STD_Art_IconButton_C_UpdateSize) == 0x000030, "Wrong size on UMG_STD_Art_IconButton_C_UpdateSize");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateSize, InVec) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_UpdateSize::InVec' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateSize, CallFunc_BreakVector2D_X) == 0x000008, "Member 'UMG_STD_Art_IconButton_C_UpdateSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateSize, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'UMG_STD_Art_IconButton_C_UpdateSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateSize, K2Node_MakeStruct_Margin) == 0x000010, "Member 'UMG_STD_Art_IconButton_C_UpdateSize::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateSize, CallFunc_FMin_ReturnValue) == 0x000020, "Member 'UMG_STD_Art_IconButton_C_UpdateSize::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateSize, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'UMG_STD_Art_IconButton_C_UpdateSize::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateSize, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000028, "Member 'UMG_STD_Art_IconButton_C_UpdateSize::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.UpdateBG_Material
// 0x0008 (0x0008 - 0x0000)
struct UMG_STD_Art_IconButton_C_UpdateBG_Material final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_UpdateBG_Material) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_UpdateBG_Material");
static_assert(sizeof(UMG_STD_Art_IconButton_C_UpdateBG_Material) == 0x000008, "Wrong size on UMG_STD_Art_IconButton_C_UpdateBG_Material");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateBG_Material, Material) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_UpdateBG_Material::Material' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.UpdateHaveIcon
// 0x0030 (0x0030 - 0x0000)
struct UMG_STD_Art_IconButton_C_UpdateHaveIcon final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateSizeRule                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateSizeRule                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateSizeRule                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x000C(0x0008)(NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_UpdateHaveIcon) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_UpdateHaveIcon");
static_assert(sizeof(UMG_STD_Art_IconButton_C_UpdateHaveIcon) == 0x000030, "Wrong size on UMG_STD_Art_IconButton_C_UpdateHaveIcon");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateHaveIcon, Condition) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_UpdateHaveIcon::Condition' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateHaveIcon, Temp_bool_Variable) == 0x000001, "Member 'UMG_STD_Art_IconButton_C_UpdateHaveIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateHaveIcon, Temp_byte_Variable) == 0x000002, "Member 'UMG_STD_Art_IconButton_C_UpdateHaveIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateHaveIcon, Temp_byte_Variable_1) == 0x000003, "Member 'UMG_STD_Art_IconButton_C_UpdateHaveIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateHaveIcon, K2Node_Select_Default) == 0x000004, "Member 'UMG_STD_Art_IconButton_C_UpdateHaveIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateHaveIcon, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'UMG_STD_Art_IconButton_C_UpdateHaveIcon::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateHaveIcon, K2Node_MakeStruct_SlateChildSize) == 0x00000C, "Member 'UMG_STD_Art_IconButton_C_UpdateHaveIcon::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateHaveIcon, K2Node_MakeStruct_Margin) == 0x000014, "Member 'UMG_STD_Art_IconButton_C_UpdateHaveIcon::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateHaveIcon, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000028, "Member 'UMG_STD_Art_IconButton_C_UpdateHaveIcon::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.UpdateMainText
// 0x0018 (0x0018 - 0x0000)
struct UMG_STD_Art_IconButton_C_UpdateMainText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_UpdateMainText) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_UpdateMainText");
static_assert(sizeof(UMG_STD_Art_IconButton_C_UpdateMainText) == 0x000018, "Wrong size on UMG_STD_Art_IconButton_C_UpdateMainText");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateMainText, InText) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_UpdateMainText::InText' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.UpdateLabelText
// 0x0018 (0x0018 - 0x0000)
struct UMG_STD_Art_IconButton_C_UpdateLabelText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_UpdateLabelText) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_UpdateLabelText");
static_assert(sizeof(UMG_STD_Art_IconButton_C_UpdateLabelText) == 0x000018, "Wrong size on UMG_STD_Art_IconButton_C_UpdateLabelText");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateLabelText, InText) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_UpdateLabelText::InText' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.UpdateWidget
// 0x0090 (0x0090 - 0x0000)
struct UMG_STD_Art_IconButton_C_UpdateWidget final
{
public:
	bool                                          ____FX_Text;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HaveName;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewButtonName;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          HaveLabel;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewButtonLabel;                                    // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ____FX_HaveIcon;                                   // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HaveIcon;                                          // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____FX_Icon;                                       // 0x0042(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               IconTexture;                                       // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       IconMaterial;                                      // 0x0050(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          ChangeOnlyTexture;                                 // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____FX_Size;                                       // 0x0079(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InVec;                                             // 0x007C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ____FX_BG_Mat;                                     // 0x0084(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     BG_Material;                                       // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_UpdateWidget) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_UpdateWidget");
static_assert(sizeof(UMG_STD_Art_IconButton_C_UpdateWidget) == 0x000090, "Wrong size on UMG_STD_Art_IconButton_C_UpdateWidget");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, ____FX_Text) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::____FX_Text' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, HaveName) == 0x000001, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::HaveName' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, NewButtonName) == 0x000008, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::NewButtonName' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, HaveLabel) == 0x000020, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::HaveLabel' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, NewButtonLabel) == 0x000028, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::NewButtonLabel' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, ____FX_HaveIcon) == 0x000040, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::____FX_HaveIcon' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, HaveIcon) == 0x000041, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::HaveIcon' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, ____FX_Icon) == 0x000042, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::____FX_Icon' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, IconTexture) == 0x000048, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::IconTexture' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, IconMaterial) == 0x000050, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::IconMaterial' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, ChangeOnlyTexture) == 0x000078, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::ChangeOnlyTexture' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, ____FX_Size) == 0x000079, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::____FX_Size' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, InVec) == 0x00007C, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::InVec' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, ____FX_BG_Mat) == 0x000084, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::____FX_BG_Mat' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_UpdateWidget, BG_Material) == 0x000088, "Member 'UMG_STD_Art_IconButton_C_UpdateWidget::BG_Material' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.GoTransparent
// 0x0010 (0x0010 - 0x0000)
struct UMG_STD_Art_IconButton_C_GoTransparent final
{
public:
	bool                                          GoTrans;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_GoTransparent) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_GoTransparent");
static_assert(sizeof(UMG_STD_Art_IconButton_C_GoTransparent) == 0x000010, "Wrong size on UMG_STD_Art_IconButton_C_GoTransparent");
static_assert(offsetof(UMG_STD_Art_IconButton_C_GoTransparent, GoTrans) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_GoTransparent::GoTrans' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_GoTransparent, Temp_bool_Variable) == 0x000001, "Member 'UMG_STD_Art_IconButton_C_GoTransparent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_GoTransparent, Temp_byte_Variable) == 0x000002, "Member 'UMG_STD_Art_IconButton_C_GoTransparent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_GoTransparent, Temp_byte_Variable_1) == 0x000003, "Member 'UMG_STD_Art_IconButton_C_GoTransparent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_GoTransparent, K2Node_Select_Default) == 0x000004, "Member 'UMG_STD_Art_IconButton_C_GoTransparent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_GoTransparent, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_STD_Art_IconButton_C_GoTransparent::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_STD_Art_IconButton.UMG_STD_Art_IconButton_C.Hover
// 0x0018 (0x0018 - 0x0000)
struct UMG_STD_Art_IconButton_C_Hover final
{
public:
	bool                                          bHover;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_STD_Art_IconButton_C_Hover) == 0x000008, "Wrong alignment on UMG_STD_Art_IconButton_C_Hover");
static_assert(sizeof(UMG_STD_Art_IconButton_C_Hover) == 0x000018, "Wrong size on UMG_STD_Art_IconButton_C_Hover");
static_assert(offsetof(UMG_STD_Art_IconButton_C_Hover, bHover) == 0x000000, "Member 'UMG_STD_Art_IconButton_C_Hover::bHover' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_Hover, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'UMG_STD_Art_IconButton_C_Hover::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_STD_Art_IconButton_C_Hover, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'UMG_STD_Art_IconButton_C_Hover::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

