#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Medal_Small

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_Medal_Small.UMG_Medal_Small_C.ExecuteUbergraph_UMG_Medal_Small
// 0x0014 (0x0014 - 0x0000)
struct UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
};
static_assert(alignof(UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small) == 0x000004, "Wrong alignment on UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small");
static_assert(sizeof(UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small) == 0x000014, "Wrong size on UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small");
static_assert(offsetof(UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small, EntryPoint) == 0x000000, "Member 'UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'UMG_Medal_Small_C_ExecuteUbergraph_UMG_Medal_Small::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function UMG_Medal_Small.UMG_Medal_Small_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_Medal_Small_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_Medal_Small_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UMG_Medal_Small_C_OnRemovedFromFocusPath");
static_assert(sizeof(UMG_Medal_Small_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UMG_Medal_Small_C_OnRemovedFromFocusPath");
static_assert(offsetof(UMG_Medal_Small_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_Medal_Small_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_Medal_Small.UMG_Medal_Small_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_Medal_Small_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_Medal_Small_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_Medal_Small_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_Medal_Small_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_Medal_Small_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_Medal_Small_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_Medal_Small_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_Medal_Small.UMG_Medal_Small_C.Init
// 0x0040 (0x0040 - 0x0000)
struct UMG_Medal_Small_C_Init final
{
public:
	struct FPBMedalDetailsDataTableRowBase        InMedalDetail;                                     // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_Medal_Small_C_Init) == 0x000008, "Wrong alignment on UMG_Medal_Small_C_Init");
static_assert(sizeof(UMG_Medal_Small_C_Init) == 0x000040, "Wrong size on UMG_Medal_Small_C_Init");
static_assert(offsetof(UMG_Medal_Small_C_Init, InMedalDetail) == 0x000000, "Member 'UMG_Medal_Small_C_Init::InMedalDetail' has a wrong offset!");

// Function UMG_Medal_Small.UMG_Medal_Small_C.RefreshMedalCount
// 0x0020 (0x0020 - 0x0000)
struct UMG_Medal_Small_C_RefreshMedalCount final
{
public:
	int32                                         InCount;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(UMG_Medal_Small_C_RefreshMedalCount) == 0x000008, "Wrong alignment on UMG_Medal_Small_C_RefreshMedalCount");
static_assert(sizeof(UMG_Medal_Small_C_RefreshMedalCount) == 0x000020, "Wrong size on UMG_Medal_Small_C_RefreshMedalCount");
static_assert(offsetof(UMG_Medal_Small_C_RefreshMedalCount, InCount) == 0x000000, "Member 'UMG_Medal_Small_C_RefreshMedalCount::InCount' has a wrong offset!");
static_assert(offsetof(UMG_Medal_Small_C_RefreshMedalCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_Medal_Small_C_RefreshMedalCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

