#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PropertyLevel

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_PropertyLevel.UMG_PropertyLevel_C
// 0x0038 (0x0298 - 0x0260)
class UUMG_PropertyLevel_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Level;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Level;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_TypeName;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TypeName;                                          // 0x0280(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_UMG_PropertyLevel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetLevelInfo(EPBCharacterPropertyLevel InLevel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_PropertyLevel_C">();
	}
	static class UUMG_PropertyLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_PropertyLevel_C>();
	}
};
static_assert(alignof(UUMG_PropertyLevel_C) == 0x000008, "Wrong alignment on UUMG_PropertyLevel_C");
static_assert(sizeof(UUMG_PropertyLevel_C) == 0x000298, "Wrong size on UUMG_PropertyLevel_C");
static_assert(offsetof(UUMG_PropertyLevel_C, UberGraphFrame) == 0x000260, "Member 'UUMG_PropertyLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_PropertyLevel_C, Image_Level) == 0x000268, "Member 'UUMG_PropertyLevel_C::Image_Level' has a wrong offset!");
static_assert(offsetof(UUMG_PropertyLevel_C, Text_Level) == 0x000270, "Member 'UUMG_PropertyLevel_C::Text_Level' has a wrong offset!");
static_assert(offsetof(UUMG_PropertyLevel_C, Text_TypeName) == 0x000278, "Member 'UUMG_PropertyLevel_C::Text_TypeName' has a wrong offset!");
static_assert(offsetof(UUMG_PropertyLevel_C, TypeName) == 0x000280, "Member 'UUMG_PropertyLevel_C::TypeName' has a wrong offset!");

}

