#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ChatMessageInfo_Widget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_ChatMessageInfo_Widget.UMG_ChatMessageInfo_Widget_C.Set Message Info
// 0x00B0 (0x00B0 - 0x0000)
struct UMG_ChatMessageInfo_Widget_C_Set_Message_Info final
{
public:
	class FString                                 InSenderName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InMsgBody;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InSendDate;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           InColor;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
};
static_assert(alignof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info) == 0x000008, "Wrong alignment on UMG_ChatMessageInfo_Widget_C_Set_Message_Info");
static_assert(sizeof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info) == 0x0000B0, "Wrong size on UMG_ChatMessageInfo_Widget_C_Set_Message_Info");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info, InSenderName) == 0x000000, "Member 'UMG_ChatMessageInfo_Widget_C_Set_Message_Info::InSenderName' has a wrong offset!");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info, InMsgBody) == 0x000010, "Member 'UMG_ChatMessageInfo_Widget_C_Set_Message_Info::InMsgBody' has a wrong offset!");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info, InSendDate) == 0x000020, "Member 'UMG_ChatMessageInfo_Widget_C_Set_Message_Info::InSendDate' has a wrong offset!");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info, InColor) == 0x000030, "Member 'UMG_ChatMessageInfo_Widget_C_Set_Message_Info::InColor' has a wrong offset!");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'UMG_ChatMessageInfo_Widget_C_Set_Message_Info::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'UMG_ChatMessageInfo_Widget_C_Set_Message_Info::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'UMG_ChatMessageInfo_Widget_C_Set_Message_Info::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'UMG_ChatMessageInfo_Widget_C_Set_Message_Info::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_Set_Message_Info, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'UMG_ChatMessageInfo_Widget_C_Set_Message_Info::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UMG_ChatMessageInfo_Widget.UMG_ChatMessageInfo_Widget_C.ShowSendFailedTip
// 0x0028 (0x0028 - 0x0000)
struct UMG_ChatMessageInfo_Widget_C_ShowSendFailedTip final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
};
static_assert(alignof(UMG_ChatMessageInfo_Widget_C_ShowSendFailedTip) == 0x000008, "Wrong alignment on UMG_ChatMessageInfo_Widget_C_ShowSendFailedTip");
static_assert(sizeof(UMG_ChatMessageInfo_Widget_C_ShowSendFailedTip) == 0x000028, "Wrong size on UMG_ChatMessageInfo_Widget_C_ShowSendFailedTip");
static_assert(offsetof(UMG_ChatMessageInfo_Widget_C_ShowSendFailedTip, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UMG_ChatMessageInfo_Widget_C_ShowSendFailedTip::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

