#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NotificationBanner

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_NotificationBanner.UMG_NotificationBanner_C.ExecuteUbergraph_UMG_NotificationBanner
// 0x0008 (0x0008 - 0x0000)
struct UMG_NotificationBanner_C_ExecuteUbergraph_UMG_NotificationBanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NotificationBanner_C_ExecuteUbergraph_UMG_NotificationBanner) == 0x000004, "Wrong alignment on UMG_NotificationBanner_C_ExecuteUbergraph_UMG_NotificationBanner");
static_assert(sizeof(UMG_NotificationBanner_C_ExecuteUbergraph_UMG_NotificationBanner) == 0x000008, "Wrong size on UMG_NotificationBanner_C_ExecuteUbergraph_UMG_NotificationBanner");
static_assert(offsetof(UMG_NotificationBanner_C_ExecuteUbergraph_UMG_NotificationBanner, EntryPoint) == 0x000000, "Member 'UMG_NotificationBanner_C_ExecuteUbergraph_UMG_NotificationBanner::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_NotificationBanner_C_ExecuteUbergraph_UMG_NotificationBanner, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_NotificationBanner_C_ExecuteUbergraph_UMG_NotificationBanner::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_NotificationBanner.UMG_NotificationBanner_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_NotificationBanner_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NotificationBanner_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_NotificationBanner_C_PreConstruct");
static_assert(sizeof(UMG_NotificationBanner_C_PreConstruct) == 0x000001, "Wrong size on UMG_NotificationBanner_C_PreConstruct");
static_assert(offsetof(UMG_NotificationBanner_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_NotificationBanner_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_NotificationBanner.UMG_NotificationBanner_C.RefreshInfo
// 0x0001 (0x0001 - 0x0000)
struct UMG_NotificationBanner_C_RefreshInfo final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NotificationBanner_C_RefreshInfo) == 0x000001, "Wrong alignment on UMG_NotificationBanner_C_RefreshInfo");
static_assert(sizeof(UMG_NotificationBanner_C_RefreshInfo) == 0x000001, "Wrong size on UMG_NotificationBanner_C_RefreshInfo");
static_assert(offsetof(UMG_NotificationBanner_C_RefreshInfo, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_NotificationBanner_C_RefreshInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_NotificationBanner.UMG_NotificationBanner_C.RefreshBannerStyle
// 0x0001 (0x0001 - 0x0000)
struct UMG_NotificationBanner_C_RefreshBannerStyle final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NotificationBanner_C_RefreshBannerStyle) == 0x000001, "Wrong alignment on UMG_NotificationBanner_C_RefreshBannerStyle");
static_assert(sizeof(UMG_NotificationBanner_C_RefreshBannerStyle) == 0x000001, "Wrong size on UMG_NotificationBanner_C_RefreshBannerStyle");
static_assert(offsetof(UMG_NotificationBanner_C_RefreshBannerStyle, bSelected) == 0x000000, "Member 'UMG_NotificationBanner_C_RefreshBannerStyle::bSelected' has a wrong offset!");

}

