#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_DashHint

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_HelmetHUD_DashHint.UMG_HelmetHUD_DashHint_C
// 0x0038 (0x0308 - 0x02D0)
class UUMG_HelmetHUD_DashHint_C final : public UPBHelmetHUD_Dash
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_UseThree;                                     // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_UseTwo;                                       // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_UseOne;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_UseTimes_1;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_UseTimes_2;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_UseTimes_3;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_HelmetHUD_DashHint(int32 EntryPoint);
	void K2_RefreshUseTimesInfo(bool bIsMinus);
	void RefreshUseTimesInfo(bool bIsMinus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_HelmetHUD_DashHint_C">();
	}
	static class UUMG_HelmetHUD_DashHint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_HelmetHUD_DashHint_C>();
	}
};
static_assert(alignof(UUMG_HelmetHUD_DashHint_C) == 0x000008, "Wrong alignment on UUMG_HelmetHUD_DashHint_C");
static_assert(sizeof(UUMG_HelmetHUD_DashHint_C) == 0x000308, "Wrong size on UUMG_HelmetHUD_DashHint_C");
static_assert(offsetof(UUMG_HelmetHUD_DashHint_C, UberGraphFrame) == 0x0002D0, "Member 'UUMG_HelmetHUD_DashHint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_DashHint_C, Anim_UseThree) == 0x0002D8, "Member 'UUMG_HelmetHUD_DashHint_C::Anim_UseThree' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_DashHint_C, Anim_UseTwo) == 0x0002E0, "Member 'UUMG_HelmetHUD_DashHint_C::Anim_UseTwo' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_DashHint_C, Anim_UseOne) == 0x0002E8, "Member 'UUMG_HelmetHUD_DashHint_C::Anim_UseOne' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_DashHint_C, Image_UseTimes_1) == 0x0002F0, "Member 'UUMG_HelmetHUD_DashHint_C::Image_UseTimes_1' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_DashHint_C, Image_UseTimes_2) == 0x0002F8, "Member 'UUMG_HelmetHUD_DashHint_C::Image_UseTimes_2' has a wrong offset!");
static_assert(offsetof(UUMG_HelmetHUD_DashHint_C, Image_UseTimes_3) == 0x000300, "Member 'UUMG_HelmetHUD_DashHint_C::Image_UseTimes_3' has a wrong offset!");

}

