#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MatchmakingRegions

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_MatchmakingRegions.UMG_MatchmakingRegions_C
// 0x0048 (0x0390 - 0x0348)
class UUMG_MatchmakingRegions_C final : public UPBMatchmakingRegionsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       QueryQos;                                          // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Flash;                                             // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_371;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_661;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_836;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      GridMatchmakingRegions;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_382;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Option_0;                                          // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Option_2;                                          // 0x0389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsInRefreshState;                                 // 0x038A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_MatchmakingRegions(int32 EntryPoint);
	void CustomEvent_0();
	void BP_OnActivated();
	void CustomEvent_1();
	void BndEvt__UMG_MatchmakingRegions_Button_371_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__UMG_MatchmakingRegions_Button_661_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__UMG_MatchmakingRegions_Button_836_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnInitialized();
	void OnButtonCancelConfirm(class FName MatchmakingRegionName);
	void OnButtonConfirm(class FName MatchmakingRegionName);
	void K2_RefreshMatchmakingRegions();
	void NotifyChoosingRegion();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_MatchmakingRegions_C">();
	}
	static class UUMG_MatchmakingRegions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_MatchmakingRegions_C>();
	}
};
static_assert(alignof(UUMG_MatchmakingRegions_C) == 0x000008, "Wrong alignment on UUMG_MatchmakingRegions_C");
static_assert(sizeof(UUMG_MatchmakingRegions_C) == 0x000390, "Wrong size on UUMG_MatchmakingRegions_C");
static_assert(offsetof(UUMG_MatchmakingRegions_C, UberGraphFrame) == 0x000348, "Member 'UUMG_MatchmakingRegions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, QueryQos) == 0x000350, "Member 'UUMG_MatchmakingRegions_C::QueryQos' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, Flash) == 0x000358, "Member 'UUMG_MatchmakingRegions_C::Flash' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, Button_371) == 0x000360, "Member 'UUMG_MatchmakingRegions_C::Button_371' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, Button_661) == 0x000368, "Member 'UUMG_MatchmakingRegions_C::Button_661' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, Button_836) == 0x000370, "Member 'UUMG_MatchmakingRegions_C::Button_836' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, GridMatchmakingRegions) == 0x000378, "Member 'UUMG_MatchmakingRegions_C::GridMatchmakingRegions' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, Image_382) == 0x000380, "Member 'UUMG_MatchmakingRegions_C::Image_382' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, Option_0) == 0x000388, "Member 'UUMG_MatchmakingRegions_C::Option_0' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, Option_2) == 0x000389, "Member 'UUMG_MatchmakingRegions_C::Option_2' has a wrong offset!");
static_assert(offsetof(UUMG_MatchmakingRegions_C, bIsInRefreshState) == 0x00038A, "Member 'UUMG_MatchmakingRegions_C::bIsInRefreshState' has a wrong offset!");

}

