#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EULA

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EULA.UMG_EULA_C
// 0x0048 (0x0380 - 0x0338)
class UUMG_EULA_C final : public UPBEULAWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_PrerequisiteButton_C*              Accept;                                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                AcceptBorder;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PrerequisiteButton_C*              Refuse;                                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ActionName;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ActionName_1;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_EULA;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_AdvancedScrollBox_C*               UMG_AdvancedScrollBox;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_EULA(int32 EntryPoint);
	void BndEvt__UMG_EULA_Accept_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UMG_EULA_Refuse_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void K2_DisplaySonySIEEText();
	void K2_DisplaySonySIEAText();
	void BndEvt__UMG_EULA_UMG_AdvancedScrollBox_K2Node_ComponentBoundEvent_4_OnScrollBy__DelegateSignature(float ScrollPercent);
	void Construct();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply On_AcceptBorder_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply On_AcceptBorder_MouseButtonUp_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EULA_C">();
	}
	static class UUMG_EULA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EULA_C>();
	}
};
static_assert(alignof(UUMG_EULA_C) == 0x000008, "Wrong alignment on UUMG_EULA_C");
static_assert(sizeof(UUMG_EULA_C) == 0x000380, "Wrong size on UUMG_EULA_C");
static_assert(offsetof(UUMG_EULA_C, UberGraphFrame) == 0x000338, "Member 'UUMG_EULA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EULA_C, Accept) == 0x000340, "Member 'UUMG_EULA_C::Accept' has a wrong offset!");
static_assert(offsetof(UUMG_EULA_C, AcceptBorder) == 0x000348, "Member 'UUMG_EULA_C::AcceptBorder' has a wrong offset!");
static_assert(offsetof(UUMG_EULA_C, Border_0) == 0x000350, "Member 'UUMG_EULA_C::Border_0' has a wrong offset!");
static_assert(offsetof(UUMG_EULA_C, Refuse) == 0x000358, "Member 'UUMG_EULA_C::Refuse' has a wrong offset!");
static_assert(offsetof(UUMG_EULA_C, Text_ActionName) == 0x000360, "Member 'UUMG_EULA_C::Text_ActionName' has a wrong offset!");
static_assert(offsetof(UUMG_EULA_C, Text_ActionName_1) == 0x000368, "Member 'UUMG_EULA_C::Text_ActionName_1' has a wrong offset!");
static_assert(offsetof(UUMG_EULA_C, TextBlock_EULA) == 0x000370, "Member 'UUMG_EULA_C::TextBlock_EULA' has a wrong offset!");
static_assert(offsetof(UUMG_EULA_C, UMG_AdvancedScrollBox) == 0x000378, "Member 'UUMG_EULA_C::UMG_AdvancedScrollBox' has a wrong offset!");

}

