#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Benchmark_Progress_Page

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_Benchmark_Progress_Page.UMG_Benchmark_Progress_Page_C.ExecuteUbergraph_UMG_Benchmark_Progress_Page
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bConfirm)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UPBLocalPlayer_BP_C*                    K2Node_DynamicCast_AsPBLocal_Player_BP;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConfirmInfo                           K2Node_MakeStruct_ConfirmInfo;                     // 0x0030(0x0078)(ContainsInstancedReference)
};
static_assert(alignof(UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page) == 0x000008, "Wrong alignment on UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page");
static_assert(sizeof(UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page) == 0x0000A8, "Wrong size on UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page, EntryPoint) == 0x000000, "Member 'UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000008, "Member 'UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page, K2Node_DynamicCast_AsPBLocal_Player_BP) == 0x000020, "Member 'UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page::K2Node_DynamicCast_AsPBLocal_Player_BP' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page, K2Node_MakeStruct_ConfirmInfo) == 0x000030, "Member 'UMG_Benchmark_Progress_Page_C_ExecuteUbergraph_UMG_Benchmark_Progress_Page::K2Node_MakeStruct_ConfirmInfo' has a wrong offset!");

// Function UMG_Benchmark_Progress_Page.UMG_Benchmark_Progress_Page_C.CancelBenchmark
// 0x0028 (0x0028 - 0x0000)
struct UMG_Benchmark_Progress_Page_C_CancelBenchmark final
{
public:
	bool                                          Confirm;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBB_BenchMarkHelper_C*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBGameInstance*                        K2Node_DynamicCast_AsPBGame_Instance;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Benchmark_Progress_Page_C_CancelBenchmark) == 0x000008, "Wrong alignment on UMG_Benchmark_Progress_Page_C_CancelBenchmark");
static_assert(sizeof(UMG_Benchmark_Progress_Page_C_CancelBenchmark) == 0x000028, "Wrong size on UMG_Benchmark_Progress_Page_C_CancelBenchmark");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_CancelBenchmark, Confirm) == 0x000000, "Member 'UMG_Benchmark_Progress_Page_C_CancelBenchmark::Confirm' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_CancelBenchmark, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_Benchmark_Progress_Page_C_CancelBenchmark::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_CancelBenchmark, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'UMG_Benchmark_Progress_Page_C_CancelBenchmark::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_CancelBenchmark, K2Node_DynamicCast_AsPBGame_Instance) == 0x000018, "Member 'UMG_Benchmark_Progress_Page_C_CancelBenchmark::K2Node_DynamicCast_AsPBGame_Instance' has a wrong offset!");
static_assert(offsetof(UMG_Benchmark_Progress_Page_C_CancelBenchmark, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UMG_Benchmark_Progress_Page_C_CancelBenchmark::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

