#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ShootingRangeWidget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ShootingRangeWidget.UMG_ShootingRangeWidget_C
// 0x0028 (0x0288 - 0x0260)
class UUMG_ShootingRangeWidget_C final : public UPBUserWidget
{
public:
	class UBottomTips_C*                          CSTMBackToMenu;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBottomTips_C*                          Setting;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ShootingOverlay;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHaveEnteredSettingPage;                           // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ShootingRangeWidget_C">();
	}
	static class UUMG_ShootingRangeWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ShootingRangeWidget_C>();
	}
};
static_assert(alignof(UUMG_ShootingRangeWidget_C) == 0x000008, "Wrong alignment on UUMG_ShootingRangeWidget_C");
static_assert(sizeof(UUMG_ShootingRangeWidget_C) == 0x000288, "Wrong size on UUMG_ShootingRangeWidget_C");
static_assert(offsetof(UUMG_ShootingRangeWidget_C, CSTMBackToMenu) == 0x000260, "Member 'UUMG_ShootingRangeWidget_C::CSTMBackToMenu' has a wrong offset!");
static_assert(offsetof(UUMG_ShootingRangeWidget_C, SafeZone_0) == 0x000268, "Member 'UUMG_ShootingRangeWidget_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UUMG_ShootingRangeWidget_C, Setting) == 0x000270, "Member 'UUMG_ShootingRangeWidget_C::Setting' has a wrong offset!");
static_assert(offsetof(UUMG_ShootingRangeWidget_C, ShootingOverlay) == 0x000278, "Member 'UUMG_ShootingRangeWidget_C::ShootingOverlay' has a wrong offset!");
static_assert(offsetof(UUMG_ShootingRangeWidget_C, bHaveEnteredSettingPage) == 0x000280, "Member 'UUMG_ShootingRangeWidget_C::bHaveEnteredSettingPage' has a wrong offset!");

}

