#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameUpgradePage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_EndGameUpgradePage.UMG_EndGameUpgradePage_C.ExecuteUbergraph_UMG_EndGameUpgradePage
// 0x01D0 (0x01D0 - 0x0000)
struct UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00E8(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0108(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0120(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0138(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0150(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0170(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x0188(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_7;             // 0x01A8(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage) == 0x000008, "Wrong alignment on UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage");
static_assert(sizeof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage) == 0x0001D0, "Wrong size on UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, EntryPoint) == 0x000000, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, K2Node_MakeArray_Array) == 0x0000B0, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, K2Node_MakeArray_Array_1) == 0x0000C0, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Format_ReturnValue_1) == 0x0000E8, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000108, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000120, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000138, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000150, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Add_IntInt_ReturnValue_1) == 0x000168, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000170, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Conv_IntToText_ReturnValue_6) == 0x000188, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001A0, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_Conv_IntToText_ReturnValue_7) == 0x0001A8, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_Conv_IntToText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_PlayAnimation_ReturnValue) == 0x0001C0, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001C8, "Member 'UMG_EndGameUpgradePage_C_ExecuteUbergraph_UMG_EndGameUpgradePage::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function UMG_EndGameUpgradePage.UMG_EndGameUpgradePage_C.RefreshCharacterList
// 0x0060 (0x0060 - 0x0000)
struct UMG_EndGameUpgradePage_C_RefreshCharacterList final
{
public:
	class UUMG_EndGameOperatorCard_C*             CharacterCard;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_EndGameOperatorCard_C*             CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EndGameUpgradePage_C_RefreshCharacterList) == 0x000008, "Wrong alignment on UMG_EndGameUpgradePage_C_RefreshCharacterList");
static_assert(sizeof(UMG_EndGameUpgradePage_C_RefreshCharacterList) == 0x000060, "Wrong size on UMG_EndGameUpgradePage_C_RefreshCharacterList");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, CharacterCard) == 0x000000, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::CharacterCard' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, CallFunc_Array_Get_Item) == 0x000014, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000028, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, CallFunc_Create_ReturnValue) == 0x000048, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshCharacterList, K2Node_MakeStruct_Margin) == 0x000050, "Member 'UMG_EndGameUpgradePage_C_RefreshCharacterList::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function UMG_EndGameUpgradePage.UMG_EndGameUpgradePage_C.Refresh Level Reward
// 0x0080 (0x0080 - 0x0000)
struct UMG_EndGameUpgradePage_C_Refresh_Level_Reward final
{
public:
	TArray<struct FPBProgressionItem>             ProgressionItemArray;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UPBScrollBox*                           LevelRewardBox;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBProgressionRewardItemStatus                InStatus;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBProgressionItem                     CallFunc_Array_Get_Item;                           // 0x0024(0x000C)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UScaleBox*                              CallFunc_SpawnObject_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         CallFunc_SlotAsScrollBoxSlot_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward) == 0x000008, "Wrong alignment on UMG_EndGameUpgradePage_C_Refresh_Level_Reward");
static_assert(sizeof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward) == 0x000080, "Wrong size on UMG_EndGameUpgradePage_C_Refresh_Level_Reward");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, ProgressionItemArray) == 0x000000, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::ProgressionItemArray' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, LevelRewardBox) == 0x000010, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::LevelRewardBox' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, InStatus) == 0x000018, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::InStatus' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, Temp_int_Array_Index_Variable) == 0x000020, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_Array_Get_Item) == 0x000024, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_Create_ReturnValue) == 0x000040, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, K2Node_MakeStruct_Margin) == 0x000050, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_SpawnObject_ReturnValue) == 0x000060, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_SlotAsScrollBoxSlot_ReturnValue) == 0x000068, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_SlotAsScrollBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_AddChild_ReturnValue) == 0x000070, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_Refresh_Level_Reward, CallFunc_AddChild_ReturnValue_1) == 0x000078, "Member 'UMG_EndGameUpgradePage_C_Refresh_Level_Reward::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function UMG_EndGameUpgradePage.UMG_EndGameUpgradePage_C.RefreshInfo
// 0x0008 (0x0008 - 0x0000)
struct UMG_EndGameUpgradePage_C_RefreshInfo final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EndGameUpgradePage_C_RefreshInfo) == 0x000004, "Wrong alignment on UMG_EndGameUpgradePage_C_RefreshInfo");
static_assert(sizeof(UMG_EndGameUpgradePage_C_RefreshInfo) == 0x000008, "Wrong size on UMG_EndGameUpgradePage_C_RefreshInfo");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshInfo, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'UMG_EndGameUpgradePage_C_RefreshInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EndGameUpgradePage_C_RefreshInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'UMG_EndGameUpgradePage_C_RefreshInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

