#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_QuestInfoSeasonEXP

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_QuestInfoSeasonEXP.UMG_QuestInfoSeasonEXP_C.ExecuteUbergraph_UMG_QuestInfoSeasonEXP
// 0x0004 (0x0004 - 0x0000)
struct UMG_QuestInfoSeasonEXP_C_ExecuteUbergraph_UMG_QuestInfoSeasonEXP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_QuestInfoSeasonEXP_C_ExecuteUbergraph_UMG_QuestInfoSeasonEXP) == 0x000004, "Wrong alignment on UMG_QuestInfoSeasonEXP_C_ExecuteUbergraph_UMG_QuestInfoSeasonEXP");
static_assert(sizeof(UMG_QuestInfoSeasonEXP_C_ExecuteUbergraph_UMG_QuestInfoSeasonEXP) == 0x000004, "Wrong size on UMG_QuestInfoSeasonEXP_C_ExecuteUbergraph_UMG_QuestInfoSeasonEXP");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_ExecuteUbergraph_UMG_QuestInfoSeasonEXP, EntryPoint) == 0x000000, "Member 'UMG_QuestInfoSeasonEXP_C_ExecuteUbergraph_UMG_QuestInfoSeasonEXP::EntryPoint' has a wrong offset!");

// Function UMG_QuestInfoSeasonEXP.UMG_QuestInfoSeasonEXP_C.RefreshInfo
// 0x00B0 (0x00B0 - 0x0000)
struct UMG_QuestInfoSeasonEXP_C_RefreshInfo final
{
public:
	class FString                                 InActivityID;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   InQuestID;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExpPoint;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBQuestModuleState                           QuestState;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             QuestStateTexture;                                 // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBQuestManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActivityEventCompletedCount_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0058(0x0018)()
	class UPBQuestManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBQuest*                               CallFunc_GetQuest_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0098(0x0018)()
};
static_assert(alignof(UMG_QuestInfoSeasonEXP_C_RefreshInfo) == 0x000008, "Wrong alignment on UMG_QuestInfoSeasonEXP_C_RefreshInfo");
static_assert(sizeof(UMG_QuestInfoSeasonEXP_C_RefreshInfo) == 0x0000B0, "Wrong size on UMG_QuestInfoSeasonEXP_C_RefreshInfo");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, InActivityID) == 0x000000, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::InActivityID' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, InQuestID) == 0x000010, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::InQuestID' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, ExpPoint) == 0x000018, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::ExpPoint' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, QuestState) == 0x00001C, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::QuestState' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, QuestStateTexture) == 0x000020, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::QuestStateTexture' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_GetActivityEventCompletedCount_ReturnValue) == 0x000030, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_GetActivityEventCompletedCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000034, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000058, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000070, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_GetQuest_ReturnValue) == 0x000078, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_GetQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000088, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x00008C, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000090, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_QuestInfoSeasonEXP_C_RefreshInfo, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000098, "Member 'UMG_QuestInfoSeasonEXP_C_RefreshInfo::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");

}

