#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PromptSetting

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_PromptSetting.UMG_PromptSetting_C
// 0x0038 (0x0358 - 0x0320)
class UUMG_PromptSetting_C final : public UPBCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ButtonChooseRegion;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonFeedBack;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonFriend;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonSetting;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_FeedBack;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_PromptSetting(int32 EntryPoint);
	void BndEvt__UMG_PromptSetting_ButtonFeedBack_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BP_OnActivated();
	void BndEvt__UMG_PromptSetting_ButtonLeavyParty_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UMG_PromptSetting_ButtonFriend_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TestPrompt_ButtonSetting_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TestPrompt_ButtonFriend_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_PromptSetting_C">();
	}
	static class UUMG_PromptSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_PromptSetting_C>();
	}
};
static_assert(alignof(UUMG_PromptSetting_C) == 0x000008, "Wrong alignment on UUMG_PromptSetting_C");
static_assert(sizeof(UUMG_PromptSetting_C) == 0x000358, "Wrong size on UUMG_PromptSetting_C");
static_assert(offsetof(UUMG_PromptSetting_C, UberGraphFrame) == 0x000320, "Member 'UUMG_PromptSetting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_PromptSetting_C, ButtonChooseRegion) == 0x000328, "Member 'UUMG_PromptSetting_C::ButtonChooseRegion' has a wrong offset!");
static_assert(offsetof(UUMG_PromptSetting_C, ButtonFeedBack) == 0x000330, "Member 'UUMG_PromptSetting_C::ButtonFeedBack' has a wrong offset!");
static_assert(offsetof(UUMG_PromptSetting_C, ButtonFriend) == 0x000338, "Member 'UUMG_PromptSetting_C::ButtonFriend' has a wrong offset!");
static_assert(offsetof(UUMG_PromptSetting_C, ButtonSetting) == 0x000340, "Member 'UUMG_PromptSetting_C::ButtonSetting' has a wrong offset!");
static_assert(offsetof(UUMG_PromptSetting_C, SizeBox) == 0x000348, "Member 'UUMG_PromptSetting_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UUMG_PromptSetting_C, SizeBox_FeedBack) == 0x000350, "Member 'UUMG_PromptSetting_C::SizeBox_FeedBack' has a wrong offset!");

}

