#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Assignment

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Assignment.UMG_Assignment_C
// 0x0090 (0x03C8 - 0x0338)
class UUMG_Assignment_C final : public UPBAssignmentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Zoom;                                              // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_PartyMemberTip;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_background;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_cover;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        LoadingMask;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_98;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_GameModes;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Squads;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_AssignmentActionTeam_C*            Team_0;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_AssignmentActionTeam_C*            Team_1;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SelectModeName;                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SelectModePlot;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MatchmakingRegionList_C*           UMG_MatchmakingRegionList;                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_ModeFilter;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDateTime                              LastUpdatePlaylistTime;                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EPBPlayListType InPlayListType)> StartMatch;                                        // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_Assignment(int32 EntryPoint);
	void K2_OnPlaylistUpdated(bool bWasSuccessful, const TArray<struct FPBPlaylistItemData>& Datas);
	void BP_OnActivated();
	void K2_OnLobbyTimeOut();
	void K2_BecomePartyMember();
	void K2_BecomePartyLeader();
	void K2_ResetAssigment();
	void K2_OnMatchmakingStatusChange(const EPBMatchmakingStatus& InMatchmakingStatusd);
	void K2_RefreshModeFilter();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void RefreshAssigment(const class FText& SelectModeName, const class FText& SelectModePlot, class UTexture2D* SelectModePlotTexture);
	bool BP_OnHandleBackAction();
	void SetPartyStatus();
	void UpdatePlaylist();
	void HandlePlaylistItemHover(class UUMG_PlaylistItem_C* PlaylistItem);
	void IsNowInTimeRange(bool bHasStartTime, const struct FDateTime& StartTime, bool bHasEndTime, const struct FDateTime& EndTime, bool* bIsInRange);

	class UWidget* BP_GetDesiredFocusTarget() const;
	class UUMG_PlaylistItem_C* FindFocusMode() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Assignment_C">();
	}
	static class UUMG_Assignment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Assignment_C>();
	}
};
static_assert(alignof(UUMG_Assignment_C) == 0x000008, "Wrong alignment on UUMG_Assignment_C");
static_assert(sizeof(UUMG_Assignment_C) == 0x0003C8, "Wrong size on UUMG_Assignment_C");
static_assert(offsetof(UUMG_Assignment_C, UberGraphFrame) == 0x000338, "Member 'UUMG_Assignment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, Zoom) == 0x000340, "Member 'UUMG_Assignment_C::Zoom' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, Border_PartyMemberTip) == 0x000348, "Member 'UUMG_Assignment_C::Border_PartyMemberTip' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, Image_background) == 0x000350, "Member 'UUMG_Assignment_C::Image_background' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, Image_cover) == 0x000358, "Member 'UUMG_Assignment_C::Image_cover' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, LoadingMask) == 0x000360, "Member 'UUMG_Assignment_C::LoadingMask' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, SafeZone_98) == 0x000368, "Member 'UUMG_Assignment_C::SafeZone_98' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, ScrollBox_GameModes) == 0x000370, "Member 'UUMG_Assignment_C::ScrollBox_GameModes' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, SizeBox_Squads) == 0x000378, "Member 'UUMG_Assignment_C::SizeBox_Squads' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, Team_0) == 0x000380, "Member 'UUMG_Assignment_C::Team_0' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, Team_1) == 0x000388, "Member 'UUMG_Assignment_C::Team_1' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, TextBlock_SelectModeName) == 0x000390, "Member 'UUMG_Assignment_C::TextBlock_SelectModeName' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, TextBlock_SelectModePlot) == 0x000398, "Member 'UUMG_Assignment_C::TextBlock_SelectModePlot' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, UMG_MatchmakingRegionList) == 0x0003A0, "Member 'UUMG_Assignment_C::UMG_MatchmakingRegionList' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, WrapBox_ModeFilter) == 0x0003A8, "Member 'UUMG_Assignment_C::WrapBox_ModeFilter' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, LastUpdatePlaylistTime) == 0x0003B0, "Member 'UUMG_Assignment_C::LastUpdatePlaylistTime' has a wrong offset!");
static_assert(offsetof(UUMG_Assignment_C, StartMatch) == 0x0003B8, "Member 'UUMG_Assignment_C::StartMatch' has a wrong offset!");

}

