#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PartyMemberInMatchmaking

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UMG_PartyMemberInMatchmaking.UMG_PartyMemberInMatchmaking_C.ExecuteUbergraph_UMG_PartyMemberInMatchmaking
// 0x0040 (0x0040 - 0x0000)
struct UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking) == 0x000004, "Wrong alignment on UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking");
static_assert(sizeof(UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking) == 0x000040, "Wrong size on UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking, EntryPoint) == 0x000000, "Member 'UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking, K2Node_Event_MyGeometry) == 0x000004, "Member 'UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'UMG_PartyMemberInMatchmaking_C_ExecuteUbergraph_UMG_PartyMemberInMatchmaking::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function UMG_PartyMemberInMatchmaking.UMG_PartyMemberInMatchmaking_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_PartyMemberInMatchmaking_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyMemberInMatchmaking_C_Tick) == 0x000004, "Wrong alignment on UMG_PartyMemberInMatchmaking_C_Tick");
static_assert(sizeof(UMG_PartyMemberInMatchmaking_C_Tick) == 0x00003C, "Wrong size on UMG_PartyMemberInMatchmaking_C_Tick");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_PartyMemberInMatchmaking_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_PartyMemberInMatchmaking_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_PartyMemberInMatchmaking.UMG_PartyMemberInMatchmaking_C.UpdateTime
// 0x00C0 (0x00C0 - 0x0000)
struct UMG_PartyMemberInMatchmaking_C_UpdateTime final
{
public:
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyMemberInMatchmaking_C_UpdateTime) == 0x000008, "Wrong alignment on UMG_PartyMemberInMatchmaking_C_UpdateTime");
static_assert(sizeof(UMG_PartyMemberInMatchmaking_C_UpdateTime) == 0x0000C0, "Wrong size on UMG_PartyMemberInMatchmaking_C_UpdateTime");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Less_IntInt_ReturnValue) == 0x000000, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Less_IntInt_ReturnValue_1) == 0x000030, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Percent_IntInt_ReturnValue) == 0x000060, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000068, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000088, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A0, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Divide_IntInt_ReturnValue) == 0x0000B8, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_UpdateTime, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'UMG_PartyMemberInMatchmaking_C_UpdateTime::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_PartyMemberInMatchmaking.UMG_PartyMemberInMatchmaking_C.StartTimer
// 0x0028 (0x0028 - 0x0000)
struct UMG_PartyMemberInMatchmaking_C_StartTimer final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PartyMemberInMatchmaking_C_StartTimer) == 0x000008, "Wrong alignment on UMG_PartyMemberInMatchmaking_C_StartTimer");
static_assert(sizeof(UMG_PartyMemberInMatchmaking_C_StartTimer) == 0x000028, "Wrong size on UMG_PartyMemberInMatchmaking_C_StartTimer");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_StartTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UMG_PartyMemberInMatchmaking_C_StartTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_StartTimer, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'UMG_PartyMemberInMatchmaking_C_StartTimer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_StartTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'UMG_PartyMemberInMatchmaking_C_StartTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_StartTimer, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'UMG_PartyMemberInMatchmaking_C_StartTimer::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function UMG_PartyMemberInMatchmaking.UMG_PartyMemberInMatchmaking_C.Reset Widget
// 0x0001 (0x0001 - 0x0000)
struct UMG_PartyMemberInMatchmaking_C_Reset_Widget final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PartyMemberInMatchmaking_C_Reset_Widget) == 0x000001, "Wrong alignment on UMG_PartyMemberInMatchmaking_C_Reset_Widget");
static_assert(sizeof(UMG_PartyMemberInMatchmaking_C_Reset_Widget) == 0x000001, "Wrong size on UMG_PartyMemberInMatchmaking_C_Reset_Widget");
static_assert(offsetof(UMG_PartyMemberInMatchmaking_C_Reset_Widget, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'UMG_PartyMemberInMatchmaking_C_Reset_Widget::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

}

