#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Message_General

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_Message_General.UMG_Message_General_C.ExecuteUbergraph_UMG_Message_General
// 0x0078 (0x0078 - 0x0000)
struct UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0050(0x0018)()
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General) == 0x000008, "Wrong alignment on UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General");
static_assert(sizeof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General) == 0x000078, "Wrong size on UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General");
static_assert(offsetof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General, EntryPoint) == 0x000000, "Member 'UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General, K2Node_Event_MyGeometry) == 0x000014, "Member 'UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General, CallFunc_TextToUpper_ReturnValue) == 0x000050, "Member 'UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000068, "Member 'UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General, K2Node_Event_IsDesignTime) == 0x00006C, "Member 'UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'UMG_Message_General_C_ExecuteUbergraph_UMG_Message_General::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function UMG_Message_General.UMG_Message_General_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_Message_General_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Message_General_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_Message_General_C_PreConstruct");
static_assert(sizeof(UMG_Message_General_C_PreConstruct) == 0x000001, "Wrong size on UMG_Message_General_C_PreConstruct");
static_assert(offsetof(UMG_Message_General_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_Message_General_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_Message_General.UMG_Message_General_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_Message_General_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Message_General_C_Tick) == 0x000004, "Wrong alignment on UMG_Message_General_C_Tick");
static_assert(sizeof(UMG_Message_General_C_Tick) == 0x00003C, "Wrong size on UMG_Message_General_C_Tick");
static_assert(offsetof(UMG_Message_General_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_Message_General_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_Message_General_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_Message_General_C_Tick::InDeltaTime' has a wrong offset!");

}

