#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_WaterMarkGroup

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_WaterMarkGroup.UMG_WaterMarkGroup_C
// 0x0018 (0x0278 - 0x0260)
class UUMG_WaterMarkGroup_C final : public UUserWidget
{
public:
	class UTextBlock*                             SteamTextID;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerID_2;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Version_2;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetContent(const class FText& PlayerId, const class FText& SteamID, const class FText& Version);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_WaterMarkGroup_C">();
	}
	static class UUMG_WaterMarkGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_WaterMarkGroup_C>();
	}
};
static_assert(alignof(UUMG_WaterMarkGroup_C) == 0x000008, "Wrong alignment on UUMG_WaterMarkGroup_C");
static_assert(sizeof(UUMG_WaterMarkGroup_C) == 0x000278, "Wrong size on UUMG_WaterMarkGroup_C");
static_assert(offsetof(UUMG_WaterMarkGroup_C, SteamTextID) == 0x000260, "Member 'UUMG_WaterMarkGroup_C::SteamTextID' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMarkGroup_C, Text_PlayerID_2) == 0x000268, "Member 'UUMG_WaterMarkGroup_C::Text_PlayerID_2' has a wrong offset!");
static_assert(offsetof(UUMG_WaterMarkGroup_C, Version_2) == 0x000270, "Member 'UUMG_WaterMarkGroup_C::Version_2' has a wrong offset!");

}

