#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ProgressionOperatorCard

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ProgressionOperatorCard.UMG_ProgressionOperatorCard_C
// 0x0098 (0x0360 - 0x02C8)
class UUMG_ProgressionOperatorCard_C final : public UPBProgressionOperatorCardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Active;                                            // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_BG;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Btn;                                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ExpProgressBar;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LevelTextSwitcher;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Operator;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OperatorDutyNameText;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OperatorIcon;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OperatorNameText;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_477;                                     // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_683;                                     // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Level;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_LevelTitle;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UUMG_ProgressionOperatorCard_C* Widget)> OnSelectedEvent;                                   // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         FontSize01;                                        // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         FontSize02;                                        // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ProgressionOperatorCard(int32 EntryPoint);
	void BndEvt__UMG_ProgressionOperatorCard_Btn_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ProgressionOperatorCard_Btn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__UMG_ProgressionOperatorCard_Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void K2_UpdateOperatorCard();
	void PreConstruct(bool IsDesignTime);
	void OnLoaded_F18141214C53884CB5FBAB81089011CE(class UObject* Loaded);
	void ActiveWidget();
	void SelectWidget();
	void UnselectWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ProgressionOperatorCard_C">();
	}
	static class UUMG_ProgressionOperatorCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ProgressionOperatorCard_C>();
	}
};
static_assert(alignof(UUMG_ProgressionOperatorCard_C) == 0x000008, "Wrong alignment on UUMG_ProgressionOperatorCard_C");
static_assert(sizeof(UUMG_ProgressionOperatorCard_C) == 0x000360, "Wrong size on UUMG_ProgressionOperatorCard_C");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, UberGraphFrame) == 0x0002C8, "Member 'UUMG_ProgressionOperatorCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, Active) == 0x0002D0, "Member 'UUMG_ProgressionOperatorCard_C::Active' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, Border_BG) == 0x0002D8, "Member 'UUMG_ProgressionOperatorCard_C::Border_BG' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, Btn) == 0x0002E0, "Member 'UUMG_ProgressionOperatorCard_C::Btn' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, ExpProgressBar) == 0x0002E8, "Member 'UUMG_ProgressionOperatorCard_C::ExpProgressBar' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, Image_112) == 0x0002F0, "Member 'UUMG_ProgressionOperatorCard_C::Image_112' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, LevelTextSwitcher) == 0x0002F8, "Member 'UUMG_ProgressionOperatorCard_C::LevelTextSwitcher' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, Operator) == 0x000300, "Member 'UUMG_ProgressionOperatorCard_C::Operator' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, OperatorDutyNameText) == 0x000308, "Member 'UUMG_ProgressionOperatorCard_C::OperatorDutyNameText' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, OperatorIcon) == 0x000310, "Member 'UUMG_ProgressionOperatorCard_C::OperatorIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, OperatorNameText) == 0x000318, "Member 'UUMG_ProgressionOperatorCard_C::OperatorNameText' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, TextBlock_477) == 0x000320, "Member 'UUMG_ProgressionOperatorCard_C::TextBlock_477' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, TextBlock_683) == 0x000328, "Member 'UUMG_ProgressionOperatorCard_C::TextBlock_683' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, TextBlock_Level) == 0x000330, "Member 'UUMG_ProgressionOperatorCard_C::TextBlock_Level' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, TextBlock_LevelTitle) == 0x000338, "Member 'UUMG_ProgressionOperatorCard_C::TextBlock_LevelTitle' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, bIsSelected) == 0x000340, "Member 'UUMG_ProgressionOperatorCard_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, OnSelectedEvent) == 0x000348, "Member 'UUMG_ProgressionOperatorCard_C::OnSelectedEvent' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, FontSize01) == 0x000358, "Member 'UUMG_ProgressionOperatorCard_C::FontSize01' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionOperatorCard_C, FontSize02) == 0x00035C, "Member 'UUMG_ProgressionOperatorCard_C::FontSize02' has a wrong offset!");

}

