#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NewItemPage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_NewItemPage.UMG_NewItemPage_C
// 0x0058 (0x0398 - 0x0340)
class UUMG_NewItemPage_C final : public UPBNewItemPageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Close;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ItemList;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBInputTipsImage*                      PBInputTipsImage_74;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem;                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ProgressionRewardItem_C*           UMG_ProgressionRewardItem_1;                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Text_C*                        UMG_STD_Text;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_NewItemPage(int32 EntryPoint);
	void K2_RestoreFocus();
	void BndEvt__UMG_NewItemPage_Button_Close_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void K2_RefreshNewItemList();
	void Construct();
	void RefreshItemList();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void InitializeFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_NewItemPage_C">();
	}
	static class UUMG_NewItemPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_NewItemPage_C>();
	}
};
static_assert(alignof(UUMG_NewItemPage_C) == 0x000008, "Wrong alignment on UUMG_NewItemPage_C");
static_assert(sizeof(UUMG_NewItemPage_C) == 0x000398, "Wrong size on UUMG_NewItemPage_C");
static_assert(offsetof(UUMG_NewItemPage_C, UberGraphFrame) == 0x000340, "Member 'UUMG_NewItemPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, Button_Close) == 0x000348, "Member 'UUMG_NewItemPage_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, HorizontalBox_ItemList) == 0x000350, "Member 'UUMG_NewItemPage_C::HorizontalBox_ItemList' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, Image) == 0x000358, "Member 'UUMG_NewItemPage_C::Image' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, Image_1) == 0x000360, "Member 'UUMG_NewItemPage_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, Image_68) == 0x000368, "Member 'UUMG_NewItemPage_C::Image_68' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, Image_Line) == 0x000370, "Member 'UUMG_NewItemPage_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, PBInputTipsImage_74) == 0x000378, "Member 'UUMG_NewItemPage_C::PBInputTipsImage_74' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, UMG_ProgressionRewardItem) == 0x000380, "Member 'UUMG_NewItemPage_C::UMG_ProgressionRewardItem' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, UMG_ProgressionRewardItem_1) == 0x000388, "Member 'UUMG_NewItemPage_C::UMG_ProgressionRewardItem_1' has a wrong offset!");
static_assert(offsetof(UUMG_NewItemPage_C, UMG_STD_Text) == 0x000390, "Member 'UUMG_NewItemPage_C::UMG_STD_Text' has a wrong offset!");

}

