#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_VoiceMessageTips

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_VoiceMessageTips.UMG_VoiceMessageTips_C.RemoveASpeaker
// 0x0020 (0x0020 - 0x0000)
struct UMG_VoiceMessageTips_C_RemoveASpeaker final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UUMG_VoiceTips_C*                       CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_VoiceMessageTips_C_RemoveASpeaker) == 0x000008, "Wrong alignment on UMG_VoiceMessageTips_C_RemoveASpeaker");
static_assert(sizeof(UMG_VoiceMessageTips_C_RemoveASpeaker) == 0x000020, "Wrong size on UMG_VoiceMessageTips_C_RemoveASpeaker");
static_assert(offsetof(UMG_VoiceMessageTips_C_RemoveASpeaker, PlayerName) == 0x000000, "Member 'UMG_VoiceMessageTips_C_RemoveASpeaker::PlayerName' has a wrong offset!");
static_assert(offsetof(UMG_VoiceMessageTips_C_RemoveASpeaker, CallFunc_Map_Find_Value) == 0x000010, "Member 'UMG_VoiceMessageTips_C_RemoveASpeaker::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_VoiceMessageTips_C_RemoveASpeaker, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'UMG_VoiceMessageTips_C_RemoveASpeaker::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoiceMessageTips_C_RemoveASpeaker, CallFunc_RemoveChild_ReturnValue) == 0x000019, "Member 'UMG_VoiceMessageTips_C_RemoveASpeaker::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function UMG_VoiceMessageTips.UMG_VoiceMessageTips_C.AddASpeaker
// 0x0038 (0x0038 - 0x0000)
struct UMG_VoiceMessageTips_C_AddASpeaker final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	class UUMG_VoiceTips_C*                       CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_VoiceTips_C*                       CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoiceMessageTips_C_AddASpeaker) == 0x000008, "Wrong alignment on UMG_VoiceMessageTips_C_AddASpeaker");
static_assert(sizeof(UMG_VoiceMessageTips_C_AddASpeaker) == 0x000038, "Wrong size on UMG_VoiceMessageTips_C_AddASpeaker");
static_assert(offsetof(UMG_VoiceMessageTips_C_AddASpeaker, PlayerName) == 0x000000, "Member 'UMG_VoiceMessageTips_C_AddASpeaker::PlayerName' has a wrong offset!");
static_assert(offsetof(UMG_VoiceMessageTips_C_AddASpeaker, CallFunc_Map_Find_Value) == 0x000010, "Member 'UMG_VoiceMessageTips_C_AddASpeaker::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_VoiceMessageTips_C_AddASpeaker, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'UMG_VoiceMessageTips_C_AddASpeaker::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoiceMessageTips_C_AddASpeaker, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'UMG_VoiceMessageTips_C_AddASpeaker::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoiceMessageTips_C_AddASpeaker, CallFunc_Create_ReturnValue) == 0x000028, "Member 'UMG_VoiceMessageTips_C_AddASpeaker::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoiceMessageTips_C_AddASpeaker, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000030, "Member 'UMG_VoiceMessageTips_C_AddASpeaker::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

}

