#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_PartyMemberList_Widget

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_PartyMemberList_Widget.UMG_PartyMemberList_Widget_C
// 0x0030 (0x0360 - 0x0330)
class UUMG_PartyMemberList_Widget_C final : public UPBPartyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBFlippingBook*                        PBFlippingBook_Party;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Blank;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LeaveParty_Widget_C*               UMG_LeaveParty_Widget;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPartyRefreshed;                                  // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UMG_PartyMemberList_Widget(int32 EntryPoint);
	void K2_OnPartyRefreshed(const TArray<class UPBUserObject*>& InPartyMemberObjects);
	void BndEvt__UMG_PartyMemberList_Widget_UMG_LeaveParty_Widget_K2Node_ComponentBoundEvent_1_OnLeavePartyButtonClicked__DelegateSignature();
	void RefreshPartyInfo();
	void SetDefaultFocus();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_PartyMemberList_Widget_C">();
	}
	static class UUMG_PartyMemberList_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_PartyMemberList_Widget_C>();
	}
};
static_assert(alignof(UUMG_PartyMemberList_Widget_C) == 0x000008, "Wrong alignment on UUMG_PartyMemberList_Widget_C");
static_assert(sizeof(UUMG_PartyMemberList_Widget_C) == 0x000360, "Wrong size on UUMG_PartyMemberList_Widget_C");
static_assert(offsetof(UUMG_PartyMemberList_Widget_C, UberGraphFrame) == 0x000330, "Member 'UUMG_PartyMemberList_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMemberList_Widget_C, PBFlippingBook_Party) == 0x000338, "Member 'UUMG_PartyMemberList_Widget_C::PBFlippingBook_Party' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMemberList_Widget_C, TextBlock_Blank) == 0x000340, "Member 'UUMG_PartyMemberList_Widget_C::TextBlock_Blank' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMemberList_Widget_C, UMG_LeaveParty_Widget) == 0x000348, "Member 'UUMG_PartyMemberList_Widget_C::UMG_LeaveParty_Widget' has a wrong offset!");
static_assert(offsetof(UUMG_PartyMemberList_Widget_C, OnPartyRefreshed) == 0x000350, "Member 'UUMG_PartyMemberList_Widget_C::OnPartyRefreshed' has a wrong offset!");

}

