#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ActivityCenter_Progress

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_ActivityCenter_Progress.UMG_ActivityCenter_Progress_C.ExecuteUbergraph_UMG_ActivityCenter_Progress
// 0x0004 (0x0004 - 0x0000)
struct UMG_ActivityCenter_Progress_C_ExecuteUbergraph_UMG_ActivityCenter_Progress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ActivityCenter_Progress_C_ExecuteUbergraph_UMG_ActivityCenter_Progress) == 0x000004, "Wrong alignment on UMG_ActivityCenter_Progress_C_ExecuteUbergraph_UMG_ActivityCenter_Progress");
static_assert(sizeof(UMG_ActivityCenter_Progress_C_ExecuteUbergraph_UMG_ActivityCenter_Progress) == 0x000004, "Wrong size on UMG_ActivityCenter_Progress_C_ExecuteUbergraph_UMG_ActivityCenter_Progress");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_ExecuteUbergraph_UMG_ActivityCenter_Progress, EntryPoint) == 0x000000, "Member 'UMG_ActivityCenter_Progress_C_ExecuteUbergraph_UMG_ActivityCenter_Progress::EntryPoint' has a wrong offset!");

// Function UMG_ActivityCenter_Progress.UMG_ActivityCenter_Progress_C.RefreshProgressReward
// 0x0010 (0x0010 - 0x0000)
struct UMG_ActivityCenter_Progress_C_RefreshProgressReward final
{
public:
	TArray<struct FPBProgressActivityReward>      RewardArray;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(UMG_ActivityCenter_Progress_C_RefreshProgressReward) == 0x000008, "Wrong alignment on UMG_ActivityCenter_Progress_C_RefreshProgressReward");
static_assert(sizeof(UMG_ActivityCenter_Progress_C_RefreshProgressReward) == 0x000010, "Wrong size on UMG_ActivityCenter_Progress_C_RefreshProgressReward");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshProgressReward, RewardArray) == 0x000000, "Member 'UMG_ActivityCenter_Progress_C_RefreshProgressReward::RewardArray' has a wrong offset!");

// Function UMG_ActivityCenter_Progress.UMG_ActivityCenter_Progress_C.RefreshQuestList
// 0x0070 (0x0070 - 0x0000)
struct UMG_ActivityCenter_Progress_C_RefreshQuestList final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBQuestManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBActivityQuestBaseInfo               CallFunc_Array_Get_Item;                           // 0x0028(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBQuestModuleState                           CallFunc_GetActivityQuestState_ReturnValue;        // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_QuestInfoSeasonEXP_C*              CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ActivityCenter_Progress_C_RefreshQuestList) == 0x000008, "Wrong alignment on UMG_ActivityCenter_Progress_C_RefreshQuestList");
static_assert(sizeof(UMG_ActivityCenter_Progress_C_RefreshQuestList) == 0x000070, "Wrong size on UMG_ActivityCenter_Progress_C_RefreshQuestList");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, K2Node_MakeStruct_Margin) == 0x00000C, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_Array_Get_Item) == 0x000028, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000045, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_GetActivityQuestState_ReturnValue) == 0x000046, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_GetActivityQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_Create_ReturnValue) == 0x000050, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000060, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_ActivityCenter_Progress_C_RefreshQuestList, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UMG_ActivityCenter_Progress_C_RefreshQuestList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

