#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NewItemPage

#include "Basic.hpp"

#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_NewItemPage.UMG_NewItemPage_C.ExecuteUbergraph_UMG_NewItemPage
// 0x0004 (0x0004 - 0x0000)
struct UMG_NewItemPage_C_ExecuteUbergraph_UMG_NewItemPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NewItemPage_C_ExecuteUbergraph_UMG_NewItemPage) == 0x000004, "Wrong alignment on UMG_NewItemPage_C_ExecuteUbergraph_UMG_NewItemPage");
static_assert(sizeof(UMG_NewItemPage_C_ExecuteUbergraph_UMG_NewItemPage) == 0x000004, "Wrong size on UMG_NewItemPage_C_ExecuteUbergraph_UMG_NewItemPage");
static_assert(offsetof(UMG_NewItemPage_C_ExecuteUbergraph_UMG_NewItemPage, EntryPoint) == 0x000000, "Member 'UMG_NewItemPage_C_ExecuteUbergraph_UMG_NewItemPage::EntryPoint' has a wrong offset!");

// Function UMG_NewItemPage.UMG_NewItemPage_C.RefreshItemList
// 0x0070 (0x0070 - 0x0000)
struct UMG_NewItemPage_C_RefreshItemList final
{
public:
	EPBProgressionRewardItemStatus                Status;                                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScaleBox*                              CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBRewardItem                          CallFunc_Array_Get_Item;                           // 0x0038(0x000C)(NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ProgressionRewardItem_C*           CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NewItemPage_C_RefreshItemList) == 0x000008, "Wrong alignment on UMG_NewItemPage_C_RefreshItemList");
static_assert(sizeof(UMG_NewItemPage_C_RefreshItemList) == 0x000070, "Wrong size on UMG_NewItemPage_C_RefreshItemList");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, Status) == 0x000000, "Member 'UMG_NewItemPage_C_RefreshItemList::Status' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_NewItemPage_C_RefreshItemList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_NewItemPage_C_RefreshItemList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'UMG_NewItemPage_C_RefreshItemList::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'UMG_NewItemPage_C_RefreshItemList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000020, "Member 'UMG_NewItemPage_C_RefreshItemList::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UMG_NewItemPage_C_RefreshItemList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'UMG_NewItemPage_C_RefreshItemList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'UMG_NewItemPage_C_RefreshItemList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, CallFunc_Array_Get_Item) == 0x000038, "Member 'UMG_NewItemPage_C_RefreshItemList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, CallFunc_Create_ReturnValue) == 0x000048, "Member 'UMG_NewItemPage_C_RefreshItemList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, CallFunc_AddChild_ReturnValue_1) == 0x000050, "Member 'UMG_NewItemPage_C_RefreshItemList::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'UMG_NewItemPage_C_RefreshItemList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, K2Node_MakeStruct_Margin) == 0x00005C, "Member 'UMG_NewItemPage_C_RefreshItemList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_RefreshItemList, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_NewItemPage_C_RefreshItemList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_NewItemPage.UMG_NewItemPage_C.OnKeyDown
// 0x02E8 (0x02E8 - 0x0000)
struct UMG_NewItemPage_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   Key;                                               // 0x0128(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0140(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0158(0x00B8)()
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0218(0x00B8)()
	TArray<struct FKey>                           CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue;  // 0x02D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NewItemPage_C_OnKeyDown) == 0x000008, "Wrong alignment on UMG_NewItemPage_C_OnKeyDown");
static_assert(sizeof(UMG_NewItemPage_C_OnKeyDown) == 0x0002E8, "Wrong size on UMG_NewItemPage_C_OnKeyDown");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UMG_NewItemPage_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UMG_NewItemPage_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'UMG_NewItemPage_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, Key) == 0x000128, "Member 'UMG_NewItemPage_C_OnKeyDown::Key' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000140, "Member 'UMG_NewItemPage_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000158, "Member 'UMG_NewItemPage_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000210, "Member 'UMG_NewItemPage_C_OnKeyDown::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000218, "Member 'UMG_NewItemPage_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue) == 0x0002D0, "Member 'UMG_NewItemPage_C_OnKeyDown::CallFunc_GetCurrentDeviceKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NewItemPage_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue) == 0x0002E0, "Member 'UMG_NewItemPage_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

}

