#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ProgressionWeaponItem

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ProgressionWeaponItem.UMG_ProgressionWeaponItem_C
// 0x0058 (0x02F8 - 0x02A0)
class UUMG_ProgressionWeaponItem_C final : public UPBProgressionWeaponItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Active;                                            // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Btn;                                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockImage;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_STD_Art_NewLabel_C*                UMG_STD_Art_NewLabel;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WeaponTextBlock;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName WeaponID, class UUMG_ProgressionWeaponItem_C* ClickedWidget)> OnClickedEvent;                                    // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsSelected;                                        // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShowNewFlag;                                      // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_ProgressionWeaponItem(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void K2_UpdateWeaponItem();
	void BndEvt__UMG_ProgressionWeaponItem_Btn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ProgressionWeaponItem_Btn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UMG_ProgressionWeaponItem_Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void ActiveBackground();
	void InactiveBackground();
	void SelectWidget();
	void UnselectWidget();
	void RefreshNewFlag();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ProgressionWeaponItem_C">();
	}
	static class UUMG_ProgressionWeaponItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ProgressionWeaponItem_C>();
	}
};
static_assert(alignof(UUMG_ProgressionWeaponItem_C) == 0x000008, "Wrong alignment on UUMG_ProgressionWeaponItem_C");
static_assert(sizeof(UUMG_ProgressionWeaponItem_C) == 0x0002F8, "Wrong size on UUMG_ProgressionWeaponItem_C");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, UberGraphFrame) == 0x0002A0, "Member 'UUMG_ProgressionWeaponItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, Active) == 0x0002A8, "Member 'UUMG_ProgressionWeaponItem_C::Active' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, BG) == 0x0002B0, "Member 'UUMG_ProgressionWeaponItem_C::BG' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, Btn) == 0x0002B8, "Member 'UUMG_ProgressionWeaponItem_C::Btn' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, IconImage) == 0x0002C0, "Member 'UUMG_ProgressionWeaponItem_C::IconImage' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, LockImage) == 0x0002C8, "Member 'UUMG_ProgressionWeaponItem_C::LockImage' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, UMG_STD_Art_NewLabel) == 0x0002D0, "Member 'UUMG_ProgressionWeaponItem_C::UMG_STD_Art_NewLabel' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, WeaponTextBlock) == 0x0002D8, "Member 'UUMG_ProgressionWeaponItem_C::WeaponTextBlock' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, OnClickedEvent) == 0x0002E0, "Member 'UUMG_ProgressionWeaponItem_C::OnClickedEvent' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, IsSelected) == 0x0002F0, "Member 'UUMG_ProgressionWeaponItem_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UUMG_ProgressionWeaponItem_C, bShowNewFlag) == 0x0002F1, "Member 'UUMG_ProgressionWeaponItem_C::bShowNewFlag' has a wrong offset!");

}

