#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_MVPInfo

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_MVPInfo.UMG_MVPInfo_C
// 0x0040 (0x0370 - 0x0330)
class UUMG_MVPInfo_C final : public UPBMVPInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_74;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Card;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CharacterIcon;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DogTag;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CharcherName;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerName;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Score;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_MVPInfo(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_MVPInfo_C">();
	}
	static class UUMG_MVPInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_MVPInfo_C>();
	}
};
static_assert(alignof(UUMG_MVPInfo_C) == 0x000008, "Wrong alignment on UUMG_MVPInfo_C");
static_assert(sizeof(UUMG_MVPInfo_C) == 0x000370, "Wrong size on UUMG_MVPInfo_C");
static_assert(offsetof(UUMG_MVPInfo_C, UberGraphFrame) == 0x000330, "Member 'UUMG_MVPInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_MVPInfo_C, Image_74) == 0x000338, "Member 'UUMG_MVPInfo_C::Image_74' has a wrong offset!");
static_assert(offsetof(UUMG_MVPInfo_C, Image_Card) == 0x000340, "Member 'UUMG_MVPInfo_C::Image_Card' has a wrong offset!");
static_assert(offsetof(UUMG_MVPInfo_C, Image_CharacterIcon) == 0x000348, "Member 'UUMG_MVPInfo_C::Image_CharacterIcon' has a wrong offset!");
static_assert(offsetof(UUMG_MVPInfo_C, Image_DogTag) == 0x000350, "Member 'UUMG_MVPInfo_C::Image_DogTag' has a wrong offset!");
static_assert(offsetof(UUMG_MVPInfo_C, TextBlock_CharcherName) == 0x000358, "Member 'UUMG_MVPInfo_C::TextBlock_CharcherName' has a wrong offset!");
static_assert(offsetof(UUMG_MVPInfo_C, TextBlock_PlayerName) == 0x000360, "Member 'UUMG_MVPInfo_C::TextBlock_PlayerName' has a wrong offset!");
static_assert(offsetof(UUMG_MVPInfo_C, TextBlock_Score) == 0x000368, "Member 'UUMG_MVPInfo_C::TextBlock_Score' has a wrong offset!");

}

