#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_BLACKMARKET

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_BLACKMARKET.UMG_BLACKMARKET_C
// 0x00D8 (0x0418 - 0x0340)
class UUMG_BLACKMARKET_C final : public UPBStorePage_Special
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImagineSpecial;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextSpecial;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BlackMarketCountDown_C*            UMG_BlackMarketCountDown;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_StoreProduct_BlackMarketMain_C*    UMG_StoreProduct_CollectionGrade;                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_StoreProduct_BlackMarketSub_C*     UMG_StoreProduct_CustomEdge;                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_StoreProduct_BlackMarketSub_C*     UMG_StoreProduct_CustomMain;                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_StoreProduct_BlackMarketSub_C*     UMG_StoreProduct_ProGrade1;                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_StoreProduct_BlackMarketSub_C*     UMG_StoreProduct_ProGrade2;                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBStoreProductInfo                    CollectionProduct;                                 // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPBStoreProductInfo                    CustomMainProduct;                                 // 0x03B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPBStoreProductInfo                    CustomEdgeProduct;                                 // 0x03D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FPBStoreProductInfo>            ProGradeProducts;                                  // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasCollectionProduct;                              // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasCustomMainProduct;                              // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasCustomEdgeProduct;                              // 0x0412(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasProGradeProduct;                                // 0x0413(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UMG_BLACKMARKET(int32 EntryPoint);
	void K2_RefreshPage();
	void InitInfo();
	void RefreshUI();
	void ResetInfo();
	class UWidget* DoCustomNavigation_0(EUINavigation Navigation_0);
	void SetFocusAfterRefreshUI();
	class UWidget* DoCustomNavigation_1(EUINavigation Navigation_0);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_BLACKMARKET_C">();
	}
	static class UUMG_BLACKMARKET_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_BLACKMARKET_C>();
	}
};
static_assert(alignof(UUMG_BLACKMARKET_C) == 0x000008, "Wrong alignment on UUMG_BLACKMARKET_C");
static_assert(sizeof(UUMG_BLACKMARKET_C) == 0x000418, "Wrong size on UUMG_BLACKMARKET_C");
static_assert(offsetof(UUMG_BLACKMARKET_C, UberGraphFrame) == 0x000340, "Member 'UUMG_BLACKMARKET_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, ImagineSpecial) == 0x000348, "Member 'UUMG_BLACKMARKET_C::ImagineSpecial' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, TextSpecial) == 0x000350, "Member 'UUMG_BLACKMARKET_C::TextSpecial' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, UMG_BlackMarketCountDown) == 0x000358, "Member 'UUMG_BLACKMARKET_C::UMG_BlackMarketCountDown' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, UMG_StoreProduct_CollectionGrade) == 0x000360, "Member 'UUMG_BLACKMARKET_C::UMG_StoreProduct_CollectionGrade' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, UMG_StoreProduct_CustomEdge) == 0x000368, "Member 'UUMG_BLACKMARKET_C::UMG_StoreProduct_CustomEdge' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, UMG_StoreProduct_CustomMain) == 0x000370, "Member 'UUMG_BLACKMARKET_C::UMG_StoreProduct_CustomMain' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, UMG_StoreProduct_ProGrade1) == 0x000378, "Member 'UUMG_BLACKMARKET_C::UMG_StoreProduct_ProGrade1' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, UMG_StoreProduct_ProGrade2) == 0x000380, "Member 'UUMG_BLACKMARKET_C::UMG_StoreProduct_ProGrade2' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, CollectionProduct) == 0x000388, "Member 'UUMG_BLACKMARKET_C::CollectionProduct' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, CustomMainProduct) == 0x0003B0, "Member 'UUMG_BLACKMARKET_C::CustomMainProduct' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, CustomEdgeProduct) == 0x0003D8, "Member 'UUMG_BLACKMARKET_C::CustomEdgeProduct' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, ProGradeProducts) == 0x000400, "Member 'UUMG_BLACKMARKET_C::ProGradeProducts' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, HasCollectionProduct) == 0x000410, "Member 'UUMG_BLACKMARKET_C::HasCollectionProduct' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, HasCustomMainProduct) == 0x000411, "Member 'UUMG_BLACKMARKET_C::HasCustomMainProduct' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, HasCustomEdgeProduct) == 0x000412, "Member 'UUMG_BLACKMARKET_C::HasCustomEdgeProduct' has a wrong offset!");
static_assert(offsetof(UUMG_BLACKMARKET_C, HasProGradeProduct) == 0x000413, "Member 'UUMG_BLACKMARKET_C::HasProGradeProduct' has a wrong offset!");

}

