#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CrossHair_AGL

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_CrossHair_AGL.UMG_CrossHair_AGL_C.ExecuteUbergraph_UMG_CrossHair_AGL
// 0x0088 (0x0088 - 0x0000)
struct UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNoAmmo;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_CrossHair_AmmoCount_C*             CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL) == 0x000008, "Wrong alignment on UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL");
static_assert(sizeof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL) == 0x000088, "Wrong size on UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, EntryPoint) == 0x000000, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, K2Node_Event_bNoAmmo) == 0x000010, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::K2Node_Event_bNoAmmo' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, K2Node_Event_MyGeometry) == 0x000014, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, Temp_bool_Has_Been_Initd_Variable) == 0x000050, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_Array_Get_Item) == 0x000058, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, Temp_bool_IsClosed_Variable) == 0x000065, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000068, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00006D, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000070, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000074, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL, CallFunc_MapRangeClamped_ReturnValue) == 0x000080, "Member 'UMG_CrossHair_AGL_C_ExecuteUbergraph_UMG_CrossHair_AGL::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function UMG_CrossHair_AGL.UMG_CrossHair_AGL_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_CrossHair_AGL_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CrossHair_AGL_C_Tick) == 0x000004, "Wrong alignment on UMG_CrossHair_AGL_C_Tick");
static_assert(sizeof(UMG_CrossHair_AGL_C_Tick) == 0x00003C, "Wrong size on UMG_CrossHair_AGL_C_Tick");
static_assert(offsetof(UMG_CrossHair_AGL_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_CrossHair_AGL_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_CrossHair_AGL_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_CrossHair_AGL.UMG_CrossHair_AGL_C.NoAmmo
// 0x0001 (0x0001 - 0x0000)
struct UMG_CrossHair_AGL_C_NoAmmo final
{
public:
	bool                                          bNoAmmo;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_CrossHair_AGL_C_NoAmmo) == 0x000001, "Wrong alignment on UMG_CrossHair_AGL_C_NoAmmo");
static_assert(sizeof(UMG_CrossHair_AGL_C_NoAmmo) == 0x000001, "Wrong size on UMG_CrossHair_AGL_C_NoAmmo");
static_assert(offsetof(UMG_CrossHair_AGL_C_NoAmmo, bNoAmmo) == 0x000000, "Member 'UMG_CrossHair_AGL_C_NoAmmo::bNoAmmo' has a wrong offset!");

// Function UMG_CrossHair_AGL.UMG_CrossHair_AGL_C.GetLauncherAmmoPercentage
// 0x0010 (0x0010 - 0x0000)
struct UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage) == 0x000004, "Wrong alignment on UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage");
static_assert(sizeof(UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage) == 0x000010, "Wrong size on UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage");
static_assert(offsetof(UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage, ReturnValue) == 0x000000, "Member 'UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'UMG_CrossHair_AGL_C_GetLauncherAmmoPercentage::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function UMG_CrossHair_AGL.UMG_CrossHair_AGL_C.LeftLauncherSetting
// 0x0008 (0x0008 - 0x0000)
struct UMG_CrossHair_AGL_C_LeftLauncherSetting final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CrossHair_AGL_C_LeftLauncherSetting) == 0x000008, "Wrong alignment on UMG_CrossHair_AGL_C_LeftLauncherSetting");
static_assert(sizeof(UMG_CrossHair_AGL_C_LeftLauncherSetting) == 0x000008, "Wrong size on UMG_CrossHair_AGL_C_LeftLauncherSetting");
static_assert(offsetof(UMG_CrossHair_AGL_C_LeftLauncherSetting, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_CrossHair_AGL_C_LeftLauncherSetting::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_CrossHair_AGL.UMG_CrossHair_AGL_C.RightLauncherSetting
// 0x0008 (0x0008 - 0x0000)
struct UMG_CrossHair_AGL_C_RightLauncherSetting final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_CrossHair_AGL_C_RightLauncherSetting) == 0x000008, "Wrong alignment on UMG_CrossHair_AGL_C_RightLauncherSetting");
static_assert(sizeof(UMG_CrossHair_AGL_C_RightLauncherSetting) == 0x000008, "Wrong size on UMG_CrossHair_AGL_C_RightLauncherSetting");
static_assert(offsetof(UMG_CrossHair_AGL_C_RightLauncherSetting, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_CrossHair_AGL_C_RightLauncherSetting::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_CrossHair_AGL.UMG_CrossHair_AGL_C.DefaultLauncherSetting
// 0x001C (0x001C - 0x0000)
struct UMG_CrossHair_AGL_C_DefaultLauncherSetting final
{
public:
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0000(0x001C)(NoDestructor)
};
static_assert(alignof(UMG_CrossHair_AGL_C_DefaultLauncherSetting) == 0x000004, "Wrong alignment on UMG_CrossHair_AGL_C_DefaultLauncherSetting");
static_assert(sizeof(UMG_CrossHair_AGL_C_DefaultLauncherSetting) == 0x00001C, "Wrong size on UMG_CrossHair_AGL_C_DefaultLauncherSetting");
static_assert(offsetof(UMG_CrossHair_AGL_C_DefaultLauncherSetting, K2Node_MakeStruct_WidgetTransform) == 0x000000, "Member 'UMG_CrossHair_AGL_C_DefaultLauncherSetting::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

}

