#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_SettingBase

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_SettingBase.UMG_SettingBase_C.ExecuteUbergraph_UMG_SettingBase
// 0x0058 (0x0058 - 0x0000)
struct UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToLeft;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_CurrentSelectIndex;     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LastSelectIndex;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_SettingPageBase_C*                 K2Node_DynamicCast_AsUMG_Setting_Page_Base;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase) == 0x000008, "Wrong alignment on UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase");
static_assert(sizeof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase) == 0x000058, "Wrong size on UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, EntryPoint) == 0x000000, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, K2Node_Event_bToLeft) == 0x000020, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::K2Node_Event_bToLeft' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, K2Node_ComponentBoundEvent_CurrentSelectIndex) == 0x000024, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::K2Node_ComponentBoundEvent_CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, K2Node_ComponentBoundEvent_LastSelectIndex) == 0x000028, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::K2Node_ComponentBoundEvent_LastSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00002C, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000030, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, K2Node_DynamicCast_AsUMG_Setting_Page_Base) == 0x000038, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::K2Node_DynamicCast_AsUMG_Setting_Page_Base' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase, CallFunc_GetDisplayName_ReturnValue_1) == 0x000048, "Member 'UMG_SettingBase_C_ExecuteUbergraph_UMG_SettingBase::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_SettingBase_C_BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature final
{
public:
	int32                                         CurrentSelectIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSelectIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingBase_C_BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000004, "Wrong alignment on UMG_SettingBase_C_BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(sizeof(UMG_SettingBase_C_BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature) == 0x000008, "Wrong size on UMG_SettingBase_C_BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature");
static_assert(offsetof(UMG_SettingBase_C_BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, CurrentSelectIndex) == 0x000000, "Member 'UMG_SettingBase_C_BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::CurrentSelectIndex' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature, LastSelectIndex) == 0x000004, "Member 'UMG_SettingBase_C_BndEvt__UMG_SettingBase_MainSwitcher_K2Node_ComponentBoundEvent_0_PBOnWidgetSwich__DelegateSignature::LastSelectIndex' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.K2_SwitchPageTab
// 0x0001 (0x0001 - 0x0000)
struct UMG_SettingBase_C_K2_SwitchPageTab final
{
public:
	bool                                          bToLeft;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingBase_C_K2_SwitchPageTab) == 0x000001, "Wrong alignment on UMG_SettingBase_C_K2_SwitchPageTab");
static_assert(sizeof(UMG_SettingBase_C_K2_SwitchPageTab) == 0x000001, "Wrong size on UMG_SettingBase_C_K2_SwitchPageTab");
static_assert(offsetof(UMG_SettingBase_C_K2_SwitchPageTab, bToLeft) == 0x000000, "Member 'UMG_SettingBase_C_K2_SwitchPageTab::bToLeft' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.ShowSaveConfirmPage
// 0x0040 (0x0040 - 0x0000)
struct UMG_SettingBase_C_ShowSaveConfirmPage final
{
public:
	TArray<class FText>                           ConfirmOptionArray;                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	class UPBPromptManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
};
static_assert(alignof(UMG_SettingBase_C_ShowSaveConfirmPage) == 0x000008, "Wrong alignment on UMG_SettingBase_C_ShowSaveConfirmPage");
static_assert(sizeof(UMG_SettingBase_C_ShowSaveConfirmPage) == 0x000040, "Wrong size on UMG_SettingBase_C_ShowSaveConfirmPage");
static_assert(offsetof(UMG_SettingBase_C_ShowSaveConfirmPage, ConfirmOptionArray) == 0x000000, "Member 'UMG_SettingBase_C_ShowSaveConfirmPage::ConfirmOptionArray' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ShowSaveConfirmPage, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'UMG_SettingBase_C_ShowSaveConfirmPage::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ShowSaveConfirmPage, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UMG_SettingBase_C_ShowSaveConfirmPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ShowSaveConfirmPage, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'UMG_SettingBase_C_ShowSaveConfirmPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ShowSaveConfirmPage, K2Node_MakeArray_Array) == 0x000030, "Member 'UMG_SettingBase_C_ShowSaveConfirmPage::K2Node_MakeArray_Array' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.IsContainsKey
// 0x0050 (0x0050 - 0x0000)
struct UMG_SettingBase_C_IsContainsKey final
{
public:
	class FName                                   InputActionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   InKey;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          bContains;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBOptions*                             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDevice                                  CallFunc_GetCurrentActivateInputDevice_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetKeysOfInput_ReturnValue;               // 0x0038(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingBase_C_IsContainsKey) == 0x000008, "Wrong alignment on UMG_SettingBase_C_IsContainsKey");
static_assert(sizeof(UMG_SettingBase_C_IsContainsKey) == 0x000050, "Wrong size on UMG_SettingBase_C_IsContainsKey");
static_assert(offsetof(UMG_SettingBase_C_IsContainsKey, InputActionName) == 0x000000, "Member 'UMG_SettingBase_C_IsContainsKey::InputActionName' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_IsContainsKey, InKey) == 0x000008, "Member 'UMG_SettingBase_C_IsContainsKey::InKey' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_IsContainsKey, bContains) == 0x000020, "Member 'UMG_SettingBase_C_IsContainsKey::bContains' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_IsContainsKey, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000028, "Member 'UMG_SettingBase_C_IsContainsKey::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_IsContainsKey, CallFunc_GetCurrentActivateInputDevice_ReturnValue) == 0x000030, "Member 'UMG_SettingBase_C_IsContainsKey::CallFunc_GetCurrentActivateInputDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_IsContainsKey, CallFunc_GetKeysOfInput_ReturnValue) == 0x000038, "Member 'UMG_SettingBase_C_IsContainsKey::CallFunc_GetKeysOfInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_IsContainsKey, CallFunc_Array_Contains_ReturnValue) == 0x000048, "Member 'UMG_SettingBase_C_IsContainsKey::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.ShowResetConfirmPage
// 0x0038 (0x0038 - 0x0000)
struct UMG_SettingBase_C_ShowResetConfirmPage final
{
public:
	TArray<class FText>                           ConfirmOptionArray;                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UPBPromptManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_SettingBase_C_ShowResetConfirmPage) == 0x000008, "Wrong alignment on UMG_SettingBase_C_ShowResetConfirmPage");
static_assert(sizeof(UMG_SettingBase_C_ShowResetConfirmPage) == 0x000038, "Wrong size on UMG_SettingBase_C_ShowResetConfirmPage");
static_assert(offsetof(UMG_SettingBase_C_ShowResetConfirmPage, ConfirmOptionArray) == 0x000000, "Member 'UMG_SettingBase_C_ShowResetConfirmPage::ConfirmOptionArray' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ShowResetConfirmPage, K2Node_MakeArray_Array) == 0x000010, "Member 'UMG_SettingBase_C_ShowResetConfirmPage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ShowResetConfirmPage, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UMG_SettingBase_C_ShowResetConfirmPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ShowResetConfirmPage, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000030, "Member 'UMG_SettingBase_C_ShowResetConfirmPage::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.HandleResetConfirm
// 0x0008 (0x0008 - 0x0000)
struct UMG_SettingBase_C_HandleResetConfirm final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingBase_C_HandleResetConfirm) == 0x000004, "Wrong alignment on UMG_SettingBase_C_HandleResetConfirm");
static_assert(sizeof(UMG_SettingBase_C_HandleResetConfirm) == 0x000008, "Wrong size on UMG_SettingBase_C_HandleResetConfirm");
static_assert(offsetof(UMG_SettingBase_C_HandleResetConfirm, Index_0) == 0x000000, "Member 'UMG_SettingBase_C_HandleResetConfirm::Index_0' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_HandleResetConfirm, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'UMG_SettingBase_C_HandleResetConfirm::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.ResetOption
// 0x0020 (0x0020 - 0x0000)
struct UMG_SettingBase_C_ResetOption final
{
public:
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_SettingPageBase_C*                 K2Node_DynamicCast_AsUMG_Setting_Page_Base;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingBase_C_ResetOption) == 0x000008, "Wrong alignment on UMG_SettingBase_C_ResetOption");
static_assert(sizeof(UMG_SettingBase_C_ResetOption) == 0x000020, "Wrong size on UMG_SettingBase_C_ResetOption");
static_assert(offsetof(UMG_SettingBase_C_ResetOption, CallFunc_GetActiveWidget_ReturnValue) == 0x000000, "Member 'UMG_SettingBase_C_ResetOption::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ResetOption, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_SettingBase_C_ResetOption::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ResetOption, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'UMG_SettingBase_C_ResetOption::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ResetOption, K2Node_DynamicCast_AsUMG_Setting_Page_Base) == 0x000010, "Member 'UMG_SettingBase_C_ResetOption::K2Node_DynamicCast_AsUMG_Setting_Page_Base' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_ResetOption, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_SettingBase_C_ResetOption::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.BindSubPageBtnClick
// 0x0048 (0x0048 - 0x0000)
struct UMG_SettingBase_C_BindSubPageBtnClick final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUMG_SettingPageBase_C*>         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_SettingPageBase_C*                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingBase_C_BindSubPageBtnClick) == 0x000008, "Wrong alignment on UMG_SettingBase_C_BindSubPageBtnClick");
static_assert(sizeof(UMG_SettingBase_C_BindSubPageBtnClick) == 0x000048, "Wrong size on UMG_SettingBase_C_BindSubPageBtnClick");
static_assert(offsetof(UMG_SettingBase_C_BindSubPageBtnClick, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_SettingBase_C_BindSubPageBtnClick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_BindSubPageBtnClick, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_SettingBase_C_BindSubPageBtnClick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_BindSubPageBtnClick, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_SettingBase_C_BindSubPageBtnClick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_BindSubPageBtnClick, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'UMG_SettingBase_C_BindSubPageBtnClick::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_BindSubPageBtnClick, K2Node_MakeArray_Array) == 0x000020, "Member 'UMG_SettingBase_C_BindSubPageBtnClick::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_BindSubPageBtnClick, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'UMG_SettingBase_C_BindSubPageBtnClick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_BindSubPageBtnClick, CallFunc_Array_Get_Item) == 0x000038, "Member 'UMG_SettingBase_C_BindSubPageBtnClick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_BindSubPageBtnClick, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'UMG_SettingBase_C_BindSubPageBtnClick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.BackPreviousEvent
// 0x0001 (0x0001 - 0x0000)
struct UMG_SettingBase_C_BackPreviousEvent final
{
public:
	bool                                          bQuitgame;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingBase_C_BackPreviousEvent) == 0x000001, "Wrong alignment on UMG_SettingBase_C_BackPreviousEvent");
static_assert(sizeof(UMG_SettingBase_C_BackPreviousEvent) == 0x000001, "Wrong size on UMG_SettingBase_C_BackPreviousEvent");
static_assert(offsetof(UMG_SettingBase_C_BackPreviousEvent, bQuitgame) == 0x000000, "Member 'UMG_SettingBase_C_BackPreviousEvent::bQuitgame' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.OnShowButtonSetting
// 0x0001 (0x0001 - 0x0000)
struct UMG_SettingBase_C_OnShowButtonSetting final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingBase_C_OnShowButtonSetting) == 0x000001, "Wrong alignment on UMG_SettingBase_C_OnShowButtonSetting");
static_assert(sizeof(UMG_SettingBase_C_OnShowButtonSetting) == 0x000001, "Wrong size on UMG_SettingBase_C_OnShowButtonSetting");
static_assert(offsetof(UMG_SettingBase_C_OnShowButtonSetting, bShow) == 0x000000, "Member 'UMG_SettingBase_C_OnShowButtonSetting::bShow' has a wrong offset!");

// Function UMG_SettingBase.UMG_SettingBase_C.RestoreFocus
// 0x0008 (0x0008 - 0x0000)
struct UMG_SettingBase_C_RestoreFocus final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SettingBase_C_RestoreFocus) == 0x000004, "Wrong alignment on UMG_SettingBase_C_RestoreFocus");
static_assert(sizeof(UMG_SettingBase_C_RestoreFocus) == 0x000008, "Wrong size on UMG_SettingBase_C_RestoreFocus");
static_assert(offsetof(UMG_SettingBase_C_RestoreFocus, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'UMG_SettingBase_C_RestoreFocus::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_SettingBase_C_RestoreFocus, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'UMG_SettingBase_C_RestoreFocus::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

