#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelmetHUD_OverBoostHint

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_HelmetHUD_OverBoostHint.UMG_HelmetHUD_OverBoostHint_C.ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint
// 0x0048 (0x0048 - 0x0000)
struct UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InActiveDuration;                     // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InCoolDownDuration;                   // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint");
static_assert(sizeof(UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint) == 0x000048, "Wrong size on UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint, EntryPoint) == 0x000000, "Member 'UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint, K2Node_Event_InActiveDuration) == 0x000004, "Member 'UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint::K2Node_Event_InActiveDuration' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint, K2Node_Event_MyGeometry) == 0x000008, "Member 'UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint, K2Node_Event_InDeltaTime) == 0x000040, "Member 'UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint, K2Node_Event_InCoolDownDuration) == 0x000044, "Member 'UMG_HelmetHUD_OverBoostHint_C_ExecuteUbergraph_UMG_HelmetHUD_OverBoostHint::K2Node_Event_InCoolDownDuration' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoostHint.UMG_HelmetHUD_OverBoostHint_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_HelmetHUD_OverBoostHint_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoostHint_C_Tick) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoostHint_C_Tick");
static_assert(sizeof(UMG_HelmetHUD_OverBoostHint_C_Tick) == 0x00003C, "Wrong size on UMG_HelmetHUD_OverBoostHint_C_Tick");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_HelmetHUD_OverBoostHint_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_HelmetHUD_OverBoostHint_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoostHint.UMG_HelmetHUD_OverBoostHint_C.K2_RefreshOverBoostActivateInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_OverBoostHint_C_K2_RefreshOverBoostActivateInfo final
{
public:
	float                                         InActiveDuration;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoostHint_C_K2_RefreshOverBoostActivateInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoostHint_C_K2_RefreshOverBoostActivateInfo");
static_assert(sizeof(UMG_HelmetHUD_OverBoostHint_C_K2_RefreshOverBoostActivateInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_OverBoostHint_C_K2_RefreshOverBoostActivateInfo");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_K2_RefreshOverBoostActivateInfo, InActiveDuration) == 0x000000, "Member 'UMG_HelmetHUD_OverBoostHint_C_K2_RefreshOverBoostActivateInfo::InActiveDuration' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoostHint.UMG_HelmetHUD_OverBoostHint_C.K2_RefreshCoolDownInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_OverBoostHint_C_K2_RefreshCoolDownInfo final
{
public:
	float                                         InCoolDownDuration;                                // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoostHint_C_K2_RefreshCoolDownInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoostHint_C_K2_RefreshCoolDownInfo");
static_assert(sizeof(UMG_HelmetHUD_OverBoostHint_C_K2_RefreshCoolDownInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_OverBoostHint_C_K2_RefreshCoolDownInfo");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_K2_RefreshCoolDownInfo, InCoolDownDuration) == 0x000000, "Member 'UMG_HelmetHUD_OverBoostHint_C_K2_RefreshCoolDownInfo::InCoolDownDuration' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoostHint.UMG_HelmetHUD_OverBoostHint_C.RefreshActivateInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_OverBoostHint_C_RefreshActivateInfo final
{
public:
	float                                         InActiveDuration;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoostHint_C_RefreshActivateInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoostHint_C_RefreshActivateInfo");
static_assert(sizeof(UMG_HelmetHUD_OverBoostHint_C_RefreshActivateInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_OverBoostHint_C_RefreshActivateInfo");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_RefreshActivateInfo, InActiveDuration) == 0x000000, "Member 'UMG_HelmetHUD_OverBoostHint_C_RefreshActivateInfo::InActiveDuration' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoostHint.UMG_HelmetHUD_OverBoostHint_C.RefreshCoolDownInfo
// 0x0004 (0x0004 - 0x0000)
struct UMG_HelmetHUD_OverBoostHint_C_RefreshCoolDownInfo final
{
public:
	float                                         InCoolDownDuration;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoostHint_C_RefreshCoolDownInfo) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoostHint_C_RefreshCoolDownInfo");
static_assert(sizeof(UMG_HelmetHUD_OverBoostHint_C_RefreshCoolDownInfo) == 0x000004, "Wrong size on UMG_HelmetHUD_OverBoostHint_C_RefreshCoolDownInfo");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_RefreshCoolDownInfo, InCoolDownDuration) == 0x000000, "Member 'UMG_HelmetHUD_OverBoostHint_C_RefreshCoolDownInfo::InCoolDownDuration' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoostHint.UMG_HelmetHUD_OverBoostHint_C.ActivateTick
// 0x0014 (0x0014 - 0x0000)
struct UMG_HelmetHUD_OverBoostHint_C_ActivateTick final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoostHint_C_ActivateTick) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoostHint_C_ActivateTick");
static_assert(sizeof(UMG_HelmetHUD_OverBoostHint_C_ActivateTick) == 0x000014, "Wrong size on UMG_HelmetHUD_OverBoostHint_C_ActivateTick");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ActivateTick, InDeltaTime) == 0x000000, "Member 'UMG_HelmetHUD_OverBoostHint_C_ActivateTick::InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ActivateTick, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'UMG_HelmetHUD_OverBoostHint_C_ActivateTick::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ActivateTick, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_OverBoostHint_C_ActivateTick::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ActivateTick, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'UMG_HelmetHUD_OverBoostHint_C_ActivateTick::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_ActivateTick, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'UMG_HelmetHUD_OverBoostHint_C_ActivateTick::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function UMG_HelmetHUD_OverBoostHint.UMG_HelmetHUD_OverBoostHint_C.CoolDownTick
// 0x0010 (0x0010 - 0x0000)
struct UMG_HelmetHUD_OverBoostHint_C_CoolDownTick final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_HelmetHUD_OverBoostHint_C_CoolDownTick) == 0x000004, "Wrong alignment on UMG_HelmetHUD_OverBoostHint_C_CoolDownTick");
static_assert(sizeof(UMG_HelmetHUD_OverBoostHint_C_CoolDownTick) == 0x000010, "Wrong size on UMG_HelmetHUD_OverBoostHint_C_CoolDownTick");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_CoolDownTick, InDeltaTime) == 0x000000, "Member 'UMG_HelmetHUD_OverBoostHint_C_CoolDownTick::InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_CoolDownTick, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'UMG_HelmetHUD_OverBoostHint_C_CoolDownTick::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_CoolDownTick, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'UMG_HelmetHUD_OverBoostHint_C_CoolDownTick::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_HelmetHUD_OverBoostHint_C_CoolDownTick, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'UMG_HelmetHUD_OverBoostHint_C_CoolDownTick::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

}

