#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_HelemtHUD_WeaponInfo

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_HelemtHUD_WeaponInfo.UMG_HelemtHUD_WeaponInfo_C
// 0x0020 (0x0288 - 0x0268)
class UUMG_HelemtHUD_WeaponInfo_C final : public UPBHelmetHUD_WeaponInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_InGameHUD_WeaponInfo_AmmoCount_C*  WeaponHUD_CurrentDeployed;                         // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_IngameHUD_WeaponInfo_WeaponName_C* WeaponHUD_Primary;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_IngameHUD_WeaponInfo_WeaponName_C* WeaponHUD_Secondary;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_HelemtHUD_WeaponInfo(int32 EntryPoint);
	void K2_SetOwnerCharacter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_HelemtHUD_WeaponInfo_C">();
	}
	static class UUMG_HelemtHUD_WeaponInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_HelemtHUD_WeaponInfo_C>();
	}
};
static_assert(alignof(UUMG_HelemtHUD_WeaponInfo_C) == 0x000008, "Wrong alignment on UUMG_HelemtHUD_WeaponInfo_C");
static_assert(sizeof(UUMG_HelemtHUD_WeaponInfo_C) == 0x000288, "Wrong size on UUMG_HelemtHUD_WeaponInfo_C");
static_assert(offsetof(UUMG_HelemtHUD_WeaponInfo_C, UberGraphFrame) == 0x000268, "Member 'UUMG_HelemtHUD_WeaponInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_HelemtHUD_WeaponInfo_C, WeaponHUD_CurrentDeployed) == 0x000270, "Member 'UUMG_HelemtHUD_WeaponInfo_C::WeaponHUD_CurrentDeployed' has a wrong offset!");
static_assert(offsetof(UUMG_HelemtHUD_WeaponInfo_C, WeaponHUD_Primary) == 0x000278, "Member 'UUMG_HelemtHUD_WeaponInfo_C::WeaponHUD_Primary' has a wrong offset!");
static_assert(offsetof(UUMG_HelemtHUD_WeaponInfo_C, WeaponHUD_Secondary) == 0x000280, "Member 'UUMG_HelemtHUD_WeaponInfo_C::WeaponHUD_Secondary' has a wrong offset!");

}

