#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ProgressionRoot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"


namespace SDK::Params
{

// Function UMG_ProgressionRoot.UMG_ProgressionRoot_C.ExecuteUbergraph_UMG_ProgressionRoot
// 0x0010 (0x0010 - 0x0000)
struct UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0008(0x0008)(NoDestructor)
};
static_assert(alignof(UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot) == 0x000004, "Wrong alignment on UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot");
static_assert(sizeof(UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot) == 0x000010, "Wrong size on UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot");
static_assert(offsetof(UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot, EntryPoint) == 0x000000, "Member 'UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot, K2Node_Event_InFocusEvent) == 0x000008, "Member 'UMG_ProgressionRoot_C_ExecuteUbergraph_UMG_ProgressionRoot::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function UMG_ProgressionRoot.UMG_ProgressionRoot_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UMG_ProgressionRoot_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_ProgressionRoot_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UMG_ProgressionRoot_C_OnAddedToFocusPath");
static_assert(sizeof(UMG_ProgressionRoot_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UMG_ProgressionRoot_C_OnAddedToFocusPath");
static_assert(offsetof(UMG_ProgressionRoot_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UMG_ProgressionRoot_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UMG_ProgressionRoot.UMG_ProgressionRoot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_ProgressionRoot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProgressionRoot_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_ProgressionRoot_C_PreConstruct");
static_assert(sizeof(UMG_ProgressionRoot_C_PreConstruct) == 0x000001, "Wrong size on UMG_ProgressionRoot_C_PreConstruct");
static_assert(offsetof(UMG_ProgressionRoot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_ProgressionRoot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_ProgressionRoot.UMG_ProgressionRoot_C.Init
// 0x07F0 (0x07F0 - 0x0000)
struct UMG_ProgressionRoot_C_Init final
{
public:
	class FName                                   NewLocalVar_0;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBCharacterDefinitionRow              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x03D0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBCharacterDefinitionRow              CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x03F0(0x03D0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBArmoryManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x07D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2[0x6];                                      // 0x07D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x07E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProgressionRoot_C_Init) == 0x000008, "Wrong alignment on UMG_ProgressionRoot_C_Init");
static_assert(sizeof(UMG_ProgressionRoot_C_Init) == 0x0007F0, "Wrong size on UMG_ProgressionRoot_C_Init");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, NewLocalVar_0) == 0x000000, "Member 'UMG_ProgressionRoot_C_Init::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, Temp_byte_Variable) == 0x000008, "Member 'UMG_ProgressionRoot_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, Temp_byte_Variable_1) == 0x000009, "Member 'UMG_ProgressionRoot_C_Init::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, Temp_bool_Variable) == 0x00000A, "Member 'UMG_ProgressionRoot_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003E8, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, K2Node_Select_Default) == 0x0003E9, "Member 'UMG_ProgressionRoot_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0003F0, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0007C0, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0007C8, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_HasItem_ReturnValue) == 0x0007D0, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_HasItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_Not_PreBool_ReturnValue) == 0x0007D1, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0007D8, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, K2Node_DynamicCast_AsTexture_2D) == 0x0007E0, "Member 'UMG_ProgressionRoot_C_Init::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, K2Node_DynamicCast_bSuccess) == 0x0007E8, "Member 'UMG_ProgressionRoot_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_Init, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0007E9, "Member 'UMG_ProgressionRoot_C_Init::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function UMG_ProgressionRoot.UMG_ProgressionRoot_C.ActiveWidget
// 0x0010 (0x0010 - 0x0000)
struct UMG_ProgressionRoot_C_ActiveWidget final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProgressionRoot_C_ActiveWidget) == 0x000008, "Wrong alignment on UMG_ProgressionRoot_C_ActiveWidget");
static_assert(sizeof(UMG_ProgressionRoot_C_ActiveWidget) == 0x000010, "Wrong size on UMG_ProgressionRoot_C_ActiveWidget");
static_assert(offsetof(UMG_ProgressionRoot_C_ActiveWidget, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'UMG_ProgressionRoot_C_ActiveWidget::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_ActiveWidget, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'UMG_ProgressionRoot_C_ActiveWidget::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_ActiveWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_ProgressionRoot_C_ActiveWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_ProgressionRoot.UMG_ProgressionRoot_C.InactiveWidget
// 0x0008 (0x0008 - 0x0000)
struct UMG_ProgressionRoot_C_InactiveWidget final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProgressionRoot_C_InactiveWidget) == 0x000008, "Wrong alignment on UMG_ProgressionRoot_C_InactiveWidget");
static_assert(sizeof(UMG_ProgressionRoot_C_InactiveWidget) == 0x000008, "Wrong size on UMG_ProgressionRoot_C_InactiveWidget");
static_assert(offsetof(UMG_ProgressionRoot_C_InactiveWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UMG_ProgressionRoot_C_InactiveWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UMG_ProgressionRoot.UMG_ProgressionRoot_C.RefreshNewFlag
// 0x0018 (0x0018 - 0x0000)
struct UMG_ProgressionRoot_C_RefreshNewFlag final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBProgressionManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterNewItem_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProgressionRoot_C_RefreshNewFlag) == 0x000008, "Wrong alignment on UMG_ProgressionRoot_C_RefreshNewFlag");
static_assert(sizeof(UMG_ProgressionRoot_C_RefreshNewFlag) == 0x000018, "Wrong size on UMG_ProgressionRoot_C_RefreshNewFlag");
static_assert(offsetof(UMG_ProgressionRoot_C_RefreshNewFlag, Temp_bool_Variable) == 0x000000, "Member 'UMG_ProgressionRoot_C_RefreshNewFlag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_RefreshNewFlag, Temp_byte_Variable) == 0x000001, "Member 'UMG_ProgressionRoot_C_RefreshNewFlag::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_RefreshNewFlag, Temp_byte_Variable_1) == 0x000002, "Member 'UMG_ProgressionRoot_C_RefreshNewFlag::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_RefreshNewFlag, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UMG_ProgressionRoot_C_RefreshNewFlag::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_RefreshNewFlag, CallFunc_HasCharacterNewItem_ReturnValue) == 0x000010, "Member 'UMG_ProgressionRoot_C_RefreshNewFlag::CallFunc_HasCharacterNewItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProgressionRoot_C_RefreshNewFlag, K2Node_Select_Default) == 0x000011, "Member 'UMG_ProgressionRoot_C_RefreshNewFlag::K2Node_Select_Default' has a wrong offset!");

}

