#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EnumOptionItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_EnumOptionItem.UMG_EnumOptionItem_C.ExecuteUbergraph_UMG_EnumOptionItem
// 0x0040 (0x0040 - 0x0000)
struct UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUINavigation Navigation)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNext;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsValid;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUINavigation Navigation)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem) == 0x000008, "Wrong alignment on UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem");
static_assert(sizeof(UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem) == 0x000040, "Wrong size on UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem");
static_assert(offsetof(UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem, EntryPoint) == 0x000000, "Member 'UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem, K2Node_Event_bNext) == 0x000028, "Member 'UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem::K2Node_Event_bNext' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem, K2Node_Event_bIsValid) == 0x000029, "Member 'UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem::K2Node_Event_bIsValid' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'UMG_EnumOptionItem_C_ExecuteUbergraph_UMG_EnumOptionItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function UMG_EnumOptionItem.UMG_EnumOptionItem_C.K2_SetValid
// 0x0001 (0x0001 - 0x0000)
struct UMG_EnumOptionItem_C_K2_SetValid final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EnumOptionItem_C_K2_SetValid) == 0x000001, "Wrong alignment on UMG_EnumOptionItem_C_K2_SetValid");
static_assert(sizeof(UMG_EnumOptionItem_C_K2_SetValid) == 0x000001, "Wrong size on UMG_EnumOptionItem_C_K2_SetValid");
static_assert(offsetof(UMG_EnumOptionItem_C_K2_SetValid, bIsValid) == 0x000000, "Member 'UMG_EnumOptionItem_C_K2_SetValid::bIsValid' has a wrong offset!");

// Function UMG_EnumOptionItem.UMG_EnumOptionItem_C.K2_SwitchValue
// 0x0001 (0x0001 - 0x0000)
struct UMG_EnumOptionItem_C_K2_SwitchValue final
{
public:
	bool                                          bNext;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EnumOptionItem_C_K2_SwitchValue) == 0x000001, "Wrong alignment on UMG_EnumOptionItem_C_K2_SwitchValue");
static_assert(sizeof(UMG_EnumOptionItem_C_K2_SwitchValue) == 0x000001, "Wrong size on UMG_EnumOptionItem_C_K2_SwitchValue");
static_assert(offsetof(UMG_EnumOptionItem_C_K2_SwitchValue, bNext) == 0x000000, "Member 'UMG_EnumOptionItem_C_K2_SwitchValue::bNext' has a wrong offset!");

// Function UMG_EnumOptionItem.UMG_EnumOptionItem_C.RefreshValueStyle
// 0x0020 (0x0020 - 0x0000)
struct UMG_EnumOptionItem_C_RefreshValueStyle final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0008(0x0018)()
};
static_assert(alignof(UMG_EnumOptionItem_C_RefreshValueStyle) == 0x000008, "Wrong alignment on UMG_EnumOptionItem_C_RefreshValueStyle");
static_assert(sizeof(UMG_EnumOptionItem_C_RefreshValueStyle) == 0x000020, "Wrong size on UMG_EnumOptionItem_C_RefreshValueStyle");
static_assert(offsetof(UMG_EnumOptionItem_C_RefreshValueStyle, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UMG_EnumOptionItem_C_RefreshValueStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_RefreshValueStyle, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'UMG_EnumOptionItem_C_RefreshValueStyle::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_RefreshValueStyle, CallFunc_Array_Get_Item) == 0x000008, "Member 'UMG_EnumOptionItem_C_RefreshValueStyle::CallFunc_Array_Get_Item' has a wrong offset!");

// Function UMG_EnumOptionItem.UMG_EnumOptionItem_C.NavigationCustom
// 0x0018 (0x0018 - 0x0000)
struct UMG_EnumOptionItem_C_NavigationCustom final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_EnumOptionItem_C_NavigationCustom) == 0x000008, "Wrong alignment on UMG_EnumOptionItem_C_NavigationCustom");
static_assert(sizeof(UMG_EnumOptionItem_C_NavigationCustom) == 0x000018, "Wrong size on UMG_EnumOptionItem_C_NavigationCustom");
static_assert(offsetof(UMG_EnumOptionItem_C_NavigationCustom, Navigation_0) == 0x000000, "Member 'UMG_EnumOptionItem_C_NavigationCustom::Navigation_0' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_NavigationCustom, ReturnValue) == 0x000008, "Member 'UMG_EnumOptionItem_C_NavigationCustom::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_EnumOptionItem_C_NavigationCustom, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'UMG_EnumOptionItem_C_NavigationCustom::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

