#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Widget_ActionButton01

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_Widget_ActionButton01.UMG_Widget_ActionButton01_C.ExecuteUbergraph_UMG_Widget_ActionButton01
// 0x0080 (0x0080 - 0x0000)
struct UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0018(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0030(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0048(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0060(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01) == 0x000008, "Wrong alignment on UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01");
static_assert(sizeof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01) == 0x000080, "Wrong size on UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01");
static_assert(offsetof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01, EntryPoint) == 0x000000, "Member 'UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01, CallFunc_MakeLiteralText_ReturnValue) == 0x000018, "Member 'UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01, CallFunc_GetText_ReturnValue) == 0x000030, "Member 'UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01, CallFunc_TextToUpper_ReturnValue) == 0x000048, "Member 'UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01, CallFunc_TextToUpper_ReturnValue_1) == 0x000060, "Member 'UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000078, "Member 'UMG_Widget_ActionButton01_C_ExecuteUbergraph_UMG_Widget_ActionButton01::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");

}

