#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_EndGameChallengePage

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_EndGameChallengePage.UMG_EndGameChallengePage_C
// 0x0088 (0x0300 - 0x0278)
class UUMG_EndGameChallengePage_C final : public UPBEndGameChallengePage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard;                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_1;                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_2;                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_3;                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_4;                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_5;                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_6;                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_7;                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_8;                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_9;                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_10;                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_11;                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_12;                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_13;                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EndGameChallengeCard_C*            UMG_EndGameChallengeCard_14;                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Progression;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_EndGameChallengePage(int32 EntryPoint);
	void K2_RefreshPage();
	void Construct();
	void RefreshProgression();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_EndGameChallengePage_C">();
	}
	static class UUMG_EndGameChallengePage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_EndGameChallengePage_C>();
	}
};
static_assert(alignof(UUMG_EndGameChallengePage_C) == 0x000008, "Wrong alignment on UUMG_EndGameChallengePage_C");
static_assert(sizeof(UUMG_EndGameChallengePage_C) == 0x000300, "Wrong size on UUMG_EndGameChallengePage_C");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UberGraphFrame) == 0x000278, "Member 'UUMG_EndGameChallengePage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard) == 0x000280, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_1) == 0x000288, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_1' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_2) == 0x000290, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_2' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_3) == 0x000298, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_3' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_4) == 0x0002A0, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_4' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_5) == 0x0002A8, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_5' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_6) == 0x0002B0, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_6' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_7) == 0x0002B8, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_7' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_8) == 0x0002C0, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_8' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_9) == 0x0002C8, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_9' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_10) == 0x0002D0, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_10' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_11) == 0x0002D8, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_11' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_12) == 0x0002E0, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_12' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_13) == 0x0002E8, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_13' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, UMG_EndGameChallengeCard_14) == 0x0002F0, "Member 'UUMG_EndGameChallengePage_C::UMG_EndGameChallengeCard_14' has a wrong offset!");
static_assert(offsetof(UUMG_EndGameChallengePage_C, WrapBox_Progression) == 0x0002F8, "Member 'UUMG_EndGameChallengePage_C::WrapBox_Progression' has a wrong offset!");

}

