#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMGSlot

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum UMGSlot.EUSAddToSlotAction
// NumValues: 0x0003
enum class EUSAddToSlotAction : uint8
{
	Add                                      = 0,
	Remove                                   = 1,
	EUSAddToSlotAction_MAX                   = 2,
};

// ScriptStruct UMGSlot.USWidgetHandle
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FUSWidgetHandle final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUSWidgetHandle) == 0x000008, "Wrong alignment on FUSWidgetHandle");
static_assert(sizeof(FUSWidgetHandle) == 0x000018, "Wrong size on FUSWidgetHandle");

// ScriptStruct UMGSlot.USWidgetRequest
// 0x0038 (0x0038 - 0x0000)
struct FUSWidgetRequest final
{
public:
	struct FUSWidgetHandle                        WidgetHandle;                                      // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SlotTag;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UUserWidget>             Content;                                           // 0x0024(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ContextObject;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUSWidgetRequest) == 0x000008, "Wrong alignment on FUSWidgetRequest");
static_assert(sizeof(FUSWidgetRequest) == 0x000038, "Wrong size on FUSWidgetRequest");
static_assert(offsetof(FUSWidgetRequest, WidgetHandle) == 0x000000, "Member 'FUSWidgetRequest::WidgetHandle' has a wrong offset!");
static_assert(offsetof(FUSWidgetRequest, SlotTag) == 0x000018, "Member 'FUSWidgetRequest::SlotTag' has a wrong offset!");
static_assert(offsetof(FUSWidgetRequest, Priority) == 0x000020, "Member 'FUSWidgetRequest::Priority' has a wrong offset!");
static_assert(offsetof(FUSWidgetRequest, Content) == 0x000024, "Member 'FUSWidgetRequest::Content' has a wrong offset!");
static_assert(offsetof(FUSWidgetRequest, ContextObject) == 0x000030, "Member 'FUSWidgetRequest::ContextObject' has a wrong offset!");

// ScriptStruct UMGSlot.USSlotHandle
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FUSSlotHandle final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUSSlotHandle) == 0x000008, "Wrong alignment on FUSSlotHandle");
static_assert(sizeof(FUSSlotHandle) == 0x000018, "Wrong size on FUSSlotHandle");

}

