#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMGSlot

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "UMGSlot_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class UMGSlot.USUMGSlotSubsystem
// 0x00A0 (0x00D0 - 0x0030)
class UUSUMGSlotSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FUSWidgetHandle AddWidgetToSlot(const struct FGameplayTag& InSlotName, class UUserWidget* InContent, int32 InPriority);
	void RemoveSlot(const struct FUSSlotHandle& Handle);
	void RemoveWidgetFromSlot(const struct FUSWidgetHandle& WidgetHandle);
	void RemoveWidgetsFromSlot(const struct FGameplayTag& InSlotName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"USUMGSlotSubsystem">();
	}
	static class UUSUMGSlotSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUSUMGSlotSubsystem>();
	}
};
static_assert(alignof(UUSUMGSlotSubsystem) == 0x000008, "Wrong alignment on UUSUMGSlotSubsystem");
static_assert(sizeof(UUSUMGSlotSubsystem) == 0x0000D0, "Wrong size on UUSUMGSlotSubsystem");

// Class UMGSlot.USUMGSlotWidget
// 0x0070 (0x0248 - 0x01D8)
class UUSUMGSlotWidget final : public UDynamicEntryBoxBase
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x01D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E0[0x18];                                     // 0x01E0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FUSWidgetHandle, class UUserWidget*> WidgetMap;                                         // 0x01F8(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"USUMGSlotWidget">();
	}
	static class UUSUMGSlotWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUSUMGSlotWidget>();
	}
};
static_assert(alignof(UUSUMGSlotWidget) == 0x000008, "Wrong alignment on UUSUMGSlotWidget");
static_assert(sizeof(UUSUMGSlotWidget) == 0x000248, "Wrong size on UUSUMGSlotWidget");
static_assert(offsetof(UUSUMGSlotWidget, SlotTag) == 0x0001D8, "Member 'UUSUMGSlotWidget::SlotTag' has a wrong offset!");
static_assert(offsetof(UUSUMGSlotWidget, WidgetMap) == 0x0001F8, "Member 'UUSUMGSlotWidget::WidgetMap' has a wrong offset!");

}

