#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnityMatchmaker

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct UnityMatchmaker.UMEchoProgress
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FUMEchoProgress final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUMEchoProgress) == 0x000008, "Wrong alignment on FUMEchoProgress");
static_assert(sizeof(FUMEchoProgress) == 0x000058, "Wrong size on FUMEchoProgress");

// ScriptStruct UnityMatchmaker.UMEchoServerPacket
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FUMEchoServerPacket final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUMEchoServerPacket) == 0x000008, "Wrong alignment on FUMEchoServerPacket");
static_assert(sizeof(FUMEchoServerPacket) == 0x000028, "Wrong size on FUMEchoServerPacket");

// ScriptStruct UnityMatchmaker.UMQoSResult
// 0x0030 (0x0030 - 0x0000)
struct FUMQoSResult final
{
public:
	class FString                                 Region;                                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Latency;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PacketLoss;                                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUMQoSResult) == 0x000008, "Wrong alignment on FUMQoSResult");
static_assert(sizeof(FUMQoSResult) == 0x000030, "Wrong size on FUMQoSResult");
static_assert(offsetof(FUMQoSResult, Region) == 0x000000, "Member 'FUMQoSResult::Region' has a wrong offset!");
static_assert(offsetof(FUMQoSResult, Latency) == 0x000010, "Member 'FUMQoSResult::Latency' has a wrong offset!");
static_assert(offsetof(FUMQoSResult, PacketLoss) == 0x000018, "Member 'FUMQoSResult::PacketLoss' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMQoSResultList
// 0x0010 (0x0010 - 0x0000)
struct FUMQoSResultList final
{
public:
	TArray<struct FUMQoSResult>                   QoSResults;                                        // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMQoSResultList) == 0x000008, "Wrong alignment on FUMQoSResultList");
static_assert(sizeof(FUMQoSResultList) == 0x000010, "Wrong size on FUMQoSResultList");
static_assert(offsetof(FUMQoSResultList, QoSResults) == 0x000000, "Member 'FUMQoSResultList::QoSResults' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMServer
// 0x0038 (0x0038 - 0x0000)
struct FUMServer final
{
public:
	class FString                                 RegionID;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IPv4;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IPv6;                                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocationId;                                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMServer) == 0x000008, "Wrong alignment on FUMServer");
static_assert(sizeof(FUMServer) == 0x000038, "Wrong size on FUMServer");
static_assert(offsetof(FUMServer, RegionID) == 0x000000, "Member 'FUMServer::RegionID' has a wrong offset!");
static_assert(offsetof(FUMServer, IPv4) == 0x000010, "Member 'FUMServer::IPv4' has a wrong offset!");
static_assert(offsetof(FUMServer, IPv6) == 0x000020, "Member 'FUMServer::IPv6' has a wrong offset!");
static_assert(offsetof(FUMServer, LocationId) == 0x000030, "Member 'FUMServer::LocationId' has a wrong offset!");
static_assert(offsetof(FUMServer, Port) == 0x000034, "Member 'FUMServer::Port' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMServerList
// 0x0010 (0x0010 - 0x0000)
struct FUMServerList final
{
public:
	TArray<struct FUMServer>                      Servers;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMServerList) == 0x000008, "Wrong alignment on FUMServerList");
static_assert(sizeof(FUMServerList) == 0x000010, "Wrong size on FUMServerList");
static_assert(offsetof(FUMServerList, Servers) == 0x000000, "Member 'FUMServerList::Servers' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMUpdateBackfillTicketRequest
// 0x00C0 (0x00C0 - 0x0000)
struct FUMUpdateBackfillTicketRequest final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Connection;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Attributes;                                        // 0x0020(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Properties;                                        // 0x0070(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMUpdateBackfillTicketRequest) == 0x000008, "Wrong alignment on FUMUpdateBackfillTicketRequest");
static_assert(sizeof(FUMUpdateBackfillTicketRequest) == 0x0000C0, "Wrong size on FUMUpdateBackfillTicketRequest");
static_assert(offsetof(FUMUpdateBackfillTicketRequest, ID) == 0x000000, "Member 'FUMUpdateBackfillTicketRequest::ID' has a wrong offset!");
static_assert(offsetof(FUMUpdateBackfillTicketRequest, Connection) == 0x000010, "Member 'FUMUpdateBackfillTicketRequest::Connection' has a wrong offset!");
static_assert(offsetof(FUMUpdateBackfillTicketRequest, Attributes) == 0x000020, "Member 'FUMUpdateBackfillTicketRequest::Attributes' has a wrong offset!");
static_assert(offsetof(FUMUpdateBackfillTicketRequest, Properties) == 0x000070, "Member 'FUMUpdateBackfillTicketRequest::Properties' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMBackfillTicket
// 0x00F0 (0x00F0 - 0x0000)
struct FUMBackfillTicket final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Connection;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Attributes;                                        // 0x0020(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Properties;                                        // 0x0070(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 QueueName;                                         // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MatchID;                                           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PoolId;                                            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMBackfillTicket) == 0x000008, "Wrong alignment on FUMBackfillTicket");
static_assert(sizeof(FUMBackfillTicket) == 0x0000F0, "Wrong size on FUMBackfillTicket");
static_assert(offsetof(FUMBackfillTicket, ID) == 0x000000, "Member 'FUMBackfillTicket::ID' has a wrong offset!");
static_assert(offsetof(FUMBackfillTicket, Connection) == 0x000010, "Member 'FUMBackfillTicket::Connection' has a wrong offset!");
static_assert(offsetof(FUMBackfillTicket, Attributes) == 0x000020, "Member 'FUMBackfillTicket::Attributes' has a wrong offset!");
static_assert(offsetof(FUMBackfillTicket, Properties) == 0x000070, "Member 'FUMBackfillTicket::Properties' has a wrong offset!");
static_assert(offsetof(FUMBackfillTicket, QueueName) == 0x0000C0, "Member 'FUMBackfillTicket::QueueName' has a wrong offset!");
static_assert(offsetof(FUMBackfillTicket, MatchID) == 0x0000D0, "Member 'FUMBackfillTicket::MatchID' has a wrong offset!");
static_assert(offsetof(FUMBackfillTicket, PoolId) == 0x0000E0, "Member 'FUMBackfillTicket::PoolId' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMCreateBackfillTicketResponse
// 0x0010 (0x0010 - 0x0000)
struct FUMCreateBackfillTicketResponse final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMCreateBackfillTicketResponse) == 0x000008, "Wrong alignment on FUMCreateBackfillTicketResponse");
static_assert(sizeof(FUMCreateBackfillTicketResponse) == 0x000010, "Wrong size on FUMCreateBackfillTicketResponse");
static_assert(offsetof(FUMCreateBackfillTicketResponse, ID) == 0x000000, "Member 'FUMCreateBackfillTicketResponse::ID' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMCreateBackfillRequest
// 0x00E0 (0x00E0 - 0x0000)
struct FUMCreateBackfillRequest final
{
public:
	class FString                                 QueueName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Connection;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Attributes;                                        // 0x0020(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 PoolId;                                            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Properties;                                        // 0x0080(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 MatchID;                                           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMCreateBackfillRequest) == 0x000008, "Wrong alignment on FUMCreateBackfillRequest");
static_assert(sizeof(FUMCreateBackfillRequest) == 0x0000E0, "Wrong size on FUMCreateBackfillRequest");
static_assert(offsetof(FUMCreateBackfillRequest, QueueName) == 0x000000, "Member 'FUMCreateBackfillRequest::QueueName' has a wrong offset!");
static_assert(offsetof(FUMCreateBackfillRequest, Connection) == 0x000010, "Member 'FUMCreateBackfillRequest::Connection' has a wrong offset!");
static_assert(offsetof(FUMCreateBackfillRequest, Attributes) == 0x000020, "Member 'FUMCreateBackfillRequest::Attributes' has a wrong offset!");
static_assert(offsetof(FUMCreateBackfillRequest, PoolId) == 0x000070, "Member 'FUMCreateBackfillRequest::PoolId' has a wrong offset!");
static_assert(offsetof(FUMCreateBackfillRequest, Properties) == 0x000080, "Member 'FUMCreateBackfillRequest::Properties' has a wrong offset!");
static_assert(offsetof(FUMCreateBackfillRequest, MatchID) == 0x0000D0, "Member 'FUMCreateBackfillRequest::MatchID' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMMatchmakerTeam
// 0x0030 (0x0030 - 0x0000)
struct FUMMatchmakerTeam final
{
public:
	class FString                                 TeamName;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TeamID;                                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         PlayerIds;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMMatchmakerTeam) == 0x000008, "Wrong alignment on FUMMatchmakerTeam");
static_assert(sizeof(FUMMatchmakerTeam) == 0x000030, "Wrong size on FUMMatchmakerTeam");
static_assert(offsetof(FUMMatchmakerTeam, TeamName) == 0x000000, "Member 'FUMMatchmakerTeam::TeamName' has a wrong offset!");
static_assert(offsetof(FUMMatchmakerTeam, TeamID) == 0x000010, "Member 'FUMMatchmakerTeam::TeamID' has a wrong offset!");
static_assert(offsetof(FUMMatchmakerTeam, PlayerIds) == 0x000020, "Member 'FUMMatchmakerTeam::PlayerIds' has a wrong offset!");

// ScriptStruct UnityMatchmaker.QoSResult
// 0x0018 (0x0018 - 0x0000)
struct FQoSResult final
{
public:
	int32                                         Latency;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PacketLoss;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RegionID;                                          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FQoSResult) == 0x000008, "Wrong alignment on FQoSResult");
static_assert(sizeof(FQoSResult) == 0x000018, "Wrong size on FQoSResult");
static_assert(offsetof(FQoSResult, Latency) == 0x000000, "Member 'FQoSResult::Latency' has a wrong offset!");
static_assert(offsetof(FQoSResult, PacketLoss) == 0x000004, "Member 'FQoSResult::PacketLoss' has a wrong offset!");
static_assert(offsetof(FQoSResult, RegionID) == 0x000008, "Member 'FQoSResult::RegionID' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMMatchmakerPlayerCustomData
// 0x0020 (0x0020 - 0x0000)
struct FUMMatchmakerPlayerCustomData final
{
public:
	double                                        SkillRating;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RankPoints;                                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMMatchmakerPlayerCustomData) == 0x000008, "Wrong alignment on FUMMatchmakerPlayerCustomData");
static_assert(sizeof(FUMMatchmakerPlayerCustomData) == 0x000020, "Wrong size on FUMMatchmakerPlayerCustomData");
static_assert(offsetof(FUMMatchmakerPlayerCustomData, SkillRating) == 0x000000, "Member 'FUMMatchmakerPlayerCustomData::SkillRating' has a wrong offset!");
static_assert(offsetof(FUMMatchmakerPlayerCustomData, RankPoints) == 0x000008, "Member 'FUMMatchmakerPlayerCustomData::RankPoints' has a wrong offset!");
static_assert(offsetof(FUMMatchmakerPlayerCustomData, Tags) == 0x000010, "Member 'FUMMatchmakerPlayerCustomData::Tags' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMMatchmakerPlayer
// 0x0040 (0x0040 - 0x0000)
struct FUMMatchmakerPlayer final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQoSResult>                     QoSResults;                                        // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FUMMatchmakerPlayerCustomData          CustomData;                                        // 0x0020(0x0020)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMMatchmakerPlayer) == 0x000008, "Wrong alignment on FUMMatchmakerPlayer");
static_assert(sizeof(FUMMatchmakerPlayer) == 0x000040, "Wrong size on FUMMatchmakerPlayer");
static_assert(offsetof(FUMMatchmakerPlayer, ID) == 0x000000, "Member 'FUMMatchmakerPlayer::ID' has a wrong offset!");
static_assert(offsetof(FUMMatchmakerPlayer, QoSResults) == 0x000010, "Member 'FUMMatchmakerPlayer::QoSResults' has a wrong offset!");
static_assert(offsetof(FUMMatchmakerPlayer, CustomData) == 0x000020, "Member 'FUMMatchmakerPlayer::CustomData' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMMatchProperties
// 0x0040 (0x0040 - 0x0000)
struct FUMMatchProperties final
{
public:
	TArray<struct FUMMatchmakerTeam>              Teams;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FUMMatchmakerPlayer>            Players;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Region;                                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackfillTicketId;                                  // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMMatchProperties) == 0x000008, "Wrong alignment on FUMMatchProperties");
static_assert(sizeof(FUMMatchProperties) == 0x000040, "Wrong size on FUMMatchProperties");
static_assert(offsetof(FUMMatchProperties, Teams) == 0x000000, "Member 'FUMMatchProperties::Teams' has a wrong offset!");
static_assert(offsetof(FUMMatchProperties, Players) == 0x000010, "Member 'FUMMatchProperties::Players' has a wrong offset!");
static_assert(offsetof(FUMMatchProperties, Region) == 0x000020, "Member 'FUMMatchProperties::Region' has a wrong offset!");
static_assert(offsetof(FUMMatchProperties, BackfillTicketId) == 0x000030, "Member 'FUMMatchProperties::BackfillTicketId' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMAllocationPayload
// 0x00B0 (0x00B0 - 0x0000)
struct FUMAllocationPayload final
{
public:
	struct FUMMatchProperties                     MatchProperties;                                   // 0x0000(0x0040)(NativeAccessSpecifierPublic)
	class FString                                 GeneratorName;                                     // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 QueueName;                                         // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PoolName;                                          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EnvironmentId;                                     // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackfillTicketId;                                  // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MatchID;                                           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PoolId;                                            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMAllocationPayload) == 0x000008, "Wrong alignment on FUMAllocationPayload");
static_assert(sizeof(FUMAllocationPayload) == 0x0000B0, "Wrong size on FUMAllocationPayload");
static_assert(offsetof(FUMAllocationPayload, MatchProperties) == 0x000000, "Member 'FUMAllocationPayload::MatchProperties' has a wrong offset!");
static_assert(offsetof(FUMAllocationPayload, GeneratorName) == 0x000040, "Member 'FUMAllocationPayload::GeneratorName' has a wrong offset!");
static_assert(offsetof(FUMAllocationPayload, QueueName) == 0x000050, "Member 'FUMAllocationPayload::QueueName' has a wrong offset!");
static_assert(offsetof(FUMAllocationPayload, PoolName) == 0x000060, "Member 'FUMAllocationPayload::PoolName' has a wrong offset!");
static_assert(offsetof(FUMAllocationPayload, EnvironmentId) == 0x000070, "Member 'FUMAllocationPayload::EnvironmentId' has a wrong offset!");
static_assert(offsetof(FUMAllocationPayload, BackfillTicketId) == 0x000080, "Member 'FUMAllocationPayload::BackfillTicketId' has a wrong offset!");
static_assert(offsetof(FUMAllocationPayload, MatchID) == 0x000090, "Member 'FUMAllocationPayload::MatchID' has a wrong offset!");
static_assert(offsetof(FUMAllocationPayload, PoolId) == 0x0000A0, "Member 'FUMAllocationPayload::PoolId' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMMatchPropertiesWrapper
// 0x0040 (0x0040 - 0x0000)
struct FUMMatchPropertiesWrapper final
{
public:
	struct FUMMatchProperties                     MatchProperties;                                   // 0x0000(0x0040)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMMatchPropertiesWrapper) == 0x000008, "Wrong alignment on FUMMatchPropertiesWrapper");
static_assert(sizeof(FUMMatchPropertiesWrapper) == 0x000040, "Wrong size on FUMMatchPropertiesWrapper");
static_assert(offsetof(FUMMatchPropertiesWrapper, MatchProperties) == 0x000000, "Member 'FUMMatchPropertiesWrapper::MatchProperties' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMPayloadToken
// 0x0020 (0x0020 - 0x0000)
struct FUMPayloadToken final
{
public:
	class FString                                 Token;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Error;                                             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMPayloadToken) == 0x000008, "Wrong alignment on FUMPayloadToken");
static_assert(sizeof(FUMPayloadToken) == 0x000020, "Wrong size on FUMPayloadToken");
static_assert(offsetof(FUMPayloadToken, Token) == 0x000000, "Member 'FUMPayloadToken::Token' has a wrong offset!");
static_assert(offsetof(FUMPayloadToken, Error) == 0x000010, "Member 'FUMPayloadToken::Error' has a wrong offset!");

// ScriptStruct UnityMatchmaker.UMConfig
// 0x0090 (0x0090 - 0x0000)
struct FUMConfig final
{
public:
	class FString                                 SessionId;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionAuth;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConnectionIP;                                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConnectionPort;                                    // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 match_datacenter;                                  // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 multiplay_location;                                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 multiplay_virtualtypeid;                           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 matchmaker_ip;                                     // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 matchmaker_port;                                   // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMConfig) == 0x000008, "Wrong alignment on FUMConfig");
static_assert(sizeof(FUMConfig) == 0x000090, "Wrong size on FUMConfig");
static_assert(offsetof(FUMConfig, SessionId) == 0x000000, "Member 'FUMConfig::SessionId' has a wrong offset!");
static_assert(offsetof(FUMConfig, SessionAuth) == 0x000010, "Member 'FUMConfig::SessionAuth' has a wrong offset!");
static_assert(offsetof(FUMConfig, ConnectionIP) == 0x000020, "Member 'FUMConfig::ConnectionIP' has a wrong offset!");
static_assert(offsetof(FUMConfig, ConnectionPort) == 0x000030, "Member 'FUMConfig::ConnectionPort' has a wrong offset!");
static_assert(offsetof(FUMConfig, match_datacenter) == 0x000040, "Member 'FUMConfig::match_datacenter' has a wrong offset!");
static_assert(offsetof(FUMConfig, multiplay_location) == 0x000050, "Member 'FUMConfig::multiplay_location' has a wrong offset!");
static_assert(offsetof(FUMConfig, multiplay_virtualtypeid) == 0x000060, "Member 'FUMConfig::multiplay_virtualtypeid' has a wrong offset!");
static_assert(offsetof(FUMConfig, matchmaker_ip) == 0x000070, "Member 'FUMConfig::matchmaker_ip' has a wrong offset!");
static_assert(offsetof(FUMConfig, matchmaker_port) == 0x000080, "Member 'FUMConfig::matchmaker_port' has a wrong offset!");

}

