#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UStruct_DamageIndicatorOverallDamage

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct UStruct_DamageIndicatorOverallDamage.UStruct_DamageIndicatorOverallDamage
// 0x0020 (0x0020 - 0x0000)
struct FUStruct_DamageIndicatorOverallDamage final
{
public:
	class APlayerState*                           PlayerState_11_96DEEA95496CA29645976ABABF618A18;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      VFX_2_898A752A4FBFD624112824B1C1F11849;            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BackPackVFX_21_9DB0171F4EE6C041031C6A9A7F52D0A2;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccumulateDamage_5_83C5D0D7444B588A1E4920A20CC8BDA5; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccumulateBackPackDamage_15_2FFA6EE6470CA0317EC0B6B4E82BE0EA; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUStruct_DamageIndicatorOverallDamage) == 0x000008, "Wrong alignment on FUStruct_DamageIndicatorOverallDamage");
static_assert(sizeof(FUStruct_DamageIndicatorOverallDamage) == 0x000020, "Wrong size on FUStruct_DamageIndicatorOverallDamage");
static_assert(offsetof(FUStruct_DamageIndicatorOverallDamage, PlayerState_11_96DEEA95496CA29645976ABABF618A18) == 0x000000, "Member 'FUStruct_DamageIndicatorOverallDamage::PlayerState_11_96DEEA95496CA29645976ABABF618A18' has a wrong offset!");
static_assert(offsetof(FUStruct_DamageIndicatorOverallDamage, VFX_2_898A752A4FBFD624112824B1C1F11849) == 0x000008, "Member 'FUStruct_DamageIndicatorOverallDamage::VFX_2_898A752A4FBFD624112824B1C1F11849' has a wrong offset!");
static_assert(offsetof(FUStruct_DamageIndicatorOverallDamage, BackPackVFX_21_9DB0171F4EE6C041031C6A9A7F52D0A2) == 0x000010, "Member 'FUStruct_DamageIndicatorOverallDamage::BackPackVFX_21_9DB0171F4EE6C041031C6A9A7F52D0A2' has a wrong offset!");
static_assert(offsetof(FUStruct_DamageIndicatorOverallDamage, AccumulateDamage_5_83C5D0D7444B588A1E4920A20CC8BDA5) == 0x000018, "Member 'FUStruct_DamageIndicatorOverallDamage::AccumulateDamage_5_83C5D0D7444B588A1E4920A20CC8BDA5' has a wrong offset!");
static_assert(offsetof(FUStruct_DamageIndicatorOverallDamage, AccumulateBackPackDamage_15_2FFA6EE6470CA0317EC0B6B4E82BE0EA) == 0x00001C, "Member 'FUStruct_DamageIndicatorOverallDamage::AccumulateBackPackDamage_15_2FFA6EE6470CA0317EC0B6B4E82BE0EA' has a wrong offset!");

}

