#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VDWF_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function VDWF_Skeleton_AnimBlueprint.VDWF_Skeleton_AnimBlueprint_C.ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint
// 0x0020 (0x0020 - 0x0000)
struct VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACatchingModule_BP_C*                   K2Node_DynamicCast_AsCatching_Module_BP;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint");
static_assert(sizeof(VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint) == 0x000020, "Wrong size on VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint");
static_assert(offsetof(VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint, K2Node_DynamicCast_AsCatching_Module_BP) == 0x000010, "Member 'VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint::K2Node_DynamicCast_AsCatching_Module_BP' has a wrong offset!");
static_assert(offsetof(VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'VDWF_Skeleton_AnimBlueprint_C_ExecuteUbergraph_VDWF_Skeleton_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function VDWF_Skeleton_AnimBlueprint.VDWF_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct VDWF_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VDWF_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on VDWF_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(VDWF_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on VDWF_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(VDWF_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'VDWF_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function VDWF_Skeleton_AnimBlueprint.VDWF_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct VDWF_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(VDWF_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on VDWF_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(VDWF_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on VDWF_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(VDWF_Skeleton_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'VDWF_Skeleton_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

