#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaitingToRestartProgress

#include "Basic.hpp"

#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WaitingToRestartProgress.WaitingToRestartProgress_C
// 0x0028 (0x0288 - 0x0260)
class UWaitingToRestartProgress_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CountDownText;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressBar;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TheTimeOfWaitToRestart;                            // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitTheTimeOfWaitToRestart;                        // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DestTime;                                          // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RemainingTime;                                     // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WaitingToRestartProgress(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WaitingToRestartProgress_C">();
	}
	static class UWaitingToRestartProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaitingToRestartProgress_C>();
	}
};
static_assert(alignof(UWaitingToRestartProgress_C) == 0x000008, "Wrong alignment on UWaitingToRestartProgress_C");
static_assert(sizeof(UWaitingToRestartProgress_C) == 0x000288, "Wrong size on UWaitingToRestartProgress_C");
static_assert(offsetof(UWaitingToRestartProgress_C, UberGraphFrame) == 0x000260, "Member 'UWaitingToRestartProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWaitingToRestartProgress_C, CountDownText) == 0x000268, "Member 'UWaitingToRestartProgress_C::CountDownText' has a wrong offset!");
static_assert(offsetof(UWaitingToRestartProgress_C, ProgressBar) == 0x000270, "Member 'UWaitingToRestartProgress_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWaitingToRestartProgress_C, TheTimeOfWaitToRestart) == 0x000278, "Member 'UWaitingToRestartProgress_C::TheTimeOfWaitToRestart' has a wrong offset!");
static_assert(offsetof(UWaitingToRestartProgress_C, InitTheTimeOfWaitToRestart) == 0x00027C, "Member 'UWaitingToRestartProgress_C::InitTheTimeOfWaitToRestart' has a wrong offset!");
static_assert(offsetof(UWaitingToRestartProgress_C, DestTime) == 0x000280, "Member 'UWaitingToRestartProgress_C::DestTime' has a wrong offset!");
static_assert(offsetof(UWaitingToRestartProgress_C, RemainingTime) == 0x000284, "Member 'UWaitingToRestartProgress_C::RemainingTime' has a wrong offset!");

}

