#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaitingToRestartProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WaitingToRestartProgress.WaitingToRestartProgress_C.ExecuteUbergraph_WaitingToRestartProgress
// 0x01E0 (0x01E0 - 0x0000)
struct WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBModeRuleSetting                     CallFunc_GetModeRuleSetting_ReturnValue;           // 0x0058(0x0068)(ConstParm)
	class APBGameState*                           K2Node_DynamicCast_AsPBGame_State;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRemainingTime_ReturnValue;             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBGameState*                           K2Node_DynamicCast_AsPBGame_State_1;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBModeRuleSetting                     CallFunc_GetModeRuleSetting_ReturnValue_1;         // 0x00F8(0x0068)(ConstParm)
	int32                                         CallFunc_GetRemainingTime_ReturnValue_1;           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0170(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C0(0x0018)()
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress) == 0x000008, "Wrong alignment on WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress");
static_assert(sizeof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress) == 0x0001E0, "Wrong size on WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, EntryPoint) == 0x000000, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, K2Node_Event_MyGeometry) == 0x000010, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_GetGameState_ReturnValue) == 0x000050, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_GetModeRuleSetting_ReturnValue) == 0x000058, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_GetModeRuleSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, K2Node_DynamicCast_AsPBGame_State) == 0x0000C0, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::K2Node_DynamicCast_AsPBGame_State' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_GetRemainingTime_ReturnValue) == 0x0000CC, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_GetRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_Percent_IntInt_ReturnValue) == 0x0000D0, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_SafeDivide_ReturnValue) == 0x0000D4, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000D8, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000DC, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_GetGameState_ReturnValue_1) == 0x0000E0, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, K2Node_DynamicCast_AsPBGame_State_1) == 0x0000E8, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::K2Node_DynamicCast_AsPBGame_State_1' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_GetModeRuleSetting_ReturnValue_1) == 0x0000F8, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_GetModeRuleSetting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_GetRemainingTime_ReturnValue_1) == 0x000160, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_GetRemainingTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000164, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000168, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00016C, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, K2Node_MakeStruct_FormatArgumentData) == 0x000170, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, K2Node_MakeArray_Array) == 0x0001B0, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_Format_ReturnValue) == 0x0001C0, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001D8, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress, CallFunc_FMax_ReturnValue) == 0x0001DC, "Member 'WaitingToRestartProgress_C_ExecuteUbergraph_WaitingToRestartProgress::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function WaitingToRestartProgress.WaitingToRestartProgress_C.Tick
// 0x003C (0x003C - 0x0000)
struct WaitingToRestartProgress_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WaitingToRestartProgress_C_Tick) == 0x000004, "Wrong alignment on WaitingToRestartProgress_C_Tick");
static_assert(sizeof(WaitingToRestartProgress_C_Tick) == 0x00003C, "Wrong size on WaitingToRestartProgress_C_Tick");
static_assert(offsetof(WaitingToRestartProgress_C_Tick, MyGeometry) == 0x000000, "Member 'WaitingToRestartProgress_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WaitingToRestartProgress_C_Tick, InDeltaTime) == 0x000038, "Member 'WaitingToRestartProgress_C_Tick::InDeltaTime' has a wrong offset!");

}

