#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaypointSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "WaypointSystem_structs.hpp"


namespace SDK::Params
{

// Function WaypointSystem.WSWaypoint.AddBackwardLink
// 0x0008 (0x0008 - 0x0000)
struct WSWaypoint_AddBackwardLink final
{
public:
	struct FWSWaypointLink                        InWaypointLink;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypoint_AddBackwardLink) == 0x000008, "Wrong alignment on WSWaypoint_AddBackwardLink");
static_assert(sizeof(WSWaypoint_AddBackwardLink) == 0x000008, "Wrong size on WSWaypoint_AddBackwardLink");
static_assert(offsetof(WSWaypoint_AddBackwardLink, InWaypointLink) == 0x000000, "Member 'WSWaypoint_AddBackwardLink::InWaypointLink' has a wrong offset!");

// Function WaypointSystem.WSWaypoint.AddForwardLink
// 0x0008 (0x0008 - 0x0000)
struct WSWaypoint_AddForwardLink final
{
public:
	struct FWSWaypointLink                        InWaypointLink;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypoint_AddForwardLink) == 0x000008, "Wrong alignment on WSWaypoint_AddForwardLink");
static_assert(sizeof(WSWaypoint_AddForwardLink) == 0x000008, "Wrong size on WSWaypoint_AddForwardLink");
static_assert(offsetof(WSWaypoint_AddForwardLink, InWaypointLink) == 0x000000, "Member 'WSWaypoint_AddForwardLink::InWaypointLink' has a wrong offset!");

// Function WaypointSystem.WSWaypoint.RemoveBackwardLink
// 0x0008 (0x0008 - 0x0000)
struct WSWaypoint_RemoveBackwardLink final
{
public:
	class AWSWaypoint*                            InWaypoint;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypoint_RemoveBackwardLink) == 0x000008, "Wrong alignment on WSWaypoint_RemoveBackwardLink");
static_assert(sizeof(WSWaypoint_RemoveBackwardLink) == 0x000008, "Wrong size on WSWaypoint_RemoveBackwardLink");
static_assert(offsetof(WSWaypoint_RemoveBackwardLink, InWaypoint) == 0x000000, "Member 'WSWaypoint_RemoveBackwardLink::InWaypoint' has a wrong offset!");

// Function WaypointSystem.WSWaypoint.RemoveForwardLink
// 0x0008 (0x0008 - 0x0000)
struct WSWaypoint_RemoveForwardLink final
{
public:
	class AWSWaypoint*                            InWaypoint;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypoint_RemoveForwardLink) == 0x000008, "Wrong alignment on WSWaypoint_RemoveForwardLink");
static_assert(sizeof(WSWaypoint_RemoveForwardLink) == 0x000008, "Wrong size on WSWaypoint_RemoveForwardLink");
static_assert(offsetof(WSWaypoint_RemoveForwardLink, InWaypoint) == 0x000000, "Member 'WSWaypoint_RemoveForwardLink::InWaypoint' has a wrong offset!");

// Function WaypointSystem.WSWaypoint.GetNextPoint
// 0x0008 (0x0008 - 0x0000)
struct WSWaypoint_GetNextPoint final
{
public:
	class AWSWaypoint*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypoint_GetNextPoint) == 0x000008, "Wrong alignment on WSWaypoint_GetNextPoint");
static_assert(sizeof(WSWaypoint_GetNextPoint) == 0x000008, "Wrong size on WSWaypoint_GetNextPoint");
static_assert(offsetof(WSWaypoint_GetNextPoint, ReturnValue) == 0x000000, "Member 'WSWaypoint_GetNextPoint::ReturnValue' has a wrong offset!");

// Function WaypointSystem.WSWaypoint.GetPreviousPoint
// 0x0008 (0x0008 - 0x0000)
struct WSWaypoint_GetPreviousPoint final
{
public:
	class AWSWaypoint*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypoint_GetPreviousPoint) == 0x000008, "Wrong alignment on WSWaypoint_GetPreviousPoint");
static_assert(sizeof(WSWaypoint_GetPreviousPoint) == 0x000008, "Wrong size on WSWaypoint_GetPreviousPoint");
static_assert(offsetof(WSWaypoint_GetPreviousPoint, ReturnValue) == 0x000000, "Member 'WSWaypoint_GetPreviousPoint::ReturnValue' has a wrong offset!");

// Function WaypointSystem.WSWaypoint.HasReached
// 0x0014 (0x0014 - 0x0000)
struct WSWaypoint_HasReached final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AcceptanceRadius;                                  // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WSWaypoint_HasReached) == 0x000004, "Wrong alignment on WSWaypoint_HasReached");
static_assert(sizeof(WSWaypoint_HasReached) == 0x000014, "Wrong size on WSWaypoint_HasReached");
static_assert(offsetof(WSWaypoint_HasReached, InLocation) == 0x000000, "Member 'WSWaypoint_HasReached::InLocation' has a wrong offset!");
static_assert(offsetof(WSWaypoint_HasReached, AcceptanceRadius) == 0x00000C, "Member 'WSWaypoint_HasReached::AcceptanceRadius' has a wrong offset!");
static_assert(offsetof(WSWaypoint_HasReached, ReturnValue) == 0x000010, "Member 'WSWaypoint_HasReached::ReturnValue' has a wrong offset!");

// Function WaypointSystem.WSWaypoint.IsEndPoint
// 0x0001 (0x0001 - 0x0000)
struct WSWaypoint_IsEndPoint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypoint_IsEndPoint) == 0x000001, "Wrong alignment on WSWaypoint_IsEndPoint");
static_assert(sizeof(WSWaypoint_IsEndPoint) == 0x000001, "Wrong size on WSWaypoint_IsEndPoint");
static_assert(offsetof(WSWaypoint_IsEndPoint, ReturnValue) == 0x000000, "Member 'WSWaypoint_IsEndPoint::ReturnValue' has a wrong offset!");

// Function WaypointSystem.WSWaypoint.IsStartPoint
// 0x0001 (0x0001 - 0x0000)
struct WSWaypoint_IsStartPoint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypoint_IsStartPoint) == 0x000001, "Wrong alignment on WSWaypoint_IsStartPoint");
static_assert(sizeof(WSWaypoint_IsStartPoint) == 0x000001, "Wrong size on WSWaypoint_IsStartPoint");
static_assert(offsetof(WSWaypoint_IsStartPoint, ReturnValue) == 0x000000, "Member 'WSWaypoint_IsStartPoint::ReturnValue' has a wrong offset!");

// Function WaypointSystem.WSWaypointManager.GetClosestWaypoint
// 0x0028 (0x0028 - 0x0000)
struct WSWaypointManager_GetClosestWaypoint final
{
public:
	struct FVector                                CurrentLocation;                                   // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           InTags;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class AWSWaypoint*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypointManager_GetClosestWaypoint) == 0x000008, "Wrong alignment on WSWaypointManager_GetClosestWaypoint");
static_assert(sizeof(WSWaypointManager_GetClosestWaypoint) == 0x000028, "Wrong size on WSWaypointManager_GetClosestWaypoint");
static_assert(offsetof(WSWaypointManager_GetClosestWaypoint, CurrentLocation) == 0x000000, "Member 'WSWaypointManager_GetClosestWaypoint::CurrentLocation' has a wrong offset!");
static_assert(offsetof(WSWaypointManager_GetClosestWaypoint, InTags) == 0x000010, "Member 'WSWaypointManager_GetClosestWaypoint::InTags' has a wrong offset!");
static_assert(offsetof(WSWaypointManager_GetClosestWaypoint, ReturnValue) == 0x000020, "Member 'WSWaypointManager_GetClosestWaypoint::ReturnValue' has a wrong offset!");

// Function WaypointSystem.WSWaypointManager.GetWaypoints
// 0x0010 (0x0010 - 0x0000)
struct WSWaypointManager_GetWaypoints final
{
public:
	TArray<class AWSWaypoint*>                    ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypointManager_GetWaypoints) == 0x000008, "Wrong alignment on WSWaypointManager_GetWaypoints");
static_assert(sizeof(WSWaypointManager_GetWaypoints) == 0x000010, "Wrong size on WSWaypointManager_GetWaypoints");
static_assert(offsetof(WSWaypointManager_GetWaypoints, ReturnValue) == 0x000000, "Member 'WSWaypointManager_GetWaypoints::ReturnValue' has a wrong offset!");

// Function WaypointSystem.WSWaypointManager.GetWaypointsByTag
// 0x0020 (0x0020 - 0x0000)
struct WSWaypointManager_GetWaypointsByTag final
{
public:
	TArray<class FName>                           InTags;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AWSWaypoint*>                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WSWaypointManager_GetWaypointsByTag) == 0x000008, "Wrong alignment on WSWaypointManager_GetWaypointsByTag");
static_assert(sizeof(WSWaypointManager_GetWaypointsByTag) == 0x000020, "Wrong size on WSWaypointManager_GetWaypointsByTag");
static_assert(offsetof(WSWaypointManager_GetWaypointsByTag, InTags) == 0x000000, "Member 'WSWaypointManager_GetWaypointsByTag::InTags' has a wrong offset!");
static_assert(offsetof(WSWaypointManager_GetWaypointsByTag, ReturnValue) == 0x000010, "Member 'WSWaypointManager_GetWaypointsByTag::ReturnValue' has a wrong offset!");

}

