#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponCaptureActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WeaponCaptureActor.WeaponCaptureActor_C.ExecuteUbergraph_WeaponCaptureActor
// 0x0004 (0x0004 - 0x0000)
struct WeaponCaptureActor_C_ExecuteUbergraph_WeaponCaptureActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponCaptureActor_C_ExecuteUbergraph_WeaponCaptureActor) == 0x000004, "Wrong alignment on WeaponCaptureActor_C_ExecuteUbergraph_WeaponCaptureActor");
static_assert(sizeof(WeaponCaptureActor_C_ExecuteUbergraph_WeaponCaptureActor) == 0x000004, "Wrong size on WeaponCaptureActor_C_ExecuteUbergraph_WeaponCaptureActor");
static_assert(offsetof(WeaponCaptureActor_C_ExecuteUbergraph_WeaponCaptureActor, EntryPoint) == 0x000000, "Member 'WeaponCaptureActor_C_ExecuteUbergraph_WeaponCaptureActor::EntryPoint' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.BPFindWeaponPartConfig
// 0x0098 (0x0098 - 0x0000)
struct WeaponCaptureActor_C_BPFindWeaponPartConfig final
{
public:
	class UClass*                                 WeaponClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RoleId;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ID;                                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCharacterSlotType                          SlotType;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 OutWeaponClass;                                    // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBWeaponNetworkConfig                 ReturnWeaponPartConfigData;                        // 0x0028(0x0038)(Parm, OutParm)
	struct FPBWeaponNetworkConfig                 CallFunc_GetWeaponPartInfo_PBWeaponPartSavedConfig; // 0x0060(0x0038)()
};
static_assert(alignof(WeaponCaptureActor_C_BPFindWeaponPartConfig) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_BPFindWeaponPartConfig");
static_assert(sizeof(WeaponCaptureActor_C_BPFindWeaponPartConfig) == 0x000098, "Wrong size on WeaponCaptureActor_C_BPFindWeaponPartConfig");
static_assert(offsetof(WeaponCaptureActor_C_BPFindWeaponPartConfig, WeaponClass) == 0x000000, "Member 'WeaponCaptureActor_C_BPFindWeaponPartConfig::WeaponClass' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPFindWeaponPartConfig, RoleId) == 0x000008, "Member 'WeaponCaptureActor_C_BPFindWeaponPartConfig::RoleId' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPFindWeaponPartConfig, ID) == 0x000010, "Member 'WeaponCaptureActor_C_BPFindWeaponPartConfig::ID' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPFindWeaponPartConfig, SlotType) == 0x000018, "Member 'WeaponCaptureActor_C_BPFindWeaponPartConfig::SlotType' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPFindWeaponPartConfig, OutWeaponClass) == 0x000020, "Member 'WeaponCaptureActor_C_BPFindWeaponPartConfig::OutWeaponClass' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPFindWeaponPartConfig, ReturnWeaponPartConfigData) == 0x000028, "Member 'WeaponCaptureActor_C_BPFindWeaponPartConfig::ReturnWeaponPartConfigData' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPFindWeaponPartConfig, CallFunc_GetWeaponPartInfo_PBWeaponPartSavedConfig) == 0x000060, "Member 'WeaponCaptureActor_C_BPFindWeaponPartConfig::CallFunc_GetWeaponPartInfo_PBWeaponPartSavedConfig' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.BPSetupWeaponLocation
// 0x0260 (0x0260 - 0x0000)
struct WeaponCaptureActor_C_BPSetupWeaponLocation final
{
public:
	class APBWeapon*                              Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Origin;                                            // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0140(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x01CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponCaptureActor_C_BPSetupWeaponLocation) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_BPSetupWeaponLocation");
static_assert(sizeof(WeaponCaptureActor_C_BPSetupWeaponLocation) == 0x000260, "Wrong size on WeaponCaptureActor_C_BPSetupWeaponLocation");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, Weapon) == 0x000000, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::Weapon' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, Rotation) == 0x000008, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::Rotation' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, Origin) == 0x000014, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::Origin' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_K2_SetActorRelativeRotation_SweepHitResult) == 0x000020, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_K2_SetActorRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A8, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_GetActorRightVector_ReturnValue) == 0x0000B4, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_BreakVector_X) == 0x0000C0, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_BreakVector_Y) == 0x0000C4, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_BreakVector_Z) == 0x0000C8, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_GetActorUpVector_ReturnValue) == 0x0000CC, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000D8, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000E4, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000F0, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000F4, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_GetActorBounds_Origin) == 0x000100, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_GetActorBounds_BoxExtent) == 0x00010C, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000118, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000124, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000130, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000134, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000140, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001C8, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x0001CC, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPSetupWeaponLocation, CallFunc_K2_SetTimer_ReturnValue) == 0x000258, "Member 'WeaponCaptureActor_C_BPSetupWeaponLocation::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.BPActualCaptureOneWeapon
// 0x0060 (0x0060 - 0x0000)
struct WeaponCaptureActor_C_BPActualCaptureOneWeapon final
{
public:
	class APBWeapon*                              Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 OutNormalRT;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 OutNormalDepthRT;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 OutSmallRT;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 OutSmallDepthRT;                                   // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempSkyLightDefaultIntensity;                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TempEnableVolumetric;                              // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewLocalVar_0;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 NormalRenderTarget;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 SmallRenderTarget;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempHDRDefalutIntensity;                           // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Origin;                                            // 0x004C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponCaptureActor_C_BPActualCaptureOneWeapon) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_BPActualCaptureOneWeapon");
static_assert(sizeof(WeaponCaptureActor_C_BPActualCaptureOneWeapon) == 0x000060, "Wrong size on WeaponCaptureActor_C_BPActualCaptureOneWeapon");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, Weapon) == 0x000000, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::Weapon' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, OutNormalRT) == 0x000008, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::OutNormalRT' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, OutNormalDepthRT) == 0x000010, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::OutNormalDepthRT' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, OutSmallRT) == 0x000018, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::OutSmallRT' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, OutSmallDepthRT) == 0x000020, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::OutSmallDepthRT' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, TempSkyLightDefaultIntensity) == 0x000028, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::TempSkyLightDefaultIntensity' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, TempEnableVolumetric) == 0x00002C, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::TempEnableVolumetric' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, NewLocalVar_0) == 0x000030, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, NormalRenderTarget) == 0x000038, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::NormalRenderTarget' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, SmallRenderTarget) == 0x000040, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::SmallRenderTarget' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, TempHDRDefalutIntensity) == 0x000048, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::TempHDRDefalutIntensity' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, Origin) == 0x00004C, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::Origin' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPActualCaptureOneWeapon, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WeaponCaptureActor_C_BPActualCaptureOneWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.BPCaptureOneWeapon
// 0x0080 (0x0080 - 0x0000)
struct WeaponCaptureActor_C_BPCaptureOneWeapon final
{
public:
	class UClass*                                 InWeapon;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RoleId;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ID;                                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCharacterSlotType                          SlotType;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 OutRenderTarget;                                   // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 OutDepthRenderTarget;                              // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_BPFindWeaponPartConfig_OutWeaponClass;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBWeaponNetworkConfig                 CallFunc_BPFindWeaponPartConfig_ReturnWeaponPartConfigData; // 0x0040(0x0038)()
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_1;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponCaptureActor_C_BPCaptureOneWeapon) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_BPCaptureOneWeapon");
static_assert(sizeof(WeaponCaptureActor_C_BPCaptureOneWeapon) == 0x000080, "Wrong size on WeaponCaptureActor_C_BPCaptureOneWeapon");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, InWeapon) == 0x000000, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::InWeapon' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, RoleId) == 0x000008, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::RoleId' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, ID) == 0x000010, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::ID' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, SlotType) == 0x000018, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::SlotType' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, OutRenderTarget) == 0x000020, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::OutRenderTarget' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, OutDepthRenderTarget) == 0x000028, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::OutDepthRenderTarget' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000030, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, CallFunc_BPFindWeaponPartConfig_OutWeaponClass) == 0x000038, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::CallFunc_BPFindWeaponPartConfig_OutWeaponClass' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, CallFunc_BPFindWeaponPartConfig_ReturnWeaponPartConfigData) == 0x000040, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::CallFunc_BPFindWeaponPartConfig_ReturnWeaponPartConfigData' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureOneWeapon, CallFunc_CreateRenderTarget2D_ReturnValue_1) == 0x000078, "Member 'WeaponCaptureActor_C_BPCaptureOneWeapon::CallFunc_CreateRenderTarget2D_ReturnValue_1' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.GetWeaponPartInfo
// 0x0050 (0x0050 - 0x0000)
struct WeaponCaptureActor_C_GetWeaponPartInfo final
{
public:
	class FName                                   RoleId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Key;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCharacterSlotType                          SlotType;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBWeaponNetworkConfig                 PBWeaponPartSavedConfig;                           // 0x0018(0x0038)(Parm, OutParm)
};
static_assert(alignof(WeaponCaptureActor_C_GetWeaponPartInfo) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_GetWeaponPartInfo");
static_assert(sizeof(WeaponCaptureActor_C_GetWeaponPartInfo) == 0x000050, "Wrong size on WeaponCaptureActor_C_GetWeaponPartInfo");
static_assert(offsetof(WeaponCaptureActor_C_GetWeaponPartInfo, RoleId) == 0x000000, "Member 'WeaponCaptureActor_C_GetWeaponPartInfo::RoleId' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_GetWeaponPartInfo, Key) == 0x000008, "Member 'WeaponCaptureActor_C_GetWeaponPartInfo::Key' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_GetWeaponPartInfo, SlotType) == 0x000010, "Member 'WeaponCaptureActor_C_GetWeaponPartInfo::SlotType' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_GetWeaponPartInfo, PBWeaponPartSavedConfig) == 0x000018, "Member 'WeaponCaptureActor_C_GetWeaponPartInfo::PBWeaponPartSavedConfig' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.BPCaptureWeaponToRenderTarget
// 0x0268 (0x0268 - 0x0000)
struct WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget final
{
public:
	class FName                                   RoleId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ID;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBCharacterSlotType                          SlotType;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 OutRenderTarget;                                   // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 OutDepthRenderTarget;                              // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBWeaponDefinitionRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0210)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsPBWeapon;                // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_BPCaptureOneWeapon_OutRenderTarget;       // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_BPCaptureOneWeapon_OutDepthRenderTarget;  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget");
static_assert(sizeof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget) == 0x000268, "Wrong size on WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, RoleId) == 0x000000, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::RoleId' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, ID) == 0x000008, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::ID' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, SlotType) == 0x000010, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::SlotType' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, OutRenderTarget) == 0x000018, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::OutRenderTarget' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, OutDepthRenderTarget) == 0x000020, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::OutDepthRenderTarget' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000238, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000240, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, K2Node_ClassDynamicCast_AsPBWeapon) == 0x000248, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::K2Node_ClassDynamicCast_AsPBWeapon' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, K2Node_ClassDynamicCast_bSuccess) == 0x000250, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, CallFunc_BPCaptureOneWeapon_OutRenderTarget) == 0x000258, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::CallFunc_BPCaptureOneWeapon_OutRenderTarget' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget, CallFunc_BPCaptureOneWeapon_OutDepthRenderTarget) == 0x000260, "Member 'WeaponCaptureActor_C_BPCaptureWeaponToRenderTarget::CallFunc_BPCaptureOneWeapon_OutDepthRenderTarget' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.OrthogtahicCapture
// 0x0020 (0x0020 - 0x0000)
struct WeaponCaptureActor_C_OrthogtahicCapture final
{
public:
	class APBWeapon*                              Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RT;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 DepthRT;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponCaptureActor_C_OrthogtahicCapture) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_OrthogtahicCapture");
static_assert(sizeof(WeaponCaptureActor_C_OrthogtahicCapture) == 0x000020, "Wrong size on WeaponCaptureActor_C_OrthogtahicCapture");
static_assert(offsetof(WeaponCaptureActor_C_OrthogtahicCapture, Weapon) == 0x000000, "Member 'WeaponCaptureActor_C_OrthogtahicCapture::Weapon' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_OrthogtahicCapture, RT) == 0x000008, "Member 'WeaponCaptureActor_C_OrthogtahicCapture::RT' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_OrthogtahicCapture, DepthRT) == 0x000010, "Member 'WeaponCaptureActor_C_OrthogtahicCapture::DepthRT' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_OrthogtahicCapture, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponCaptureActor_C_OrthogtahicCapture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_OrthogtahicCapture, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WeaponCaptureActor_C_OrthogtahicCapture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_OrthogtahicCapture, CallFunc_IsValid_ReturnValue_2) == 0x00001A, "Member 'WeaponCaptureActor_C_OrthogtahicCapture::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.PerspectiveCapture
// 0x0020 (0x0020 - 0x0000)
struct WeaponCaptureActor_C_PerspectiveCapture final
{
public:
	class APBWeapon*                              Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RT;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 DepthRT;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponCaptureActor_C_PerspectiveCapture) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_PerspectiveCapture");
static_assert(sizeof(WeaponCaptureActor_C_PerspectiveCapture) == 0x000020, "Wrong size on WeaponCaptureActor_C_PerspectiveCapture");
static_assert(offsetof(WeaponCaptureActor_C_PerspectiveCapture, Weapon) == 0x000000, "Member 'WeaponCaptureActor_C_PerspectiveCapture::Weapon' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_PerspectiveCapture, RT) == 0x000008, "Member 'WeaponCaptureActor_C_PerspectiveCapture::RT' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_PerspectiveCapture, DepthRT) == 0x000010, "Member 'WeaponCaptureActor_C_PerspectiveCapture::DepthRT' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_PerspectiveCapture, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponCaptureActor_C_PerspectiveCapture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_PerspectiveCapture, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WeaponCaptureActor_C_PerspectiveCapture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_PerspectiveCapture, CallFunc_IsValid_ReturnValue_2) == 0x00001A, "Member 'WeaponCaptureActor_C_PerspectiveCapture::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.StartCaptureTask
// 0x0020 (0x0020 - 0x0000)
struct WeaponCaptureActor_C_StartCaptureTask final
{
public:
	TArray<struct FWeaponCaptureTask>             CallFunc_GetWeaponTaskArray_ReturnValue;           // 0x0000(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponCaptureActor_C_StartCaptureTask) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_StartCaptureTask");
static_assert(sizeof(WeaponCaptureActor_C_StartCaptureTask) == 0x000020, "Wrong size on WeaponCaptureActor_C_StartCaptureTask");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask, CallFunc_GetWeaponTaskArray_ReturnValue) == 0x000000, "Member 'WeaponCaptureActor_C_StartCaptureTask::CallFunc_GetWeaponTaskArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WeaponCaptureActor_C_StartCaptureTask::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask, K2Node_SwitchInteger_CmpSuccess) == 0x000014, "Member 'WeaponCaptureActor_C_StartCaptureTask::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask, Temp_int_Variable) == 0x000018, "Member 'WeaponCaptureActor_C_StartCaptureTask::Temp_int_Variable' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.StartCaptureTask_Step_01
// 0x0020 (0x0020 - 0x0000)
struct WeaponCaptureActor_C_StartCaptureTask_Step_01 final
{
public:
	TArray<struct FWeaponCaptureTask>             CallFunc_GetWeaponTaskArray_ReturnValue;           // 0x0000(0x0010)(ReferenceParm)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponCaptureActor_C_StartCaptureTask_Step_01) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_StartCaptureTask_Step_01");
static_assert(sizeof(WeaponCaptureActor_C_StartCaptureTask_Step_01) == 0x000020, "Wrong size on WeaponCaptureActor_C_StartCaptureTask_Step_01");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_01, CallFunc_GetWeaponTaskArray_ReturnValue) == 0x000000, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_01::CallFunc_GetWeaponTaskArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_01, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_01::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_01, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_01::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.StartCaptureTask_Step_02
// 0x0020 (0x0020 - 0x0000)
struct WeaponCaptureActor_C_StartCaptureTask_Step_02 final
{
public:
	TArray<struct FWeaponCaptureTask>             CallFunc_GetWeaponTaskArray_ReturnValue;           // 0x0000(0x0010)(ReferenceParm)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponCaptureActor_C_StartCaptureTask_Step_02) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_StartCaptureTask_Step_02");
static_assert(sizeof(WeaponCaptureActor_C_StartCaptureTask_Step_02) == 0x000020, "Wrong size on WeaponCaptureActor_C_StartCaptureTask_Step_02");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_02, CallFunc_GetWeaponTaskArray_ReturnValue) == 0x000000, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_02::CallFunc_GetWeaponTaskArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_02, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_02::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_02, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_02::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.StartCaptureTask_Step_03
// 0x0020 (0x0020 - 0x0000)
struct WeaponCaptureActor_C_StartCaptureTask_Step_03 final
{
public:
	TArray<struct FWeaponCaptureTask>             CallFunc_GetWeaponTaskArray_ReturnValue;           // 0x0000(0x0010)(ReferenceParm)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponCaptureActor_C_StartCaptureTask_Step_03) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_StartCaptureTask_Step_03");
static_assert(sizeof(WeaponCaptureActor_C_StartCaptureTask_Step_03) == 0x000020, "Wrong size on WeaponCaptureActor_C_StartCaptureTask_Step_03");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_03, CallFunc_GetWeaponTaskArray_ReturnValue) == 0x000000, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_03::CallFunc_GetWeaponTaskArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_03, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_03::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_03, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_03::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.StartCaptureTask_Step_04
// 0x0020 (0x0020 - 0x0000)
struct WeaponCaptureActor_C_StartCaptureTask_Step_04 final
{
public:
	TArray<struct FWeaponCaptureTask>             CallFunc_GetWeaponTaskArray_ReturnValue;           // 0x0000(0x0010)(ReferenceParm)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponCaptureActor_C_StartCaptureTask_Step_04) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_StartCaptureTask_Step_04");
static_assert(sizeof(WeaponCaptureActor_C_StartCaptureTask_Step_04) == 0x000020, "Wrong size on WeaponCaptureActor_C_StartCaptureTask_Step_04");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_04, CallFunc_GetWeaponTaskArray_ReturnValue) == 0x000000, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_04::CallFunc_GetWeaponTaskArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_04, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_04::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_StartCaptureTask_Step_04, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponCaptureActor_C_StartCaptureTask_Step_04::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponCaptureActor.WeaponCaptureActor_C.CalWeaponRealSize
// 0x01B8 (0x01B8 - 0x0000)
struct WeaponCaptureActor_C_CalWeaponRealSize final
{
public:
	class APBWeapon*                              InWeapon;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RetSize;                                           // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Center;                                            // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   RetBox;                                            // 0x0020(0x001C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_1;                  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue_1;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CallFunc_MakeBox_ReturnValue;                      // 0x00FC(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_MakeBox_ReturnValue_1;                    // 0x0128(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_BoxAdd_Ret;                               // 0x015C(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponCaptureActor_C_CalWeaponRealSize) == 0x000008, "Wrong alignment on WeaponCaptureActor_C_CalWeaponRealSize");
static_assert(sizeof(WeaponCaptureActor_C_CalWeaponRealSize) == 0x0001B8, "Wrong size on WeaponCaptureActor_C_CalWeaponRealSize");
static_assert(offsetof(WeaponCaptureActor_C_CalWeaponRealSize, InWeapon) == 0x000000, "Member 'WeaponCaptureActor_C_CalWeaponRealSize::InWeapon' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_CalWeaponRealSize, RetSize) == 0x000008, "Member 'WeaponCaptureActor_C_CalWeaponRealSize::RetSize' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_CalWeaponRealSize, Center) == 0x000014, "Member 'WeaponCaptureActor_C_CalWeaponRealSize::Center' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_CalWeaponRealSize, RetBox) == 0x000020, "Member 'WeaponCaptureActor_C_CalWeaponRealSize::RetBox' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_CalWeaponRealSize, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'WeaponCaptureActor_C_CalWeaponRealSize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_CalWeaponRealSize, CallFunc_GetMesh3P_ReturnValue) == 0x000040, "Member 'WeaponCaptureActor_C_CalWeaponRealSize::CallFunc_GetMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_CalWeaponRealSize, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000048, "Member 'WeaponCaptureActor_C_CalWeaponRealSize::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_CalWeaponRealSize, CallFunc_GetChildrenComponents_Children) == 0x000058, "Member 'WeaponCaptureActor_C_CalWeaponRealSize::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(WeaponCaptureActor_C_CalWeaponRealSize, CallFunc_BreakVector_X) == 0x000068, "Member 'WeaponCaptureActor_C_CalWeaponRealSize::CallFunc_BreakVector_X' has a wrong offset!");
