#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponDebugPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBoundary_structs.hpp"
#include "ProjectBoundary_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponDebugPanel.WeaponDebugPanel_C
// 0x0160 (0x03C0 - 0x0260)
class UWeaponDebugPanel_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AjustOn;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ADS_RX_Minus;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ADS_RX_Plus;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ADS_RY_Minus;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ADS_RY_Plus;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ADS_RZ_Minus;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ADS_RZ_Plus;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                AjustOffset;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                AjustOffset_1;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Cfg_ID;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       D_RX;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       D_RY;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       D_RZ;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Def_ID;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Idle_DR_X;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Idle_DR_Y;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Idle_DR_Z;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Idle_DT_X;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Idle_DT_Y;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Idle_DT_Z;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_RX_Minus;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_RX_Plus;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_RY_Minus;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_RY_Plus;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_RZ_Minus;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_RZ_Plus;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_TX_Minus;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_TX_Plus;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_TY_Minus;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_TY_Plus;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_TZ_Minus;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Idle_TZ_Plus;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 ML_CameraShakeName;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 ML_CameraShakeName_1;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 ML_CSV_1;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 ML_CSV_2;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 ML_CSV_3;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 ML_MeshFOV;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 ML_WorldFOV;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       PrtID;                                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        PrtSelCombo;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WPN_Name;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanAdjustOffset;                                   // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AdjustBarOn;                                       // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WeaponDebugPanel(int32 EntryPoint);
	void BndEvt__WeaponDebugPanel_AjustOffset_1_K2Node_ComponentBoundEvent_31_OnButtonClickedEvent__DelegateSignature();
	void UpdateFOV();
	void BndEvt__WeaponDebugPanel_Idle_DT_Z_K2Node_ComponentBoundEvent_30_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WeaponDebugPanel_Idle_DT_Y_K2Node_ComponentBoundEvent_29_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WeaponDebugPanel_Idle_DT_X_K2Node_ComponentBoundEvent_28_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WeaponDebugPanel_Idle_DR_Z_K2Node_ComponentBoundEvent_27_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WeaponDebugPanel_Idle_DR_Y_K2Node_ComponentBoundEvent_26_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WeaponDebugPanel_Idle_DR_X_K2Node_ComponentBoundEvent_25_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WeaponDebugPanel_Idle_TY_Minus_K2Node_ComponentBoundEvent_24_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_TZ_Plus_K2Node_ComponentBoundEvent_23_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_TZ_Minus_K2Node_ComponentBoundEvent_22_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_TY_Plus_K2Node_ComponentBoundEvent_21_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_TX_Plus_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_TX_Minus_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_RZ_Plus_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_RZ_Minus_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_RY_Plus_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_RY_Minus_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_RX_Plus_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Idle_RX_Minus_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_ADS_RZ_Plus_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_ADS_RZ_Minus_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_ADS_RX_Plus_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_ADS_RX_Minus_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Minus_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_Plus_1_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_AjustOffset_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponDebugPanel_EditableTextBox_7_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WeaponDebugPanel_EditableTextBox_6_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WeaponDebugPanel_EditableTextBox_5_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WeaponDebugPanel_PrtSelCombo_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void Construct();
	void FetchCharAndWeaponInfoForAimOffsetDebug(class APBCharacter_BP_C** AsCharacterBP, class USceneComponent** CharScaleRoot1P, class UPBCharacterSkeletalMeshComponent** CharMesh1P, class UCameraComponent** Camera1P, class ACSTM_Base_C** AsWeapon, class UPBWeaponSkeletalMeshComponent** WeaponMesh1P, class UMeshComponent** SightMesh_1P);
	void UpdateTransformDisplay(class UMultiLineEditableText* TextBox, const struct FTransform& TransformInfo);
	void ChangeADS_R_RefreshAll(class UMultiLineEditableText* TextBox, const struct FRotator& Rotation, bool X, bool Y, bool Z);
	void ChangeADS_T_RefreshAll(class UMultiLineEditableText* TextBox, const struct FVector& Translate, bool X, bool Y, bool Z);
	void UpdateDeltaVectorTextBoxes(class UEditableTextBox* B1, class UEditableTextBox* B2, class UEditableTextBox* B3, float B1_Value, float B2_Value, float B3_Value);
	void ChangeIdle_R_RefreshAll(class UMultiLineEditableText* TextBox, const struct FRotator& Rotation, bool X, bool Y, bool Z);
	void ChangeIdle_T_RefreshAll(class UMultiLineEditableText* TextBox, const struct FVector& Translate, bool X, bool Y, bool Z);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponDebugPanel_C">();
	}
	static class UWeaponDebugPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponDebugPanel_C>();
	}
};
static_assert(alignof(UWeaponDebugPanel_C) == 0x000008, "Wrong alignment on UWeaponDebugPanel_C");
static_assert(sizeof(UWeaponDebugPanel_C) == 0x0003C0, "Wrong size on UWeaponDebugPanel_C");
static_assert(offsetof(UWeaponDebugPanel_C, UberGraphFrame) == 0x000260, "Member 'UWeaponDebugPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, AjustOn) == 0x000268, "Member 'UWeaponDebugPanel_C::AjustOn' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ADS_RX_Minus) == 0x000270, "Member 'UWeaponDebugPanel_C::ADS_RX_Minus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ADS_RX_Plus) == 0x000278, "Member 'UWeaponDebugPanel_C::ADS_RX_Plus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ADS_RY_Minus) == 0x000280, "Member 'UWeaponDebugPanel_C::ADS_RY_Minus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ADS_RY_Plus) == 0x000288, "Member 'UWeaponDebugPanel_C::ADS_RY_Plus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ADS_RZ_Minus) == 0x000290, "Member 'UWeaponDebugPanel_C::ADS_RZ_Minus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ADS_RZ_Plus) == 0x000298, "Member 'UWeaponDebugPanel_C::ADS_RZ_Plus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, AjustOffset) == 0x0002A0, "Member 'UWeaponDebugPanel_C::AjustOffset' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, AjustOffset_1) == 0x0002A8, "Member 'UWeaponDebugPanel_C::AjustOffset_1' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Cfg_ID) == 0x0002B0, "Member 'UWeaponDebugPanel_C::Cfg_ID' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, D_RX) == 0x0002B8, "Member 'UWeaponDebugPanel_C::D_RX' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, D_RY) == 0x0002C0, "Member 'UWeaponDebugPanel_C::D_RY' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, D_RZ) == 0x0002C8, "Member 'UWeaponDebugPanel_C::D_RZ' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Def_ID) == 0x0002D0, "Member 'UWeaponDebugPanel_C::Def_ID' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_DR_X) == 0x0002D8, "Member 'UWeaponDebugPanel_C::Idle_DR_X' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_DR_Y) == 0x0002E0, "Member 'UWeaponDebugPanel_C::Idle_DR_Y' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_DR_Z) == 0x0002E8, "Member 'UWeaponDebugPanel_C::Idle_DR_Z' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_DT_X) == 0x0002F0, "Member 'UWeaponDebugPanel_C::Idle_DT_X' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_DT_Y) == 0x0002F8, "Member 'UWeaponDebugPanel_C::Idle_DT_Y' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_DT_Z) == 0x000300, "Member 'UWeaponDebugPanel_C::Idle_DT_Z' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_RX_Minus) == 0x000308, "Member 'UWeaponDebugPanel_C::Idle_RX_Minus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_RX_Plus) == 0x000310, "Member 'UWeaponDebugPanel_C::Idle_RX_Plus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_RY_Minus) == 0x000318, "Member 'UWeaponDebugPanel_C::Idle_RY_Minus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_RY_Plus) == 0x000320, "Member 'UWeaponDebugPanel_C::Idle_RY_Plus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_RZ_Minus) == 0x000328, "Member 'UWeaponDebugPanel_C::Idle_RZ_Minus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_RZ_Plus) == 0x000330, "Member 'UWeaponDebugPanel_C::Idle_RZ_Plus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_TX_Minus) == 0x000338, "Member 'UWeaponDebugPanel_C::Idle_TX_Minus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_TX_Plus) == 0x000340, "Member 'UWeaponDebugPanel_C::Idle_TX_Plus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_TY_Minus) == 0x000348, "Member 'UWeaponDebugPanel_C::Idle_TY_Minus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_TY_Plus) == 0x000350, "Member 'UWeaponDebugPanel_C::Idle_TY_Plus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_TZ_Minus) == 0x000358, "Member 'UWeaponDebugPanel_C::Idle_TZ_Minus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, Idle_TZ_Plus) == 0x000360, "Member 'UWeaponDebugPanel_C::Idle_TZ_Plus' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ML_CameraShakeName) == 0x000368, "Member 'UWeaponDebugPanel_C::ML_CameraShakeName' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ML_CameraShakeName_1) == 0x000370, "Member 'UWeaponDebugPanel_C::ML_CameraShakeName_1' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ML_CSV_1) == 0x000378, "Member 'UWeaponDebugPanel_C::ML_CSV_1' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ML_CSV_2) == 0x000380, "Member 'UWeaponDebugPanel_C::ML_CSV_2' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ML_CSV_3) == 0x000388, "Member 'UWeaponDebugPanel_C::ML_CSV_3' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ML_MeshFOV) == 0x000390, "Member 'UWeaponDebugPanel_C::ML_MeshFOV' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, ML_WorldFOV) == 0x000398, "Member 'UWeaponDebugPanel_C::ML_WorldFOV' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, PrtID) == 0x0003A0, "Member 'UWeaponDebugPanel_C::PrtID' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, PrtSelCombo) == 0x0003A8, "Member 'UWeaponDebugPanel_C::PrtSelCombo' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, WPN_Name) == 0x0003B0, "Member 'UWeaponDebugPanel_C::WPN_Name' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, CanAdjustOffset) == 0x0003B8, "Member 'UWeaponDebugPanel_C::CanAdjustOffset' has a wrong offset!");
static_assert(offsetof(UWeaponDebugPanel_C, AdjustBarOn) == 0x0003B9, "Member 'UWeaponDebugPanel_C::AdjustBarOn' has a wrong offset!");

}

